[
    {
        "video_id": "FAsjC_c1p64",
        "title": "Bitcoin Holds Firm, Zcash Rebounds, Big Crypto Developments Ahead &amp; More!",
        "published_at": "2026-01-12T13:59:21Z",
        "sort_date": "2026-01-12",
        "url": "https://www.youtube.com/watch?v=FAsjC_c1p64",
        "transcript": "Major move pending. Miners may be dumping BTC, but ETF inflows have been strong. And a European government minister just called Bitcoin the future of finance. Trump's tariff turmoil. The Supreme Court is weighing up whether to cancel the import tariffs slapped on a whole load of nations last year. What might happen and what would the outcome mean for the markets? Zcash Civil War, one of last year's best performing crypto projects, just saw its dev team resign on mass as the crypto space sees its first major drama of the year. And we'll have Lewis with the TA, the winner of our portfolio competition, tweets of the week, and much more besides. This is the Coin Bureau News Live. Yes. Hello everyone. Welcome to another episode of the Coin Bureau live news show. It is great to see you all. My name is Guy and I am joined as Lewis. Yes. Yes. Yes. Nice to see you, sir. How you doing? Um I'm doing good. I'm filling in for for Nick right now. I figured we could make it uh a family affair as one of the comments has eloquently pointed out with Guy and uh Guy Jr. over here. Yes. A few people have mentioned that Lewis looks like my son. So, we're make Yeah, we're making this a family affair. Father and son. Here we go. Um, yes, as you can see, Lewis is making his live debut on the show today. Now, um, I have I sadly have to report to you folks that poor Nick is not well today. Um, I I I I hope he won't mind me sharing, but he had some dodgy shellfish over the weekend and is the sick man of uh of Dubai at the moment. Um, I think we actually have some live footage of him in bed. Yes, there we are surrounded by uh by the scene of the crime. Yes, poor old Nick is not feeling very well. So, um, you will just have to make do with myself and Lewis, I'm afraid. We will do our best to shepherd you through in Nick's absence. Um, but before we get stuck in, can I please implore you all to smash that like button for Nick, folks? For Nick. I'm not going to promise you some portfolio alpha or anything like that. All I'm going to say is if that like status bar below Lewis doesn't get to 100%. Then poor old Nick isn't going to recover in time for next week's stream. So hammer those likes for Nick, please. 100%. Yeah. Poor old Nick. We need 100,000. We Exactly. likes. And we need 100,000 likes for Nick. Have you ever had food poisoning, Louis? Um yes. A long time ago. It is not pleasant, is it? Not at all. Okay. Wishing him the best. Um, and of course uh you you guys can watching can all uh com drop a comment as well. Maybe I'm sure Nick if he's not he he might not be watching this live because I think he really is under the weather, but he'll probably watch it on catchup and I'm sure he would appreciate some uh some supportive comments uh in the uh in the uh in down below. Um he's not hung over. I can tell you that much. I can tell you Nick is Nick does not do hangovers. Um, so, uh, yeah, please do leave a supportive message for Nick and pound that like button so as he recovers and is back for next week's stream. So, Lewis, you and I are just going to have to soldier on through. Yep. Well, you know, you're the expert out here and uh, this is my first time, so I'll let you lead and uh, I'll just chime in. Okay. Okay, cool. Well, let's take a look then. Uh, we'll go back to last week's price action for Bitcoin. Um, so if we go back to last Monday before Nick even considered eating a dodgy oyster, um, we can uh, we remember that Michael Sailor went ahead and made his first Bitcoin purchase of the year. Um, just over 1,000 uh, BTC he added there to Strategy's increasingly swelling pile. Um, we also had some strong ETF flows, right? Yeah. in the beginning of the week uh or the beginning of the year very strong and we saw that in the price uh you know crypto was looking pretty good in the beginning of 2026 pretty pretty good yes bitcoin actually uh actually went up to 94k now I have to ask you were you were you starting to believe at 94k um I was not uh a couple friends were a couple acquaintances people who uh reached out to me and I I told them, \"Guys, I don't I don't think you should jump on it quite yet.\" Okay. Feel like you should wait just a little bit longer. So, they'll be they'll be thanking you for that. Um eventually, maybe. Who knows? Okay. Okay. Yes. Uh 94K was uh was tested. Um but as we'll soon see, it didn't it didn't last. Um meanwhile, on Tuesday, um we had Luxembourg's finance minister making some bullish comments about Bitcoin. Yeah. Yeah. Pretty good. Um, you know, it didn't work out too well with uh America's government, you know, basically promoting crypto and saying it's going to be the best thing in the world and the new financial instruments. But, uh, maybe Luxembourg's um, maybe maybe that'll turn things around and we'll have a different scenario and and things will just be up from here. Exactly. Maybe maybe this is the Luxembourg put we're entering now. Um, meanwhile, uh, our old favorite Tom Lee was back out again, wheeled out onto, I think this was CNBC, um, calling for a quarter of a million dollar Bitcoin. I can't remember what exactly his Oh, oh, for 2026. Okay, so Tommy is bullish as ever. Um, and Sailor himself actually caught a bit of a break here. Now, this was some good news which we should talk about a little bit because uh as you may recall um MSCI was weighing up the uh the possibility of um removing uh not only strategy but digital asset treasury companies in general. Very scary. Yeah. From its from its indices. And what this would have meant if MCI had removed strategy then uh all these passive funds that buy you know any indices that strategy had featured in would automatically sell. This would not be not have been nice. That would have absolutely destroyed the entire market. Yeah. So, this is very good news actually. We actually Yeah, we we got a bit of a reprieve on Tuesday which I don't we probably weren't grateful enough for. Um we really got let off the hook. Yeah, I mean this this would have damaged the markets incredibly. I was I was very worried about it after I did the video and um it's I'm very happy to see that this decision is what happened. Things to be thankful for. Um Bitcoin didn't seem to get the memo though. It fell uh back below 92K. It didn't care. Honeybadger didn't care. Um and then fell below 91K. Yeah, it just keeps on falling for some reason. Yeah, this is uh despite progress being made on the Clarity Act as well. Um, now we're going to talk about this in a little more detail a little later on. Um, but, uh, yeah, the Clarity Act, this big market structure bill, um, that is making its way through Congress. Uh, and as you'll soon see, the time is maybe a little bit against it, but we'll we'll get to that. Um, miners are also dumping Bitcoin, right? Yeah, they're dumping. And, uh, because they're dumping, the mining difficulty of Bitcoin is falling as well. Yeah. So uh yeah, historically when Bitcoin mining difficulty falls, uh it tends to fall along with price as well. The two are the two are pretty closely correlated. Um now this is a result of because Bitcoin's price has been falling. Um a lot of miners are being squeezed out. So they are switching off their machines, powering down their AS6, which means fewer miners on the network, which means the difficulty goes down in order to incentivize more miners to then join. That is the beauty of the mathematics of Bitcoin. Yeah, one of the uh one of the really clever ways in which the whole network is structured. But yes, at the moment, difficulty is falling along with price as well. It's basically it's it's not a good time to be a minor. So, uh as you saw from that headline there, I think that was Riot Platforms uh selling a fair bit then. Um now, uh we flagged this up last week as well. We had quite a lot of employment data um that we were looking at. Um we had some employment numbers come in below expectations. Yeah. Um you know they added a lot 41,000 but not as much as what people wanted or expected. Yeah. And um we saw that a little bit reflected in the price dumping below you know 92 and then 91 and then 90. Yeah. This was on Thursday. Now Lewis as you're sitting in that chair you have to point out um something that got closed because of this uh because of this. Yeah. Um, I I wish I had some some weights to lift to get a good pump in. Do you want to try your best South African accent? My South African accent closed the gap as per usual and it was okay. I'm not going to I'm not even going to bother with that anymore. I thought I had it, but guess not. So, we closes the gap. Close the gap. Why do I feel like that could be a meme? Is that a meme? Yeah, it should be. It's like over the line. Over the line. Close the gap. the hole. Um, yeah. So, yeah, we did uh we did we did close that CME gap right there, but as you can see, there's another one below it at around 88K. So, we might still go lower to close that CME gap there, Nick, I think, is probably just They do tend to close. I don't know what the hell I'm talking about. All right, I'm do tend to close them CME gaps, don't they? What am I doing? Okay, Friday. Uh, yes. Friday. Friday. Friday. Uh Friday we had NFP uh non-farm payroll numbers come in uh slightly below expectations actually. Um the market still dumped. Yeah. What a surprise. Yeah. Yeah. Yeah. It just did not crypto does not seem to be able to catch a bit at the moment and uh that took us into the weekend. Then on the weekend, on the weekend, um you know, in the beginning of of the year, like we talked about, we we saw some nice inflows with the ETFs, but apparently um that just didn't want to last because now we had four straight days of outflows on the Bitcoin ETF. Um ETH is on its third day, so not quite as bad as uh Bitcoin, but it's still pretty telling that a lot of people and a lot of institutions are moving out of Bitcoin still right now. Yeah. Yeah. Um, so, uh, so yes, outflows, as as Lewis said, outflows for Bitcoin and ETH as well. Now, we have to talk, we didn't mention this at the, uh, at the top of the show, but there's been a sort of a drama going on um, over the last few hours involving this man, uh, one of crypto's reluctant main characters, I think you can say, obviously, uh, Jerome Pal, chair of the Federal Reserve. Um, so the TLDDR here is that basically he released this video, I think it was yesterday, uh, basically sort of pushing back against the fact that, uh, prosecutors have launched a criminal investigation into him, uh, regarding the renovation of the Fed's headquarters. Yeah, pretty wild. I'm not I'm not sure if that's ever happened before. um you know they say that well he said he said that the threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public rather than following the preferences of the president. So they're saying like okay the president doesn't like what he's doing so he's you know putting charges against him. Um, and some people do like what he's doing. Some, but a lot of people actually don't. Yeah. But in the end, the markets, well, not crypto, but the general markets are still going up. So, it seems like Powell is able to do what he wants to do. And and the markets are still going up, which should make Trump happy, but you know, I guess Trump's not happy enough because they're not high up. He is not happy enough. Yeah. This is now this is a kind of extraordinary thing we're seeing here at the moment because this is all this is calling into question the independence of the Federal Reserve and as Lewis said you know quoting that thing that Powell said you know he's basically saying that these charges are being implemented because uh he and presumably the rest of the FOMC but I think this is very much directed at Powell himself are basically not doing what Trump wants. They are not lowering interest rates as quickly and as low as as Trump would like. Um and as such, you know, this is why these criminal charges are being pressed. It's not, you know, as far as Powell is concerned, this has got nothing to do with the the the renovation of the Fed HQ. It is a kind of extraordinary moment. And you know, obviously there's there's quite a lot of sort of general chaos going on around Trump and what the US is doing at the moment. And this is just another piece of that puzzle. But it is really big news because uh yeah, as we say, this is this calls into question Fed independence. And as a result actually uh Lewis mentioned it pumping the markets. Um this uncertainty because this is what it is really. This is uncertainty that is being introduced here. This has been great for the gold bugs um and also for silver as well. Both gold and silver have hit new all-time highs lately. Um so we are in a very very interesting period folks not only geopolitically but also uh what is going on with the Fed and I think this is and Jerome Pal and I think this is going to be a big story of this week. So, uh, we'll be keeping a very close eye on that and we'll have more to bring you, uh, on that next week, but, uh, watch this one carefully. It's going to be interesting. Now, Lewis, if you are looking for, uh, an exchange, if you're feeling bullish on Bitcoin or maybe you're feeling bearish on Bitcoin and want to sell some and you want a top international exchange to trade it on, then you have to check out Two Bit. All right, you got two bit. Two bit. Well, tell me more. I certainly will, Lewis. Two bit is an international exchange. They have a wonderful solid interface. They have deep liquidity, competitive fees, onboarding, Lewis, is super simple. You just need an email address. That's it. Yeah. You just take your email address and you can sign up. You can explore the platform right away. And uh Coin Bureau viewers are uh eligible for up to $90,000 worth of trading rewards alongside Lewis lifetime VIP level one upgrade and 50% off trading fees for life. Lifetime VIP level one upgrade. Wow. I'm going to sign up right now. Get in there. Get in there. So, you can scan the QR code um to uh to get that deal or you can use the link in the description if you're one of those people. Um but whatever you do, yes, do check out Tubbit and we are delighted to have them as a brand partner. Okay, Lewis, uh I'm going to tell you, I'm going to give you an idea of the sentiment in the chat. It is do it is kind of Nick based. I would. Good day everyone. Looks like Nick has had a little pullback today on the daily. Nevertheless, it surely lead to a weekly consolidation and eventually Nick will be back with us soon. Inshallah. Inshallah. We hope Nick will be back with us soon. Poor Yeah. Um I wouldn't say Nick is necessarily feeling bearish. Um I'd say he's feeling a lot worse than that. Um yes, poor old Nick. Um okay. Uh so yes, lovely to see all your messages of support uh for Nick as well. Um also uh messages of support for Jerome Powell. Powell is a honeybger. He don't give two poops. Good for Pal. This is uh Yeah, this is gonna be uh He really doesn't. He really doesn't. I mean, he's getting on a bit, isn't he? He's He's He's proved himself. I bet he's just like, \"What? Bring it on. I don't care. I'm too I'm too goddamn old, pretty much.\" Um uh Nick looks a little different today. Do you think I lost some weight? He did lose some weight. He lost some muscle mass. Lost some muscle mass. Lost some hair. Had a bit of a trim, but otherwise, he's the same he's the same Nick that we know and love. Okay. All right. Uh let's move on. And we were we touched on the idea of tariffs, right? Yeah. Yeah, we touched on and we talked about it on our new Friday show, the uh FUD and FOMO show, which by the way, if uh you aren't if you're watching this right now, you don't know about it, it's a new show. You should check it out every Friday. It's really great. It's more laidback than than this. And we've talked about a lot of different things, including the tariff decision, which should have happened on Friday, or we were expecting it, but uh then it didn't. It was a big old nothing burger. Here we are. We were all keyed up. We were watching things coming out of the Supreme Court and then they uh they postponed it till the 14th, which is wedded. Yeah. Or I actually read uh the article and it said they expect it to be on the 14th. So Okay. You know, maybe the 14th, maybe the 15th, maybe the 31st or whatever. We'll figure it out. Yeah. So, if you're not up to speed with this, folks, this is this is kind of important at the moment. You will all remember Trump's tariffs from last year and all the uh the chaos uh and confusion that they caused. Well, you thought they might have gone away, but no, they are back because uh the legitimacy of the tariffs has been challenged and uh this has gone all the way to the Supreme Court and the uh the court is we're basically waiting on the court's ruling on whether these tariffs were legal or not. Um and it if uh if prediction markets uh are your thing then right now uh the odds that they will rule in uh Trump's favor it's it's pretty it's pretty low 31%. Yeah. Now we should explain what exactly the possible outcomes are here because this is this is not a binary outcome. This is not one thing or another. There are a few different options. But let's let's quickly look at the two extremes. So on the one hand um the Supreme Court they could say they could kind of uh say what Trump is basically hoping they're going to say and uh that all the tariffs are legal and that Trump can just go ahead uh instituting them uh carry on Mr. President. So that is one possible outcome. What's the other kind of extreme outcome? Well I would have to think that they would say that they're all illegal. Okay. And then uh they would just order the Treasury to pay back you know everything that that has been paid and that seems a little extreme to me to be honest but it is one of the extremes. Yeah. So these are the extreme options. Either they say you're all good carry on or they say no these are bad and you got to pay them back. Now quite a lot of money uh as we'll see in a moment has been collected uh via these tariffs but as I said it's not just a binary one. There are a couple of middle-of the road options. Well, and the first um is that they that the court could rule um that the tariffs can be used under international emergency economic powers act. That's the EA as I'm sure you know. I'm talking to the converted here, but only for narrow national security threats and not for general trade deficits. So this could mean um that uh certain tariffs would be struck down like the global tariffs, you know, the ones leveled on particular countries. Um but uh specific ones like the fentinel related ones could be left intact. So that's one kind of middle- of the road option. There's another middle of the road option as well, right? Yes. The other middle of the road is to say that they are illegal, but they're starting to be illegal from today or whenever the decision is finalized. And if they do that, then the government won't have to pay back the $150 billion that, you know, they collected. So that's a more of a middle ground. Yeah. Okay. So yes, as Lewis says, $150 billion have been uh collected through these tariffs so far. And yeah, I mean, there is a possibility uh that the Supreme Court will say the government has to pay all that back. What do you think the market's going to going to react to that? Well, I think it's going to be fairly interesting. I think equities um are going to uh are going to react pretty well because if you consider companies like Costco, Walmart, uh Target, you know, these big importers, there they are um on their away day to Washington, um they have been eating these enormously, you know, much higher import costs and either passing them on to consumers or or you know, concealing them in their balance sheet. But um the these guys if the tariffs were in fact struck down um would see a massive boost in their margins and you can you would imagine that their uh their share prices would would rocket. Yeah. I mean pretty much anything that's that relies on the global supply chains uh could probably benefit or would benefit from reduced friction, reduced cost of of the tariffs if they're, you know, no longer there. Yeah. So, a lot of a lot of different things, a lot of companies would end up going up. All of those, you know, Costco, Walmart, Target, even Apple, Nvidia, pretty much pretty much everything to be honest. Anything, as Lewis says, anything that's kind of been um, you know, relies on global supply chains, um, you know, especially to and from China, etc. So, yeah, I think certainly for equity markets, uh, the tariffs being struck down would probably signal good news. um it wouldn't be good news for the government obviously having to repay that money but also from the point of view of bond yields. Now, you would imagine that a country that is, I think, somewhere in the region of $ 38 trillion in debt doesn't really want to see a spike in bond yields, but that is probably what would that what they would get um if these if these tariffs were struck down to say nothing of just sort of general questions about US fiscal sustainability and how these refunds might go because I don't imagine this is this is this would be a particularly easy process. Yeah, definitely not. Yeah. Um and of course, uh what we can almost be certain of is that if uh the Supreme Court does rule against Trump and say that, you know, these tariffs are illegal and have to be repaid or or something that Trump doesn't like, then you can imagine um there will be an appeal and uh this this will probably rumble on. Um safe havens such as gold and silver, which as we pointed out earlier have been uh doing pretty well recently, they might see a bit of a correction if the Trumps if the Trumps the tariffs go down and sort of this whole kind of global trade war tension cools. Um, so that might be uh, you know, that might be a bit of a headwind for for the likes of gold and silver. But what about crypto? Yeah. People want to know how crypto react. Well, you know, it's like it's like what happened when we got some good news? What happened in in the crypto space? Uh, basically basically we went down. Um, and then what happened when we got some bad news? Well, basically we went down again. So, I would have to think that whether um anything happens, we're going to end up going down. Okay. Okay. I must say I kind of agree on this because yeah, if um if it's bad news, then uh crypto could well sell off. You know, especially if this news comes outside of regular market hours, then obviously crypto trades 24/7. It's often the first thing to get sold. Um we've seen this happen many times before. I also think yeah if it's good news then a lot of people they've already been doing this could switch from crypto to like these companies in the stock market that have that actual reasoning to go up also. So that could also hurt crypto in that regard. Yeah. Yeah. I uh I must say I hope I hope we're wrong on this one, but I kind of think this tariffs news is is probably something crypto wants to forget as soon as possible. Well, you know, it feels like it's been like a year. I know it's been a little bit less than a year, but it feels like it's been so long that event like I don't know. I think a lot of people are already sort of over it and they're not paying as much attention to it anyway. So maybe it's not going to affect it as much. I that's that's strange, isn't it? Because there's there's really nothing else happening in the world at the moment that might be distracting people's attention from things like boring old tariffs and stuff like that. You know, there's it's not like there's any geopolitical chaos going on or anything that we should, you know, probably be paying attention to. Um, so yeah, I mean these tariffs I think are just going to be the gift that keeps on giving. A bit like uh a bit like malaria. Um, okay. So, uh, now if you're feeling anxious about these tariffs and the state of the market, then, uh, you could do a lot worse than just hodddling your crypto and waiting for all of this to blow over. And if that is what you are planning to do, then there is no better wallet to use than Tangum. Now, Tangum combines uh the safety of a hardware device with the convenience of a web wallet as well. Um they are absurdly easy to set up and use. Wonderful little devices. And uh you can get a 10% discount if you scan the QR code. Lewis. Oh well, you know what? I know what else uh I know what QR code I'm about to scan. Yeah. Don't don't don't waste the time talking to me. Sorry. I got to go. I've got some QR codes to scan. Yes. scan the QR code uh for that discount or the link in the description if you insist. Okay. Now, uh Lewis, there was another slight drama last week in the cryptoverse. Yeah. And this one was actually pretty interesting to me, especially considering, you know, I was I had some positions in here and I think Nick did as well. And we're talking about Zcash. Okay. And uh the Zcash crash. Apparently, the team resigned um or a lot of the team resigned. Uh, and the story goes, CEO Josh Sweheart announced on January 7th that the entire Electric Coin Company ECC team resigned following a constructive discharge by the Bootstrap Board. Yeah. So, a little bit of context here in case you're not up to date with this. Electric Coin Company ECC is the entity that, you know, sort of develops uh Zcash. It was the entity that employed Zcash's developers. And Bootstrap is a kind of nonprofit entity that was sort of attached to Electriccoin Company um and you know sort of oversaw oversaw um network support and and what have you. Um so there was a disagreement between Bootstrap and uh um Zcash's developers. It's funny how that happened now after, you know, like late last year the price went up so so so much and there were all of these really really big people talking about it and like getting involved and and buying and I'm sure they had some, you know, influence and wanted to take it into a certain direction. Yeah. And um I read one of Josh's tweets and he was saying how he really wanted to just stay with the with the original like ethos of of Zcash and privacy. And so I so I commend him, you know, for for doing that cuz I'm sure there was some deals where he could have got godly amounts of money and uh he decided to say like look, no, we're sticking with what we believe in. And so if he has another project, I don't know. I'd be interested in looking at it. Um, but then there's also what happened with uh Monero at the same time as Zcash went down, Monero ended up going up. So maybe something's happening happening with that. We'll see. Yeah, I think what it shows is that the uh the privacy narrative is very much alive and well at the moment. Um, so yeah, there were these I think that what they called irreconcilable differences um between board members uh over the strategic um direction of Zcash. So basically the developers I think the word the phrase I saw was rage quit. They basically rage quit from electric coin company and then promptly went and started a new entity um to continue their mission of building what they call unstoppable private money. Um and yeah well the impact of this was pretty clear in the charts. Uh Ze uh tanked on this news as you would as you would kind of expect. Um but um it did it did start to recover pretty quickly. It did. It did. And as a trader, I I look at the charts and you could tell a lot with just the price action on the charts. And the fact that the entire team essentially resigned and it didn't just go straight to zero tells you a lot. It tells you that this is very resilient. And there's definitely something behind the scenes here, which gives me some hope for ZEC because um I mean, how many other coins could could have half their team or most of the team just resign and and not just go to zero, you know? Uh this Yeah, it fell. It fell, but it it had a nice bounce and it seems to be stabilizing right now. So, it's looking pretty good to be honest. Yeah. Well, let's see what happens with Zcash. Obviously, yeah, as as Lewis says, if if a project can survive its whole dev team basically walking out and and then, you know, promptly start to rebound, um there must be quite a lot to it, quite a lot more to it than uh than perhaps meets the eye. So, yeah, it does look uh it does look kind of positive for Zcash at the moment. And uh you know, if you've looked at trending coins uh today, you'll see that Zcash is amongst them, Monero, and indeed a number of other privacy projects as well. And I think um I think it was last week's stream that Nick and I were kind of discussing this as well. Privacy is almost certainly going to be a big narrative of 2026. And I mean I was a little surprised. I didn't necessarily think that uh we would see big pumps for the likes of XMR and Zcash because I sort of thought well we're more likely to see you know big gains for kind of more sort of corporate oriented crypto projects because obviously I think a lot of the a lot of the privacy narrative a lot of the drive behind the uh privacy narrative is coming from institutions they're the ones who really want it. Um, that brings me back to the point. Weren't there are a lot of institutions or companies that were getting into Zcash uh lately and that's probably where the riff happened because they had to make a decision, you know. Yeah. But um yeah, there was there was quite a lot of support for the Zcash devs who uh who walked out. I think um the Winkle Voss twins among others voiced their support. So yeah, I I support them. Yeah. So, uh, it looks like, um, Zcash is, uh, down, but certainly not out. Um, so, uh, yeah, I think this, this is definitely one to watch as the, uh, as the privacy narrative unfolds over the rest of the year. Okay. Now, we are going to get some wonderful TA in a minute, but first of all, Lewis, I need to tell you about BitGet. Okay, I need to give a big thanks uh to BitGet, another of our brand partners. They've helped us run a portfolio competition, as you've noticed, over the last uh, few weeks. Uh we brought that to an end last week. Um and uh I'm very pleased to announce um that our winner Colin uh has been selected. So Colin um yes, we're keeping keeping you anonymous. Other than that, um you will be receiving uh that uh the balance of that portfolio very very soon. So look out for the rest of you. Yes, congratulations, Colin. For the rest of you, if you don't already have a BitGet account, then you are missing out. You can sign up now um and be eligible for up to 50k USDT in bonus. Again, QR code Lewis. There it is. Get scanning. One second. Get SC. You've already got one. I've already got one. Okay. So, they did pretty well with that competition, right? Like they started with five 5K. We started We started with 5K. We started with $5,000 USDT and uh we basically every week uh the our loyal viewers got to decide where we would allocate this to and what sort of percentage of the portfolio. For the last few weeks they just insisted that we full the whole lot into Bitcoin. I mean it's it would been pretty smart because I think uh you put full port into anything else. We would have been in a lot of trouble. Um but yeah, we were we uh weren't quite at 5k when we closed out the competition, but not far below it. Um and hey, in crypto in this market, that's good. That is pretty good. So, well done to all our viewers who who held our hand and shepherded us through that portfolio competition. Great work. Okay, it is that point in the show where we go to Lewis for some excellent TA. How are you going to manage this one, Louis? Um well, I actually built a time machine. Okay. So, that's what you've been doing all afternoon. That is what I've been doing this afternoon. So, I'm going to I'm going to hop into the time machine and then I'll I'll throw myself on the screen, do the TA, and then I'll jump back. Okay. Do it. Let's see. All right. Thanks for the handoff, Lewis. Uh, I think I'll take it from here. In all seriousness though, um, not much has changed and I don't think a lot will change when it comes to my analysis until something crazy happens. And that's because if you look at Bitcoin, obviously we've just been in a downtrend pretty much since October, right? Since the first week of October and now we're just moving sideways. And this is what I was thinking. I was thinking that let's say we are in a bare market. Well, what always happens during bare markets? There are long periods of time that need to actually pass and then there's usually a capitulation event and of course there are deadcat bounces along the way but before the true bottom is actually hit there is a lot of time usually a year maybe a little bit less and there is a capitulation event and we haven't had that yet and personally I do think that we are in a bare market and we're only 27% off we're not even let we're not even 30% off of the highs right now. So, because of that, and that's what I'm thinking, my bias is always going to be more bearish, at least for most of this year, unless something happens with the price. And so, just looking realistically speaking, we've been rangebound between 84,700 and 94,000 ever since November 22nd. and we're yes, it does look a little bit more bullish right now considering the fact that we created a higher high on the close, but um I'm still not totally convinced. And even if we do come all the way up to 97,000 or even above that, I'm still not convinced that this is going to be the bottom and that's it and now we're just going to go to new all-time highs. So, I'm taking an extreme cautionary approach here. I'm not going to be buying anything right now because personally, I don't really like the way that this last candle is looking and I don't really like the way that the markets are looking overall. What I'd much rather do is either look at some other markets and see if there's any opportunities there, or wait until something comes up where a lot of different things come together, the price looks really good, enough time has passed, and maybe there's some stories that are coming out and some narratives that could all be used within crypto to make some good trades. But personally, I just don't really see them right now. One of the only things I did see um you know actually was Zcash, which we're talking about you know in the actual stream. But besides Zcash and maybe Monero, I don't know too many other things that I'm super super confident about. So I'm going to continue to just wait it out until something really really good happens or something really really bad happens and um I see a trade setup that makes sense to me. Now, if you're a scalper, that's a totally different story, but I'm assuming that 99% of the people watching this aren't scalpers. And I want to make sure that if I'm going to suggest something that I have a lot of confidence in it. And so, with saying that, that's going to be my TA for today. And we'll just jump right back into the studio. It's It's not an easy market to trade. Yeah. Um, I learned from 2022, like, you know, you could try to trade certain markets, but you're so much better off just trading when everything aligns and it's easy. Otherwise, the probability of losing money is just like too high. And why why even do that? I mean, like remember in uh 20 2019 when the market ended up crashing, but uh the crypto market crashed, but weed stocks and a lot of the stock market went absolutely crazy. like we should have rotated into those back then. So, uh just like how most people I think should have rotated from crypto into into gold and silver this time around. So, I'm just I'm just going to chill out. Wait until something you know comes up and then I'll be more comfortable going in. Nothing wrong with chilling. I tell you what, there is something wrong with though and that is the failure of people watching this stream to pound the like button sufficiently to get Nick well again. We're only at 20%. That means Nick is only vomiting 20% less than he was at the start of the start of the stream. Come on, folks. Hit that like button for Nick. Ever somewhere right over here. Yeah, it's it's somewhere. It's somewhere down there. It's a big thumbs up. Smash it for Nick, folks. Poor old Nick. He's uh he needs all the help he can get, you know. Okay. Uh let's have a look at some of the tweets of the week. What? Okay. Oh, there's Louis again. Hi, Louis. I actually also have a twin. Um, good-looking guy, right? Um, let's start with this one. Uh, this is from um, Steve. Uh, to the guy who offered me over 1,000 ETH for this guy in 2021. I really think you should send me like 50 ETH for saving you 950 ETH. Honestly, I if I was him, I'd probably I'd probably send him an ETH just just because of it. Yeah, why not? You know. Okay. So, I presume it wasn't you who offered him. It was not me who offered him 1,000 Ethereum for uh for his golden board eight, but it is golden, you know. So, at least gold is up, right? And gold is up. Maybe there's something. No, no. Oh, yeah. It's still a board, I'm afraid. Unfortunately, um it's not the it's not the last bit of nostalgia we're going to be looking at in this uh in this tweets of the week selection, but um yeah, I mean, wow. Wow. There were articles people sort of explaining why they would never sell their ape. I read the article that I don't know if it was this guy but it was whoever had it was probably a probably a thousand Ethereum. I was like you're so dumb. What a time. You are so you are so dumb. What a time to have been alive. Okay, next up um we have this one um from uh Bernie Maidoff and Nikita Beer. If you haven't been keeping an eye on crypto Twitter uh over the last few days um you'll know that in amongst all the stuff about Powell and you know all the geopolitical stuff um Nikita Beer who is head of product or something at X yeah um has just become crypto uh crypto Twitter's least popular person um he's uh yeah basically people uh reckon that he's sort of has a hand in suppressing crypto content. Yeah. Yeah. And for good reason too, you know. I mean, look, just look at this what he says over here. Um, basically he's basically he's saying that you shouldn't be posting. Um, and you shouldn't be replying to people and communicating with people online be and and this is crypto Twitter. Like half of the audience on crypto Twitter is chronically online living in their chronically online people in the world, you know, and he's basically telling them to engage less of the platform. Yeah. Basically, get off our platform. Like what is it? What is he thinking? Yeah, he uh he actually posted a you know the Ben Affleck having a cigarette meme, right? He basically posted that. I think that's I think that's how tiresome all this got for him. But yeah, there's been some pretty actually some pretty unpleasant memes about Nikita Beer going around. But yeah, he is Crypto Twitter's least popular person at the moment. Um and this has uh resulted in a lot of kind of soularching and uh this tweet from Altcoin Psycho is also pretty good. Hot take, but crypto Twitter doesn't suck because of Nikita Beer. It sucked far before his time. We had a vaporware memecoin frenzy fueled by insiders, celebs, fake virality, and short-term attention games. Media built on griffs. No one cared because they were making money. That's when CT. You see, I the last part of that is why it didn't suck. No one cared because they were making money. Okay. But now that we're not making money, now it sucks even more. Yeah. Okay. And if you add into that, you've also got the likes of uh Ben K. We haven't selected one of Ben's tweets this week, but Ben also tweeted a graph of uh crypto YouTube views um which are uh which are not doing well either. So there's a lot of there's a lot of soulsearching going on in crypto media at the moment, folks. Um meanwhile, we've also got this one uh Grock who is I mean Grock's had a um a week. Uh Grock is also um was asked where it uh where it thinks we are in the cycle right now. Apparently we're in disbelief. Yeah. And um I'm I'm in disbelief about some of the stuff that Grock has been looking that I'm I'm looking at this at this chart right here. Uh the simplified market cycle at the top right. All right. Put a bikini on that. Oh my word. Oh my word. Move on. Move on. Um and here's our here's our little bit of nostalgia. Um here's our some nice nostalgia to finish on. Uh dear Hal Finny, uh much missed. um running Bitcoin. This uh this early tweet from Hal Finny about Bitcoin, someone many people believe to be Satoshi. And as you see the date there, January the 11th. So that was well that was yesterday. 2009, 15 years ago. Wow. Back back when times were good. 17 years ago before almost everyone a little math. Don't say it, Bre. Don't say it. That's Yeah, this is the this brains of the operation. Oh, I knew I was getting I should have just said all those years ago, shouldn't I? Don't worry, I don't think anyone uh even knew about Bitcoin back then. Any of us. So, no. Uh H did though. Okay. Um some dates for the diary. Uh on the 13th, which is uh tomorrow, we've got the CPI. Um and if you really like inflation data, then you'll want to hang around until the day after that because then we'll have the PPI as well. And then on the 15th, um the Clarity Act is going to be voted on in the Senate. So, this Thursday. Yes. Um and uh now we alluded to this earlier, but the looming government shutdown or the possibility of a government another government shutdown is sort of uh injecting a bit of um a bit of jeopardy into this. They kind of Yeah, we we need them to talk this through pretty quick. Yeah. The people who want it are really trying to push it, you know, just in case the government decides to say we don't want to work anymore. Exactly. What other What profession can you do that in? I don't like what I'm doing. I'm I'm going to go home and just like not work. shut it down. Yeah. I mean, the American government, it's it's a source of constant delight and confusion and then they could just come back and just like everyone still has their jobs and like still gets paid. And what's this is so backwards. Well, I presume the people in the in the actual government get paid. A lot of a lot of federal employees don't get paid when they No, it's just the people who are actually like not doing work. Yeah. Yeah. They're fine. Even more backwards. They're fine. Thank you very much. Um, so yes. Uh, let's see. progress on the clarity act. Um that could be coming soon as well. So um just before we close up, let's have a look at some of the comments. Lewis looks like a cross between Guy and Clark Kent. I'll take it. Both two handsome people. Yeah, I can I can see that if I go like do something. Yeah, you need the uh what's it called? The sort of cowick thing going There it is. Oh my word. Oh my word. Just what if you see Lewis going into a phone box, you know what's about to happen. Um, a lot of sympathy for Nick. Not enough sympathy to get us past 20. You callous people. Poor Nick. He'll be back soon though, returning as Thor. Stronger and wiser. You can bet he will be. Um, we've got someone else saying hello from South Africa. Lewis is the Elvis of crypto. I was That was my nickname at a summer camp. Really? Was Elvis. Yeah. Thank you very much. That's uh fantastic. Fantastic. I can see it. Clark Kent. Elvis. Um, keep them coming. Um, I'm going to I'm going to leave the last comment. Uh, well, no, there's another question. The Dreadbug says, uh, will Lewis be doing his live stream again Friday? Well, yeah. I mean, we have our whole whole new show. So, we do have a whole new show. We're talking about maybe doing it every once every Fortnite. Um, but if you guys really want it, then perhaps we can uh make it a bit more. Then, smash the like button. We're not smashing the like button for Nick. So, smash the like button if you want to see more of our Friday live stream as well. Brought in FOMO. Um, now Steven Warden 2474 wins this wins the show today. Uh, talking about Nick not turning up because he's unwell is a bit shelfish. What a dad joke. Brilliant. I love it. Absolutely. Steven, you're hired. Get yourself over to Dubai. We'll find a job for you. You can just be you can just be head of bands. How about that? Wonderful. Okay. Um, please join me everyone in uh wishing Nick all the best uh for his uh recovery from that nasty bout of uh food poisoning that he's got. I'm sure he'll be back. You can't keep a good man down. But Lewis, thank you so much for filling in today. It's been great. No, thanks for having me. I appreciate it. Who needs Who needs that Nick anyway, you know? He's over raised. I mean, we're fed up with him, you know, just he's just, you know, he's Sorry, Nick. Sorry, Nick. He's a good guy, but I mean food poison. He knows a sort of lame. Who who goes oysters? I know. I mean, in a bare market. Yeah. He needs extra zinc or something. I know. I know. You should just take supplements. All right. Thanks everyone for watching. We'll be back next week. Who knows? Maybe Oh, there he is. Pray for him. Um, but thank you all for watching and we'll see you again soon. Bye-bye. Happy birthday to both of you, Nick and Guy. have the same birthday. Happy birthday, guy. Hope it's a good one. Happy birthday, guy. Happy birthday, guy. Have a good one. Looking forward to your birthday next Monday, guy. Happy birthday. Happy birthday, man. Happy birthday. Have a nice one, guy. Happy birthday. Happy birthday, man. Have a nice one, guy. Uhoh. Nick, you're back. Bro, I'm telling you, don't go near the shellfish, man. It's so bad. I feel"
    }
]