[
    {
        "video_id": "oIztx1R9Mrk",
        "title": "How Cat Photos Caused A Man to Lose $46 Billion in Bitcoin",
        "published_at": "2026-01-12T10:45:43Z",
        "sort_date": "2026-01-12",
        "url": "https://www.youtube.com/watch?v=oIztx1R9Mrk",
        "transcript": "Imagine being one of Bitcoin's first true believers. You got your hands on 371,000 BTC when no one was paying attention. Enough to make you one of the richest people alive. But then you lose it all. Not in a hack, not from losing your keys, but by getting caught trying to blackmail a presidential candidate with a fake ransom note and some cat photos. This is the alleged wild story of Michael Manel Brown, a Bitcoin pioneer who could have been a billionaire but instead became a cautionary tale. Brown, better known online as Nightmb MB, was there in Bitcoin's earliest days. He was a regular on bitcointtalk.org discussing crypto mechanics and even trading messages with Satoshi Nakamoto. He claimed to know enough about Satoshi, like what PC he used, his last known location, and private conversations, that he could verify anyone claiming to be them. Whether that's true or not, Brown clearly had a head start in Bitcoin. He also claimed he once worked with a bank to produce pre-charge Bitcoin cards. The bank had invested about $12,000 to acquire Bitcoin, but later lost interest. But Brown didn't, and he managed to strike a deal for $5,000 to take it all off their hands. This meant he walked away with 371,000 BTC for about 1 cent per coin. At Bitcoin's recent peak of over $124,000 in August, that stash would have been worth about $46 billion. Though, Brown's story isn't just about early riches. In 2009, he was already on law enforcement's radar for suspected data theft from an insurance company. Then came the move that defined Brown's legacy for all the wrong reasons. In 2012, Mitt Romney was preparing for a run at the White House. That same year, a package arrived at the office of his accounting firm, Price Waterhouse Coopers. The letter claimed to be from a hacker who had stolen 3 years of Romney's tax records. to keep them private. The demand was simple. $1 million in Bitcoin. If anyone else wanted the documents released, they could also send $1 million to the hacker. Similar envelopes were also sent to the Democratic and Republican party offices. Each held a letter and a flash drive. It was one of the first public ransom cases involving Bitcoin, and it made headlines. Bitcoin had barely entered the mainstream, and now someone was demanding a million dollars worth of it. But what made it unforgettable was how it all fell apart. Each flash drive contained files with names like 4154 Dolphin Knight MB, 5276 Dolphin Catherine. The Secret Service traced those digital breadcrumbs back to Brown's alias and confirmed his wife's name was, you guessed it, Catherine. agents searched his home and found matching files on his computer. And then the final piece clicked into place. Two mysterious photos of cats were also buried in the files. Turns out they belong to Brown's neighbor. In 2013, Brown was indicted, though he pleaded not guilty. By 2016, he was convicted of wire fraud and extortion, sentenced to 4 years in prison, and ordered to pay around $200,000 in restitution to PWC. [music] By then, Brown was already known for sitting on one of the biggest Bitcoin wallets in history. So, naturally, the big question was, what happened to it? Many speculated on the coin's whereabouts and whether Brown even had access to them. But a little digging shows that in 2012, he claimed most of the coins were donated to Wikileaks and the rest were used to pay off debts. Maybe once the BTC was gone, he had second thoughts. Maybe he wanted back in, just not the honest way. Whatever it was, Brown has faded from Bitcoin's story. Whether he'll ever return to it remains to be seen. If you found this video interesting, watch this one next to learn about one of the largest crypto heists to date."
    }
]