[
    {
        "video_id": "fJx4Kfl5U1w",
        "title": "DCA Live: Next move",
        "published_at": "2026-01-12T17:14:55Z",
        "sort_date": "2026-01-12",
        "url": "https://www.youtube.com/watch?v=fJx4Kfl5U1w",
        "transcript": "Good morning everybody. Second DCA show of the year and the first one. CTO CTO is back. Happy New Year. >> Uh we have Marty and Mando. The whole gang is here today. We're going to talk about all of the crazy things going on in the crypto world with day 57 literally where Bitcoin is still floating at that kind of 91k 92K level 57 days. So something weird is going on either this very slow selling combined with very slow accumulation but it's very unusual to see it so stagnant for such a long time. We'll dig into that and so much more. Before we do, links below for this whole gang. And we're streaming on all each other's channels. And we'll get into the good, the bad, and the ugly news today. Mando, how are you? >> I'm doing great, man. I'm doing great. Everything's good. >> Awesome. And [clears throat] welcome back, CTO. >> Thank you. Great to be back next season. >> In purple. Is purple the color? Like, because I know your color scheme, maybe your lighting makes Mando always look like he's in purple, but he's not. I'm trying to match Mando. >> Yeah, you are in purple. And uh and of course we have Marty Party with >> How you guys? >> I can't read what's on your t-shirt, but looks like Asian. >> Oh, it's Bitcoin. This is a Bitcoin in Japanese. 21 million. >> Very nice. Very nice. We will talk about 21 actually today as well in the show. So, let's jump in. We have a lot of ground to cover. This one's called scarcity beats abundance. And there is this interesting theory that we'll get into in a minute. But first, uh let's talk about the case for Bitcoin. Um, and again, last week we mentioned the term Venezuela, like we're all pro war, like we all have a dog in this fight between whatever happened with Maduro. We have no dog in this fight. So, we're not getting things heated. What we do care about is the impact of these geopolitical events on markets. That's why we talk about them. I want that to be very clear. People were saying very weird stuff last week. Anyway, this is an interesting point from David and Mando. I'd like your take on this and maybe Marty too and CTO. Venezuela just proved that bit the Bitcoin bullcase and no one is paying attention. Maduro used Tether to move 80% of Venezuela's oil revenue, billions in sanctions evasion, etc. Then the US made a phone call. Tether froze the wallets. What do you make of this, Mando? Um, is it safe to as a sovereign to move your money around using Tether? >> Tether can freeze uh that they've they've shown that they can do that. So, I don't know. They didn't really used to do this that much and then recently they've started to do it a bit more. Um, strangely actually USDC has been criticized a little bit more for not uh freezing this sort of stuff. So, I agree that Bitcoin does not have this issue as does some of the other proofof work uh coins. So if if Tether's trying to cozy up with the US a little bit more, right, they had Bo Burn um what's his name again? Bohines and they uh they have they're looking to kind of go on shore at least in Europe and US with more compliant versions of their stable coin. Like there's a chance that that Heather's going to be doing a bit more of this the next uh the next few years. See, uh, Marty, what's your take on this without getting too political? >> First of all, let's a big shout out to David, my friend David. He's excellent. He's, uh, he's in oil and gas. Um, his business, they, uh, mine Bitcoin with excess gas. That's his business. He's extremely knowledgeable. He's just putting out banger after banger. I think he's dead on here. Um, all we are, I call it the purge. We're going through the purge right now. that is all criminal behavior, all criminals, all Bitcoin and crypto held by criminal organizations um will be policed, removed and this is just another step in the way. Tether is exerting for you know they've frozen a thousand addresses historically. This is unprecedented. This shows you that uh you know you criminals you can't use Tether. Um you I think it's a great show of strength from Tether um obviously with pressure from OFAC and the Department of Justice but uh you know PDVSA which is the the Madera's oil company has been you know using Tether to bypass sanctions specifically on Tron. We must make that clear. This is on Tron. >> Correct. >> 90% of these frozen addresses were on Tron. >> Um and you know this is uh this is what we knew would happen. You can't you can't use crypto to do criminal things. It's been pushed that way for a long time. And until I think we're being held in an 87 day um commodity suppression, until this stuff is fixed, until these players are removed, until this behavior is released, we will not go higher. Why would we? The higher we go, the they will sell. And these people are a lot of a lot of this asset. So, I think it's all good. For me as a long-term holder, I'm extremely bullish on any of this policing personally. And we also saw Madera and Zcash banned by Dubai today. >> Ah, the Zcash because they had some Dow issues. >> Monero Zcash has officially been banned by the UAE. >> Yeah. Well, I always say, you know, things like privacy days were numbered. Governments hate privacy. They like to stalk on people. CTO, that was a very interesting piece of news from Marty. Um, Tether where do you funnel your Larsson oil industries money? >> Yeah, exactly. I think that Madur [clears throat] if Madura had used Bitcoin instead, I'm not sure it would have made such a big difference because then those transaction I mean they would get blacklisted instead. It's like North Korea's Bitcoin and of course they can try to wash it right and left and mix it and so on so forth, but pretty difficult with big amounts. So, I'm not sure it would have mattered so much. I agree with Marty. It's like purging the criminals out of uh the crypto industry. And I think that's a good thing. I think if they want to do shady stuff, they need to use cash or gold bars or something else that can't be tracked. Uh digital um assets are on ledgers. It's forever there and it's quite easily analyzed. Even if they try to mix it, if it's big amounts, it's usually possible to trace it. >> Yeah, I think I think you you stepped on a point there, CTO, that we need to probably stress a little bit more and that is the portability. Okay, we know that oil is extremely hard to move around. You need these massive tankers that can be taken over by military ships. And the portability of gold to trade it is also extremely difficult to move around and requires a ton of security. So, can you imagine trading oil for gold? That sounds very cumbersome and and put that against the backlight of the portability of Bitcoin. Interesting. Exactly. Of course, it's like for a legitimate business, of course, digital currencies, so digital assets are much more practical. I'm saying like in the hypothetical case because that was the claim here that, you know, they could have used Bitcoin instead of USDT and then they could have gotten away with avoiding the sanctions. But I'm not entirely sure that's true. I think it would have been a problem with Bitcoin as well. They would have had to use something something else. >> Yeah. >> Well, remember if we step back, they they converted a lot of the Tether into Bitcoin. Yes. >> Talking about the 600,000 stockpile, right? So, it's quite interesting. Um, this might been seizing remaining Tether wallets. Um, and the US is going after that 600,000 Bitcoin. Well, the 600,000 Bitcoin was a pair trade from gold to Bitcoin. But the oil revenue was tethered through THRON, wasn't it? >> Storing years of oil trade using Tether in Bitcoin. But then uh they've come after and frozen, I believe, $183 million of Tether wallets associated with Madera as well. So, they're seizing the Bitcoin and freezing the Tether wallets. It's a policing operation. >> Yeah. Well, let's get into the big story today. I want to talk a bit about scarcity because, you know, people are the other in the other of the story is people are losing interest. You know, humans are like flies and if there's no pollen on the flower, they move on to another flower literally. Uh there are five companies now that are worth 10x the market cap of Bitcoin. Five companies. So, and gold is valued at 350 million Bitcoin. So when you think about that either and this is from Rajad Sony either something has to catch up because it's never been so egregious in terms of the delta between the total amount of wealth in the world and how small Bitcoin continues to become over time. So the question is which way will gravity pull us Mando? Will Bitcoin be pulled up? But and this takes us to our abundance story that's coming next. But these are these top five companies all AI related, AI adjacent and again completely dwarf the market cap of Bitcoin. What happens next? >> It's all those added together though is 10x. >> Yeah. Yeah. Yeah. Okay. [snorts] >> Um they seem like very different trades at this point to to me. Uh Bitcoin I don't think is really at the moment is not really benefiting from the AI trend. It is frustrating at the moment. Like today we saw gold and silver again rally because of this fight between Pal and and Trump and Safe Haven was like okay this is a good time for safe haven demand and Bitcoin it's kind of attempted a rally but it's still just in this very very narrow range like if you look at the Bitcoin chart it's kind of after that initial dip uh down to 80k it's been smaller and smaller and smaller the channel so until we have a conclusive breakout of that channel I think volatility feels very low. It looks like it's still in that that uh like people people have done options trade, right? Like uh that's what it looks like still to me where like the volatility is being massively suppressed uh at the moment. >> You're muted. James [snorts] >> CTO, I don't know if you have a a chart here, but talk about this flat little piece, you know, 57 days at this call it 91K, 92K, 90K range, it is totally asleep. But I know and Mando correctly talked about the channel because when you get into that kind of cloud that's compressing, it's going to break one way or the other eventually. The question is when tell us when it's going to break, CTO. >> Absolutely. So it's getting really exciting. It was a good time to um have a break because nothing has happened here the past month. But now it's very clear. It's very very clear. Price is in this range here. And what the first thing we have to note here is what didn't happen. So this started to look like this would turn into a head and shoulders with a right shoulder over here and a breakdown sometime around the new year. But that didn't happen. That never confirmed. So this never became a head and shoulders pattern. Instead, price ran up to the top of the range again and rejected on exactly the same level as the previous time. I put it here at 93,860. So price is in a range between uh about 94,788 and n sorry 84,788 and 93,860 and as you said James it's going to break out and um you know which direction we will have to see but I could definitely see this going in an upside breakout because and we think we will talk about that later. A lot of people have given up now. Crypto is really boring. It has dropped. Uh, everyone is in AI and silver and gold and so on. And that could perhaps be when we pick up momentum again or we get the downside breakout then uh we have another leg down. But or you know we could bounce again at the bottom. Um, uh, Martin, you sent an interesting WFO chart to, you know, could get one more touch at the bottom and then >> up from there. So, we I'm monitoring this range and when it breaks out, I'm going to take action. If this breaks on the upside, I'm in again. If it breaks on the downside, okay, there's one more leg down probably. So, it's very clear now. It's not confusing anymore. Very clear strategy. Rectangle can be a bottom formation. We can absolutely turn around here and move up, but then we have to break the upside of the range. It can also be a continuation pattern. Then we break the downside and one more leg down. And for me, I mean, as cheaper the Bitcoin, the better. I would love another leg down, but if we get leg up, I'm on it. >> Yeah, >> I love that. I love that CTO. Well, >> Marty, what's your take? Are we breaking up to the upside? >> I mean, firstly, I've been waiting for this week. Um, in my community, we we've been waiting for this week for I don't know, months. This is this is a pivotal week guys. Um this January 15th date has been pending since late November. Um remember we have a whole lot of things happening. On the January 5th, Binance moved jurisdiction um to Abu Dhabi, right? They went right under the radar, which was a big day for for anybody who knows who follows the markets, but they've moved to the ADGM. So Binance is now officially regulated um and therefore can't do as much shady business. And if you'll notice, the market has substantially changed. If you're a trader or sculper, you'll see that the market making movements, everything has slightly changed since January 5th. So January 1st feels to me like the beginning of the bull run in my opinion from a liquidity perspective. Um January 5th, Binance goes under Abu Dhabi control. Then we have market structure, which obviously is the most pivotal law in all of crypto history. um which is you know the legal green stamping of crypto as um or obviously blockchains as commodities, blockchain tokens as commodities, legal commodities and then the definition of security tokens, access tokens, utility tokens, etc. Once that passes, I believe you'll see a floodgate like you've never believed. So I I feel like we're being held here using dealer hedging. Um I call it commodity suppression just like they do with silver and gold for many many years. Anybody in silver and gold knows very much this frustration uh where every time you move up you know it seems to come thumping down with aggression. This is typical commodity suppression using you know delta delta neutral um hedging from from the dealers and uh like David said if you've been watching his posts it ends it's all about gamma you know at some point it doesn't become valuable to them and then they will release it and uh that date is looking like January 29th potentially or this Friday one of the two dates but that explains where we are and that's typically how the woff is that's what the woff is when I talk about woff I'm talking about large participants Wales institutional um you know their distribution what their intent to accumulate the asset. So it all makes sense. We're in the W cop accumulation just like CTO says the only question now is whether they run at those the late longs all of the leveraged longs that have accumulated since you know November uh when this started. Will they come and try and flush them or are they unable to do that because of the Binance change? potentially they can't do these deep flushes and large volatility volatility moves like they used to do and so we might see a slow build up um until you know the dealer hedging becomes unprofitable and then uh we'll see a markup back to resistance. I mean global liquidity right now is saying 124,75 is the price of Bitcoin. So we could return there very fast in my opinion. >> We we'll get to we'll get to the macro and some global liquidity in a second. And I do want to talk about again the intersection between AI. There was a lot of talk over the last couple of weeks that has some people a little bit confused. You know, you got Elon Musk saying, \"No, you don't need to save for retirement. There's going to be abundant everything.\" Uh we know we are heading into a maybe a post labor economy with AI and robots and all that type of stuff. And as labor becomes increasingly irrelevant, prosperity is created without jobs, wages will stagnate, fiat will go to zero, which we know anyway, and traditional savings will fall. But there is one asset that doesn't depend on human work. It doesn't depend on governments. It doesn't depend on productivity, etc. >> And this guy Brad Long says, and we always heard this over the years, given 0.1 Bitcoin or 0.21 21 Bitcoin actually matters. But 0.21 Bitcoin in a post labor world with infinite abundance but only a little bit of scarcity. That 0.21 Bitcoin could matter a lot. Again, abundance is coming. Scarcity is disappearing. But the question is, is Bitcoin the one exception? Mando, I'm going to give you that prickly pair first. What do you believe? >> No, I believe in this. I I believe I believe Bitcoin is going to be a great asset to own over the next over the next decade. I it's just strange that it continues to be in this this weird channel, right? Like we've been talking about this literally for months now that it's underperforming. Gold hitting another alltime high today like or getting close to it at least. It just it it needs to keep get that back that um that correlation. And uh I I it still perplexes me why it's broken down. Like every single day I look at this and go like, yes, Bitcoin is the best asset to own because it's like you said, it's digital. It's easier to store. It's easier to send than gold. Like it's actually it's an asset built for the the age of AI at the same time having that sort of scarcity. So I'm I'm still in CTO's camp of wait and see here. Like I haven't got back into the market aggressively since kind of I got out when I was at 100K. But um I I am every day perplexed at why this has not caught back on as a trend. >> Can I add one thing? One thing that I found very useful for myself that has I fell for many times like I saw some investment opportunity and I felt oh wow I understand exactly this. It should really move and I buy it and then nothing happens and nothing happens. Nothing happens. nothing happens and then I kind of gave up and then it moved. So, it wasn't wrong. We were just too early like and I've learned from that to be more patient that we kind of see this so clearly and then we don't understand why it doesn't move. And perhaps it's because not enough other people see it yet, but they might later. So yeah, it could be that we that analysis is exactly correct. It just will move later and that's one thing that yeah been useful for me so I don't give up too early. >> Yep. Awesome. Good stuff. All right. U Marty, any thoughts? 0.2 on Bitcoin. Is that a big big enough bag for the next decade? And I I always get paranoid. And one thing I do want to say here is, >> you know, things are changing so fast in the world. >> Will, and it's controversial. >> Could Bitcoin be displaced? There's been a lot of chatter out there as well. It's like, oh, the technology is too old. It's too slow. It's not going to make it. We need a more decentralized, more what encrypted solution than Bitcoin. >> I mean, I've always I stick with my thesis. Um, first of all, Bitcoin is a digital vault. It's a bank vault. It's the new bank vault. Um, it's intended to be slow and secure. I don't think it needs to be faster. I don't think it needs to be uh change all like I agree with Michael Sailor. The the le the least we change on Bitcoin, the better at this point. That's its job. That's it. It's it it's its its role is to store money, to store value. And uh we always complain when it goes sideways, but we want it to be a store of value. So, it's a little uh little contradictory. The minute it becomes a store of value, we all freak out that it's not going up. Um, it's up from 16,000. Let's be very clear. 16 to 90,000. A massive jump. So, like CTO says, I agree with we need to be more patient. In my opinion, um, as well, you can't compare to other markets. Other markets are regulated, extremely regulated by jurisdictions all around the world. Crypto is unregulated. Um, it's a wild west. It always has been. And, uh, we're working, David Saxs, Lumis, and the and, uh, you know, the the representatives are working day and night. They were in all weekend deliberating this Clarity Act to try and regulate crypto. Once it's regulated, I believe we will see its full potential. Until then, it'll be an accumulation. Um, but it's I I'll stick to my thesis. I think it goes up in binary numbers. 16 32 64 128 256 512 1024 I think it's it's heading for 1 million a bitcoin that's far the 0.21 21 Bitcoin completely makes sense to me. Um, in my opinion, that's what's going to happen. >> 1024. That's a tech number, too. >> That's a million dollars in 24. Correct. >> Oh, I know that. But the 1024 is like getting back to bits and bites. Let's let's move on. There's there's other stuff happening, too. And this goes back to the yawn session where people are actually bored. It's like, oh, what the hell's going on here? And if you look at YouTube viewership, it has dropped to its lowest level since January 21 from Solid Intel. And I don't know if you feel that in your communities, but interest is down. And Will Clemente, um, you know, we saw the Bitcoin therapist lose his mind before Christmas, which is funny. Um, and he's the therapist, and he even got frustrated with this action. And then Will Clemente. Uh, this environment is literally what Bitcoin was created for. The president is coming after the Fed chair. Metals are ripping. As a result, gold and silver through the moon as sovereigns diversify reserves, stocks and risk assets at record highs, geopolitical risk rising. If Bitcoin can't catch a bid soon, then I don't know. CTO, to you first. What do you think of Will Stadia? It's like he he's like, \"What the hell's going on? We are overdue for a move.\" >> Yeah. I mean, when the last optimist gives up, that's the bottom. So um yeah I mean of course it should move um from a logical perspective clearly people are selling so it doesn't move but this can change quickly at one point it will I have no there's no doubt in my mind that the technology the concept and so on will survive so I mean this volatility is great. >> Yeah. What would you say? What would you say Amanda to will say the bid is coming soon or just >> I mean that's what I've been saying so far as well. I'm not in the I'm not in the sort of world where I'm going to predict when it's going to come. Uh I I think we maybe need a more broader move across all markets for like Bitcoin to suddenly see this sort of move. Now I feel like it's actually being harmed almost by everything else hitting alltime high, you know. But um yeah, I think I think if we were to see like a maybe a move down in stocks, we might see a move in Bitcoin here. But for right now, it's it's kind of not helping that everything else is the alltime high while Bitcoin isn't. >> Good. Good stuff. All right, let's go on to the next little bit of good news. And Marty, you've probably seen this, too. We're seeing wallets like like sharks accumulating like mad. The whales are back in. The good news here is the long-term distribution has slowed significantly, which we saw over onchain uh over the past ever since about mid December, 10th of December, the long-term holder Bitcoin distribution has decelerated fast and net outflows have rolled up over from the extreme levels. You we had record selling for a record long period of time and now we just need the ETFs to kick back in. But this is a at least a positive. And again, when you look at these periods of big selling, they only last a finite period of time. We had a tiny little green bump there in the middle of the selling. Let me see if I can pull up that exact month. I got to zoom in. Uh between July 2025 and end of August, big sell-off, tiny bump in September, and then a big selloff again. But if you take that whole period, we had six pure months, seven pure months of heavy selling by the long-term holders, which equates to what happened in 2024 to early 2025 and also before that. So again, this cycle is very different. The selling came in fits and starts, which is correlated to Bitcoin being above 100K, hitting 120K. And in terms of the calendar of the timing of the 4-year cycle, which was the signal because all the long-term holders, as we found out after the fact, the the big bag holders, the OGs, they all got on the phone with each other and say, \"Hey, you going to sell?\" \"Yeah, I'm going to sell. You going to sell?\" \"Yeah, I'm going to sell.\" And they all decided to sell. But but considering the amount that was actually sold, I'm surprised Bitcoin didn't fall further. What do you think, Marty? >> Yeah, I think this is I agree with you. This is the uh self-fulfilling prophecy thesis. Um I think when people when large enough influences say sell then specifically for technical reasons then people will follow. But you guys did you see over the weekend we've got Fidelity and CZ of Binance talking of super cycles claiming the four cycle is over. Um if you map your that chart you have to actual liquidity cycle you'll see we're exactly where we are. We've never we're in a macro bottom. People have never been more broke than they have been over the last few months. So, they needed to sell. All people that needed to sell sold. That's where we are right now. Um, in my opinion, the super cycle started on January 1st. We'll have long extended bull runs with short violent pullbacks. Much like the spy, I think Bitcoin starts trading like the spy from this year. >> Yeah. >> In my opinion. Um, yeah. that that I think the bigger news is the Jerome Powell being sued in court. >> We'll we'll we'll get to that in a second. I do want to talk about another thing because >> at least in the state of California, we've had uh and place like the UK and different regimes around the world where they threaten to jack taxes on high netw worth people, do unrealized capital gains, confiscate wealth, very uh Orwellian stuff. But they had a little test of a little experiment in California uh in 2025 where they said they'd take 5% off the billionaires >> which includes things like wealth you wouldn't imagine. So the voting power for Sergey and Larry from Google is 20x the normal share. >> So the government would take imagine you got a million shares. The government sees as 20 million shares >> which meant that they would not be able to afford to pay the tax bill if they stayed. They ran and so did Peter Theel, Shemath, David Sachs, uh Palmer Lucky from Anderil. All the California billionaires, at least half of them, according to Shemath, have left over a trillion dollars in value. And now we're seeing, I always say money gives you wings. People are fleeing high tax regimes, places that aren't safe or authoritarian regimes to places that are safer. Like Dubai is probably packed at the gills right now. you have this this might be old news because I thought if you held Bitcoin for over a year in Portugal it was taxree anyway I thought crypto was taxfree um but anyway Mando to you first you're see are you not noticing the big global money flight right now around the world >> to tax tax jurisdictions yeah it feels that way right it's happening in the US obviously with what's happening in California and then it's been happening for a while though like I think it's >> some of these like western economies are kind of maturing and the debt is getting so high that they're having to come in there and tax the wealthy very very high. >> So Marty, do you mind just muting? I think there's going to be an echo as well. >> Oh, really? >> Yeah. Um now >> and that is causing um uh them to kind of increase capital gains pretty high on a bunch of different people at the moment. like the whole California thing is stem from the idea that essentially they're like they're the fiscal situation there is not going that well and that's the case in the UK it's the case in France at the moment a lot of northern European countries are having this sort of issue so I think this flight to uh other countries is only really accelerating you see where all the millionaires have moved over the last few years it's been to places with better tax regimes UAE I think has been the number one but there's been various other ones including like Portugal, Switzerland, Italy had a had a low tax regime for a little bit and uh a few other places in in Asia like Singapore. So I think this is going to be a trend that continues for a long time >> and it it it was started actually during C19 when people had the excuse like I don't need to be in the office and they started bouncing and going to Florida say out in New York and other places um from California to Nevada and Texas and all these taxree places and then say you know it's not that bad here and then they stayed but now it's beginning to accelerate again a big move CTO what's your take on this the flight of the bag holders? Oh yeah, this is very interesting and I think there's a great opportunity in this actually because it's very clear now there's two sets of countries here. One who has the idea let's squeeze out more of the rich people that we have. Let's get them to pay more tax. That's how we're going to solve it. And then there's another set of countries who think differently. They thinking instead let's attract the people from these other countries. Let's get them to move here so that they pay tax here. instead they pay lower tax but they will pay tax here instead of in their previous country. So these two sets of countries are now very clearly polarizing almost with uh and it's within the US also I think I mean of course James you know US much better than me because I'm not from there but I can see that like uh uh California versus Texas and and so on. It's kind of playing out between the states as well and and in You know, Europe, it's very clear UK is losing a lot. They had previously something called a nondom scheme where they they tried to attract rich people and then they removed it. Okay, what happens then? Well, all those rich people move out again. And >> Russian oligarchs, by the way, tons of Russian oligarchs moved to London, I think, during this era. >> Yeah, probably. And and yeah, then if they remove the scheme again, those people move out. So, it [clears throat] is super clear. So if anyone is, you know, buying a house or something, I think think carefully where you're doing that. In the UK, I read that 1% of people pay onethird of the tax and 5% pay half. So if those people move out, who's going to pay for everything? And I think they haven't kind of really thought this through. It's going to be like a monumental collapse if they push this through. And then some proposals are actually implemented. They kind of crazy. For example, in Norway, unless I'm mistaken, they have an unrealized uh capital gains tax, like a wealth tax. So, say that you're an entrepreneur. You start a successful company. You're still kind of broke. You still live in your uh small apartment, but your company is now worth a lot. and you own 50% of it, then they're going to tax you on that, but you're going to pay it with what? You don't have any money, barely have money for rent, right? So, you have to then sell part of your company to pay the tax even though you you're still building it. And I see that this idea is taking root in many different places. And uh that will then obviously force those entrepreneurs to move out. account and people people think if it's just the say the Peter the moves out but it's not just him it's him his businesses the companies he invests in if a VC invests in a firm they'll say you got to move to you know Sandill Road Silicon Valley etc if they move to Texas or Florida they say you got to move here you cannot be far away you got to be like a 20-minut ride away from the company all their staff all their companies all their people all their property taxes all their income taxes is all gone. >> Oh yeah. All that because many times you have to move the company as well, right? So So it's like it's massive impact and >> uh I think it's like this old idea that ah no one's going to move. We will force them to stay and make it more difficult to move. But it's not going to work unless going like full out east Germany. You have to build a wall or something and shoot people trying to climb over like that's the that's where it goes. That's where that idea ends up. >> Well, they're they're trying they're trying to burn the boats to chase people for 10 years with their wealth as well if they do leave. Anyway, back to our next story, which is a tailwind, alpha tailwind for us. And I'll explain why in a minute. And Marty, this is in your wheelhouse, too. Threats on the Fed. Jerome Powell says the Department of Justice is threatening the Fed with criminal charges because they're spending billions on a an office extension or something um because they will not bow to Trump Trump's wishes to low interest rates. And we know the midterms are coming up in November 2026, which is not too far away. We're talking 10 months and change. And the US current administration wants to juice the market. This happens every time before the elections. So people feel good and they say, you know, I like the people in power. They're doing a good job. But they're trying to cut real estate mortgages. They're going to trying to cut interest rates. They're trying to cap uh credit card interest rates at 10%. They're trying to reduce taxes, increase investments. Marty, what do you make of all of this? I call it juicing the market by any means necessary in the US. and take that a step further. How can this help crypto AI stocks, all that stuff down the line? Marty, you might be muted. Yeah. Um, the severity of the situation in the US is either either they have to bring in income using tariffs, which, you know, Trump started very aggressively and now you can see already the Supreme Court challenging that. I think there's a lot of asymmetric bets around that specifically around wealthy people and the moving the flight capital flight out of the US. Um because if Trump's tariffs are banned illeg or deemed illegal then there's only one other option and that's to tax the rich and the rich are you know running ahead of that front running that potential. That's what I think is happening. But clearly Trump wants to stimulate the markets. He's announced a $200 billion mortgage bond buyback. Um, obviously he has Moran in the Fed trying to reduce rates, talking about three or four rate cuts he would vote for next year, whilst the majority of the Fed is voting for no cuts. I think we've got a complete um shakeddown going between Trump trying to stimulate the economy and uh, you know, push the can down the road um, with with potential solutions including stable coin and Bitcoin as as a way to reset the system. But then you've got push back from the Fed. And I think this is just literally the next the next uh move against the Fed to try and try and either force his his hands or to get rid of him entirely. Now look, if we can get rid of the Fed entirely, um I think Trump will go on the largest money printing campaign we've ever seen in history, which will obviously play well into into assets. Um so I think that the it's going down right now. This this I think is a very significant event. this threatening Jerome Powell with legal action. Um, and the wealthy people are leaving because they're front they they're front running the Supreme Court saying all that tariff income is false and you got to applaud back and you can't do that. So, it's a very interesting situation. Like I said, this is the week I told you this this week or next week is the week of reckoning. Will the US be able to save itself with tariff tax which means the eradication of the IRS which is obviously good for people to stimulate the economy making the IRS into the external revenue service via tariffs. If that fails um Trump has several other ways in which he can tariff countries but I think the market will rack quite poorly but ultimately the US has to find a way to to to raise more money. Um they have the biggest debt situation a trillion dollars a month in interest. So how are they going to get out of that? They got to either make money with tariffs or tax the hell out of the rich and the corporations. So, I think you're going to see the rich and corporations trying to leave. Starts with California um next moves to foreign countries. But then just like CTO says, I'm I'm hearing the same thing from um Australia. They're seeing this coming and they're clamping down too. They're not allowing these these tax havens. Look at Abu Dhabi. They're not allowing Monero and Zcash. I think the whole world is starting to clamp down on that concept. It's called financial repression. You can Google it. This has happened in the 40s and the 70s. This is uh this is what's happening. So I think it's all tied together. It's all uh one big movement. Um Trump is trying to get the US out of debt and to stimulate the economy and the existing forces are pushing back. >> Yeah, interesting stuff. And a lot of people now also considering kind of the stodgy period we've been in. Is this a time to accumulate crypto? [snorts] Obviously 2025 was a lost year. Uh broke the four-year cycle that's definitively in the books. Now a lot of people looking at the as we saw from your chart at the beginning CTO bottoming. We're also beginning to see a move. I have this Trading View setup where I compare Salana to every single other uh crypto out there and it's up against everything today with the exception of uh Tesla. So, uh Salana is making a little bit of a run. Um do you think uh Mando, you know, you said you're not ready to commit yet. Is this a fake out? A lot of people are asking consider considering the four-year cycle was broken. People are really confused. They don't know what to do. Should we go back into the market? Should we sell out of the market? Should we rotate into something else? Should we just do a little bit of safe dollar cost averaging? And what do you think the ETFs will do to this market? Because for the last month or so, uh, Salana ETFs have had positive flows unlike other assets. I mean, I can tell you I can tell you my portfolio is not is not um is not majority crypto right now. Um I've been buying gold and Google. Those have been my two biggest buys recently. And then I did buy some Monero, although I sold some over the last couple days. Um I like buying assets as they're breaking out towards alltime highs and going into price discovery. And at the moment, Bitcoin is bouncing back. We're looking for support. that that can be a good time to buy, but generally I don't tend to make that much money when that happens. So, I'm gonna wait to see if it breaks out um particular firstly at this full channel and then probably above 100K. If it goes above 100K, I think I get back in um in decent size because I really like the narrative for Bitcoin. But I think you can get caught in good get narrative for a long time and with everything going to alltime high like that's just what I've been doing with my portfolio. So, um, I'm not going to sit here and say that you should have go all in for a crypto at this time. I do think if you're long-term and you're like, \"Right, I want to own this for the next 10 years in Bitcoin.\" Bitcoin is a great thing to own because it it will it will retain that sort of a hedge, but the market's just broken down in a strange way recently that that it's been tough for me to um to go back in with massive confidence. I I tried to look at the breakout at 94K the other day and I was like, \"This could this could get interesting.\" and then got rejected and I was like, \"Okay, we're going to be in this channel for a little bit longer.\" So, that's my uh that's my basic >> and I've had this theory for a while, you know, knowing Michael Sailor and looking at the way he smiles sometimes. I I still have this nagging theory, he knows something is up. He is buying handover fist. He bought 13,627 bitcoins billion dollars today. >> Yeah. And a lot of it the money that was raised was from STRC, the preferred dividend. Marty. Um, could he know something is going to happen with Bitcoin? We had somebody in the US government as well, Byron. I think >> Bitcoin. >> Yeah. All of a sudden he drops 100K on Bitcoin out of the blue. Do you think they know something's going on? Because for Sailor to be deploying so much capital and doing some NAF premium sales that are probably at a discount, I >> he's he's in a rush to accumulate handover fist. And remember, at this price, he bought it about 92K. 13,600 Bitcoin in a week is a lot. >> Tell us what you think. >> I mean, I think Bitcoin was it's the only non-bearer asset in the world right now other than physical gold, which is impossible to carry. So I think it has a massive market. The ma anytime there's any talk of war um you know geopolitics it only plays into the hands of Bitcoin. I think Bitcoin as a as an asset is there's nothing like it. Of course um in my opinion I'm a I'm a trader as long as as well as a long-term holder. My long-term holding portfolio have not touched. It's a 10-year strategy. I think in this range you follow you follow the large players. uh this woff accumulation we're in right now started in November you know for probably around November 21st was the bottom at around 80,000 and that's the time for for accumulation and you follow the uh large participants never follow crypto Twitter never follow small players never follow traders they don't know what they're talking about anyway just had to throw that in there you follow the whales the whales are accumulating you accumulate if if you're out of the market now you should be scaling in. I'm at seven out of 10 units. I'll save three units for the spring, the WO off spring, which I think will come over the next week. Um, that's where I'll go pretty much fully back into my position. As a trader, I'll look to long that that around 80,000 80,800. Um, I put my probabilities up on my page very transparently. Um, and then obviously when you cross over the 200 day moving average, if you're a more conservative trader, like if man, what Mando's saying, you can get back in there. that's perfectly fine. I think in the long term it doesn't really make that much difference at $10,000 of Bitcoin. But yes, I think we're in accumulation. This is the time to enter. This is the asset to hold. Uh the stock market is very very overcooked. Um and Bitcoin is in a beautiful accumulation. I I I I think it's the asset to buy right now personally and Michael Sailor seems to agree and so does half of the representatives in the Congress. So you can sit around and you know and and live in a fearful world or you can seize the moment and I think Bitcoin's price firstly once again you can look at all the charts you want on Bitcoin but it's an unregulated market. So what are charts? Um I think this changes radically after market structure. I don't think you'll recognize the crypto market. This is the time to accumulate. I think the last real chance to accumulate Bitcoin um at these levels. Will there be a lower dive? Absolutely. The WOF says we may clear the longs which means we break those support levels um you know and run at those 15x longs which could be a dive to let's say 85800 maybe 83800 maybe as deep as 79800 worst case scenario they take back take back the whole Trump pump but it'll be very shortlived and you might not be able to uh actually exercise that trade exchanges might go down um slippage will go to the moon >> and you'll >> there you There's a quick question here. How come micro strategy options are still expensive given the drop in the stock value because of the volatility? And by the way, treasuries, DATs, digital treasury companies have all completely lost their butts. Um, people have lost faith maybe because they now have ETF access. But I think everybody's now looking at the big rotation into AI. I think that's taken a lot of oxygen. So has gold and silver taken a lot of oxygen. But the everything mean reverts and then we'll things will come back. But I do believe as other people believe Sailor knows something something's going to give. We're going to do one last topic and then we're going to open up to some questions. But this is something that CTO you pinged me talked to me about this before we even got started. And this is what I call all roads lead to the anti-authorit authoritarian tech stack. >> I love this. Yeah. This was written by an ETH guy, Dave. Uh, I think it's David, you probably can't remember his name. Um, but he basically he talked he wrote a paper that during times like what's going on in Iran right now. There's two things that matter. One, it's X, which is Twitter, and two is communication capability, which is Starlink, because these regimes shut down the internet in the country. Nobody can communicate. And that's very frustrating when you got some bad things happen. And it's I think it's just funny. Um because CTO you asked would Tesla merge with other companies because the stuff that Shamas said over the weekend. I do not believe that that's going to happen because Elon doesn't want to put a bigger target on his back by controlling one huge company that controls the whole world. That would just be bad. It's better for them to be in discrete silos like space, AI and social, like uh robots and electric autonomous vehicles. They should all be separate bundles in my opinion. I think Shimath is wrong in that one. Um CTO, any questions regarding this and the authoritarian text which I think is >> of course it's a it's a huge topic. Uh but um yeah, there's so much to say and of course happy to see that uh because in Iran people have been a lot of people have been oppressed by a very heavyhanded regime and if they can use modern technology to change that I think it's fantastic. Another thing that I really reflected on is that I truly get a completely different perspective on many things if I go on X than if I go on basically all other media sources. It's been very polarizing like uh for example just take the recent Minnesota example like all the major newspapers write one angle and then you go on X and you see completely different story and it's really been striking to me and um I know Elon Musk is very polarizing and so on half people hate him half people love him but I think He really has done this the free speech uh platform he has created it and it is a only today you go on any other platform you see a different angle on all these events at least that's my experience >> in fact he he just called the bluff of the European Union they said he's rigging the system to spread certain narratives he's going to share the code and the algorithm for X publicly so everybody can see for themselves. He is not doing anything. It's completely unbiased, which is interesting. Amando, what do you think of this uh anti-authoritarian tech stack and the world we live in? Because I just I just see the planet as more and more of a tinder box every single day. And that's only going to get worse with the advent of AI and wealth distribution and stuff like that. >> Yeah, I'm a big big believer in that, too. So, I think I think buying the uh buying anything that's going to do well in an world of high conflict, I think makes a lot of sense. Um, Bitcoin is one of those things. Um, I think we got the echo again. Uh, party. >> Um, so just wait. Um, so yeah, I think the we'll hopefully see a decent amount of gold and and silver and Bitcoin all follow that that that world higher. AI is kind of the unknown in that sort of world because a lot of those are stocks. So I think that that could cause a um that could go either way in the case of war like if we start to see China make a move to Taiwan or or something along those lines in terms of geopolitics. But I do think that should be your your overarching uh theme. Um I do think some of the robotics companies make sense because they kind of apply for defense in a large way and I think defense is going to be a big sector let's say for the next 50 years. >> Exactly. I was always anti-militaryindustrial complex always anti- war stocks etc. But in this day and age uh I am looking very heavily at defense stocks and Android IPO is coming this year and a few others. Uh so it'll be super interesting. Marty, quick take and then we'll take a few quick questions from the audience. You're muted against. Yeah. Philosophically, uh, this all goes back to the generational change, right? The hundred years cycle, the baby boomers and the silent generation, those born, you know, before me pretty much, and Elon Musk, Michael Sailor, my generation, James, you, yourself. um we're technocratic and we're taking over the world and uh this is how it looks. It's not pretty at times. There will be a lot of resistance as I always use the expression they'll fight like dogs and they are doing so right now. But I mean for the people in the audience, what does an anti- athoritarian stack look like? Okay, remember it's like a layered set of let's talk about it decentralized privacy focused opensource self-s sovereign technologies um technologies designed to resist government censorship surveillance corporate gatekeeping financial repression I talk about it all the time and centralized control so understand that's what we're going through now Elon Musk obviously is on the forefront is an anti- athoritarian tech stack X is an anti- aor authoritarian tech stack. Bitcoin is an anti- athoritian tech stack. As you can see, it's playing out right in front of your eyes. There'll be push back. Don't be fearful. This is part of how it happens. They will die. The older people will die. So will the PTSD from the World Wars. This newer generation is not a wararmongering generation. We are peaceloving. We use technology to integrate the world. We don't use war. And so we're going through the last phase of the transition. It can be scary. You can look at the Benner chart. It goes from now till around 2030. It's going to be a potential rough spot. Bear with it. Accumulate assets. Work your ass off. >> Fourth turning stuff there. We got Marty all fired up. Thank you for that. And yes, we we like peace. So, this is a quick question, technical question for you, maybe CTO or Marty from Turk. Can someone share? If you buy Bitcoin in a non-KYC place but paid with USDT, does it make it KYC? Does it reach back into the source of funds and track them asking for a friend? CTO >> always assume that uh you know you can't hide you can't hide. Don't underestimate the tax authorities. They're much more competent than you maybe you think. So uh they have a lot of tools. They're very competent people. Uh, forget about if it's like KYC or not KYC. Report everything, pay your taxes, or it's not going to end well. Like, if these countries and professional, you know, criminal organizations with hundreds of experts, if they can't hide it, you're not going to be able to hide it. So, um, yeah, it's not going to work. Doesn't matter if it's KYC or not KYC, it's going to come back to you one way or another. >> Uh Marty, any technical insight there? >> Uh I mean, I think it's quite interesting. First of all, don't sell. If you don't sell, you don't have a taxable event. Um if you have a long-term time horizon, don't sell. Selling you, if you sell for a small profit and pay 38% tax, you're making a bad trade. Always remember that. People forget that. Um the other things to understand like CTO says is um AI on blockchains will be the most powerful surveillance tool of all time. Um you can't hide. Okay, criminals leave crypto. It's literally the opposite of what you think. You think crypto is trans is a place to hide. No, crypto is literally the greatest place to be found. Um and I think that's a big misunderstanding that is coming to light in 2026. play by the rules. Um, this is an alternative, you know, anti- athoritarian tech stack. Buy it and hold it if you're looking to make more dollars in crypto. Well, you know, you may be lucky enough to do that, but 99% of traders lose money. You hold this asset. This assets going up in value. Right now, there's a very small barrier between stable coin and use for goods and services through Visa partnerships, etc. But that will fall away. I expect in 6 months time you'll start to see native crypto being adopted by merchants across the world specifically in the western world. Actually in Abu Dhabi right now is probably the the strongest case for that which means you don't even have to go back to dollars. One Bitcoin is one Bitcoin. Um if you if you have a Bitcoin, you have a Bitcoin. Stop comparing it to dollars so much because remember the most volatile thing on earth right now is the value of the dollar. So anything priced in dollars that has volatility is probably dollar volatility. Okay, these are very little known facts that confuse people a lot. So we're looking for hygienic markets in crypto and people to slowly move away from coming into crypto to make more dollars. You need to accumulate crypto if you are a crypto believer. Anti-authoritarian tech stack, that's your goal. Go ahead. >> Yeah, good stuff. Um, XMR top three crypto by 2030. I don't think so. We've we've talked about privacy before as well. Um, privac privacy coins will never be able to take uh down or be able to attract institutional money, which I've always said from the very beginning. Uh, what is a good call option in Marvel? Won't answer that here. [laughter] Very tactical. Uh, is there's a question here. Is Saul anti-otheritarian? 100%. >> Okay. Who needs sniper suits? Uh >> any layer one is is absolutely anti- athoritarian. It cannot be seized. >> Any layer one token. A layer 2 token is not. Understand that. A layer 2 token can be seized instantly. It's centralized. >> Yeah, I saw a question up here regarding an monad crypto. Uh Monad basically the my models the tokconomics are horrible. Uh, it's very bad launch whale dumping. It's overhyped as an ETH killer. It's not an ETH killer. We already know what the ETH killer is. Any thoughts on Monad, Mando? It's just so like your name. It's unbelievable. [laughter] >> You are Mr. Monad. >> They probably approached me at some stage for for a marketing deal. No, I um I'm not really interested in Monad. Like it's it's maybe interesting tech, but there's not enough scale. It feels like we don't need more block space right now. Um we need users of that block space. I think Salana is an interesting play obviously. Um the privacy coins seem to be amongst the strongest like subnarrative still at the moment. Zcash went through a very strange week, right? Like um there was a fight with the core devs and they seem to have spun off a new company to help build out the the main wallet there. um the price action it kind of went lower and then Monero broke out of a multi-year trend uh slightly going higher although this Dubai thing is kind of interesting like uh interestingly M is based in Dubai so his his ability to shill uh Zcash I think is going to be pretty difficult now >> I know I was thinking about the same [laughter] thing myself >> I know he's having a hard day he's pulling out his last >> and and you know the chief mer officer like the chief marketing officer for Zcash over the last six months who was incessant and did did really well but it shows you the power of of one guy >> uh really to push it out there I thought it was fascinating very good observation um >> chain link thoughts on chain link you know after what happened on 1010 I think we all learned something about not only the importance of oracles but also the frailty of oracles um I always go back to utilities and utility tokens it's a service provider providers like people thought in the late '9s uh people could make a ton of money on DSL providers for highspeed internet they never made any money because it becomes utility that's the way I view these things like oracles um anybody want to take chain link CTO >> I mean chain link was one of the projects where I got interested in altcoins but that was uh when was it 2017 or 2018 something like that when I first heard about it Then it was revolutionary. Now, as you say, now it's a utility. It's one of many. I haven't actually looked at uh the link chart for at least this year. So, yeah, I don't really see how they need to come up with something new if they should make a massive move from here. I think you >> we'll take Yeah, we'll take all the questions. Thank you for that, CTO. >> I mean, chain link is not a blockchain. That's the biggest misnomer. Anybody on Tik Tok telling you chain link is a blockchain, you've been gaslit. Chain link is the decentralized oracle network. >> It's not a blockchain. So it'll never be a commodity. So the the risk under market structure laws, if you run an AI, will chain link be a utility token or a commodity under new market structure law. It'll tell it'll be utility token, which means it'll be under surveillance as a security. So that it'll go through security processes. Like I always said, chain link should probably just go public as a stock. Um same as Ripple. I'm not sure why they have a token. Um, also chain link is dependent on blockchain. So why invest in the thing dependent on the blockchain? Why not invest in the L1 of the blockchain? I I don't understand either. >> Yeah, goal. Pure goal there from Marty. Thank you for that. Um, and this is another spicy topic from spiraling. It seems like we're heading into World War II, though. Uh, not going to be good if we are not prepared. I I do expect a black swan this year. uh because we get one every year, probably in the first half of the year, maybe in the first quarter. But the world is smart enough to avoid World War II. But we do have that tinder box happening all over. We got the Middle East, we got Ukraine, Russia, we have China, Taiwan, now things happening in South America. It's just there's a lot of heat all over the place. But no, World War II is not something you need to be worried about. And the future of war is also very different. It'll be about taking down networks and using drones and you know the blocking signal that I think that the future of war is very different from what we probably know in the past. Anybody want to tackle this? Should we be concerned? Marty, >> I mean I don't want to take away from the air, but I think we've already been through World War II. I think it's been going on pretty much since 2008 in my opinion. I think it's a financial monetary war. It's a cultural war. I think we're seeing a hemispherical war. I think it's been going on already. We don't bomb countries anymore because we realized we've got to rebuild them. So why bomb them? Never bomb infrastructure. You're going to have to rebuild. Um I think it's never been more true with the with the internetbased societies. So I think World War II has been going on. It's a monetary sovereign reserve currency war in my opinion. It's a manufacturing war. All the things that have been going on I think are part of a war including co >> in my opinion. >> Go ahead. Yeah. No, good stuff. Uh, obviously memory is redot. Uh, drram prices through the roof. But I think if you're chasing that trade, uh, like Mandanda says, he likes to chase things and making new alltime highs. I think there is some fundamental changes happening between Nvidia and Samsung partnering up, which could impact Micron's dominance right now. But that's a a longer story out there. Um, >> we're in a very interesting situation on the charts. I don't know if you guys are watching, but we've we're now retesting those resistance lines at 92200, which is very anti the WO off. Woff says we should trade down now to the to 85. So, this is interesting. I call it break the white off. Can we break the wipe off? It's happening in real time. >> CTO, you're up. You want to zoom into like a fiveday time frame and see what we're looking at here? >> Yeah, the institutions want to to to dip us and it looks like we're fighting back. >> Yeah. >> Yeah. So what Martin showed um or talked about earlier is that if with if this is a V of distribution there should be one more >> uh down here. But [clears throat] I mean for me I will just play what happens. If this break on the upside great okay we have an upside rectangle breakout. If it breaks on the downside okay one more leg down. I don't need to predict it and I can't miss it. So I'm very relaxed here. I think a lot of people get very stressed. There's no need to be stressed. Bitcoin not going to go to $1 million with a trend down and without you know a number of very beautiful and clear breakouts along the the way and it doesn't matter that much. Okay, so I have this level here at 93,000 860. It doesn't really matter if it's there or Mando you talked about 100k it's up here if this is going to go to a million dollar guys. Okay, let's let's look where is a million dollars. Where is a million? [laughter] Million dollars is up here. And people are stressed like where should I be here? You can't even see it. You can't even see it on the on the screen here. Where is 91k? Where is 100K? You can't see it. It doesn't matter. It doesn't matter at all. So, >> does matter at all. uh try to not uh get to big draw downs and try to get in when it's going up. That's it. >> Exactly. >> I'm not stressed at all. >> And there's ton there's tons of exponential stuff. Uh the questions regarding Pith as well like chain link. Same thing. It's a utility. Um I you know, we'll see. But with that everybody, we've gone an hour. I want to thank everybody for this. There isn't a lot of news happening because there's not a lot of price action happening, but we try and set the stage. Uh, one final question for the whole gang here. Yes or no? New Bitcoin alltime high in 2026. Mando. >> Yeah, that's a yes. >> I'm going to go for I think it could be still. We need, in my opinion, to get out of this like rut, we need something to like almost break or like there need to be a shift in global markets at the moment. everything else going higher and Bitcoin going sideways. We need one of those to just chill out for a little bit or like people get worried about them and then we move back. >> I I love it what what CTO said. When the last optimist dies, that's when we go up. That was so good. CTO, new alltime high for Bitcoin this year. >> Yeah. Before I answer, I will just say that my guess is is not input to my own trading in any way or form, but if I would have to guess, yeah, I will guess yes. I'm an optimist. >> Yeah, Marty. Yes or no? >> Oh, absolutely. 100%. >> Yeah, I think so, too. We just need with the key ingredient, all we need is the ETF flows to come back, which will come back at the market structure. You look at all the big American banks that like the top eight banks own half of all banking assets and represent all the high net worth people. And Bank of America says 4% into Bitcoin. If just Bank of America did that, we go straight to a new alltime high, 130k overnight. That's the story everybody. Be patient. Markets are designed to take wealth from the impatient and give it to the patient. Be the patient. Probably said that really badly, but >> have a great week, my friends. Don't forget links below for these legends. >> Thank you for all the good info. Thank you. Good night, guys. >> Thank you, everyone. Enjoy the week. Bye."
    }
]