[
    {
        "video_id": "nU-154oTgwY",
        "title": "Palantir Slides Overnight as Fed Statement SHOCKS The Market!",
        "published_at": "2026-01-12T03:39:26Z",
        "sort_date": "2026-01-12",
        "url": "https://www.youtube.com/watch?v=nU-154oTgwY",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope everybody had some time to at least relax this weekend. However, we were just bombarded with a ton of different headlines and right now even a lot of political headlines being released and what this is causing is tensions to arise, uncertainty, dispute, and volatility to come. Uh what you see here in the overnight in the future session uh dropping down about half a percent. We're going to be talking about this especially with tensions between the administration and the Fed and the Fed even coming out with a response already tonight. Uh we're probably going to see volatility because that's going to continue with macroeconomic data. We do get a lot this week and we get um we get inflationary data this week. We also get big bank earnings. So that's going to give us some kind of key ideas on how the big banks are doing in this current economy. Now, we're going to be talking about Palanteer, some of the names on the watch list, uh kind of all in the mix of this volatility, and of course, crypto, which is actually getting a bid right now. Bitcoin all of a sudden is kind of increasing, but it always does Sunday night before it gets faded out. So, if you're a new or returning viewer, hit the like button, subscribe for daily videos. Let's pop it up in the channel here. Let's talk about Palanteer. Kind of what we've always started on this channel. Uh Palunteer is currently down about a whole percent in the overnight hours, and it's just no individual news or catalyst with Palanteer. uh earnings is going to be kind of coming up here I think in just a few short weeks. So we'll be talking about that as it gets closer. But nonetheless uh the price right here is at 175.86. This price in my opinion is just correlated to the volatility that we're seeing in the whole broader market right now. Kind of a lot of the stocks are following along with that. You also do have Palanteer here that is currently right now below its 50 and it's 200 uh you know within this whole consolidation kind of zone. U Palunteer if it does get some selling pressure could easily retest these 170s it has multiple times uh you know I would probably be utilizing that as a support level and if it fails that's where Palanteer can drop quite quickly uh for further breakdown but you know it does have a lot of resiliency between the 170 and the 183. So, if it hangs out in here, you know, I'm not making any big trades or anything like that with Palanteer specifically. It's just kind of hanging out here, uh, waiting for any kind of big catalyst or individual news to bring it up. So, uh, nonetheless, that's just kind of where it's at. We'll be keeping it, of course, on the radar. You see right here, the SPY is down about half a percent currently at 60 $690 right now with the general market that closed on Friday at 96966. Uh so at $6,9006 right here trying to get towards that 7,000. We're not going to get that at the market open probably. I'll tell you that as it's going to open around here more around 6,900. Uh but one nonetheless of course we had that you know Supreme Court tariff ruling and they decided hey uh we're not going to issue any opinion and uh that was just kind of annoying because everybody was expecting an opinion to be issued. But nonetheless this is kind of on the top of the radar that's on the back burner right now as we have future slide as Trump's Department of Justice actually opens criminal investigation into Fed Chair Powell. Now, what this is, this criminal investigation, uh, this is all from federal prosecutors that are looking into the renovations of the Federal Reserve's headquarters in Washington from when Powell wanted to renovate uh, the buildings, the historic buildings in the Federal Reserve and stuff like that, the Federal Reserve's headquarters. Uh, that's what this is all about. And Jerome Powell comes out here with a response. I encourage you guys to go look at the video. It's about 2 minutes long. And we don't have to watch it all right here. I encourage you to go watch it after this. The threat of criminal charges, he says here, is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public uh rather than following the preferences of the president. So he's basically saying that this is a politically type of investigation. Uh and I think I don't know, we'll see what happens here. Uh we don't really bring a lot of bias on the channel. You know, no political uh bipartisan here in the channel. uh just more kind of looking how is the market going to react to this. Right now it doesn't seem to be doing quite well. I don't think they like this kind of push uh what a lot of people are deeming it as political uh in terms of this whole investigation regarding the renovations on Powell. I don't think the market likes that uh because I think it brings uncertainty to the independence of the Fed which has always been really important. Uh so what you have here is Powell's statement. We'll kind of see how this investigation will play out. We'll probably get more details hopefully on it tomorrow. Uh but nonetheless, that's kind of how the market's taking it right now. Um good for Powell to stay strong though. Uh really really I would say uh showing bravery in terms of um showing the priority and how viable it is. It's important that the Fed remains independent. So that's what we're sitting at right now. We'll see what happens here. You also have here Trump coming out and saying that credit card companies will be in violation of the law if they charge over 10% interest rates after January 20th. That's only 9 days from now. It's going to be only 8 days in the matter of a few hours right here. So, you're seeing some overnight market reaction right here. Basically saying here he is saying that it abuses the public and that it will not allow it to continue. So, nonetheless, you're getting a lot of volatility here towards the downside. Personally, we don't have any huge changes within the economy. So, I think I'll be just looking at this at more dip opportunities in terms of a long-term perspective for my long-term portfolio. Uh, looking here at the SPY here and at the S&P 500 index. You know, if we lose that 6,900, we could be looking more of a possible retesting at that 6,800. There's a decent amount of support at that 6,800. So, any dips kind of below there, I'll be looking at and we'll see if we even if that breaks down to that level. Um, looking at some of the stocks that'll be keeping on my radar. Uh, in terms of the volatility from this whole credit card thing, 10% by January 20th. I don't know if they if they can make it that fast. We'll see what happens with that. That's where you're just kind of seeing uncertainty across the board. Stocks we talked about on the channel before like SoFi. Very interesting price action after this thing shot up to 29 and got shot right back to 26. Very interesting price action, I'll tell you that. Uh, but you can see down about 2% here in the overnight session. Um, you know, Hood right here is down about.3%. not facing as much of a uh kind of selling pressure as so far. But nonetheless, you know, stocks that I'm currently interesting interested in in terms of short-term kind of more swing trades. Uh I'm really liking the look of path right now. Uh personally, I like it around this area cuz it's kind of around the support area right here. It was kind of sold off uh from this last push up here to about this $18 resistance. We've seen path here in early December here that pushed up to 20. Um it kind of was involved a little bit with the swing trade right here. Sold out a little bit below that, you know, local high that we saw. But I like path right here in terms of the whole theme for Agentic AI in 2026. Um more of a long-term type of uh option play currently, but I do like where that sits. Also here with Zetta, kind of same thing. However, uh you know, Zetta is around these kind of big highs over the last week. We could possibly get a retesting down here into the 20s. You know, it's all possible. We'll see what happens, but it's holding strong in the overnight session here. Actually up about 31. So, I do like this play uh for Zeda right now. If Zetta is able to break above this 24, that's where you could see it possibly moves back up here into the 30 area depending on this breakout. Uh depending if it does get validated, depending if it does get hold, that's why it's kind of just more of a smaller risk type play, but that's where we're sitting with Zetta. Uh other names that I'm currently looking at, of course, we have ASST we've been talking about, which is at an interesting spot right now. Uh and BMR. BMR currently is up about 3% at $30.94 and you got asst uh strive right here right beneath the dollar. Uh and that is because right now cryptocurrency is actually experiencing a little bit of a bid. We see Bitcoin right here at 92,000 here. A little bit of buying pressure when it was basically sitting at around 90,000 all weekend has been able to hold that support level. Uh 90,000's been a decent floor for Bitcoin and likewise here for Ethereum. uh you know 3,3100 has been a pretty good floor for Ethereum. So uh we'll see what happens with these two cryptos. Uh maybe with some of the uncertainty here with the Fed and kind of between what's the pressure in the future going to look like from in terms of the administration and political pressure for the Fed. Uh you know that's where decentralization comes more into play um you know in terms of people that are really kind of anti- uh type of administration and like the whole decentralization aspect. That's where it possibly could be getting a little bit of a bid here for Bitcoin even though it is getting highly correlated to how the markets are trading. But we'll see what happens. That is kind of decoupling a little bit as we speak. Uh but we'll see if this gets a move. If this does get some move, you know, if this does get a move, you could see another push back here to the 94. I think once you get that push to the 94 and that's where you're going to see more of a um push possibly back to 100. But um we'll see what happens when you know with that in terms of Bitcoin. It's very unpredictable. It's kind of the wild wild west in its own nature. Uh but other than that, other stocks that I'm liking, of course, I cipher currently not in the names. We're seeing tons of swings here and volatility. I ran got a nice bid on Friday. What's happening with these stocks? They get these nice market open pushes and a lot of buying pressure and then they kind of get fade in midday and which isn't necessarily a bad thing. Uh in terms of swing traders are probably taking a lot of advantage of that. But you see I ran here that basically it's a little bit of resistance at the 50. Comes back here closes at 46. And right now in the overnight session is up about 48 bucks right now. Up about another $2. So we'll see what happens. Nonetheless, peace out. Take care. And I catch you guys later."
    }
]