[
    {
        "video_id": "oqcGTDkirUw",
        "title": "BREAKING: TRUMP TO CRIMINALLY CHARGE POWELL!!!! Gold, Silver ATH, Bitcoin Next?",
        "published_at": "2026-01-12T06:04:59Z",
        "sort_date": "2026-01-12",
        "url": "https://www.youtube.com/watch?v=oqcGTDkirUw",
        "transcript": "Jack, good morning, guys. And holy Jerome Powell, the chair of the Fed, is getting criminally persecuted for not lowering interest rates. Listen to this insanity that's going on right now. Good evening. On Friday, the Department of Justice served the Federal Reserve with grand jury subpoenas, threatening a criminal indictment related to my testimony before the Senate Banking Committee last June. That testimony concerned in part a multi-year project to renovate historic Federal Reserve office buildings. I have deep respect for the rule of law and for accountability in our democracy. No one, certainly not the chair of the Federal Reserve, is above the law, but this unprecedented action should be seen in the broader context of the administration's threats and ongoing pressure. This new threat is not about my testimony last June or about the renovation of the Federal Reserve buildings. It is not about Congress's oversight role. The Fed, through testimony and other public disclosures, made every effort to keep Congress informed about the renovation project. Those are pretexts. The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public rather than following the preferences of the president. This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions or whether instead monetary policy will be directed by political pressure or intimidation. I have served at the Federal Reserve under four administrations, Republicans and Democrats alike. In every case, I have carried out my duties without political fear or favor, focused solely on our mandate of price stability and maximum employment. Public service sometimes requires standing firm in the face of threats. I will continue to do the job the Senate confirmed me to do with integrity and a commitment to serving the American people. Wow. Wow. Basically, the Fed, Jerome Powell, they're saying that they are potentially criminally persecuted for what? For doing their job and because they're not listening to what Trump wants to do because politicians, as you know, they don't have direct control over the Fed. The whole idea is that if you are a politician, you shouldn't be able to hyperinflate the country just because you need to fund whatever project you want to do in order to get reelected. And so that's why the Fed and the government are separated. And Trump doesn't like that. [laughter] Of course, he doesn't like that. He wants the interest rate down. He wants the printer going as soon as possible. And Powell is in his way. And if if Powell caves here is really going to be a new paradigm. Even if he does not cave here, we still have a new paradigm because Powell is out in May. And then you have a Trump puppet in place and he's going to do exactly what Trump says. Number one, because he's selected by Trump, but number two also because if he doesn't, there's going to be all kinds all kinds of lawsuit, criminal lawsuit for uh renovation, for they're gonna dig up something. Okay? And so as you see this unfold, gold is skyrocketing to new levels because this is really at the core of what the dollar is. If the dollar is not the dollar anymore any anymore in the sense how it works, how it functions, how the how it gets printed, how the interests are set, maybe we need a bit of redefinition of what the dollar is and that's what gold is really sensing here. The same thing is with silver. You look at silver is pumping and pumping and pumping new highs. just created a new high and this is the power of following the trends because as you know commodities have been in a weekly bull trend for a long time especially the precious metals I mean here we're speaking about precious metals in particular where since 7 months ago silver is up 141% platinum 133% palazium 80% and gold 65% so you really have to be early in these trends and that's why if you have bulmania you have the money scanner you can see basically in real time when things are flipping bullish or bearish and so let's say that you missed the weekly flip you you miss the beginning of the bull trend on the weekly. Can you still make a lot of money? Absolutely. Because you have the daily flips. And here, for example, you see that on the daily, lithium, it flip bullish 3 weeks ago, only three weeks ago, and it's up 71%. And then ask yourself, how many altcoins have done anything like this in the last 3 weeks? Then silver up 66% since the bull flip two months ago. Orange juice [laughter] up 25% since a month ago. Uh copper uh 15% since a month ago. If you cannot get the weekly flip, maybe you didn't pay attention, maybe you were in other assets, it's okay. You can go on the daily flip, it's also okay. And daily flips, they happen more often, so you have more opportunity. If you want to join Bulmania and get access to all of these fantastic tools, I mean, really life-changing tools, then go to bulmania.com. Uh, and you can you can also find the link below and watch the free video. The first step is to watch the free video so you understand the mindset and the strategy behind how to use these tools. So if you just get the tools, it's not going to be the same as you as actually understanding how they work. So do it as soon as possible. Also, as you know, if you go and you click below on exchanges I use, you can sign up for Pionex for buy bit. The good thing is you can trade gold and silver on most of them. People ask me, Ian, where to buy gold, where to buy silver? Well, you can buy it on buy bit on Bit Unix on Pionex, but on Pionex right now in particular, uh there is a link with uh if you click this link with Pionex, you get a special a special bonus with Nvidia stock. So, as you know, Nvidia stock and trady stocks have been pumping a lot also. So, this is the current situation between January 9th and 31st. You can get this if you use the link below. And our boss have been doing pretty well, especially when it comes to silver. We opened up silver two days ago up a lot. Tesla up a lot. Uh ETH up a lot. So a lot of these bots as you know they trade volatility. So when there is a bit of volatility they trade. When there is no volatility they just buy buy low sell high and whatever volatility there is they will be utilizing it. So it doesn't have to be a lot of volatility just a little bit. And then of course with leverage it can be amplified. Now looking at the uh crypto bubbles you have Monero. Monero pumping 18%. Let's check Monero quickly because uh people have been loving Monero pump and Monero has been in a bull trend in a fantastic bull trend and it has been pumping to new alltime high also. It is in price price discovery now as well. Fantastic to see because privacy is a very very big narrative. It is basically a Zcash catchup trade. As long as it's bullish you can trade it. As long as it's bullish you can speculate on it going up. But guys, if Bitcoin does not continue up, if Bitcoin doesn't um pump at least towards the 50week moving average here, then a lot of these altcoins will struggle. So if you compare privacy coin to commodity, it may sound insane, but commodity is like both more pump and safer because it's not relying on Bitcoin. And Bitcoin now is in a bunch. So we're going to be of course keeping an eye on all of the all of the coins, but uh you just keep that in mind. Then you also have uh Canton up by 16%. Zcash itself is is up 9% although it's more in Bshan now. Uh looking at fear and greed currently we are in fear. And what is interesting is that uh if you look at where we're now we are in fear territory. Uh the last time we were here was at the bottom in um in May, April uh last year and uh the last time before that was here at the bottom in August in 2024. And so in terms of relief rally, this should be a very good point to have it. Now the problem with this red the fear zone is that um in a bare market it just keeps going lower anyway. So that's why you cannot really trade based on it. You cannot trade based on it. But you can still get an idea. It's a bit of context. It's just like we say here. Cool chart, right? But here's the truth. Charts tell you what happened, not what to do. Most traders lose not because they like data, but because they like mechanical rules. That's why you really should go to bulmmania.com. This uh link here goes to bullman.com because you need to learn the mechanical rules otherwise you know there are many charts but what do you make of them? How do you trade them? All about the mechanical rules. Now let's check performance year to date. Let's check the hovering years. Uh sorry not the hovering years the midterm years. We're now in the midterm year and [snorts] we're basically on track for now. We're basically on track. This is the green line. We're the green line. And if we do like this, you see that uh yeah, we're following both the white and the orange quite close. So in the coming weeks, we will see more exact what kind of correlation we have with the previous midterm years. For now, it is very very high correlation. Also uh we did launch the uh global liquidity uh global liquidity chart right here. This one is interesting because it shows you the balance sheets of the central banks and as you can see it has not really been going up ever since co the balance sheets of the central banks have not been going up and you can argue that this is a way stronger single signal than global M2 because as soon as this thing started to go up last time here in uh 2020 the reaction was basically instant for Bitcoin also. I mean it took a few months here as well but it was way better than for example the Fed. The Fed started to increase balance sheet here in 2019 here it took like a year more than a year before the big pump in Bitcoin. But when you look at all central banks global liquidity or not all but Fed ECB and BOJ that we track here they're the biggest and most important then uh the reaction was way way quicker. So keep an eye on that. Also let's check the hyperlquid P&L uh what kind of wallets are bullish? What kind of wallets are bearish? So what do we see? We see that the giga charts 1 million up are bearish. The big brains with 100k to 1 million in P&L. This is in P&L guys. This is P&L. This is not portfolio size. This [clears throat] is P&L. So they're also bearish. Uh then you have 100 10K to 100K. They are slightly bearish. And then all of the other smaller wallets and direct plebas are bullish. So interesting to keep an eye on. Uh and uh let's check the Oh yeah, ETF inflow. We don't have new data here. Uh let's check the dollar strength index. This one is going to be interesting to follow as as we have this Fed situation unfold because uh if this thing continues to go down then [clears throat] normally it is quite good for Bitcoin if this thing continues to go down. So if we see a bottom here like we had in 2021 that goes all the way to these levels then [clears throat] for Bitcoin is fantastic. I mean it would be fantastic. So let's see if it can do that. with the uncertainty with the Fed, how the Fed works, how the US really works. I mean, how is the dollar created, we're really redefining what uh it means to be the dollar. The dollar is not the same as it was yesterday with everything that's happening now. So, let's see how this will evolve in the coming days. I think this week is going to be insane, guys. I mean, this week is going to be crazy. We also have the market structure bill vote this week. Uh at least the one of the first votes. There's going to be a vote quite significant vote vote this week. Probably not the final vote. That's number one. Also this week guys, we have the tariffs. We have Supreme Court deciding if tariffs should be rolled back or not. So it's also this week. And now with the Jerome Powell persecution. So a lot of stuff going on. I have to go. I have to travel today. That's why we do a short one. Smash up the like, subscribe, check out booming.com for mechanical rules. And also check the exchanges I use for Pionex and other ones that that we have here. And remember that you can trade uh gold, silver, and stocks in most of them nowadays. In most of them, for sure on Pionex, for sure on Bybit, and I believe on on these other ones as well. So definitely click them in all of them. You have nice big signup bonus, nice rewards, and I'll be with you tomorrow. Smash up the like and goodbye guys. Goodbye. Goodbye. Bye."
    }
]