[
    {
        "video_id": "y6WjF4CQfQY",
        "title": "Bitcoin Gets REJECTED from Key Level (here&#39;s what it means)",
        "published_at": "2026-01-25T23:12:23Z",
        "sort_date": "2026-01-25",
        "url": "https://www.youtube.com/watch?v=y6WjF4CQfQY",
        "transcript": "Hey guys, Allesio. Hope you're well. So, in this video, we're going to take a look chart of Bitcoin and examine what this particular move, this drop on the price of Bitcoin could mean for the crypto. As you can see, our Bitcoin after it rallied to the 21 weekly moving average appears to be getting rejected or deflected from that moving average or that resistance. So, what could this potentially mean for the crypto? All right, guys, join me. Hey guys, welcome back. speaking to you today from Istanbul in Turkey. I flew over here just a few days ago and just walking about the town here in Istanbul. Amazing place, by the way, if you've never been. I've not been here since I was a small kid. All right, guys. Let's take a chart of Bitcoin. Some of you probably wondering, okay, this recent drop in the price of Bitcoin, what could it indicate? Now, if you watch my previous videos, you probably might already know what I'm going to say in this video and what I'm going to drive at and what the recent price movement on the chart of Bitcoin could mean uh for the crypto. So if you look at the price of Bitcoin recently, it managed to bounce back. As you can see, this recent rally to the 21 weekly moving average as an important resistance level. It almost reached it, but nevertheless, it managed to bounce back to just near 98K. It did not go above 100K, but as you can see here, that recent price drop on the price of Bitcoin seems to indicate that Bitcoin is now getting rejected from the 21 weekly moving average or just close that level. For one thing, Bitcoin has now dropped below some recent support levels. For example, it's dropped below 89K and it's also broken below 87K. So, by breaking these recent support levels, again, 89K and 87K, it is indicating or increasing the probability that Bitcoin is potentially getting rejected from resistance from near the 21weekly moving average, a very important level of resistance. So, guys, as it stands right now as I'm making this video, it's not good news for Bitcoin. I was hoping that Bitcoin would see some strength and move above the 21weekly moving average and above 100K, but unfortunately that did not happen. And this recent price drop and the break below support at near 89K and 87K, this is not a positive or good development for Bitcoin. Now, let me say that if Bitcoin also breaks below 84K or just near that level, that would significantly increase the probability that Bitcoin could drop to new lows. And at the moment, because of the way Bitcoin seems to be getting rejected from the 21 weekly and that level of resistance, at the moment the odds have increased towards the bearish side. In other words, as long as Bitcoin stays below the January highs and below the 21 weekly, for now sellers or bears have control. Put it this way, guys. If bulls wanted to prove that Bitcoin had bottomed, it should have ideally rallied above the 21weekly moving average and ideally above 100K. But that's not what happened. And unfortunately, Bitcoin is now seemingly getting rejected from that moving average, that weekly 21 moving average, and from resistance. So guys, as you can imagine, this is not the chart picture I wanted to see. Uh, personally, I wanted the bullish case to succeed, but that's not what really happened. So yeah, it is disappointing. Uh because at the moment given that red bar, given the recent price drop and given the fact that it's broken support at the moment the probabilities are increasing that Bitcoin could potentially now move to new lows and especially if Bitcoin now breaks below 84K that would increase the probability significantly for a move to new lows and potentially below the 80K level and to the 70s. Yeah, guys, this is not what I would have liked to have seen. It is rather disappointing. The chart picture on Bitcoin right now resembles what we saw in 2022 in that bare market when for example Bitcoin rallied as you can see here for the 21 weekly and then got rejected on that red bar and that increased the probability that Bitcoin could drop to new lows. The chart picture on Bitcoin as I'm making this video now that might change the next several weeks. We shall see. But at the moment, uh, given what we can see right now, which looks as though Bitcoin is getting deflected and it means that rally to the 21 weekly seems to have failed. It's failed to gain momentum. It's not looking good, guys. I'm sorry. Uh, so it appears at the moment that a repeat of 2022 and 2018. In other words, a potential bearish picture or bare market picture is at the moment gaining probability. Yeah, I'm sorry to say this, guys. Anyway guys, I'm going to cover Bitcoin, stock markets, and gold in more detail in a member video. Uh, make sure you check that out. You know, I wish I had some better news to share with you, but Bitcoin seems to have decided otherwise. Anyway guys, that's what we have here. Thanks very much indeed. If you got something out of this video, please give it a thumbs up and also please subscribe for future video updates and let me know your own thoughts in the comment section what you think. Thank you very much indeed guys. See you in the next video update. Bye for now."
    }
]