[
    {
        "video_id": "sUc6N0sWZNc",
        "title": "Trump Just KILLED Credit Cards!! Here&#39;s What Replaces Them...",
        "published_at": "2026-01-25T12:45:08Z",
        "sort_date": "2026-01-25",
        "url": "https://www.youtube.com/watch?v=sUc6N0sWZNc",
        "transcript": "Recently, US President Donald Trump promised to set an interest rate cap of 10% on credit cards. At the same time, US politicians quietly tabled a bill that would significantly lower credit card swipe fees. What does this have to do with crypto, I hear you ask? Well, 200 million Americans have an estimated 650 million credit cards due to the rewards these cards offer. rewards that are funded by interest and fees. So, what happens when the rewards on traditional credit cards decline and the rewards on crypto cards increase due to regulations? Well, millions of Americans will switch to using crypto cards. The result would be true crypto adoption on a massive scale and enormous rallies for the stocks and cryptos affiliated with these cards. So, if you want to be early to the next big thing, then watch this video until the end. First things first, though, you need to know that nothing in this video is financial or investment advice. It's educational content intended to inform you of what could, keyword, could happen in crypto if we see regulatory changes around credit card interest rates, swipe fees, and DeFi. If this is the kind of content you enjoy, then let us know by smashing that like button. and let's get stuck in. Let's begin by going back in time to 2020 when crypto cards first started gaining traction. Those of you who were around back then might recall that Crypto.com's Metal Crypto debit cards were a huge hit. And not just because people could earn money for referrals. The cash back paid in CRO tokens, though small in percentage terms, turned out to be massive due to the price increases for CRO at the time. To use an anecdote, one member of the Coin Bureau team was getting what amounted to 20 to 30% cash back on groceries for months thanks to the CRO token cash back and the rising value of the token. Obviously, these lucrative rewards depended on CRO's price, which crashed with the rest of the crypto market in 2022. This also upended all the other lucrative crypto card programs at the time. But despite the crash in crypto prices, the adoption of crypto cards continued growing exponentially. For context, there were only around 1 million crypto card holders in 2020. At the end of 2025, there were as many as 15 million. And it's estimated that by the end of 2026, there will be as many as 20 million crypto card holders. In other words, 15 to 20x growth in 5 to 6 years, which is truly exponential. To put things into perspective, there are around 30 billion credit cards and debit cards globally, which is mind-boggling. On the one hand, this means there's still a lot of room for crypto cards to grow. On the other hand, this assumes that crypto cards will continue growing at their current pace. Now, of course, the current growth trajectory ultimately depends on why more and more people are using cryptocards. The answer depends on where you're based. If you're based in a country with a weak currency and a broken banking sector, crypto cards can act as de facto shadow banks, allowing you to transact in stable coins. So, it should come as no surprise then that 60 to 80% of crypto cards have been issued to people in these kinds of countries with the remainder issued in countries like the US and the UK. For crypto card holders in countries like the US and UK, the reason why they use crypto cards is because of the rewards which are still lucrative despite the draw down in the crypto market in recent months. For example, you can earn up to 4% cash back paid in BTC with the Coinbase 1 card, which isn't far off from the 5% cash back offered by traditional credit and debit cards. Very useful if you want to stack SATs. And the more you spend, the more rewards you get. When you combine this with the fact that people in developed countries tend to be wealthier, it should come as no surprise that up to 80% of all crypto card volume comes from crypto card holders in regions like North America and Europe. So, when it comes to the effects cryptocard adoption could have on actual crypto prices, these are the jurisdictions to watch. And as I mentioned in the introduction, upcoming changes to US regulations around credit cards could limit rewards on traditional cards, whereas upcoming changes to US regulations around crypto could increase rewards on crypto cards. This would result in the mass adoption of crypto in the highest value jurisdiction, which could be rocket fuel for the tokens affiliated with the most popular crypto cards. But before we get into that, you need to know about the new and improved Coinbureau Telegram channel. We recently plugged it in to some of the best APIs to give you important crypto updates in real time, allowing you to stay on top of the market without having to doom scroll on X. So, if that sounds useful, then join the Coinbureau Telegram channel using the link below or the QR code on the screen. Now, if you were paying attention in the introduction, you'll recall that it's estimated that around 200 million Americans have 650 million credit cards, which means that the average American has three to four cards on average. You'll also recall that the main reason why Americans have so many credit cards is because of the lucrative rewards these cards offer. Not just cash back, but perks like free subscriptions and flights. Surveys of American credit card holders confirm that 70 to 80% of them pick cards based on the rewards they offer. The result is that over 90% of money spent using credit cards comes from cards that offer high rewards. In case you're wondering, more than a third of every dollar spent in the US comes from a credit card, which makes credit cards the most popular means of payment there. And as another fun fact, the reason why credit card rewards have become so popular is because of the 2008 financial crisis. After the housing bubble popped and bank lending was restricted by regulations, they needed to find new revenue streams and one of them was credit cards. Naturally, banks needed some way of incentivizing consumers to sign up for these cards, especially given the global recession at the time. And this is where things get interesting. Banks realized that they could offer high rewards on credit cards using interchange transaction fees. Now, for those unfamiliar, when you buy something at a store using a card, be it a debit card or a credit card, the store owner gets charged a percentage of the sale. So, for instance, if you buy something for $100 and the interchange fee is 1%, the store owner pays $1 to the bank. Now, logically, interchange transaction fees are higher for credit cards with higher rewards, which is why credit cards issued by companies like American Express aren't as widely supported as Visa and Mastercard. Whereas Visa and Mastercard have interchange fees that top out at 3.15% plus a max 10cent fee, American Express has interchange fees that top out at 3.25% with a minimum 10-cent fee. Now, what makes this so interesting is that interchange fees have incentivized merchants like store owners to increase their prices to offset some or most of these card interchange fees. So, something that would normally cost $100 costs $14 to offset the 3.25% fee plus additional fees. So, the result is that people who pay with cash or cards with lower interchange fees are the ones footing the bill. Just think about it. If you have a credit card that offers 4% cash back and you buy something for $14 that would normally cost $100, you pay an extra $4, but you get it back as rewards. If you have cash or a debit card that doesn't offer any rewards and you buy something for $14 that would normally cost $100, you actually pay an extra $4 and don't get that money back. The craziest part is that it's not just interchange fees that pay for card rewards. It's also the interest payment on credit card debt from less creditw worthy borrowers. Now, these less creditworthy borrowers are referred to as revolvers, and they're the ones who pay over 20% on their credit card debts on average. Worryingly, the average credit card interest rate in the US is over 20% according to the Fed. This means that the average credit card holder is a so-called revolver, consistent with the estimate that 50% of credit card holders are revolvers. Again, a portion of the interest payments these credit card holders pay helps fund the rewards of the top tier credit card holders. And for those who don't know, only around 15% of credit card holders qualify for the top rewards. So, it's literally the bottom 50% subsidizing the top 15%. Now, if you can feel populism pumping through your veins at this point, you're not alone. These credit card dynamics have been the subject of scrutiny for years with dozens of US politicians trying and failing to pass bills to limit interchange fees or the amount of interest that can be charged on credit card debt. The EU actually succeeded in limiting interchange fees back in 2014 and the result was predictable. Credit card rewards collapsed. Reduced card rewards not only resulted in less credit card adoption, but less credit card usage and less spending. Now, this is a problem when you're dealing with an economy that's driven mostly by consumption, which is the case in both the EU and the US. Proponents of the current credit card setup in the US argued that reducing fees or limiting interest would result in less of the spending, which keeps the US economy going. This begs the question of whether Trump's recent policy to cap credit card interest rates at 10% or the recent bipartisan bill to lower interchange fees will succeed. The answer is complicated. In theory, Congress could easily pass these laws simply because they would be incredibly popular with the average American. In practice, many US politicians are lobbied by banks, which makes passing such laws harder. As you might have guessed, 60 to 70% of bank revenue from credit cards comes from the high interest rates that credit card borrowers pay with most of the remaining 30 to 40% coming from interchange fees. So capping interest rates would limit bank profitability, whereas reducing interchange fees would cause credit card rewards to fall, resulting in less credit card adoption, less usage, and less spending. As previously noted, however, this assumes that 100% of interchange fees go towards rewards, which actually isn't the case. A portion of interchange fees go to the bank as profit. Lowering these profits could theoretically result in higher rewards and more credit card adoption. Similarly, capping interest rates would theoretically result in more borrowing overall or at least in less money being spent into the real economy instead of debt. There are many theoretical scenarios we can give here, but the fact of the matter is that banks aren't going to comply with limiting interest rates unless they're compelled to by law and will also be against lowering interchange fees since they would disrupt the credit card adoption flywheel. If push came to shove, however, interchange fees would be the first on the chopping block with interest rates not far behind. With rising populism on both the left and the right and consensus among all populists that credit card interest rates and fees are excessive, it's likely that we will see restrictions on both at some point. If it doesn't happen under Trump, it will happen under the next president. and the chances of it happening will only go higher as credit card debts and interest rates continue climbing as they have in recent years. So, this finally brings us to the crypto side of the equation. As we've learned, most card rewards are paid for using interchange fees, and this applies to crypto cards as well, even though most of them are debit cards. The difference is that crypto cards can offer additional rewards that regular cards can't, such as token rewards that are small in percentage terms but large in real terms when crypto prices are rising. This ability for additional rewards is an inherent advantage that crypto cards have, and it's one that's likely to result in additional adoption regardless of what happens with traditional card rewards. As we've also learned though, most of these additional rewards offered by cryptocards are dependent on crypto market conditions, particularly in the altcoin market since altcoin tokens are typically used as rewards. As we've seen in this cycle, altcoins have underperformed and they're likely to continue underperforming as investing in crypto indices becomes common and more and more of the new flows go into the largest cryptos by market cap. as a result. Thankfully though, there are other ways that crypto cards can offer lucrative rewards without altcoin pumps. And the two biggest ones are stable coins and DeFi. Now, as most of you will know, stable coins are backed mostly by US government bonds. These bonds pay a yield, currently around 4%, which isn't a lot if you have a few hundred, but is a lot when you have hundreds of billions of dollars. as some stable coin issuers do. News flash, but a portion of these US bond yields could be used to offer higher rewards on crypto cards that leverage stable coins. The only reason why this hasn't happened yet is because of regulations. As some of you might have heard, one of the reasons why politicians have been struggling to pass the Clarity Act is because of disagreements over whether to allow stable coin yields to be passed on to stable coin holders. Right now, all the yield goes to stable coin issuers, which is good news at first glance because it means more profits. Upon closer inspection, however, you realize that if stable coin issuers were able to pass on a portion of the yield on stable coin reserves to stable coin holders, they would be able to do things like, well, offer crypto cards that have much higher rewards due to this extra yield. This would result in more adoption of these crypto cards, more adoption of the stable coins they support, and thus bigger profits for the issuers. And can you guess who's been pushing back against allowing yield on stable coins? That's right, the big banks. Officially, it's because it could destabilize the financial system since most people would opt to say use a crypto card instead of a card issued by, say, JP Morgan, draining bank reserves and increasing financial instability. Unofficially though, it's because they don't want competition, which would naturally lower their profits. Thankfully though, there are other ways that stable coins can earn yield. And one of these is DeFi lending. Believe it or not, but you can currently earn around 3.5% lending USDC on Coinbase, which is presumably the maximum you could earn if stable coin issuers were allowed to pass on reserve yields to holders. The difference with DeFi lending, though, is that the yield is much more variable and depends on market conditions. When demand for borrowing in DeFi is high, yield for lending USDC can be as high as 10% or more. The fact that yields for lending USDC are still hovering around 3.5% despite the suboptimal crypto market conditions suggests that this yield is close to the floor, near the lowest level it will likely go. Now, this is fascinating because it suggests that there's persistent demand for borrowing USDC coming from somewhere. As far as we can tell, the answer here is Bitcoin holders. The more that people hodddle BTC, the more they want to borrow against it instead of selling it. Evidence for this can be seen in the fact that the total value locked on DeFi protocols like Morpho has continued rising even while crypto prices have continued falling. Borrowing against BTC seems to be a new trend and one that continues regardless of crypto prices. And so long as this trend continues, DeFi yields on USDC will continue to hover somewhere around the 3.5% level, making it possible to integrate this additional yield into crypto cards. Given that interchange fees are also in the 3% range, this means that crypto cards offering rewards derived from DeFi yields could theoretically offer double the rewards that traditional cards do, leading to lots of adoption. There's just one small problem, though, and that's something I noted a few moments ago. Most crypto cards are debit cards. To refresh your memory, most of the wild rewards and excessive spending is happening via credit cards. And this is where things get truly fascinating because crypto doesn't just make it possible to issue additional rewards on cards and such. It also makes it possible to access additional forms of credit. As we've just learned, DeFi allows anyone to lend and borrow crypto. Currently, almost all the borrowing in DeFi is collateralized, meaning that you need to deposit a dollar amount of crypto that's greater than the dollar amount of USDC that you're looking to borrow. If the value of your crypto collateral falls, or if the value of the debt you took rises too much, the crypto you used as collateral is automatically sold. Now, this is a brilliant mechanism, but it's not very scalable, and it's also not something that most people are used to. That's exactly why many DeFi protocols are moving towards undercolateralized lending, meaning you don't have to put much collateral down in order to borrow, if any. In practical terms, this means we could eventually see crypto credit cards where the credit comes from DeFi lenders rather than banks. And because interest rates in DeFi depend on supply and demand, higher interest rates like the 20% we see on Tradfi credit cards now would likely attract lots of lenders, which would naturally push crypto credit card interest rates down. Put differently, it will become possible for the free market to put a cap on DeFi enabled credit cards, allowing them to offer higher rewards as well as lower interest rates. And this brings me to the big question, and that's which cryptos will benefit the most as crypto card adoption continues. Well, if you've been paying attention, you'll already know the answer. Cryptos related to stable coins and cryptos related to DeFi. Now, exactly which cryptos these will be really depends on what happens with crypto regulations in the US, but we can confidently make a few assumptions. The first is that stable coin enabled crypto cards will leverage a blockchain of some kind because well all stable coins run on blockchains. These blockchains will need to be cheap and fast which means that slower chains like Ethereum aren't at the top of the list. So for the time being the likes of Salana and Bass seem to be at the top of the list. Granted that Bass doesn't have a token but a token is reportedly being explored. As time goes on, however, we're likely to see new blockchains emerge that are focused on stable coin payments. And there are two that come to mind already. The first is ARK, a blockchain launched by Circle that's currently in testnet and is also reportedly planning a token. Now, it stands to reason that ARK's purpose will be to support USDC payments, which means that ARC will play a role in supporting crypto cards with USDC. The second stable coin blockchain that comes to mind is Plasma, a layer 1 that launched late last year and has close ties to USDT issuer Tether. Plasma is currently working on an all-in-one banking app called Plasma 1, which features a crypto card and promises to offer a yield of over 10% on USDT. Again, this yield will likely come from lending USDT in DeFi, likely to Bitcoin Wales using BTC as collateral to borrow USDT. When it comes to DeFi, the winners there should be fairly evident as well. The tokens belonging to the DeFi protocols powering the yield on crypto cards will be the ones that benefit the most. The list here is pretty short and probably isn't going to change all that much. Ave, Morpho, Make a Dow aka Sky, and probably other supportive protocols like Pendle. Now, make no mistake, these will not go parabolic tomorrow. Rather, these are coins and tokens to keep an eye on in the coming years as crypto card adoption continues. In the short term, these cryptos could all crash further if we enter a bare market. In the medium to long term, however, adoption of crypto cards means that all these projects could well experience genuine adoption of their own, which would generate fees that will presumably be used to drive value to their respective cryptocurrencies. And if you want to know which crypto projects are generating the biggest fees right now, then you can check out our video about that using the link above. As always, thank you for watching and I'll see you in the next one. This is guy. Over and out."
    }
]