[
    {
        "video_id": "fUUsfBwDghE",
        "title": "Trump and Belarus? A New Alliance Emerges #shorts",
        "published_at": "2026-01-25T16:01:02Z",
        "sort_date": "2026-01-25",
        "url": "https://www.youtube.com/watch?v=fUUsfBwDghE",
        "transcript": "Bellarussian dictator Lucas Shenko has now signed the document on Bellarus assession to Trump's board of peace. [laughter] Guys, listen. This would not be in my bingo card for 2026 that you have alliance between the US and Barus. We're best friends. [laughter] We're now the best friends. Best friends. Denmark is is telling him, \"F you.\" Norway. Norway did not give the Nobel Prize. Freaking Norway. Where is it? Where is it? He did not get the Nobel Prize from Norway, which controls who control the Nobel Prize. Listen to this. >> Norway's prime minister that you not winning the Nobel Peace Prize made you feel less obligated to think purely of peace. >> Well, I lost a lot of respect for Norway and I believe and I believe very strongly that Norway controls the Nobel Prize. But you have to understand I settled eight wars. I've had uh every one of those wars, every participant wrote. I didn't ask them to do it. They sent in strong recommend. You know, they make recommendations for that. But I settled eight wars. No president's probably ever settled one war. I don't know. Think of it. I did eight. The reason I do it is because it's easy for me to do. And I didn't do it for a Nobel Prize. I did it because I'm saving a lot of lives. I'm trying to settle the final one. I'm trying to do Russia Ukraine. >> Hey guys, it's crazy. So, let's see how that partnership goes. But so, the conclusion out of all of this is that markets of course don't like uncertainty. It."
    },
    {
        "video_id": "u-CTn9Ik0cw",
        "title": "Precious Metals Keep Pumping: Gold, Silver, Platinum #shorts",
        "published_at": "2026-01-25T12:01:39Z",
        "sort_date": "2026-01-25",
        "url": "https://www.youtube.com/watch?v=u-CTn9Ik0cw",
        "transcript": "And also what's happening now is a continued pump in the precious metals. We've been speaking about precious metals for quite some time and we also I mean I also told you last week the fact that precious metals are pumping a lot doesn't mean that it's time to sell. Absolutely not. Something that pumps in a parabola can still keep pumping. And you see gold is 76% since weekly flip one year ago. Silver is 175% gain since the weekly flip 7 months ago on the money line. Then you have platinum 143% since eight months ago when it flipped."
    }
]