[
    {
        "video_id": "23svDDci3vA",
        "title": "My Crypto Loss: High 7 Figures Since 2013 #shorts",
        "published_at": "2026-02-08T19:27:25Z",
        "sort_date": "2026-02-08",
        "url": "https://www.youtube.com/watch?v=23svDDci3vA",
        "transcript": "You know, my biggest loss in in crypto since 2013 was in high seven figures. Like it's below 10 million, but very very close to that. So, you know, did I lose years getting back? I didn't lose years. It was just, you know, part of the journey. Hopefully, you get to a higher low in your net worth. But even if you get to a lower lower low, which some people do, it's just a journey, man. You get it back, you're going to see something else that that you want to strive for. Money is obviously super important. I'm not saying it's not important but uh there are also many issues it doesn't solve.",
        "summary_hu": "A videóban a szerző a 2013 óta elért legnagyobb kriptovaluta veszteségét osztja meg, amely magas hétjegyű összeg, de 10 millió alatt van. Azt állítja, hogy a veszteség része az útnak, és hogy a pénz ugyan fontos, de nem old meg minden problémát. Azt is megemlíti, hogy hiába tapasztaltak egyesek alacsonyabb nettó értéket, ez nem akadály a fejlődésben, és új célok után lehet nézni. A története azt üzeni, hogy a valamennyi veszteség tanulság, és folyamatosan új lehetőségek után kutatunk.",
        "summary_en": "The speaker shares their largest cryptocurrency loss since 2013, which is in the high seven figures but under 10 million. They emphasize that this loss is part of the journey and assert that while money is significant, it doesn't solve all problems. The narrative suggests that despite some experiencing lower net worth, this should not deter one's pursuit of new goals. The takeaway highlights that every loss carries a lesson and offers an opportunity to seek new possibilities.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 50,
        "key_points_hu": [
            "A legnagyobb veszteség magas hétjegyű összeg volt.",
            "A pénz fontos, de nem minden problémát old meg.",
            "A veszteség része az út, és új célok keresése folytatódik."
        ],
        "key_points_en": [
            "The largest loss was in the high seven figures.",
            "Money is important but doesn't solve every problem.",
            "Losses are part of the journey, and the pursuit of new goals continues."
        ],
        "main_topics": [
            "Cryptocurrency Loss",
            "Investment Emotions"
        ]
    },
    {
        "video_id": "qwp5-h_3uos",
        "title": "Solana&#39;s TOP Use Cases: Payments, Trading, Memes &amp; More #shorts",
        "published_at": "2026-02-08T16:31:32Z",
        "sort_date": "2026-02-08",
        "url": "https://www.youtube.com/watch?v=qwp5-h_3uos",
        "transcript": "Where do you use Solana for I mean everything from uh stable coins from payments uh receiving stable sending st trading uh any shitcoin best trade experience on Salana no bridging no nothing onboarding I just see you know people enter into crypto if I'm to onboard someone into crypto what do I tell them I tell them to get phantom wallet so they can trade the most things and it's going to be the greatest and you have to bridge and I have to like figure stuff out and obviously me some of the biggest uh volume creators so it really shows that the blockchain works the only thing that's missing is the perex although you And uh already now in um in Phantom wallet they do have that you can go long and short but it's not as big as hyperlid.",
        "summary_hu": "A Solana felhasználási lehetőségei között kiemelkednek a stabilcoin tranzakciók, a kereskedés és az új felhasználók gyors onboardolása. A Phantom wallet használata megkönnyíti a kereskedést, mivel sokféle eszközt elérhetünk anélkül, hogy bonyolult híddal kellene foglalkoznunk. Az elemzés szerint a blokklánc teljesítménye megbízható, azonban a perifériás eszközök, például a hitelezés, még fejlődésre szorulnak. A jelenlegi kereskedési tapasztalatok alapján a Solana a legjobb opció számottevő volumenű kereskedők számára, ami nagyobb használati arányra utalhat a jövőben.",
        "summary_en": "Key use cases for Solana include stablecoin transactions, trading, and the onboarding of new users into the cryptocurrency space. Utilizing the Phantom wallet simplifies trading, providing access to a wide range of assets without the complexities of bridging options. The analysis suggests that the blockchain operates effectively; however, peripheral offerings like lending need further development. Current trading experiences highlight Solana as the top choice for significant volume traders, which may indicate increased adoption in the future.",
        "crypto_sentiment": "Bullish",
        "sentiment_score": 75,
        "key_points_hu": [
            "Stabilcoin tranzakciók könnyítése",
            "Phantom wallet használata a kereskedéshez",
            "A blokklánc teljesítménye megbízható"
        ],
        "key_points_en": [
            "Facilitation of stablecoin transactions",
            "Use of Phantom wallet for trading",
            "Reliable performance of the blockchain"
        ],
        "main_topics": [
            "Solana Use Cases",
            "Cryptocurrency Trading"
        ]
    },
    {
        "video_id": "069pulu7knY",
        "title": "Bitcoin Bounce: Euphoria vs. Reality - Will it Crash Again? #shorts",
        "published_at": "2026-02-08T12:58:23Z",
        "sort_date": "2026-02-08",
        "url": "https://www.youtube.com/watch?v=069pulu7knY",
        "transcript": "Bitcoin is having quite a bounce. If you look at altcoins, you look at XRP, you look at ETH, you look at Solana, all of the different cryptocurrencies have a nice bounce. Basically, Bitcoin bottomed out here a few days ago at 60. Now, it's back to 69. And of course, this brings a bit of positivity, a bit of euphoria to the crypto space. However, I have to warn you guys that many people are going to get so wrecked because of this bounce. You see, when you have a big crash, it's very normal to have a big bounce. However, if you look at the candle, it's still freaking red. I mean, the week started at 76 and went all the way to 60. Yes, now we're at 69, but you have to be still super conservative here. Next week is going to be quite critical because if we see next week a big green candle, let's say we see next week a green candle that erases all of the losses from this week, then we can speak about some kind of V-shaped recovery.",
        "summary_hu": "A Bitcoin árfolyama újra emelkedésnek indult, jelenleg 69 dollár körül mozog, az előző mélypont 60 dollár volt. Ezen kívül más altcoinok, mint az XRP, ETH és Solana is hasonló tendencia mutatkozik. Bár az emelkedés eufóriát keltett a kripto világában, figyelmeztetni kell arra, hogy sok befektető súlyosan veszteségeket szenvedhet el. A piaci gyengeség jelei, mint a vörös gyertya, amely a múlt héten látható volt, arra utalnak, hogy a helyzet továbbra is bizonytalan. A következő hét kulcsfontosságú lesz, és ha láthatunk egy jelentős zöld gyertyát, amely eltünteti a héten bekövetkezett veszteségeket, akkor beszélhetünk egy esetleges V-alakú helyreállásról.",
        "summary_en": "Bitcoin's price has bounced back to around $69 after bottoming at $60 recently. Other altcoins like XRP, ETH, and Solana are also showing similar upticks. While this bounce has sparked some euphoria in the crypto space, caution is advised as many investors may get seriously wrecked. The signs of market weakness, illustrated by the red candle from last week, suggest that the situation remains uncertain. The next week will be critical; if we see a significant green candle that erases this week's losses, we could discuss a potential V-shaped recovery.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 40,
        "key_points_hu": [
            "Bitcoin árfolyama 60 dollárról 69 dollárra emelkedett.",
            "Más altcoinok is hasonló emelkedést mutatnak.",
            "A piaci helyzet továbbra is bizonytalan, érdemes óvatosnak lenni."
        ],
        "key_points_en": [
            "Bitcoin's price has risen from $60 to $69.",
            "Other altcoins are showing similar increases.",
            "The market situation remains uncertain; caution is recommended."
        ],
        "main_topics": [
            "Bitcoin Price Movement",
            "Market Sentiment and Recovery Signals"
        ]
    }
]