[
    {
        "video_id": "23svDDci3vA",
        "title": "My Crypto Loss: High 7 Figures Since 2013 #shorts",
        "published_at": "2026-02-08T19:27:25Z",
        "sort_date": "2026-02-08",
        "url": "https://www.youtube.com/watch?v=23svDDci3vA",
        "transcript": "You know, my biggest loss in in crypto since 2013 was in high seven figures. Like it's below 10 million, but very very close to that. So, you know, did I lose years getting back? I didn't lose years. It was just, you know, part of the journey. Hopefully, you get to a higher low in your net worth. But even if you get to a lower lower low, which some people do, it's just a journey, man. You get it back, you're going to see something else that that you want to strive for. Money is obviously super important. I'm not saying it's not important but uh there are also many issues it doesn't solve."
    },
    {
        "video_id": "qwp5-h_3uos",
        "title": "Solana&#39;s TOP Use Cases: Payments, Trading, Memes &amp; More #shorts",
        "published_at": "2026-02-08T16:31:32Z",
        "sort_date": "2026-02-08",
        "url": "https://www.youtube.com/watch?v=qwp5-h_3uos",
        "transcript": "Where do you use Solana for I mean everything from uh stable coins from payments uh receiving stable sending st trading uh any shitcoin best trade experience on Salana no bridging no nothing onboarding I just see you know people enter into crypto if I'm to onboard someone into crypto what do I tell them I tell them to get phantom wallet so they can trade the most things and it's going to be the greatest and you have to bridge and I have to like figure stuff out and obviously me some of the biggest uh volume creators so it really shows that the blockchain works the only thing that's missing is the perex although you And uh already now in um in Phantom wallet they do have that you can go long and short but it's not as big as hyperlid."
    },
    {
        "video_id": "069pulu7knY",
        "title": "Bitcoin Bounce: Euphoria vs. Reality - Will it Crash Again? #shorts",
        "published_at": "2026-02-08T12:58:23Z",
        "sort_date": "2026-02-08",
        "url": "https://www.youtube.com/watch?v=069pulu7knY",
        "transcript": "Bitcoin is having quite a bounce. If you look at altcoins, you look at XRP, you look at ETH, you look at Solana, all of the different cryptocurrencies have a nice bounce. Basically, Bitcoin bottomed out here a few days ago at 60. Now, it's back to 69. And of course, this brings a bit of positivity, a bit of euphoria to the crypto space. However, I have to warn you guys that many people are going to get so wrecked because of this bounce. You see, when you have a big crash, it's very normal to have a big bounce. However, if you look at the candle, it's still freaking red. I mean, the week started at 76 and went all the way to 60. Yes, now we're at 69, but you have to be still super conservative here. Next week is going to be quite critical because if we see next week a big green candle, let's say we see next week a green candle that erases all of the losses from this week, then we can speak about some kind of V-shaped recovery."
    }
]