[
    {
        "video_id": "_qVWp3C0D2g",
        "title": "The ULTIMATE 2026 Crypto Portfolio STRATEGY!!",
        "published_at": "2026-01-11T12:45:06Z",
        "sort_date": "2026-01-11",
        "url": "https://www.youtube.com/watch?v=_qVWp3C0D2g",
        "transcript": "In 2025, US stocks rallied by over 16%. International stocks rallied by almost 30%, gold rallied by around 70% and silver rallied by a whopping 150%. Meanwhile, the crypto market fell by 10%. This therefore has everyone wondering, is there any point to holding crypto in 2026, or is it better to stick to last year's winning assets? And if there is a point to holding crypto, which ones make the most sense to hold? That's why today we're going to figure out what an optimized crypto portfolio for 2026 looks like. Allin, all out, or somewhere in between. My name is Guy, and if you hold crypto, this is a video you can't afford to miss. Before we begin though, you need to know that I am not a financial adviser, and nothing in this video is financial advice. It's educational content intended to inform you about the factors driving the markets and which cryptos, if any, could perform well in 2026 given these factors. If that sounds good, smash that like button and let's get into it. Now, I want to start off with something you may have noticed in the intro, and that's the fact that international stocks rallied twice as much as US stocks last year, and precious metals rallied twice as much as international stocks. Yes, some US stocks rallied more than international stocks and even gold, but the trend is clear. Global capital is rotating out of the US and into other countries and commodities. This is due to a combination of factors, including the US dollar, which fell by almost 10% in 2025, and concerns around things like Trump's tariffs and America's reliability as an ally. Whereas a falling US dollar provides a boost to international economies, concerns around the US's political and geopolitical stances have caused capital to flow elsewhere, boosted by the narrative of booming emerging market economies. As you can see, the outperformance of US stocks versus international stocks follows a cycle just like everything else in the markets. This image is from early 2025, but we can draw in what happened. International stocks outperformed US stocks at a level not seen since the early 2000s. Now, believe it or not, but this could be why crypto and US small cap stocks struggled in 2025. You see, all the world's assets exist on a risk spectrum. At one end of the spectrum, you have safe assets like government bonds, and at the other end of the spectrum, you have riskier assets like penny stocks. As investors feel more confident about the future of the economy and the markets, the more they start allocating further down the risk spectrum. The catch though is that not all assets across the spectrum are equal. For example, since the reserves of Russia's central bank were frozen following Russia's invasion of Ukraine in 2022, many countries decided to accumulate gold in lie of Western government bonds as reserves. In other words, more of the capital being allocated into the low-risk part of the market started finding its way into gold. It's possible that something similar happened on the opposite end of the risk spectrum. As more capital started going into the high-risk part of the market, it was allocated to international stocks and commodities instead of crypto and US small cap stocks. Some would argue that this capital went into AI stocks and there's certainly some truth to that when it comes to retail investors, but most of the money is with the institutions and it looks like they went into foreign stocks and metals in 2025. If this is indeed the case, then it begs the question of whether any of this risk on capital will find its way into crypto in 2026. Before I give you the answer though, I need to tell you about the Coinb Club. That's where we do weekly deep dives into promising crypto assets of all kinds, provide daily updates about what's going on in the markets, and reveal how we are personally positioned. So, if you want to know which cryptos we're holding in 2026 and which ones we're considering buying, then become a member of the Coin Bureau Club using the link down in the description. Now, let's go back to that chart showing the historical outperformance of US stocks versus international stocks. As you may have noticed, there's never been a period in crypto's history where international stocks significantly outperformed US stocks, at least not until 2025. Besides the fact that this supports the idea that international stocks drained liquidity from crypto, it could be the start of a bigger trend. As you can see, every decade has had its own investment theme. In the 1950s, it was European stocks. In the 1960s, it was US stocks. In the 1970s, it was emerging markets and commodities. In the 1980s, it was Japanese stocks, i.e. international stocks. In the 1990s, it was US stocks. In the 2000s, it was emerging markets and commodities again. And in the 2010s, it was US stocks again. Again, there seems to be a cycle. And this cycle suggests that the 2020s will likely be dominated by international stocks and commodities. At first glance, you might think that this means the crypto market is going to struggle. After all, these international stocks and commodities appear to be competing for the same risk capital as crypto. The caveat, though, is that these flows into international stocks and commodities could kickstart a new riskon wave. You see, international stocks and commodities are seen as risk assets by investors in developed countries, namely the US. However, this isn't the case in many other countries, especially emerging markets. This makes sense when you consider that for most investors, the safest assets are those found in their own countries. And in many countries, lots of these assets are tied up in commodities. Take the Canadian stock market for instance. Resource and commodity companies make up more than a third of the TSX. That's Canada's version of the S&P 500. To put things into perspective, resource and commodity companies make up less than 5% of the S&P 500. By this point, you're probably wondering how any of this is related to crypto. Well, it becomes clear when you look closely at the capital flows at play. Some US investors looking to allocate further out along the risk spectrum will invest in the Canadian stock market. This will cause the Canadian stock market to rise, and the TSX went up by 30% in 2025, by the way. Whereas Canadian stocks are seen as riskier by US investors, they're seen as the safest option by most Canadian investors. The huge rise in the TSX will inevitably increase risk on sentiment among Canadians. So where will Canadian investors allocate their capital if they're looking to invest in riskier assets? Sure, they could invest in other international stocks and commodities, but it's not as easy for Canadians to invest internationally. And commodities aren't anything exciting. They're the boring old backbone of the Canadian economy. It's possible, therefore, keyword possible, that some of this capital goes into crypto. In other words, liquidity started off by flowing into US stocks, then it flowed into international stocks and commodities instead of flowing into crypto and small cap US stocks as it had in previous cycles. As such, you could say that liquidity from US investors took a detour. It went overseas instead of online. The thing is that this overseas capital will need to flow somewhere once foreign markets are flooded with liquidity. And one of the places it could flow into is crypto. Aside from the fact that crypto also lies further out along the risk spectrum for international investors, it's also much easier for international investors to access compared to say the Polish stock market, which was up 45% in 2025. By the way, this begs a bigger question though, and that's when foreign investors will buy crypto and which ones they will buy, if any. And the answer here is fascinating because it ultimately depends on a combination of two factors. Which countries are opening their doors to crypto and which particular cryptos investors in those jurisdictions are interested in. Suppose we're dealing with a European investor. The DAX, the German stock market index, is hitting new all-time highs, and they want to invest some of this capital out along the risk spectrum into crypto. Now, as some of you will know, the EU recently introduced its markets in crypto assets or MIA regulation, which creates clarity for crypto, particularly altcoins listing on exchanges. What you may not know though is that the EU also introduced strict travel rule regulations which make it very inconvenient to move crypto off exchanges. At the same time, many European investors are environmentally conscious, if you catch my drift. This means that European investors are likely to stay away from crypto niches like DeFi and could even steer clear of proofof work cryptos like Bitcoin due to their resource inensive mining. Logically, this means that most of the risk on capital from European investors will probably find its way into larger altcoins which are easily accessible on exchanges, including on traditional centralized exchanges. As it so happens, there are a lot of altcoin ETPs listed in Europe. Beyond Bitcoin, the largest ETPs by assets under management are those for Ethereum, Salana, and XRP. So, it stands to reason that ETH, Soul, XRP, and other large altcoins will start to get investment once European stock indices are saturated with enough liquidity that European investors start going further out along the risk spectrum, whenever that may be. If we had to guess, the boom in European stock markets will probably happen once the war in Ukraine is over, which will hopefully be by the end of 2026. It goes without saying that it would take time for liquidity in European markets to rise after that. And it would also take time for that liquidity to find its way into crypto. But we'll come back to the time it will take for that to happen a little bit later on. First though, I want to drive the point home. Suppose instead we're dealing with a South Korean investor. The Cosby, the South Korean stock market index, is hitting new all-time highs and they want to invest some of this capital out along the risk spectrum into crypto. Similar to Europe, South Korea has incredibly strict regulations that make it very difficult to do onchain things like DeFi and invest in cryptos that aren't on centralized exchanges. The difference is that South Koreans invest almost exclusively in altcoins, presumably because they have smaller price tags and are perceived as having more upside potential. As a fun fact, XRP is the most traded cryptocurrency in South Korea by a wide margin. And if you look at the top trading pairs on South Korean crypto exchanges like Upbit, it's mostly obscure small cap altcoins we've never even heard about. Once again, the main question here is time. When will South Korean capital flow into the crypto market in size? Well, believe it or not, but it could be a decline in tensions with North Korea. To bring you up to speed, the new South Korean administration wants to become friendlier with North Korea and has even asked the Chinese government to help. So, a decline in tensions would likely result in more investment and speculation. And regarding which cryptos South Koreans would buy, trading volume suggests XRP and ETH top the list. Though this list is subject to change, and everything else that comes after it is, well, anyone's guess. By now though, it should be clear that investors in many countries seem to be primarily interested in altcoins. Be it because of environmental sensibilities or the perception that altcoins offer higher returns. And this brings me to the big question and that's how we can use all of this information to construct a crypto portfolio for 2026. The answer depends on where we are in the process we just discussed. Specifically, how long it will take for global liquidity to finish flowing into international markets and commodities and when this international liquidity would start flowing into crypto, if at all. Well, if the DAX and Cosby are anything to go by, many international stock markets have only just started breaking out, which is remarkable when you remember that they already beat US stocks in 2025. Unfortunately, this means that international liquidity is unlikely to flow into crypto anytime soon, but there are signs that the altcoin bias of international investors is already starting to reflect in the charts. If you're addicted to social media, then chances are you've seen this chart of others BTC. To refresh your memory, others measures the combined market cap of cryptos outside of the top 10. So, altcoins. So, what others BTC shows us is the strength of smaller altcoins relative to Bitcoin. As you can see, altcoins were weakening against Bitcoin until recently, and it looks like this viral ratio has bottomed out. Naturally, this has led to speculation that there's going to be a massive breakout in altcoins relative to Bitcoin in the coming weeks and months, which seems impossible given where we are in the crypto market cycle, as well as the liquidity cycle. That is until you realize that others doesn't just include altcoins. It also includes stable coins and tokenized assets, notably tokenized gold. So then what happens if precious metals keep rallying and we start seeing tokenized silver, tokenized platinum and other tokens for precious metals? Obviously others would rise in both fiat terms and relative to BTC. This is incredibly important to understand as it's something that everyone seems to be missing. Others BTC could rise significantly in 2026, but it may not be because of growth in altcoins. It could be because of the growth in stable coins and tokenized assets which happen to be of interest to investors in the US right now and have been highlighted as key themes for 2026 by institutions. In practical terms, this means that the optimal crypto portfolio in 2026 could be one that's focused on stable coins and tokenized assets simply because some of the risk on capital could go into these niches. And of course, most of the stable coins and tokenized assets currently exist on Ethereum. It should come as no surprise then that ETH BTC has been rising since last summer when the Genius Act regulating stable coins was passed in the US. What is surprising is that ETH BTC has technically been in an uptrend since April of 2025. As crazy as it sounds, this means there's been rotation into ETH beneath the surface. Things get even crazier when you consider what this means for altcoin rotation. In case you forgot, it's assumed that any money that goes into crypto first gets invested into BTC, then it rotates into ETH, and then into other altcoins. Upon closer inspection, though, you realize this rotation is a bit more complicated, but it nonetheless suggests that the rotation from BTC into ETH could have only begun in the spring of 2025. Again, it sounds crazy, but recall the nuances I just explained. Stable coins and tokenized assets were key themes for institutional investors in 2025 and have been underscored as key themes for 2026. Most stable coins and tokenized assets exist on Ethereum. So, it makes sense that ETH has strengthened relative to BTC in recent months. And the same is true for others BTC rising due to stable coins and tokenized assets. So, does this mean go allin on ETH stable coins and tokenized assets for 2026? Not so fast. You see, for starters, ETH BTC and others BTC don't tell us anything about the prices of any of the assets in question. If BTC fell by 55% and ETH fell by 50%, ETH BTC would rise. Similarly, if BTC fell by 55% and most altcoins fell by 70%, others BTC could still rise if the market cap of others is growing from stable coins and tokenized RWA. Well, historical crypto cycles and the liquidity cycle suggest 2026 is going to be a bearish year for BTC, ETH, and altcoins regardless of what ratios like ETHBTC and others BTC suggest. But before you go all into stable coins though, there's another nuance to keep in mind. Whether it makes sense to go into stable coins or not fundamentally depends on how the US dollar's value will change in 2026 versus the currency that you use. If you use the euro and go all into stable coins and the US dollar falls in 2026, you'll lose money in real terms. Conversely, if you use the euro and go all into stable coins and the US dollar rises in 2026, you'll make money in real terms. Before you ask, we're not sure where the US dollar will go in 2026, but historically bare market years corresponded to a rise in the US dollar and therefore this could happen in 2026. And what about tokenized assets then? Well, it's a similar story to stable coins. If you go all into tokenized US bonds and US bond prices fall, you'll lose money and vice versa. Fortunately, we're likely to see new natively issued tokenized assets like companies launching their stocks as digital tokens instead of physical shares. So getting in early on these opportunities could be lucrative. You'll have to dy about those. So then what does the optimal crypto portfolio for 2026 look like given these dynamics? Well, at the end of the day, it depends on your risk tolerance and time horizon. If you don't mind holding ETH for a couple of years, even if prices fall another 50 to 70%, then it could potentially be a better portfolio anchor than BTC. If you can't stand that volatility and can't stand waiting, then stable coins may be a better anchor. Just keep in mind though that US dollar stable coins could still lose you money depending on exchange rates. The same goes for tokenized gold, which could be another potential anchor depending on your time horizon and risk tolerance. In a perfect world, it would be possible to invest in companies that are involved in stable coins and tokenization, but most of these companies are highly correlated to crypto. In theory, stocks like Circle and Coinbase would be good bets for 2026 since Circle issues USDC and Coinbase will offer tokenized RWA trading and presumably issuance. In reality though, they could get dragged down with the rest of the crypto market if crypto enters a bare market later this year, which is likely historically speaking. The silver lining though is that the 2027 2028 period is shaping up to be explosive. By that point, most countries should have reasonable crypto regulations in place. And factors making international investors hesitant to allocate into risk assets like the war in Ukraine, tensions in the Middle East, and issues in Asia will hopefully be resolved. This will make it possible for liquidity to flow from international markets into crypto by the end of the decade when international stocks will likely peak. So, TLDDR, pay attention to assets related to stable coins and tokenization in 2026, and watch altcoins closely as we approach 2027, starting with Ethereum. And be sure to watch the Coin Bureau so you know where we are in this process. And if you want to know what other themes investors are watching in 2026 and which cryptos could benefit, then be sure to check out this video here. And if you made it this far, thank you so much for watching and I'll see you in the next one. This is guy. Over and out."
    }
]