[
    {
        "video_id": "Nv7YO3sXUVM",
        "title": "BMNR Stock Breakout Imminent After SHOCKING News!",
        "published_at": "2026-01-14T04:13:23Z",
        "sort_date": "2026-01-14",
        "url": "https://www.youtube.com/watch?v=Nv7YO3sXUVM",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. We have all had a very interesting trading day with the market that really started with a melt up near all-time highs. We had inflationary data that was showing to be basically relatively cool and even in line with expectations as we saw that basically all the analysts and experts that were were predicting the tariffs to be very inflationary uh that just didn't really come to fruition. Um, so what you saw was a lot of bullishness in the market open followed by kind of an intraday liquidity sweep and selloff with a little bit of a recovery towards the end. Uh, so we'll be talking about that especially here with Bitcoin and Ethereum catching a very large bid. Ethereum could possibly be entering into a breakout zone if this holds. That's the big grain of salt. If this holds, we're going to be talking about how this could be a potential breakout area for BMR that's especially been consolidating for a while and a lot of people seem to be holding the bag. Could there be some optimism that gets re-entered into the market? We'll be talking about some of the other individual stocks we've been talking about on the channel, making some big news. If you're a new or returning viewer, hit that like button, subscribe for daily videos, and let's pop it up on the screen here. The BMR ARM currently is at 3248. uh what you can see right here currently doing quite well above its 50 above its 200. Now, BMR has had a decent amount of support around the 30s that we can see here with multiple touch points. And even if we kind of zoom out here over the 3month, you know, after BMR had this large selloff from when it was in the ' 50s and the 40s and came down here to 24, we've kind of seen a nice bounce and just consolidation here with some swings, of course, the 40, a little bit of some resistance there, but now BMR has just been hanging around the 30s. Currently, it's at 3248. I think if it can break out of this consolidation zone, if it can get past 33, that's where you're going to see possibly a retesting of $3940. Now, one of the big things that we're seeing here is Bitcoin currently right now at 95,000. It is currently kind of knocking on the door of 96,000. And how that correlates here to Ethereum, it is finally also breaking out of its own consolidation zone. Considering Ethereum has been really hanging out here just at this 3,000 and this 3100 floor for a long time had this testing basically at about 33 was rejected and now currently is above that zone. So you can see here over the last 24 hours has been doing quite well. Now the only big pieces of you know I would say catalyst or huge market moves that we're seeing here other than that these have been consolidating for quite some time and uh they've also been experiencing a bit of a draw down over the last several months. Uh so that's where you could have selling that might be faded. But you do have here the US Senate Banking Committee. They had talked about here the Clarity Act and we've been trying to get more information on this as this could be very bullish for the welcoming of cryptocurrency into the traditional financial sector and also just more regulation and clarity regarding the crypto companies. This is a result here more of 6 months of good faith bipartisan negotiations they say and has benefited from consultation with ind industry uh participants legal and academic experts in key stakeholders talking about here are the facts. So they're giving facts bringing clarity regarding regulation which is great. That means that the tradition traditional banks that are looking to get more involved with cryptocurrency can have more leadway without facing potential consequences with uncertainty that's around there. And on top of that with BMR, you also have here of course Tom Lee is buying uh Bit or buying Ethereum at a rapid pace, continuing to buy 75 million worth of Ethereum. He bought that last week as he's working to achieve 5% of the circulating supply of Ethereum that he calls the power of numbers here and is also continuing to increase the staking uh amount of Ethereum which is good for the Bitine balance sheet. So in terms of a digital asset treasury and a traditional finance guy, uh Tom Lee really betting his whole basic basically reputation it seems like on this move for this kind of synergistic effect between crypto and current US equities and kind of this whole uh what's tokenization going to look like here in the near future. I'd like BMNR in terms of the short-term move here. We're also seeing here moving in sync. Like I had talked about these downtrends of Ethereum are kind of breaking here. We're seeing higher lows. Hopefully that'll keep continuing to come with higher highs and in subwave three talking about lots of bullish catalyst that are piling up. One of the digital asset treasuries that actually received the opposite of good news today and kind of optimism. Interesting things happening here is with Strive. Now, we've been talking about Strive, ticker symbol AST. Now, ASST was trading around 120 today or 112 basically had a nice pop up there and then we see it sell off quickly to about 90 cents and is recovering right around that dollar zone. And I think that's basically because we have Bitcoin that is currently at about 95,000. is helping that because it's, you know, very highly correlated to Bitcoin's price in terms of it is a Bitcoin digital asset treasury. What happened today though is they announced a merger with SML SMLR acquiring their Bitcoin, but they also announced a 1 for20 reverse stock split alongside the shareholder approval with this merger. Reverse stock split typically carry a very bad reputation especially for the retail traders. They do not like reverse stock splits uh because typically that can help promote dilution. If you do a reverse stock split then you can dilute the shareholders even more. That is kind of the repeated cycle that can really be the death of a stock. So that is where you have the uncertainty that lies. Uh in terms of this move here though, asset or strive now holds 13,000 bitcoin. A lot of the big reasons that I'm seeing across X on why they conducted this one for20 reverse stock split here was basically to help kind of maintain their listing regulations and to help several institutions be able to buy have institutional investors be able to have access to Strive since at its current strike um not strike price at its current share price that it is just kind of unavailable on a lot of different type of exchanges. So we'll see how this plays out. What's your opinion if you've been following it at all down below? I really want to know. Uh talking about Palanteer, we've been talking about that of course in the channel a ton. Basically consolidating here within its 3mon kind of consolidation between this 170 between this 184. It hangs out here. Of course, we've had breakouts below. We've had breakouts above um you know, but just kind of hanging out here in the zone. We have earnings that'll be coming out February 2nd or whatever it is like here in a few weeks. That's, you know, where I'll be typically looking at panels here a little bit more. Uh we do have more price targets recently that have been increasing. Here we have TRU is first. Now we have City that upgrades here to a 235 price target. Let's talk about some of the data center stocks here doing quite well. Uh you see them kind of breaking out here especially with you got Nibbius here that's at 106. You got Ren here that's breaking out at 54 right now up another 2% here in the overnight hours. And you have Cipher that is also doing quite well right now at 1860. Now, Cipher was able to, if we look on the daily right here, basically came to about 1891, fell down to the high 17s. This is where you saw the liquidity sweep kind of across the same kind of move across all the markets and then a nice recovery above its 50-day currently at 1850 1860. I think if Cipher is able to maintain a move and a close, which we kind of did get, but basically a bullish move past 1860, that's where you're going to get the retesting here, I think, of 20s. If this holds here, if you see a breakout above that, that's where I think you're going to see more of a stronger move like I ran that's already recovered from the low of 33 all the way back up here to 54. Now, that's where you could see some strong moves in Cipher, especially since today. There was an interview with the CEO. I haven't fully watched this interview um but just looking at it I hear lots of things all over Axe that lots of sites are coming online new acquisitions and an amazing team behind it as we know very bullish on some of the data center stocks for 2026 along with Agentic AI looking at Zeta and Path uh basically didn't make any huge moves today. I mean Zeta's gone on a huge run so consolidating right here a little bit of a draw down not necessarily a bad thing. Uh you see path right here. I think we saw the CEO CEO that sold some shares right here. There was some other pieces that brought uncertainty. So that's why you saw basically this kind of selloff. Still bullish on it though right here at $16. I like path. I like zeda for the agentic play. I'll be keeping that on my radar. Other than that, but right now you have the spy that's down and basically futures are flat. I won't even say down at 002% down 14 points. Really not making any moves right now. You have big banks that will be releasing their earnings. uh a lot of volatility of course with the big banks and credit card companies with the recent call the one-year 10% cap on credit card interest rates and then we also have the possibility the Supreme Court ruling on Trump's tariffs that's priced in at like a or not even I don't even know if it's priced in but the prediction markets have it at like a 70% chance that they're going to be overruled. So we'll see what happens. They were supposed to come out with an opinion on Friday but they didn't. So, we'll see if they come out with one tomorrow and there could be some volatility that comes with that. Other than that, that's really all that I have for you guys. Peace out."
    }
]