[
    {
        "video_id": "6UMRKDmqRF4",
        "title": "BITCOIN GOES PARABOLIC!!!! (Big Trap or Real?)",
        "published_at": "2026-01-14T20:33:44Z",
        "sort_date": "2026-01-14",
        "url": "https://www.youtube.com/watch?v=6UMRKDmqRF4",
        "transcript": "So yes guys, welcome to another episode. And as you can see right now, Bitcoin is pumping back towards 96. It even went all the way to 97 today. So this is the highest price ever since we had this dump right here in November. So obviously big achievement for the Bitcoin bulls. Bitcoin bulls are casing celebrating. Bitcoin bulls are really on fire today and for a good reason. I mean we are actually now pushing above this resistance here that we've been discussing for a long time and we are almost at the 50week moving average where the big question will be asked can we pump above it or not because as you know we're in a weekly bare trend long-term bearish short-term bullish and this is also fantastically tradable when it comes to altcoins. You see here two days ago you had all kinds of altcoins flipping on the money scanner. One of them was Dash. This was one day and 18 hours ago. And if you have the uh money scanner in in the Bullmania membership, you can see when things are flipping on the 4 hour, on the daily, this thing is up 92%. This is the thing for short-term trading. This market is quite good. Absolutely. For short-term trading, for bullish trends, you see horizon 27 bar chain bars are coming back 21%. And this is only since 18 hours ago when the flip was confirmed. Then you have baby Doge, you have all kinds of other things. Then when you look back a bit longer, you have pirate chain, you have paladium, something something some coin that is kind of paladium or what it is. You have kao, you have other ones. So this is why when we are in this environment of a bit of a crab market for bitcoin. Yes, it's up a bit here and there 96 97. The big opportunity for trading currently it is in smaller alts when they are entering bull trends on the daily. That's number one. In terms of Bitcoin, where are we? Where are we? We're here. The next target as you know is approximately uh the 50WE moving average which is 5% above us. This can literally be tomorrow. 5% may not may not seem like a lot but remember most people they trade with leverage. So when people are taking trades here when you see the gigachads for example you look here at our hyperlquid map you see that the gigachads the big brains when they're trading here this is mainly leverage trading. So 5% may not seem like a lot, but if you use bybit, you use other exchanges, if you go here to bulming.com/partners, use the link below, exchanges I use, you're going to come to this page, boom.com/partners, you have bionex, you have buyid, fantastic signup bonuses, but this is where you got to understand that for short-term trading, you don't need that much many%. We've been discussing it during the last few days, but all of these different wallets here, they are trading on Hyperlid and Hyperlid is a leverage exchange. And what has happened during the last few days is that giga charts have gone from ultra bearish to just slightly bearish. Okay, that's number one. And then big brains, they went from slightly bearish to bullish and now to indecisive. So when we look here at historic earlier today, this big brain was green. Now it is indecisive, but it was bullish. All in all, you can see a trend here that since the last week, the gigachs, which means that they have 1 million or more in profit, they have been bearish and now they are turning more bullish. That's one trend. And then big brain they also were bearish now they're turning bullish as well. Well slightly bearish but the next episode is they they go bullish as well. So the big walls are also expecting the revisit of the uh of the 50week moving average. And as you know our plan since October 8th when we started to derisk is to basically sit on our hands now. We're not going to do anything unless we're really starting to close weeks above the 50 moving average here or unless we go here to the 200E moving average. This is for us. We're we're in a perfect position. We have 30% of the portfolio in Bitcoin. We have derisked everything since October 8. I mean literally right here if you've been following and the the signals for us to to act are twofold. Number one in case 50 moving average is broken. And if we go to a 200week moving average, I spoke about it at length yesterday, but if I am to repeat the 200E moving average uh case is that here if you go to bullming.com/charts, you can see all of these charts. And you see that here we have a simulation when you buy at the two 200E moving average. If you scroll down here, uh it's massive. I mean, it's massive profits, always massive profits. So you can be quite confident there. Uh and the max draw down that we've seen is 24% in 2022, but that was the worst one. Normally on average it's just 11% down on average the max max drawd down that you may experience. So uh those are the two scenarios. In the meanwhile, this is very very much expected. When you look um in the bare trend, this is very much excited. This one in the bare trend context. When you look at what happened here in 2022, it was kind of the same. We had how many weeks from this peak basically from the peak to the uh this fake out peak here from the micro peak to a higher low. So a lower high it was here how many weeks? uh 20 20 weeks from the peak to the lower high peak basically this fake out towards the 50 week it was 20 weeks. So if we use the same logic uh not over complicate too much let's say we do something similar then the peak here should potentially be here in late February. Okay. So if this continues like this bum bum bum bum bum here towards late February uh could be a a peak if we see something that is similar nothing is exact nothing is exact but things do rhyme and especially when we look at performance by year and you compare to the previous cycles we are currently the green chart 2026 and you compare to previous midterm years which is 2022 2018 I mean you see we're we're kind of exact now we're a bit above the average see the average was is a bit lower But uh still in the vicinity of the previous uh midterm midterm years. So all in all from a long-term perspective for me this is a no man's land. This is the no trading zone from a long-term perspective. This is not a zone where you know I would put a lot of money into the market back that would be at the 200 week or if we go above 50 week super simple strategy but when it comes to trading guys when it comes to short-term trading holy crap I mean that's where a lot of a lot of money is made. Okay. Because here you have the best riskreward instead of focusing just on you know on this you know maybe a few% up with leverage you could with leverage you could but if you want to trade spot I mean spot is here is here here is spot okay you want to keep it simple you you want to go spot this is spot also we added ETFs today so if you have bulmania you now also have access to the ETFs so basically all ETFs in the world you can uh filter here by by different asset class and by different focus let's say you want to see all equities you have them right here and then you can see you know the biggest gain since the flip. This was 6 days ago. Let's see the biggest flip since uh any time. Basically, no limit on the uh on when it flipped. Then you have uh you know this equity, this equity, this equity. You can also say you know I want only large caps. Okay, only large caps. Then you have ETFs only with large caps. So did you know for example this this Vietnam thing is pumping since a month ago 13%. Well, now you know. Now you know, now you know. So a lot of opportunities overall in the market. I mean if we look at weekly trend you see here is some of this leverage 2x long 2x long but also you see ultra silver fantastic 400% gain 7 months ago ultra xrp there you go XRP is it real XRP or is something else that's XRP anyway it's up 360 all of it is just freaking tickers okay all of that is just freaking tickers you have Google this leverage another leverage fund. You can then go into okay I only want let's say commodities let's see what's what happened to commodities bam you have silver silver physical silver fantastic fantastic so we've added ETFs now so you can speculate on ETF when they flip in real time commodities we've had them for forever now fantastic returns here in silver polio on platinum here you can trade for example on buy bit you can trade silver on pionex you can also trade silver as you know if you go to the link in description and you sign up for exchanges I use on buy bit and on uh on Pinox you can trade most commodities and also most stratfi as well. So from a short-term perspective here is where it is kind of a golden age right now. I mean in one way or another when Bitcoin is in this consolidation kind of you know going back towards the moving average the thing to do is to look out for this trends and have a nice tight stop-loss so you're not wrecked in case it goes against you and uh just play that game. I mean it's fantastic overall if you if you want something to do. I mean many people they want something to do even when this uh sitting on the hand season is for Bis. I know many people cannot just sit on their hands and sadly that what rags them that was that what rags them to learn properly how to trade. Go to bullmania.com watch the free video. This is the first link in description. You're going to learn all about mechanical rules. You're going to get access to our uh money scanner so you can have all of these alerts in real time. I mean literally get in real time when things sleep flip. And as you can see you you really wanted to have real time. you want to be in early early bull trends. So to get access to that just go to bullminger.com or click the first link in the description. Now moving on guys um we checked the hyperlquid. Let me speak a bit about pump fun. This is very interesting in terms of the uh short-term trading as well. I mean the the reason why we're seeing a lot a lot of excitement for short-term trading is because there there is money to be made as we saw in the um in the flips on money scanner. But you also see activity now in the trenches. And in the trenches meaning when it comes to memecoin trading because pump fund revenue if you measure it in Solana it's actually going towards alltime high. It's very soon above this high right here in January when the Trump thing was launched. You remember the Trump memecoin. And basically it's only this high left. Uh but all in all is basically one of the highest one of the highest revenue days for pump fun ever ever ever. So uh you might have you know thought that the memes are dead pal fun I mean not at all not at all so this is daily uh revenue they have p revenue in soul measured in soul if you measure in USD it's a bit different because soul is down but um that's why it's better to measure in soul because here you kind of see without this distortion of the USD price because of course if USD pumps then the revenue in soul is also going to go up in USD terms so yeah keep an eye on this one why is it important to keep keep an eye on this one because if this continues, it is one of the key catalysts for soul. So if you see this thing continue going up, but soul is lagging. Uh could be could be a signal that is going to snap at some point. The best thing is obviously to always just look at the trend. Don't try to guess it with stuff like this. But if you don't have the trend indicator, you want something else, some kind of other proxy, go to bullmain.com/charts. I mean, it's a free chart. You can see all of this here. Okay, all of this. Uh so that's that. When it comes to the um the trenches, they they're not they're not gone. They're not gone. They're here. Okay, trenches are here. Meme coins are here. Now, uh in one way, you can say that maybe we deserve another nuke because of this. Maybe we deserve to go to the 200E moving average. I mean, some people are saying that that memes are still big. We haven't learned anything. If you read what kind of memes people are trading, I mean, it's uh it's [ __ ] We haven't we haven't learned anything. Pal fund revenue coming back to alltime high. So you could say you could say that we deserve another new we deserve to go to $10 for Salana to $20,000 for Bitcoin. If we keep I mean we keep trading all of this brainless stuff. Normally bare markets at least they reset they reset the sentiment. So it's it's dead. Okay. It's dead. So when people are saying oh everyone is so bearish. I don't know man but people are not very bearish. people are not very bearish. It's only the the only people who are bearish are the so-called uh giga chads. When you look at the hyperlquid uh here, they're the only ones. I mean, everyone else has snapped into bullish quite quickly. And also look here another thing. Let me show you the greed here. Ethereum and grid now is kind of coming back to neutral uh from the red zone. So all in all, sentiment is coming back quite quickly. I think we have a real chance here to go to a 50 week and then we're going to see if we smash above it or not. On this note, welcome everyone who is watching live. Smash up the like if you haven't yet. Big shout out to Matt for time stamping us. Let know let me know what you think about this time of streaming as you know we do weekends a bit. And uh now I want to play you another thing which is quite bullish and that's that the US president wants markets up. He's very angry that they're not pumping. He's saying that the Fed is killing every rally. Holy crap, guys. Listen to this. >> Possible in the Fed. We have a real stiff in the Fed, but that's for another day. >> Real stiff in the Fed. And now he's trying to get get him in jail with criminal persecution for some renovation. >> But they raise rates. So everyone says, \"Oh, they announced great numbers. It's great, great, great.\" And the market goes down because they immediately raise rates. No. When the market goes up, they should lower rates. You want to see 20% and 25%. You want to see what we can do. We've got to go back to an old standard. When >> please please please Mr. El President, please. He's now also officially el president of Vincelas, you know. So, he's fully correct. I want to see 20% 25% in S&P. I want to see what we can do. Yes. Yes. Yes. >> There's good news. The market should go up, not go down. Does that make sense to everybody? That's the way >> it makes sense. Yes, it makes perfect sense. Holy gra most of the time. That's the way you make a country great. But our growth potential is unlimited and could be much higher if we went back to sanity. We're not doing it anymore. We're talking about the head of a Fed of the Fed. And I want somebody that when the market is doing great, interest rates can go down because our country becomes stronger. See, you view it differently. our country becomes stronger and therefore interest rates should go down not up. They >> I mean I guess there is some um there is some argument to be made here that if your economy is stronger you should have lower interest rates because when people buy your debt it's lower risk. But the question is is the stock market the sign of how economy is doing or not the ever question. Let's see. But there's another clip I want to play you where he really doesn't like Jerome Powell guys. He he does not like Jerome Powell. mortgage drop below 6% for the first time in many years. It's coming down very rapidly and that's not with the help of the Fed. If I had the help of the Fed, it would be easier, but that jerk will be gone soon. In addition, holy gra it would be easier, but that jerk will be gone soon. guys a lot. I mean, you know, they're going to they're going to hyperinflate the crap out of dollar. So, guys, as soon as Bitcoin is bullish trend, as soon as we go to 200 week, oh, bye bye bye. I mean, it's uh it's going to be legendary. It's going to be legendary generational. Now, uh to to counter the the bullishness, we need to speak a bit like I I don't know if they're going to you never know, guys. I mean, with Trump, you never know. Will he do something with Greenland or not? White House is now posting this picture. Which way Greenland man? Okay. Is it Russia or China and or US? Let's see if he's going to take Greenland. What he's going to do? Uh that would be uncertainty. Markets don't like uncertainty. Okay. Markets don't like uncertainty. Now, uh some news before we go to Q&A. Look here. Nine out of the 22 fastest companies to reach 100 million in revenue are built on Solana. That's quite interesting. So, you have for example Phantom, you have Radium, you have Backpack, you have Jupiter, you have Pampan. Of course, Ponfan, you have Axium, you have what? What is Backpack Radio Bongbot? Of course, Bongbot. So, that's what's interesting here. Um, the fact that you can build applications on Solana, you can go mainstream. Can you do it on base? Let me know. We discussed bass at length yesterday. Go rewatch it. I don't think you can. I don't think you can. Next, guys, we have also SEC coming out saying that all US markets will be on chain within the coming two years. Let's listen to this. If it's boring, we're not going to listen for a long time. I hope he says it in the beginning. >> Tokenization is the idea of using then smart contracts or or you know tokens onchain to be able to that represent say underlying security. And so then that tokenized security is a security and would be subject to SEC rules by law. But the idea is that it's if it's onchain on a blockchain then there's much more transparency as to where it is. Right now there's a bit of capacity as to you know who owns what and where the company usually doesn't even know where it's sharehold who it shareholders are and where the where you know where the >> Yeah, I mean it's very true. It's this is so true especially I mean not especially but if you have a nonpublic listed company ah it's a bit tough to know who owns what because some people invested in that investment platform some people got options those options going to be converted to like you know to really see where the hell all your stocks are how they're transfer like man it's if you have a bigger organization it's quite tough and then when company goes public it can take years I mean over a year I spoke to Simon Dixon a few years ago he said he invested in I think coin Coinbase like years years before they went public. It took him like a year to get the stocks tradable because to figure out to register the stock was crazy. It was crazy. So yeah, here in the video he later says that everything is going to be on chain which makes perfect sense. U let's check a bit of news. Let me refresh here on bullming.com/charts. By the way guys, if you haven't done so yet, go to bullming.com/charts. All these charts are free. You want the bubbles, they're right here. XMR still doing well. You have I mean everything else uh here very very neatly organized uh and um yeah fantastic fantastic fantastic uh fe and greed we checked global asset this one we checked yesterday silver is now above Nvidia social risk let's see what social risk currently is right now social risk is 19 so yeah no one really searches for Bitcoin on Google guys no one cares about Bitcoin on Google so yeah normally we pick out on red here and people say that we didn't see red. We did see a bit of red here with Trump launch and Sana, but yeah, not as strong as in previous cycles for sure. Um, some more news. We have Senate Banking Chairman Scott saying that Trump tied ethics uh clash doesn't belong in crypto bill. So, as you know, on Thursday they're going to vote on this market structure bill. You have Charles Hoskinson. Man, Charles Hoskinson thinks that we're not going to get it. Charles Hoskinson is very bearish. Charles Hoskinson. Let's see. Mark, let me see if I can find a video quickly here. He was saying that we're not going to get it now. He's actually very bearish now. He he he's doesn't like Trump that Trump did all of the coins and so on and so forth. Uh San House, listen, I don't want to search too long here, but he's quite bearish. So, let's see what's going to be there. There's obviously this debate how much Trump will gain by this bill passing. Uh oh yeah, here it is. Maybe this is here, but it's 1 hour, man. Becomes a campaign talking point in 2026 when the Democrats run for reelection. They're going to say crypto equals Trump equals bad, crypto equals corruption. So these types of things, they weaponize the industry in a way where half of America hates the industry now. >> Yeah. I I guess that's I guess that's the that's the conclusion kind of. Uh well I mean in a way it is let's see if they can pass it but the thing is they want to pass a lot of bad stuff as well. It's not only good stuff they want to pass. They also now lately they they started to add bad stuff to the uh to the bill. So if you go here to crypto and stratfi news um you see that it's a lot of talk whether we're going to have uh the stable coin yield remove as part of market structure bill because egenius act passed and there it allowed stable coins to basically offer yield via exchanges and now they want to remove it. So banks they want to close this loophole as they say where they say that the line is blurred between tokens and savings accounts. They don't want to lose customers to stable coins and apparently they're going to try to push this uh into the market structure bill. So I mean let's see what's going to happen with with it. Uh all in all I don't think it really matters with the price trend. The price has pumped without it. The price will pump without it. The price has dumped with or without at least and all all the price moves they're quite disconnected uh from the whatever is in the news. So we can as easily go to 200k without it. Okay. for Bitcoin and even the best news when the best news comes out we can still dump. Okay. So that's why the trend is your friend the same news that will pump us to Valhalla in the bull market today maybe not do will not do anything and some news which would not even be notice in a bull market may dump us a lot. If you have a bit of ne negativity in a bare market it dumps a lot. So looking at news like the same kind of news can either be bullish or bearish depending on on the price context. So guys, on this note, let's go to Q&A questions, answers, debates, discussions. Let's go as soon as possible. Check number one, bullmania.com for uh free training. If you want to get access to the money line, the money scanner, all of our stuff, you first need to do training because you need to know what all you're doing, how you're trading, what you're using, because really, I mean, people are in a bad spot not because they don't have enough tools or data. There's like endless tools, endless d like you, you know, there's a million indicators, but it's education, missing education and of course missing money scanner, but um the first thing to fix is the is the educational part. So that's number one. Uh then go to boommy.com/partners. Why? Because there you sign up for all of the exchanges I use. Let me open it uh here. The partners bum uh Pyionx buy bit on Pionex you can now can do the Nvidia uh campaign. Meaning that uh if you go to Pionex uh one second man so many tabs open here here where is the tab here here if you go to pionex you click here the first link you will get this Nvidia position if you click before end of January and finally bull.com/charts for free charts let's go guys Q&A right now and big shout out to Matt for times something us today as always well no sometimes sometimes I mean whenever we need Matt is here that's that's best. Sometimes it's Guzman, sometimes it's crypto for you. I think yesterday we had crypto for you. Now we have Matt, but Matt is always in the chat. That that's uh that is us always Matt in the chat. Fantastic. Big big shout out. Big fat shout out. A huge head and shoulders pattern forming. You mean on Bitcoin? I mean, you could see it like that also. Um the issue with um head and shoulders is that you you it is I would say it's second tier. like it's a second to third year um conf signal you can trade. It's it's not the I would I wouldn't have it as the primary signal because how do you trade it? You need to trade it basically when the neckline breaks but then it's already here at uh 77. So it's um not really good like this big big fat ones. They're not too good and then um normally we bottom out at the 200 moving average anyway. So if you have a too big one, it's not really useful. And in general, you know that the trend is the number one signal. Second grade signal is like some kind of you know some pattern, some triangle, some some other thing that can just boost your confidence in the shortterm move. You you can get that you can get boosted confidence. And then third grade signal is you know stuff like news and and everything and everything. Yeah. Uh and so on and so forth. Yeah. Question. good time to do risk if we didn't do it in time. It's a good idea to keep a bag in case we I mean it's tough. It's h because we're down already. It depends on what it is. I mean with Bitcoin, you can you can just add to your long-term huddle. uh if you especially if you feel that you um kind of new to for Bitcoin like the time to risk was in October somewhere there now it's um uh it's not the same like it's you know our average sell price since October is somewhere here you know 105 between 105 110 somewhere here so in case we start going above the 50 moving average we can buy back basically the same if you start selling now you're going to be in a bit different position so with Bitcoin at this point it could make sense either to derisk just a bit maybe 50% instead of 70 and then uh so it depends on how worried you also are if this is like your whole money or it's just a small amount let's say if it's an insignificant amount in your portfolio then just keep it if it is like you know you're really worried you're struggling every day with your nerves then I mean drisk a bit but u bitcoin as a whole is going to be okay anyway when it comes to alts if your alts are wrecked like minus 90% you could just move them a bit at a time into bullish assets. I mean, there are many bullish assets and we speak about it so much in bulmania.com in the educational part of bullmania.com because it's like a whole thing. How do you derisk? How do you position yourself? It's actually the hardest thing is is the hardest thing and that's why we focus so much on. So go to bullming.com watch this about mechanical rules. You need to apply mechanical rules. How to go from a wreck position in all coins. All coins I would not I would really handle them. I would not keep altcoins that are super red because most of them are not going to come back. Most of them most of them go to zero versus Bitcoin. So keeping them it's you're in a mental prison. I mean you wake up every day you think about the crap you have. You look at them. You hope they're going to go come back. You hope the founder does something the founder already checked out. He doesn't care. You already checked out long time ago. So I would say go to bullman.com. Watch the video and Bitcoin depending on your like mental load. If you're like really pressured by it, then maybe release the pressure a bit by drisking slightly. You're it's not as good as uh doing it earlier. But still, I mean, it's it's quite okay um to risk a bit still. But then with all coins, you really they if they're just trending down, even if they're down 70%, they can dump another 70%. So that's the problem. So with all I have no patience, I have no patience if they are in a bare trend. Zero zero patience. and they go to zero versus Bitcoin through time anyway. But yeah, go to bulmania.com because I mean I cannot summarize the answer here for you fully. I can uh I can give you this answer but it's it's like a whole topic. I mean we have whole lectures on it in bulmania.com because it's it's one of the key questions. people that come into bullmania.com into our community. The first thing we need to fix is their brain and their wrecked positions and their portfolio that is uh very badly constructed. Super wrecked holding bearish assets hoping they're going to come back getting burned initial their some people their brain is cooked. That's why we focus so much because you know imagine year after year being down and I mean it you really get like burnout in your brain. It's so important important to fix that. It's very important and uh yeah I mean that's why I really feel we that's why you know I have so much motivation to work and build out Bullmain because it is really moving the needle for many people. If you can just escape the mental prison you can stop holding things in bare trend you buy things in early bull trend with a money scanner it's a lifesaver. I mean literally lifesaver because I mean let's be real if you are or coins are not doing well likely your family notices that based on your emotion emotional state based on how you are like it's it's actually really serious topic that's why we focus but anyway you get the point go to bullman.com and watch the video someone says I did a bit too late but um did it to fill in control accounted earlier now waiting to derisk. Yeah, I mean that's very important to be in control to be in control. It can always be that you know you start derisking and then it it starts pumping but that's why you do a bit at a time and that's I mean we go in depth in bulmania about it but it's uh it's you know how how to manage portfolio when uh everything is uncertain because that's the definition of market there's no certainty in the market everything is is uncertain like you could be unlucky you start risking we go to Valhalla right when you do risk it could happen you need to be okay with the with the strategy you take and and there are strategies specifically for for this But yeah, it's not u it's not um many people that understand it. Yeah, it's it's a we have a lot of work to do still when it comes to education overall in the industry. Um I feel for sure had many bad experience in crypto. No, no for man. No phone for no phone. No phone. I can no longer listen to N. No for man. F is going to get you wrecked, but you should be acting on early bull trends. I mean, it is what it is. You want to be early. So, not because of FOMO, but because that's where when the riskreward is the best. Um, so it's a strategy when something flips bullish, ideally you want to catch it early. So, let's say that Bitcoin continues pumping. Now, it is now bullish since one day and 19 minutes ago. So, for short-term trading, this is great because we are on the daily. Uh and yeah, if you use buy bit, use bionex with uh leverage, you can capture a lot. 4% with leverage can be way more. When it comes to long-term, we're still bearish. Very important. And uh yeah, for that reason, we're not uh we're protesting capital here. You see here, bullish. As as soon as Monero turned bullish, boop. Very, very nice. This thing pump and dump uh white bit two years ago. Fantising. Fatizing. Let me know if you trade it. I mean, do you use it? Like I I have such a a lot of this ex it's exchange right I say yeah I'm I'm on the conservative side here as soon as bearish boop chain link mega so yeah there you go be early in trends both when it comes to bull and getting out in bear that's it says Let's see. If I had listened to you, I would still have 150K. Oh, holy crap. You lost 150K. You say if I still if I listen to you, I would still have it. Holy crap. I mean, listen, you got Don't worry about number one, even if you do not listen in the past, it's uh don't worry like it's just look ahead now. Look ahead now and you're gonna easily make it back in the coming cycles. you will and I'm not saying that just to make you feel good. I mean literally it happens all the time. People get wrecked in one cycle then they buy NFT or whatever early bull trend they really go deeper into crypto they make it back in the next. Now the problem is many of them that also lose it in the next saying DJ gambler not learning mechanical that that's the problem but uh you're going to make it back if you see stay in crypto I think you're going to make it back. So just yeah keep keep being in crypto. That's it. That's it. That's how you learn to listen to I mean you you need actually you need pain. Exactly. I mean you you need the most of my lessons are in the pain. I know we need to hear when you do this again on October 8th when we had the fake fake peak right here. Very important. Yes, same crypto will make it back 100%. I mean it happens. It happened to many people I know also fully wrecked. I mean even in the last uh bear I know many people that got fully wrecked in the last bear made it back in in in this bull. Many of them have worked in crypto also. I mean starting to work in crypto is one way to to do it faster. Oh by the way guys I forgot to tell you. Holy crap. Go to bullmania.com jobs. We are looking for a clip editor. Okay, go to bullming.com/job. Click apply. Read everything here. Uh, what we're looking for and uh, yeah, apply. There you go. Uh, if you want to be working together, apply, apply, apply, apply. That's that. Bullman is the best. Yo, Krypto G, big shout out. shout out. What's your opinion on lots of prediction markets popping out now? Uh I just I mean my main is polymer market. I have no idea about that. I just use poly market. I know CZ is trying to uh outperform out compete launching on BNB chain in the bull market like in the actual when Bitcoin is bullish that's when it's going to be more interesting with the just from a token perspective the fact that you're going to have a new coin you know like unis swap was big CZ did pancake swap man pancake swap pumped a lot 2021 you remember so from that perspective it's interesting just from a like coin perspective will it be like that like with the Dexus in the past. I don't know, man. I don't know. Could be just like CZ tried copying copying Hyper um not Hyper Yeah, Hyperlquid. He did Aster. No one cares about it now. It was like a month ago or two or when it was two months ago. So, from a product perspective, I don't see how it's going to be interesting. Maybe it will. I mean listen in crypto you don't want to predict too much because things pump that that make no sense like Pepe dog with hat you know to be to try to think using your brain is bad being too smart is bad so I'm not even going to try to think here I can tell you what I use I use just poly market I don't use the other ones okay so maybe is it going to pump the coin who the hell knows that's it if they're going to pump the coin we're going to see it we're going to be part of it in the with the trend if they are in a big fat bull trend. So that's it. That's it. Don't overthink it, guys. Don't overthink it. Like the product, it's uh secondary. The only product that matters is Bitcoin, okay? That's the product that matters and it's doing very well. Everything else is just a ticker. But yeah, I mean I I've also missed a lot of opportunities by uh by being too smart, resisting meme coins. I remember I mean in 2016 like 2015 I I I was like bearish at Doge because I was like too smart for it or something. I don't know. It was dumb. I should not have not been bearish Doge back then. So if you're overthinking it is bad, man. It's bad. Don't overthink it. If it pumps, it pumps. Respect the pump. And as a uh lesson to myself, I coined the term respect the pump in all assets. That's it. And crypto is the only industry where exactly where you can say I was wrong because I was too smart. That's the only industry where being smart is bad in many cases. Well, overthinking is bad. You have to be on the right curve when when you also have a the the left curves the retardios they they make money right curve the smarts who know to act like [ __ ] they make money and then the mid curve they make no money or who overanalyze I remember I spoke with a guy he worked in a bank very smart guy this was in 2021 2020 he really was overthinking smart contracts I remember I tried to explain to him many times how it like he was so negative toward worth it. Like he he was a smart dev but he really could not understand smart like listen why why are you overthinking can you can have trading on sh like why no he has so many reasons why it will not work see too smart is bad man it's bad for your entrepreneurship and he was like a smart dude like bum bum bum bum bum programming but I thought okay maybe this guy's going to get more contracts he's a developer he he did not get it man he did not get it be smart enough to sound like you're exactly that's when you're on the right curve. Zach is saying, \"I learned the hard way. Love how the love how this went from staying crypto to a job offer.\" You legend Ivan your best. Big shout. I appreciate appreciate it. Do you like my cho ch ch ch ch ch ch ch ch ch ch ch ch ch ch ch ch ch ch ch choes to reenter Ada s. Well, I mean, only if they're in a bull trend. Currently, I don't think any of them. Let's Let's check Saul. How far is it? How far how far away? But for for now, take it easy, man. Take it with soul is at 177. There is a bull trend. I I wouldn't touch it before then. Um with ADA, let's see other USD. And you know, some people say, \"But I haven't should I buy if I still believe long-term?\" No. then you just buy Bitcoin for long-term you know for long-term belief just Bitcoin why because everything else goes to zero against Bitcoin longterm so if you want for long-term belief then it's Bitcoin it's not like ADA because again they go to zero versus Bitcoin ADA gets bullish here 06 so yeah I wouldn't touch it until then the big opportunity is guys is when uh Bitcoin bottoms out and you can get into new altcoin trends that's a big opportunity When Solana went from $8 to 300 after Bitcoin bottomed out, that was the opportunity. Yeah. There you go. What happened to Soul? We're out of soul since October. But like we discussed like yesterday and two days ago, I'm very bullish. Soul tech tech wise. I mean, we just saw today also, but since October 8th, I'm out from most old coins. Why? bare trend soul and other ones only bullish in a bull trend. when Bitcoin is in the bull trend. So when sold was $8, it went to eight to 300 from 8 to 300 in the last bull, it did more than Bitcoin. So that's the opportunity. So that's why when Bitcoin bottoms that's the time to go into soul and other and uh I but ideally the see if you let's actually see soul versus other the cycle soul since the bottom of the bar. There we go. I don't know what it is but Charles cannot pump it. I mean this is Sana versus Ada. Slana has killed Ada. Basically, if you bought here at the lows, this is when Bitcoin bottomed out, guys, here in like early January. Oh my god. Soul is up like the 1300% versus ADA to the top. Oh my. So, you know, it's not they're not in the same league even. They're not in the same league. some some for some reason people think you know they're like the same you know you have cola Pepsi ADA man it's not the same it's really is not the same let's okay let's measure we can measure from another point in time let's measure from this low just to here where now then it's th000% 900 let's measure let's measure from this alltime high here in 2021 so not even from the low from like the alltime high and not and not to the high but to here it's still 140%. So yeah, I mean how you turned and twisted ADA has not even been in the same league as all this this cycle. That's why on Hyperlid those wallets that are between minus 100k loss and a million loss are called other holders here. It's for a reason. And then those that lost a million or more are wrecked less. There you go. There you go. Evan, is possible to track NFCs with bullish bearish? Technically, yes. But, uh, it's like almost not worth doing it because there's not too much trading going on in NFCs. Um, so we added, for example, we added the ETFs now because their actual uh pumps are happening with this. I think we could get it uh also but let's see if I go to open C. Why is it bare here? Is the coin bare? Why is see even open C they become a deck for normal coins? Yeah, I mean guys not too much is happening here. It's going to be too much work for not too much uh gain. It's like Crypto Pank Ape and P and that's it. Oh, what is this? Gary V pump and dump V friends. How does it look is bullish? What? What's happening? Holy crap. Yeah. From 40 E to 18. Holy crap. Yeah. Ah, this is the average. I guess this is the average. Okay. the average from 30 average 30th to 28th. Yeah. No guys, I mean right now NFTs just look at the freaking line. If it if it trends up, you keep it simple with NFTs like it's it's uh too too few collections like we're going to track like four correction collections or what uh it's not there uh time. I think at some point we're going to add it because again bullmania is this 360 tool. So you can have everything. You have the NFTs, you have tokens, you have ETFs, you have every. So, we're going to add it at some point, but uh no, we don't have it now. Also, I'm not trading myself NFTs. I just have the pad penguin and that's it. So, I just want to build everything that I need because that's the best way to build a product. You build for yourself. Um and yeah, and then we're going to add NFC. Do you actually trade NFTs? But why do you want you trade NF like buy you hold them or you want it more like for hoping that your NFC is going to come back? you want to check if it's bearish or or you actually trade or you just want to see how wrecked your NFC is or or maybe it's pumping I babanka. What do you do with the beanies? Beanies are for fun and community. Well, they're just for fun. right now. For now, for now. I What do you think about stable? What what to do with your stable coins? I'm scared to put them in a just to get 4%. Yeah, I mean, good question. Uh, Vitalik actually had a whole post on this. What to do like the stable coins are bad and so on so forth. Uh, let's see. Vitalik, let me open it up. But all in all, AVA is probably super safe, but again, probably who who the hell knows more contract you get 4%. It is better than having it in like a centralized exchange. So that's better. And if something happens to a likely will get like bailed out by the industry anyway. So but it's a bit of a risk. And Vitalik is saying that we need decentralized stable coin. We need decentralized stable coin. He's pushing for decentralized stable coin. He doesn't really have anything concrete. He's saying that number one, we should have stable coin that is not tracking the dollar because we want to be disconnected from nation state. Number two, we need to fix this technicality that oracle cannot be gamed. And uh we need to have uh uh some solution to the fact that staking yield is competition. Not really sure what he means here. If you don't have three, then again you have a few% API suboptimal return rates, which is quite bad. possible path solving three treat this as enumeration reduce taking yield written ah yeah okay okay I get it I get I get I get it I get I get I get it I get it he's basically saying that sometimes okay so this what he's saying the way that um uh the ETH and stable coin yield like the relationship with them it's quite interesting because if the ETH yield you get just by taking ETH is higher than what you get with stable coins, a lot of capital is going to flow to ETH and that in some protocols it may be an issue that you have this you know a bunch of capital just leaves the protocol depending on how you structure the protocol it may even have issue with the stability of the protocol where where a bunch of uh money like instantly just goes and stakes ETH instead because if you have money you want to optimize it. So if ETH is a bigger um is is more yield than stable coin protocol, you're going to have moves there. You're going to have capital move there. So yeah, reduce create new category of staking which has yield almost as high as regular staking but which does not have the same slashing. Anyway, you can read more. There is no solutions. He just wants to have a better decentralized stable coin. So it's a bit of tech mambo jambo. But it's also another thing with um uh with uh yeah with with stable coins as a whole. Not just that the yield is risky. Holding stable coin is risky. They're either decentralized or semi-entralized. There's no true decentralized one. Okay guys, let's do last one. I'm kind of falling asleep here. But everything for the showbiz. You guys wanted this time zone. We're here. We're hustling. Last one. Last one. Where is I? I have no water. Like even even water. We see I need more Bjoni. Where's Bjoni? There's It's not here. I best stable coin to hold USDC or USDC. I don't know, man. Uh I I have both. I I don't trust any of them. But you kind of need both. None is good. USDT can blacklist you. They can uh freeze your wallet even if you have in cold storage. USDC can also do it. So and D is I guess a bit better but is backed by USDC. So if government wants they can freeze USDC backing D and yeah that's a problem because if you have D then you are exposed to that attack on D. So what do you want? Do you want to be exposed that the government goes after you specifically that they freeze your account specifically? Because that's the risk in USDC and USDT if you hold the native coins. That's the risk you have that someone in the government says, \"Hey, listen this wallet ban it.\" Tether insta banan. That's the risk you have with USDC USDT. With D, it's a different type of risk where your die coins, they cannot be frozen, but the whole freaking D backing theoretically could be frozen. Well, part of it which is USDC which is quite significant that can be frozen. So yeah, I don't know which one is better. Here someone needs to target you specifically. Here someone needs to target uh die. Here you have maybe bank goes under like it kind of did last bear. You remember signature and what what's silver gate? What was the other silvergate? I don't remember. No, the banks that went collapsed. They had USDC's funds. So yeah, it's not too good. That's why that's why Vitalik is saying we need solution. We need solution. We need better stable coin. decentralized stable coin. Yeah. So there's no solution and uh that's why from that perspective it would be very nice if Bitcoin either goes into 200 to 200 week moving average so we can buy there or above the 50 week so we can we can buy there so we can stop holding too much uh stables. It's a problem. Yes guys yes it's a problem guys that's it. Thank you so much for being here. Thank you for contributing to the show. Uh big shout out to who? to Matt for time us today. Smash up the like, subscribe to the channel if you haven't yet. Uh, check out bullmania.com if you want access to the tools. If you want to catch the big pumpamentals such as Dash, one day ago flip, boom, 92% print. Uh, this paladium thing, three days, boom, boom, 58% flip. If you just look at a few more, yeah, you you look in the last, let's say, three weeks, you have even bigger ones. So, to get all of that, go to bullming.com, watch the free training, then go to bulling.com/charts. If you want u uh this, just set it as your homepage. So, every morning you come here, you can check the bubbles, you can check crypto prices, you can check global asset ranking, fear and greed, you can check the news, basically everything. Because the reason why I do this website, as you know, is that I don't want I don't want to check like a million websites every morning. I don't have a million tabs open. I just have one tab. It's booming.com/charts. This one is fully free. And whenever I'm thinking about some chart that I haven't put it put here yet, I just put it. You can see Fed balance sheet right here. You can see global liquidity like ECB balance sheet and everything in here. Also, you can see dollar index. You can see ETF inflow, daily. So, you don't have to go to a million tabs. It's actually fantastic. Pump fun. You can see the state of trenches how much pump fun is making. I am so on the support guys. Smash it up. See you tomorrow. Have a good day and goodbye guys. Goodbye. Goodbye. Bye."
    }
]