[
    {
        "video_id": "GujIpBbxpj8",
        "title": "The Future of AI Trading",
        "published_at": "2026-01-31T15:41:03Z",
        "sort_date": "2026-01-31",
        "url": "https://www.youtube.com/watch?v=GujIpBbxpj8",
        "transcript": "Essentially, it doesn't matter how accurate LLMs are trading today because tomorrow more capital will be controlled by them. So, the first to adopt and trade around the LLM metas will make the most. Unless, of course, they pivot to turbo dumping on each other, which they might, which they might. But the truth is that LLMs as trading strategies are growing and the ability for them to influence markets will grow as well. This is just something I have in the back of my mind. It's not actionable as to how to like make money with this yet, but it's something that I am very focused on, right? is how can we be early to these potentially mega trends? And I think that this is a framework that I'm not 100% sold on yet. I think that it's a possibility. I don't know when this happens. But as more and more people say, \"Oh my gosh, this assistant does so many things better than me. It's unemotional. It sticks exactly to trade plans. It doesn't need to, you know, deal with its uh excitement or fears. It can just stick to and execute plans.\" I think it's very interesting to know whether the LLMs will eventually start outrading everyone, not unlikely, and then eventually start controlling more and more",
        "summary_hu": "A LLM-ek (nagy nyelvi modellek) szerepe a kereskedelem jövőjében egyre növekvő jelentőséggel bír. A piaci trendek változása és a tőke LLM-ek általi ellenőrzése kulcsszerepet játszik a kereskedési stratégiákban. Az, hogy a legelső adaptálók profitálhatnak a LLM-ek fejlődéséből, kiemelt fontosságú, bár a jövőbeni hatások és a piaci manipulációk mértéke még nem világos. Az érzelemmentes kereskedés előnyei, mint a feszültségek és félelmek elkerülése, szintén fontos faktornak számítanak. Az LLM-ek hatása a kereskedésre várhatóan nőni fog, ami új lehetőségeket teremt a befektetők számára. Az LLM-ek lépéselőnybe kerülése nem elhanyagolható, és figyelmet érdemel, ahogyan a piacon való szerepük kifejlődik.",
        "summary_en": "The role of LLMs (large language models) in the future of trading is becoming increasingly significant. Changes in market trends and the capital being controlled by LLMs are crucial elements in trading strategies. The advantage that early adopters can monetize from the advancements of LLMs is notable, though the extent of their future impact and potential market manipulations remain unclear. The benefits of emotionless trading, such as avoiding tensions and fears, are also a key consideration. The influence of LLMs on trading is expected to grow, creating new opportunities for investors. The possibility of LLMs gaining a competitive edge should not be overlooked as their role in the market develops.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 50,
        "key_points_hu": [
            "LLM-ek kontrollált tőkéje nőni fog a jövőben.",
            "Az első adaptálók nagy nyereséget realizálhatnak.",
            "Az érzelemmentes kereskedés előnyei fontos szerepet játszanak."
        ],
        "key_points_en": [
            "The capital controlled by LLMs will increase in the future.",
            "Early adopters may realize significant gains.",
            "The advantages of emotionless trading play an important role."
        ],
        "main_topics": [
            "Influence of LLMs in trading",
            "Capital control by AI"
        ]
    }
]