[
    {
        "video_id": "a6uO4j3H5uY",
        "title": "Saudi Arabia opens its stock market to the world tomorrow #shorts",
        "published_at": "2026-01-31T18:30:00Z",
        "sort_date": "2026-01-31",
        "url": "https://www.youtube.com/watch?v=a6uO4j3H5uY",
        "transcript": "Saudi Arabia is opening up their stock market to the public, basically outside of Saudi Arabia on February 1st. And that's correct. So on February 1st, Saudi Arabia opens up their market, opens up their stock market to the world. So you can invest even if you're not from Saudi Arabia. The same thing happened in China a long time ago. But when China opened up to the world, the stocks skyrocketed.",
        "summary_hu": "Szaúd-Arábia február 1-jén megnyitja részvénypiacát a globális befektetők előtt, lehetővé téve, hogy külföldiek is részesedjenek az ország gazdaságában. Ez a lépés hasonló a Kína korábbi piaci nyitásához, amelynek következményeként a kínai részvények drámai emelkedést mutattak. A nyitás várhatóan növeli a tőkeáramlást az országba, ami biztonságos környezetet teremt a befektetők számára. A részvénypiac hozzájárulhat Szaúd-Arábia gazdasági diverzifikálásához, különösen az olajiparon kívül. A külföldi befektetők érdeklődése új lehetőségeket biztosít a szaúdi vállalatok számára. Figyelemmel kell kísérni a piaci reakciókat a nyitás után, mivel a kereslet és a befektetői bizalom kulcsszerepet játszik a részvények árfolyamának alakulásában.",
        "summary_en": "On February 1st, Saudi Arabia is set to open its stock market to global investors, allowing foreign participation in its economic landscape. This move parallels China's earlier market opening, which saw its stock prices surge dramatically. The opening is expected to attract capital inflow into the country, creating a favorable environment for investors. The stock market could aid in Saudi Arabia's economic diversification beyond oil. Increased interest from foreign investors can also present new opportunities for Saudi companies. Market reactions post-opening will be crucial, as demand and investor confidence will play significant roles in determining stock price dynamics.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 50,
        "key_points_hu": [
            "Február 1-jén megnyílik a szaúd-arábiai részvénypiac",
            "Külföldi befektetők is részesedhetnek a piacból",
            "A nyitás hasonló Kína korábbi tapasztalataihoz"
        ],
        "key_points_en": [
            "Saudi Arabia opens its stock market on February 1st",
            "Foreign investors can participate in the market",
            "The move resembles China's previous experiences"
        ],
        "main_topics": [
            "Stock Market Opening",
            "Foreign Investment"
        ]
    },
    {
        "video_id": "F3Cgt1tHjfI",
        "title": "BITCOIN AND ETH: GOING LOWER RIGHT NOW!!!! SILVER COLLAPSES 40% 🚨🚨🚨🚨🚨🚨",
        "published_at": "2026-01-31T17:42:58Z",
        "sort_date": "2026-01-31",
        "url": "https://www.youtube.com/watch?v=F3Cgt1tHjfI",
        "transcript": "Oh yes, oh yes, oh yes, oh yes. Guys, welcome to another episode. And as you can see right now, we're falling. We're falling. We're falling. We're falling. Bitcoin is falling very rapidly. Just as we click the stream button, we're going below 80K in real time. Now we're above again. But the question is when will it stop? And if you watch this channel, you know the answer. We're going to pop. Bitcoin is going to pop up in real time, which is at 200E moving average. and within 10% of of 200 week moving average we will be buying and buying with with size. I don't want to repeat too much but everything has been going exactly as we have been predicting it. It's been quite insane. I mean guys isn't it quite it's been quite insane. We've been de-risking since since October 8th. Also I added now to the timeline here that we said be careful with gold and silver. Be very very careful. And uh yes indeed silver has fallen 40%. Basically 40%. And we've been saying, let me play you this. This is basically from January 2, 27th and January 28th, we've been warning, warning, warning, warning, warning. Listen to this. And in silver, normally when the parabola ends, it is quite brutal. There is never a period a period where silver just goes up without coming to some kind of moving average. So if you are fully outside of silver, now is not really the time to be super forming. And with highest likelihood we will have a pullback in silver towards the moving average. The question is of course when you never know that but I just see so much formal let's say the moving average goes something like this uh depending on when we touch it. So you guys all remember this was 27th then on 28th we said the same thing and listen here are the people who were writing that Ivan you don't understand fundamentals Ivan you don't understand the silver new dynamic dollar is h going to hyperinflate but guys there's nothing new under the sun everything is repeating and when people are saying that silver is going to hyperinflate the dollar I've seen it too many times and in the beginning I believe that kind of stuff I mean in the beginning when I entered markets and someone said hey you know bitcoin is going to hyperinflate the dollar like this month or silver is going to hyper inflate this month and dollar is going to, you know, go go to zero. You know, it's likely somewhere around the top. It's impossible to say exactly when the top is, but I think we nailed it pretty nicely. And silver fell basically 40%. Now it's back up again. But this is the danger with silver and with gold when you're not part of the early trend, but you're trying to jump on on the train too late. So guys, Bitcoin down, silver down, gold down, everything is down. The star of the show is the dollar. Currently the dollar is the star of the show and as 360 investors who are both in crypto in stocks and ETFs in all assets we have to see things straight. I mean it is one thing to repeat over and over again that the dollar is hyperinflating hyperinflating hyperinflating and just be in that tunnel vision hyperinflation scenario mode but in reality what's happening now is the dollar is likely going to strengthen now over the coming weeks because it has been so hated. It has been insanely hated. Dixie has been going down. There have been all of these fears that it's going to hyperinflate and uh if you just zoom out you see that nothing too bad has happened to it but still people were so afraid so afraid. So afraid now it's coming back up. It was at the lowest Dixie was at the lowest at 95. Now it's back to 97 and pumping back to the upside. So let's see what's going to happen here. I mean my expectation here is that dollar will continue to strengthen and it's going to basically play us in the hands because uh we are expecting Bitcoin to go further down here towards the 200 week now that the breakdown seems to be confirmed. We still have one day left in the week guys. I mean maybe something crazy happens and we pump back into this range which we have been in since November. There's still one day left. Maybe it's going to happen. I don't think it's going to happen, but you know, who knows? [laughter] Maybe there's going to be a miracle, but most likely we're going to close the week somewhere here. Then it means that the the breakdown from this formation is confirmed and the target of that uh breakout is going to be the somewhere here at around 200 week moving average and our buy orders are going to start hitting here around 60k 62 61. Why? Because it's within 10% currently 10%. Now, if it takes a longer time to get to a 200 week, then we're going to be buying even sooner because 200 week is going up through time. So, if it takes, you know, a few weeks or month to come to come there, we're going to adjust. But the way it looks now, the buy orders for us are going to be starting here at like 61 62. So, if you want to follow that uh subscribe, subscribe. I mean, you should have been subscribed since October. If you're not subscribed since October, you missed most of the uh most of the moves here. Uh maybe you've huddled altcoins down 80 90%. Listen, it's fine as long as you learn your lesson, as long as you take all of the wisdoms that we give you here for free on this channel every day and you apply it in your daily life because the next cycle is going to get crazy if we go to 200 week. I'm super bullish Bitcoin, guys. If we go to 200 week, it is the best thing that can happen ever for Bitcoin. If you want Bitcoin to 1 million this soon as possible, it needs to go to 200 week. Shake out everyone. Get all of the holders wrecked, mega wrecked. So the hope in their eyes disappear and they sell at the bottom like they always do. Huddle down 80%, diamond hand 80% minus sell and then the bull market starts. Why? Because you were the last hodler. When the last hodler sells, there's no one else to sell. No one else has left to sell. So that's that's a classic classic. And of course, if you want to learn it for real, then go to bullmania.com and watch this free training about the mechanical rules because just like with silver, just like with Bitcoin, I mean, you see, this works in in any asset. If you go to bullmania.com/ivan, you can see my track record here public with expos. You you can see exactly that. We called the silver uh right before the peak. We've been calling crypto right before the collapse. Meanwhile, your favorite influencer was probably saying, \"Ah, 40x altcoins are going to go 30 30 40 50x THEY'RE GOING TO GO and then bam, they're down 90%.\" So now for them to even return to where they started, they have to go 50%. Or your another favorite influencer, Twitter roar, was telling you that you know ISM business cycle what happened. You see what happened? So all in all, our message here may not be the most popular because it's not what people want to hear, but it's the most accurate, the most true, the most profitable, and that's the only thing I care about. We need profitability. We need bull mania in our lives, in the portfolio. And sometimes for bull mania to remain in our portfolio, we have to be riskoff. We have to be a bit bearish. Doesn't mean that we're forever bearish. We're here to ensure that portfolio is up very nicely in a vertical shape as much as possible. And that's exactly what we're here to do. Now guys, looking at the Sana guys. Sana. [laughter] Sana. Oh, coming to 100 guys. Coming to 100. Coming to 100. And you know my one single wish is that Sana falls to 30. We're going to be buying Sana at 30 here with a lot a lot a lot with big fat size. Okay. Sana chicken coming to roost. Uh, Bitcoin coming to Papa and Sana coming to 30. If this if this is going to unfold like we wanted. Okay. Now, nothing is guaranteed. We don't know if it's going to go to 30, but man, if it goes like like it's going now, it's going to be it's going to be fantastic. It needs to lose just another support here. It needs to smash below 90. Then we're going to get our very very nice 30. [laughter] Let's see, guys. Let's see if it's going to happen. Let's see if it's going to happen. Also, who who can guess this song? Do Do you guys hear the song? Who can guess this song? It's a bit classical. If you don't If you're uneducated, it's not for you. If you're a bit educated, maybe you understand it. Let me know. Not Nutcracker. Exactly. Darth, who is it? Brooks, big shout out. The most educated person on the stream. Okay. So that's that. The world is going to be very beautiful if Sana goes to 30. It's going to be fantastically beautiful. If if it goes to 30 kind of like the music. Okay. Now uh if if if uh I mean you see yourself kind of has a bit of support here at this 200 but see for if 200 week 50 week it doesn't matter because they're there they're flat. If you know markets uh and it's fine if you don't know I can tell you here so you know when the moving averages is flat they don't matter it's u like it's not a signal because crossing moving averages means that trend is shifting but when they're flat there is no trend they're just sideways if you have a stable coin the moving average is always the same so it's flat the same thing when you have a sideways chop moving average is going to be the same also so yeah you understand that in this situation this 200 week, 100 week, 50, all of that doesn't really matter too much for ETH. ETH is just in a big fat range here, okay? And it's kind of wanting to go here to the lows. So, we're going to be buying it here. Now, guys, let me speak a bit about what's happening with I mean just this notion that there is nothing new under the sun. If you look back at the last week or two, people were saying that dollar is going to hyperinflate. Now many people also made the mistake that we flagged in this uh in the streams and they started to treat um gold and silver as fiat meaning that they started to like measure their wealth in them. They started to like move all dollars to to silver and gold. I mean I know many cases where people got super wrecked because of that. And if you remember on the streams we had this questions Ivan should I just you know instead of tether should I use like gold? Should I put everything in gold? And if you remember what I told you silver and gold they're assets. they they are in a bull trend then they're in a bare trend they're super volatile so don't really confuse them with fiat fiat is what you measure in okay and gold is you can trade it you can trade it I know it goes against like people are saying that gold is real money this and that but all of this is platitude all of this is just language and it's not practical for you if you start treating Bitcoin and silver as the measuring stick it's not going to be practical for you you likely the only the only time you will want to measure your wealth in silver and gold is at the peak because what happens then in all cases in all cases when silver and gold pump a lot they also dump a lot I mean they go to moving averages we've been speaking about it a lot but you know when when it dumps no one wants to measure their wealth in silver you know when silver goes like this like it did in 2021 and two like no one wants to measure their wealth in silver when stock market is mooning in dollars and you're there silver silver is down down down there there are only very few people who are really like gold bugs and silver bugs they're ideologically convinced only they for them it makes sense to measure their their wealth in silver but I mean for most people they start measuring here because they get convinced that silver is real money everything else is fake money and then bum bum BUM BUM BUM BUM BUM bum bum okay and then do you want to really measure everything in silver when silver has dumped how much it dumped from here to here silver has dumped oh my 80%. Let's see here in from 2011 it dumped 80%. You really think that average plebe who at the peak got convinced that dollar is going to hyperinflate and now he's measuring everything in silver and his silver is his main money. You think he's going to keep measuring everything in silver when it fell 80%? Like listen, he's going to panic sell way before that and I see it over and over again. So guys, there is nothing new under the sun. Dollar is not going to hyperinflate because it's such a such a cornerstone of the economy that if it h it's like it's not in anyone's interest. I mean that that's maybe the the conclusion. There is in no one's interest that it's going to hyperinflate this quick. It's not in China's interest because China trades with the US more than with any bricks. So all in all, it's not in anyone's interest. That being said, it goes to zero slowly through time and that will continue to happen. But this is why I wrote silver boomers are going to learn a lesson about parabas. We cryptodigians know all too well. All too well. This was before the big crash. But um it's it's important. Uh there's nothing you understand. likely is is just going to be like like it always been that you have a big pump you can ride the trend and then then fito and uh yeah I mean people always writing big shout out to this guy curillo fire lai you should check the fundamentals this is not crypto don't compare 2008 to 2026 and then what happens silver goes exactly like crypto like a freaking shitcoin okay goes like a shitcoin [laughter] the guy was like oh don't don't think it's crypto what do you mean like it's a shitcoin Okay. [laughter] What store of value? What store of what you speak about? You know, store of value. Okay. Store of value. Okay. Okay. What store of value? What do you mean? So, listen. It's just another asset. You trade it. You don't date it. Trade it. Don't date it. It It's in a bull trend. You trade it. Do you date it? You don't date it. Now, the only thing where it makes sense to date it is in case you are really serious about your long-term portfolio, you just want, you know, tail uh tail risk protection. meaning that um you know there are some risks that are very low probability that may theoretically may happen for example dollar hyperinflation it is a very low percent I mean likely it's not going to happen but it may I mean listen there is always a few percent so the place for silver in a portfolio is to have 5 to 10% I mean gold and silver as a as a class precious metals in case hyperinflation happens because then if you just have 5 to 10% in gold and silver let's say hyperinflation does happen out out of nowhere. Well, then they're going to pump, you know, 10x, 20x, 30x, whatever, they're going to basically save your portfolio. Your wealth, the wealth is not going to be destroyed. It's just going to migrate into gold and silver and you're going to get your portfolio back basically. I mean, that's the that's the proper way. If you want to date and marry silver and gold, just put five to 10% in your portfolio. That's it. That's it. Otherwise, it is a tradable asset. You trade the trends and you're out when the trend is bearish. So now we're out that the trend on the daily is bearish and u let's see on the weekly I think it's it may still be bullish on the weekly because we're right on the I mean we're right on the flip here. We're right on the flip but already now I started to ladder out. I did I said it on Twitter. You can read more about if you go to booming.com/ivan you can read more about the plan here with the silver but on daily it's bearish. Uh it's this is I don't like this. I don't like this uh candle wick very ugly. So for me it's enough to start uh lathering out. Uh but potentially potentially it can still you know derp around here a bit. Uh maybe even continue. I mean let's see. But it's it looks very ugly like this candle. I don't like it. And based on the daily trend I already start to take action. And then once the weekly also closes is going to be just another confirmation to uh to derisk even heavily. And now the question is okay what now? What now? You know what what now? What now? Uh silver fenito gold fenito I mean with high likely we never know but lading out starts actually started yesterday not today. Uh so what now? We wait for the next bull trend. Bitcoin could be the next bull trend. It still has to go to 200 week for us to be super comfortable to buy it. But that can be quick guys. I mean listen I think now I mean you see yourself how much is left to to to our buy zone. I mean isn't it excited exciting guys? Aren't you excited? I'm very excited because within 20% Bitcoin dump we we start buying is people have been asking Ian when bull when Ivan bull when Ivan bull we exit around 125 that was when we started to derisk and soon we can get our entry at with within 10% of 200 moving average. is it's the best. Like it's fantastic. And so all in all, we're going to be bullish again at at that point. We're going to be starting to accumulate. I mean, I'm so excited, guys. I I don't I'm so excited that Bitcoin goes back to an area where it is like cheap as hell and you can start buying now with I hope it's going to be quick like this. We don't know if it's going to be quick like maybe, you know, maybe it comes back here and then it gets rejected, you know, maybe. I hope it's not like I hope it's fast, guys. I hope it's fast so the next bull market can also start faster. Then once we again we have a known risk here and that's that we're going to start accumulating here. Okay, within like 10%. Uh Bitcoin may fall like 20% below 200 week. So we we just know that listen we have like a 30% risk here potentially just based on the previous bare market. Sometimes it does go like you know 20% below the 200 week. It can happen. It can happen. But uh I mean I'm happy with that. I'm very happy with that. I mean, listen, it's the the idea is not to buy the exact bottom is to buy something which is super riskreward adjusted. And uh just as I'm speaking, by the way, Bitcoin goes to Papa in real time. It takes the subway straight to Papa. It goes even lower. I love seeing that. So, let's let's hope it continues. And Sana also also goes straight to Papa. Now, guys, man, if Sana goes to 30, holy crap. I mean, [laughter] I I don't know what to tell. Now, people also ask, what about Avox? What about other stuff? The thing is I don't use Avox so I'm not you know as excited as Sana because with Sana it has a special place in my heart because I am using it a lot like that's the thing I'm using it a lot so if it's if it goes to 30 like it's going to be irresistible for me to buy when it comes to even if it's in a bare trend I mean even if bare trend at 30 I'm going to be buying it with Avox I don't use it I don't remember last time I used AX guys I don't yeah and when I use it was with like $5 I haven't done anything significant and it's kind of going to all And so here with Avox, I will not be touching it until it is in a confirmed bull trend just based on my you know I don't use it. So it's it's just going to be I don't want to be front running anything because I'm less excited here with Solana like I'm genuinely excited to be a big fat owner once uh the once we are at 30 [laughter] I I'm going to be loving it with with Alex. I mean, even if it's cheap, like I I don't know like how many users they have, is it all fake? Because I don't use myself with Solana. I I use myself. So, I know. I know. I know many people in the in the in the comment section, you guys always say Ivan Solana is on and off. I never had issues. Never had issues. Never had issues. Like some of the ETH bag holders never tried LIKE IVAN IS BAD. IT'S BAD. Then they have L2 fully centralized always up and down like on and off. L2 tokens. Look at optimism. Look at arbitum down only. Basically scam. Not really, but kind of. And then asana said, \"Listen, okay, I I don't want to debate. I just know. I mean, I know my truth. I know my truth. I use Salana a lot. I'm a use case enjoyer.\" Okay, I'm a use case enjoyer. You don't have to follow me. You can do your own thing if you don't want because there's always someone. So, guys, that's that. That's that with the with the Soul, with the Avox, with the ETH. Uh, what else we have? What else we have? Zcash, guys. Again, nothing new under the sun. Bear trend means bare trend. Bear trend means out. Bear trend means GTFO. You remember Zcash? We said write the bull trend but it is working against gravity because Bitcoin is going down. Bitcoin is in a bare trend. Be careful. Be careful. Be careful. So yeah, Zcash basically has no support. It has a bit here very low support. Other than that it may go to like 170 quite fast. I mean where is support? It just like this week it lost this support. So where's the next one? Maybe you can say this one. It's a bit uh so yeah if you uh want to short currently there are many shorting opportunities and if you want to learn shorting for real go to bullmania.com watch the free video it's in the link below so you understand how it works because if you look at our members here Gio just posted that he shorted render uh nice 21%. This was just, you know, one one few hours. A few hours. Uh then let me show you another one. I mean, most of the gains that people Here's another render shorted at 4x uh because it went um it went bearish uh in the in in the system here. Yeah. Oh, Supreme Governor. My Supreme Governor is back with another one. This is from our Discord Bull Mania. Using the mechanical rules, using our strategies shorted ETH 25x but with see with risk management with high stop loss. This makes sense. This makes sense. I mean, most people they just lose money uh using this kind of leverage. But if you know mechanical rules, if you go to booming.com, it makes sense. So here, 60% just, you know, having a short from this to this. Very, very nice. Uh then let's see, we have more. We have more I want to share with you so you understand that like it's micro strategy short the crap out of sailor the the ponzomic or whatever it is. It's from Mooncat. Big shout out to Mooncat as well in our discord. Shorted very nicely 10x. Nice 40 41% gain. And again it's not like you know you have to wait a long time here. Uh what is this? Seeker SKR short passive in up 41%. Nice. And this is I mean this from yeah you see here yesterday this is just in the last like I'm sharing the gains from our community in the last uh uh 24 hours. So all in all guys if you want to join bullmania.com uh watch the video and also go to bullmania.com/partners so you get all of the exchanges so you can go long you can go short. You be you have big fat signup bonus. By next big fat sign up buy big fat you can go long or low anything any any asset gold stock uh what you want the the NASDAQ uh S&P 500 what you want my Fred it's there in the boom.com/partners or exchanges I you like in the description it says exchanges I use so click there now guys inflation inflation one of the reasons we're dumping we're dumping is because inflation coming in hot 3% inflation PP PPI should have been 2.7. That was the expectation. So yeah, it's dumping also because inflation is high. Guys, guys, guys, breaking news. Researchers at MIT have discovered the leading cause of the rapidly rising divorce rates worldwide for couples aged 25 to 65. And then it's a picture of Tomley. [laughter] Yeah. Yeah. It's a wife changing money. If you follow Tom Lee, you got wife changing money, but it means that wife changes you. Okay. [laughter] This is the problem. It's the problem for many dudes hope it's going to be the other way, but it got the other way. They got [laughter] it's problematic. Now, uh, see, I think he predicted 180, but we got 80 [laughter] at the end of January. I believe his prediction was 180, but we got 80. January Tom Lee. Let's see. 180. Or what was it? It wasn't 180K. [snorts] Uh, let's see. Let's see. Let's see. New record. New record. Uh, January 2026. Oh, now he just said alltime high, but I I swear he also said it's going to go to Yeah. Yeah. Yeah. Here, here, here. Guys, we got 80, but it he said 180. Maybe he got confused a bit a bit, but at the beginning of the month, he was saying what he was saying. Let's see. 180 when it doesn't say. Anyway, but we got 80. [laughter] I love it. I love it. Now, guys, we made a lot of videos about Tom Lee. You can check it. I mean, I don't want to repeat myself, but all in all, you follow the price, not some narrative, not some business cycle, not some just follow the damn price. I mean the trend is there. It's bare. It's been bare trend. We've been bearish. U if you have some other explanation why we should pump. In most cases it's not valid strategy to trade on. You will get wrecked. You will be hoping that they continue to tell you the same thing. And then you wake up one day and now he's bearish. I mean Tom Lee for the last weeks he's been bearish. He said the stocks are going to go down, crypto's going to go down. And what happened to your strategy? It was Tomley strategy but he now changed his mind. What do you do? You don't you don't know anything. Should go to bullion.com otherwise. Anyway, so what else we have? Uh, now here's something that does make sense. I actually agree with Tom Lee on the fact that Bitcoin should really fix the quantum resistance and and prioritize that. Here here's where I do agree with him because it is a bit of a weakness that investors take into consideration into risk consideration. Let's say I'm an investor. I just want something for the coming 100 years just as a protection in my portfolio. With gold, man, I know it's gold. It's not going to change. with Bitcoin. If I want something for the next hundred years, it doesn't really work in its current state. Why? Because of quantum. It's not quantum secures. Listen to this. Wait, wait, wait, wait. >> This is what Tom Demar actually is expected. So, he's been hired as an adviser at Bitmine. And he actually told us Thursday was an important day, and it turns out today was an important day because we've had a big decline in in crypto. Um, but this is more akin to the end of the selling, not the beginning. So, >> so you don't think like lower? >> Sorry. >> For instance, maybe I played the wrong clip. I I I think he was supposed to say about quantum here. One sec. Ignore like what he just said is top retardo. How you know is the end of the selling. How you know? You don't know. Ignore it. Remove it from where he said about quantum. >> Ethereum might go to 2400. It might go to 1K. It It might go to 1K, >> but it's a touch and then that's the bottom. >> Oh my god. Okay. Sorry. Sorry. I mean, this is peak retardo in the bull market. He's going to be the smartest man ever. In the bare market, he's peak retardo. I mean, he he cannot he cannot um adjust. Okay. Sorry guys. I thought he was he would speak about the uh the quantum. Maybe I played something wrong. Anyway, ignore that clip fully. It's it's not good. Uh guys, that's it. Let's go to Q&A questions, answers, debates, discussions. Um, and uh, yeah, all in all, very excited. We're very excited. Bitcoin is going in the correct direction down to Papa. We are waiting right here around 10% from uh, 200 week. It's such a clean break. Bulls still have one day to recover it into the range. They have to pray hard. If you're a bull, play pray hard. You need it. Otherwise, uh yeah, maybe we're going to have a leg down kind of like this one right here. And that Yeah. And you see if I take this pickle from this. This is true, guys. You take pickle here. You apply the pickle here. You see we're going to go it's going to be exact. You see exactly as predicted. You see? [laughter] It's going to be exact. Guys, questions, answers, debates, discussions. Go, go, go, go, go. Uh, [snorts] let's get to the questions uh and discussions. Uh, while we're thinking about questions, let me just quickly see what else is happening with the uh overall uh yeah market. Uh let's see. Everything is kind of down. Um yeah, uh everything's down. No, nothing to say. Week everything is down. Day everything is down. Month still a bit up. Year was Zcash is still up yearly a lot. Hour. Oh my hour. Hour. Not good. Not good. Not good. Uh, what else? What else? What else? Fear and greed. What's happening? Extreme fear. Bam. There you go. As you know, you cannot trade fear and greed because extreme fear can become more extreme fear. Just like here in 2022, extreme fear and then a bit recovery and then more extreme fear and prices just go lower. So people who trade based on this also get wrecked a lot. Don't trade based on it. It's just fun to see kind of, you know, the the the crooked state of people's emotions. Uh so yeah it was extreme fear then it went silence a bit. It actually went to greed for a day here in the beginning of January when we had the initial pump and now back to extreme fear guys. Also I I mean it's the ghost of Christmas past midterm years guys. Exactly what we've been speaking about going down mirroring exactly the previous midterm years turning on the average. It's exact on the average man. Exact on the average. The white one is is the average. It's exact on the average. I mean, yeah. What do you want is it's exact. So, yeah, everything is exact. I mean, isn't it exactly as predicted? Should I say exactly? It feel it feel somehow bad to say exactly as predicted, but it's true. So, should we say it or not, guys? Exactly as predicted. Exactly. Now, sunshine ahead, guys. Sunshine ahead. just another 20% towards the that area and then up only fantastic fantastic fantastic guys and uh exactly Biden was better like bogdan is saying uh Biden was better for for uh finance overall why because he didn't do a lot and uh turns out Marcus like when politicians don't do too much when you do a lot markets get a bit spooky they get a bit slightly spooky okay exactly so it's a copyright The moon Carl we are licensing this uh exactly as predicted from the moon. Exactly. We are exclusive licenses. Okay guys let's go. Let's go. Let's go. Let's go. Marty Party also says exactly guys. I mean I love Marty Party but it's not it's it's far from exactly as predicted. I mean listen. Yeah. I mean you you know yourself. If you watch if you watch Marty you look at your portfolio. You're still all in Sana 100x or whatever you are. You you still complain that winter mute is still manipul manipulation is winter mute manipulation manipula. I mean that's it. There you go. [laughter] Big shout to Mercy. But he's going to be great in the bull market. Uh he's going to be exactly as predicted in the bear. He's been very bad. He's been very bad. He's been Yeah. I mean, you know yourself. Yeah. Yeah. But I love him. Listen, I love him. I love him. Uh once, you know, bull market comes, he's going to be exactly now. He is very very much not. [laughter] But big shout out. [clears throat] Oh no, it's manipul. We're dumping because manipul everything is manipulated. Winter mute dumping Sana. That's why Sana does not pump. Everything is what you mean? What? What you mean? What you mean? What you mean? You mean winter mute every midterm year they manipul? Listen, it's it's bare trend. It's uh midterm. So what you want? What what you want? It's what what else you want literally I mean all of the signals yes pi cycle top indicator was not working but you see pi cycle top it's not it's not supposed to like it's not a it's like a crypto thing we we created it worked like one time and people oh pi pi pi cycle pi ple multiple like all of this stuff guys I I'm telling you they don't work because I actually tried using them I was all about you you remember just if you watch this channel two years ago even yeah like three three two years ago we were all about PI cycle top multiple hash ribbon you know all of the this uh crypto stuff uh crypto specific top indicator they're all for guys I can conclude to you that they're all for Gazi in comparison to following mechanical rules following the trend uh what what we're doing now like it's unbelievable how different uh performance you yet if you follow all of this you know cycle top high cycle top uh or another one nuple you remember we looked a lot at nupal it doesn't work like it's it's not useful it works a bit I mean it works as you know infotainment it discuss a bit it doesn't work to place trades to enter position to exit position to allocate for a bull market for a b it does not work it does not work it does not work why because in most of these cases let's say a nupole they have so many assumptions again I'm asking you guys have you gone to university do you know the scientific method Are you educated play or uneducated play? Because I myself I went to university but I'm still uneducated because I didn't finish it. But I know enough that looking at all of this, you know, onchain stuffs. There are so many assumptions, unverified assumption. Okay, Bitcoin moves from this address to this address. So we conclude it's a sell. How you conclude it's a sell? It's a transfer. Why you say they sold? Why you say they sold? So and then based on that they draw chart. Okay. They say it's nupal this guy sold because they transferred it which means that now they have realized profit. I mean it's it's so many assumptions. So I don't use them. I don't now I don't use them. I use them sometimes because uh just for you know infotainment content people still want to hear about it. So sometimes we just discuss it for it's like kind of like fear and grid. I told you you know it's it's fun to look at it. I mean it's a nice chart. It's interesting chart. I mean in general we humans our brain like we love the charts. So I also love looking at charts like fear and greed. Wow. Look here we were fearful. Wow. Like you don't you don't base strays on that. But it's nice to discuss a bit you know we're discussing different things. A bit of this a bit of that. But it's infotainment. Infotainment. So yeah there you go. There we go. Man, I'm losing so much money says SLP. You're probably not in control of uh what you're doing. You're probably not really in control of uh your positions. You're not really in control of anything. Uh so, time to fix that. Go to buluming.com. Uh watch it and um yeah, start start applying them. I mean, that's it. Uh you will be guided to to how to join Bulmania there. Uh so, yeah, jump on a call with us, do all of that. So yeah, do do it as soon as possible because you can recover everything if you know how to actually like for real how actually trading works and you apply it in the next bull. Just stay here. Stay here until next bull. Don't mess up the next bull. The next bull is going to start if we get Yeah, I mean as soon as we get closer to this uh it's going to be very nice. [snorts] So yeah, I mean everyone if you feel that man this bull market this and that I could have played it better. You should go to booming.com, learn about the mechanical rules, then there's going to be a strategy called yada yada. Follow it fully. Follow it fully. Exactly what you're told. If you want to fix, if you don't want to fix, you just want to blah blah blah blah blah la, you know, information comes in in one year out other, okay, don't do it that don't don't do it then. But if you need help, let me guide you by the hand. And uh there is a video there, boom.com. Then it tells you what to do afterwards. Just blindly follow it. Just blindly follow it. And that's it. That's it. That's it. That's it. That's it. And subscribe to the channel because we do share here. I mean, even the channel, you know, we've been sharing the whole step by step by step here as well. Is booming free. It's not free. It's not free. But in comparison to what people are doing, it's such a small investment. Like it's uh such a like you know people go all in they lose like 80% of the portfolio because they think business cycle is going to like you know and also once you go through a transformation in bulmania your life is changed you have these skills that I have you have them forever you can trade any market for the remaining of your life you know how to enter how to exit like you can write AI you can write I mean it's like infinite value basically infinite value anyway moving on what's a good buy for ETH for ETH A good buy. A good buy. Yeah. Uh goodbye is in case it go it goes to a bull trend that would be a good buy. Uh otherwise if it goes here to to around like you know low 1K 1.4 I mean basically everything here in this uh box. Um it's a quite a no wide box but uh likely if it's going to get support here somewhere at like 1K maybe maybe goes a bit lower to 900. So somewhere here you know 1k 1.1 1.3 somewhere here somewhere here would be good would be very very good but yeah eth man let's see I will be I would rather buy salana at 30 than e at like 1k okay I would rather buy salana at 30 so I hope that salana breaks down to 30 here I mean you know it's meh you know if 1k okay what is g who Where you going? [laughter] Where you going to go eat? But okay, you buy at 1K. Here's the speculation. Here's the here's the bull case for ETH, guys. You buy at 1K and then you pray that it breaks this multi-year resistance at like 5K, 4.8 because basically this cycle guys, we didn't go to new alltime high. Really, we went like you know $100 like it doesn't count and it will we down. So the most bullish thing for ETH guys is in case we start breaking here and start running because then we're going to snap to 10K very fast. But we basically have a consolidation here for since 2021. I mean five years. So the bull case for ETH which is exciting is that you you buy here at like 1K then it smashes this and then it flies to like 20K kind of like silver. I mean um in that regard you can kind of compare to what silver did because silver when you look at it it also had crazy consolidation here. It consolidates since 2020 and then once it broke it Yeah. then it flew it flew from 30 to 120. So when you have such a long consolidation bum bum bum bum bum bum it's very nice. So can ETH do something similar? Let's see. Oh guys, by the way, we had some uh donation. I I missed some of them. What did you guys say? Hello. Hello. Uh let's see. Oh, yeah. Here. Ivan, good morning. Really love this US morning streams. Ivan, you must listen to Dorothy by Man Fred Minich Orchestra. Okay, I'll check it. I'll check it. I I just need to be sure there's like no copyright. That's the best thing. I I guess there's not. I mean in classical music there is it's often public domain but still with I know very nice I'll check it I'll check it but I guess yeah I guess it's public domain also hype goes to papa how about hype yo Ivan how about hype let's check Let's see. Yeah, it goes to papa. I mean, basically what we said the other day we said the other day is in bare trend. So, respect the bare trend. When to buy when it goes to bull trend or if it goes here, I would be buying here actually if it falls. How much has to fall? Yeah. Yeah. If you want to buy, buy somewhere there. But so nice. So nice. How could these dudes in like 18 or 1700 when they lived? How could they do this? It's crazy. I guess 1800. How could you you sit there like in your house like Yeah. Figure figure out music. No internet, no chat, GBT writing. Crazy, crazy, crazy. So, uh, hype there at like 10 or if it goes to bull trend, that's it. Oh, guys, did we talk about the XRP short the today or yesterday? I mean, XRP guys. Oh. Oh. Oh, it's playing out in real time. Holy crap. It's playing out in real time. You remember we said if it starts falling here that there is like no support until like 0.6. I think we spoke about it yesterday or like two days ago or whatever. But yeah, it's playing out. It's playing out guys. Short is playing out very nicely here. Okay, there you go. There you go. So much for free training. Well, you have to watch the free training otherwise you don't understand. you don't understand like anything if you just jump on a call like we need to use the call then for you to understand the basics. So first watch the free training on boommy.com so you understand discretion what it means and so on so forth then do the call. So just listen just follow the system. Don't argue with me. Don't I don't want to watch free training. If you need help or no otherwise don't don't do it then I mean we just watch the live streams. That's it. That's it. That's it. But if you really want help, don't overthink it. Go to bullman.com. That's it. I mean we we can offer help or that's it. So uh either either this or either that. Uh you can just watch the free the live streams here. There is also free free training. We give you here free training. It's not really the same depth, but it's okay. The evil pickle plant. Exactly. Did you get out of metal? So, yesterday we started to to ladder out 100%. So, are you in 50x short on soul right now? If you expect it to go No, I see you definitely need to go to bull.com watch. I don't expect it to go to 30. It seems to to want to go there. Uh, [clears throat] but I don't expect it to go. I think it's a very I mean if it breaks the support it has a very high likelihood of going here. I don't want to short it because it's too risky. Instead I want to make move when I have the best riskreward. See I mean you understand the difference because this this is the the again I say pleb with love. I mean I hope you understand but but is is the pleb mindset. So you know Ian so if you expect this why don't you short listen I don't expect it. I say that if it goes to 30 I hope it goes to 30. is going to be the best riskreward riskreward play shorting now is not it's not good riskreward. I mean it can it have a violent uh swing to the upside out of nowhere you get liquidated. So uh you can still make it work with mechanical rules to short Sana but at the same time the shorting of Sana now is nowhere near just going long as hell here buying spot like there is no tomorrow. So it's a big difference with you know if you expect it. I I don't expect it. I mean I think it's very likely but it's not you know I I say this is going to happen. I don't know I don't know if it's going to happen. I think if it breaks this support this one it has no other support. So what what is the conclusion? If it has no other support it's going to come to papa. So this is the plan. I I mean expect this is the how what other word is there in English to say not expect maybe anticipate you know maybe I see cloud I don't take umbrella now or maybe I I mean what's a good what's a good comparison you know I see I see that you know it's heading there I don't want to put money on it arriving there but if it arrives there that unlocks the opportunity okay you % if it arrives there then it's opportunity then it's opportunity anyway that's that um yo mundi great analysis I'm three short on XRP since 2.4 four. That's good. That's good. That's good. That's good. Exactly. Ivan does not expect he pulls this. Exactly. Exactly. So I Yeah, I foresee maybe forc is better. Yeah, foresee. I foresee. I foresee. Anyway, big shout out to the question. It's good question. Good question. Good question. Uh thanks for the question. Uh so guys, that's that. Thanks a lot for being here. We are at 43 minutes. It's quite good length. extra stream today uh with uh with with all of you guys. Thanks a lot for being here. Thanks a lot for contributing to the chat to the streams. Uh it's fantastic guys. I mean at any point we go live. We have thousands of people watching. It's uh fantastic. Fantastic. So uh yeah, hope you got a bit smarter. Hope you understood a bit more. Hope you this helped you in some way. And yeah, thanks again for all questions. Again, I I don't think I have to explain, but let me just do it. So it's no miserizing. Even when I call you uneducated, maybe even dirty pleb, [laughter] clueless monkey with machine gun who is just, you know, going lever. [laughter] I do it from a place of love because we've all been there. I've been there. Uh yeah, that's it, guys. That's it. Okay, enjoy. Enjoy. Have a good weekend. Good s Saturday. Goodbye, guys. Goodbye. Goodbye. Goodbye. and special.",
        "summary_hu": "A Bitcoin és az arany/piacok jelenlegi helyzete aggasztó, hiszen a Bitcoin gyors esésben van, és a szakértő elmondása szerint az árfolyam elérheti a 200 hetes mozgóátlagot, mielőtt újra emelkedne. Az ezüst 40%-os csökkenésével az emberek pánikba eshetnek, ezért a befektetőknek óvatosnak kell lenniük, főleg ha késlekednek a belépéssel a piacra. Az amerikai dollár a hírmondó pozícióját veszi át, mert a szakember szerint erősödni fog a közeljövőben, amit a piaci félelmek generálnak. A közelgő befektetési lehetőségek szempontjából a bitcoin és a silver megközelítések továbbra is figyelmet érdemelnek, de a pénzügyi helyzet elemzése során elengedhetetlen a kockázatok figyelembevétele.",
        "summary_en": "Bitcoin and silver markets are currently in a concerning state with Bitcoin experiencing a rapid decline, potentially reaching the 200-week moving average before a rebound. The 40% drop in silver could cause panic among investors, indicating that caution is necessary for those delayed in market entry. The U.S. dollar is emerging as the focal point, as the analyst predicts its strengthening in the near future driven by market fears. Upcoming investment opportunities in Bitcoin and silver still warrant attention, but risk assessment is crucial in navigating the financial landscape. The bearish sentiment in crypto markets indicates a need for strategic planning going forward.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 35,
        "key_points_hu": [
            "A Bitcoin gyorsan csökken, elérheti a 200 hetes mozgóátlagot.",
            "Az ezüst 40%-ot esett, ami pánikot okozhat a befektetők körében.",
            "Az amerikai dollár növekedése várható a jelenlegi piaci félelmek miatt."
        ],
        "key_points_en": [
            "Bitcoin is rapidly declining and may hit the 200-week moving average.",
            "Silver has dropped 40%, potentially causing panic among investors.",
            "The U.S. dollar is expected to strengthen due to current market fears."
        ],
        "main_topics": [
            "Bitcoin market trends",
            "Gold and silver investment strategies"
        ]
    },
    {
        "video_id": "9MCBz420Oes",
        "title": "Tether buying gold? #shorts",
        "published_at": "2026-01-31T16:00:19Z",
        "sort_date": "2026-01-31",
        "url": "https://www.youtube.com/watch?v=9MCBz420Oes",
        "transcript": "Tether has been playing it super interestingly. They have been buying gold like there is no tomorrow. Tether have been diversifying into gold. They're buying 1 billion worth of gold per month. So if it really is the case that we are going towards a goldbased world order. They're going to be a big fat player. They're going to be on the on the level of you know JP Morgan. they're going to be on the level of uh the big banks of today. But in the world denominated in in a gold denominated world. So uh gold just added four trillion of market cap. It is the 2x entire Bitcoin market. You see how small we are. You see still how small Bitcoin is. And you can of course argue that Bitcoin is way better. You can store it. You can have it. You can you don't need to transport it in the truck. You have it in your brain potentially if you want. You you can have a seed phrase that stores your your funds. I mean, Bitcoin is a winner when it comes to use case.",
        "summary_hu": "A Tether gyorsan diverzifikál az arany felé, havonta 1 milliárd dollár értékben vásárolva aranyat. Ez arra utal, hogy a Tether jelentős szereplővé válhat egy aranyalapú világpiacon, amely a mai nagy bankok szintjére emelheti. Az arany piaci kapitalizációja 4 trillió dollárra nőtt, ami már a Bitcoin teljes piaci értékének duplája. A Bitcoin előnyei között említik a könnyű tárolást, hiszen akár a felhasználó agyában is megmaradhat. A jelenlegi helyzetben a Bitcoin használati esetét győztesnek tekintik, bár a domináló arany-alapú rendszer felé való elmozdulás aggodalmakat ébreszthet a kriptovaluták jövőjével kapcsolatban.",
        "summary_en": "Tether is aggressively diversifying into gold, purchasing $1 billion worth of gold per month. This suggests that Tether could become a significant player in a gold-based world order, potentially rivaling today's major banks. Gold's market cap has surged to $4 trillion, which is double the entire market value of Bitcoin. Bitcoin's advantages include easy storage, as it can be retained mentally by users if desired. In this context, Bitcoin's use case is deemed a winner, although the shift towards a dominant gold-based system raises concerns regarding the future of cryptocurrencies.",
        "crypto_sentiment": "Bullish",
        "sentiment_score": 75,
        "key_points_hu": [
            "A Tether aranyvásárlásai jelentős növekedést mutatnak.",
            "Az arany piaci kapitalizációja a Bitcoin kétszerese.",
            "A Bitcoin használati szempontból kiemelkedő előnyökkel bír."
        ],
        "key_points_en": [
            "Tether's gold purchases indicate substantial growth.",
            "Gold's market cap is double that of Bitcoin.",
            "Bitcoin has outstanding advantages in terms of use case."
        ],
        "main_topics": [
            "Tether's investment strategy",
            "Gold market dynamics"
        ]
    }
]