{
    "channel_name": "CoinBureau",
    "channel_id": "UCqK_GSMbpiV8spgD3ZGloSw",
    "channel_handle": "coinbureau",
    "video_id": "1PL4L_cyDvo",
    "title": "Unrealized Gains Tax on Crypto: The New 36% Law Explained (What HODLers Must Know)",
    "published_at": "2026-02-17T14:26:05Z",
    "url": "https://www.youtube.com/watch?v={'kind': 'youtube#video', 'videoId': '1PL4L_cyDvo'}",
    "transcript": "Imagine paying taxes on crypto profits you  haven't even sold yet. You bought Bitcoin at   $20,000. It pumps to $100,000. And suddenly the  tax man demands $28,000 in cold hard cash. You   don't have the cash, so you're forced to sell your  Bitcoin just to pay the bill. Now, for years, this   was just a scary campfire story we told ourselves  during bare markets. But uh well, that story has   just become a reality. This is our reality now.  The Netherlands has just passed legislation taxing   unrealized gains at 36% and it takes effect in  2028. This isn't a theoretical anymore. Paper   profits could trigger real tax bills, forcing  mass selloffs and potentially crashing the market.   Welcome to the new era of wealth conversation. But  is this just a Dutch problem or is it the start of   a global trend that could end hardling forever?  And uh more importantly, how can you protect your   portfolio from this liquidity nightmare? That is  exactly what we are diving into today. My name is   Nick and you're watching the Coin Bureau. Now,  let's look at exactly what happened because the   details are terrifying. On the 13th of February  2026, the Dutch House of Representatives approved   the quote actual return in box 3 act. The  bill passed with 93 votes in favor, which   is a comfortable majority. So, what does this law  actually do? Well, starting on the 1st of January   2028, Dutch residents will be taxed at a flat rate  of 36% on the actual returns of their investments.   And here's the kicker. for assets like stocks,  bonds, and uh yes, cryptocurrency, actual return   includes capital growth even if you haven't  sold. And that means if your portfolio goes   up in value during the year, you owe 36% tax on  that appreciation. It doesn't matter if you still   hodddling or if you plan to hold for 10 years. The  government treats that paper gain as income. But   it gets worse. The law explicitly exempts real  estate and startup shares from the unrealized   gains tax. Those assets are only taxed when  they are sold. So if you own a bricks and mortar   building, you're fine. But if you own digital  property like Bitcoin, you get hammered. It's a   clear double standard that punishes liquid assets  and innovation. Now, you might be wondering, why   on earth would they do this? Well, to be blunt,  they didn't really want to. Even the lawmakers   who voted yes admitted this isn't ideal. They are  basically desperate to plug a€ 2.3 billion euro   annual revenue hole left after the Dutch Supreme  Court ruled their previous tax system was illegal.   So, they rushed this through as a quote bridge  solution, a very expensive portfolio destroying   bridge. But why does this actually matter if you  don't live in the Netherlands? Well, because ideas   like this have a nasty way of spreading. We all  know that governments worldwide are drowning   in debt. Global debt hit record highs in late  2025, sitting near $346 trillion. Politicians   are looking for any untapped revenue source they  can find. And uh unrealized gains are the golden   goose. Remember the Biden administration's 2025  budget proposal? They pitched a 25% minimum tax   on unrealized gains for Americans worth over $100  million. Now, that proposal effectively died on   the vine, especially with the recent political  shifts, but the idea is out there. It's a zombie   policy that keeps coming back to life. California  just floated a billionaire net worth tax. Illinois   considered marktomarket taxation. The Netherlands  is just the first domino to actually fall. And if   it works there, meaning it raises enough money  without causing a total economic collapse,   you can bet other finance ministers will be  taking notes. But here is the real nightmare   scenario for crypto investors. It's called the  liquidity death spiral. Imagine you hold Bitcoin   worth $100,000. You bought it cheap, maybe  at $20,000. Under a 36% unrealized gains tax,   you have an $80,000 gain. And that means you owe  roughly $28,800 in taxes. But uh you haven't sold   a bitcoin. You don't have $20,000 in cash lying  around. So what do you do? You have to sell   some Bitcoin to pay the tax. Now multiply this  across millions of investors. Every tax season,   everyone is forced to sell assets at the same  time to pay taxes on paper profits. This mass   selling drives down the price. And because the  price is dropping, liquidity dries up. It creates   a feedback loop where the tax itself triggers the  crash it was designed to capture. And for crypto,   it gets even worse because of volatility. We  all know crypto has 80% drawdowns. It's part   of the game. But imagine this scenario. It's  the 31st of December, 2027. We are in a massive   bull run. We hope Bitcoin hits $150,000. You are  ecstatic, even despite the fact that you owe tax   on those massive gains on the 31st of December  snapshot. Then January 2028 rolls around. The   market corrects and Bitcoin crashes to $60,000.  You are now holding an asset worth $60,000, but   you owe taxes based on a value of $150,000. You  could easily owe more in taxes than your entire   portfolio is currently worth. You are underwater  on the asset and you owe the government money   for the profits that have evaporated. Sure, you  can carry those losses forward to future years,   but that doesn't help you pay the bill due now. It  is mathematically ruinous. Now, before we get into   how you can protect yourself from this, and there  are ways, I want to mention something important   about staying informed. Policies like this can pop  up overnight, and if you aren't paying attention,   they can wreck your strategy. And that is why we  have the Coinbau Telegram channel. It's where we   share the latest breaking news, provide deep dive  alpha, and give you the most important market   updates. All pinged directly to your device  so you don't miss a thing. So, sign up today   using the link down below or scanning this QR code  over here. Okay, back to taxes. Now, you might be   thinking, if they pass this law, I'll just leave.  Easier said than done. The Dutch proposal includes   something called a quote protective assessment  or conserv. Basically, if you try to immigrate,   they calculate the tax on your unrealized gains  right then and there. It's an exit tax. They might   let you defer payment, but the debt hangs over  you indefinitely. It's capital controls disguised   as tax policy. And history shows us exactly  how this ends. In the 1970s, the UK had a top   tax rate of 98% on investment income. The result,  the brain drain. Anyone with talent or money left   the country. The Rolling Stones moved to France.  Michael Kaine hotfooted it to the US. It didn't   raise revenue. It destroyed the economy. Sweden  tried a wealth tax. What happened? IKEA founder   Ingvar Comprad moved to Switzerland. Uh Sweden  eventually repealed the tax in 2007 because it was   costing them more in capital flight than they were  raising in revenue. France had the ISF wealth tax.   It caused an exodus of 42,000 millionaires and 35  billion euros in capital flight. They repealed it   in 2017. The lesson is clear. Wealth is mobile. If  you try to tax it before it's realized, it leaves.   The Netherlands is set to learn this lesson the  hard way. So, what are sophisticated investors   doing to prepare? Because you can bet they aren't  just sitting there waiting to get wrecked. First,   we are seeing a migration to crypto friendly  jurisdictions. Portugal used to be the go-to   with zero tax. And while they have tightened the  rules, holding crypto for more than 365 days is   still generally tax-free for individuals. And then  you have the UAE. Dubai has zero personal income   tax and zero capital gains tax. It's becoming the  capital of the crypto world for a reason. And of   course, we can't forget El Salvador. And despite  some changes regarding legal tender status,   they still exempt Bitcoin transactions from  capital gains tax. There is also a darker shift   happening. This kind of legislation accelerates  the move underground. We've seen privacy coins   like Monero and Zcash putting in serious moves  recently. Monero hit an all-time high of nearly   $800 in January 2026. Why? Because if governments  try to tax what they can see, people will move   what they have to where people can't see them.  However, this is a dangerous game. The EU's   Micah regulations and the US Treasury are cracking  down hard. Major exchanges have delisted privacy   coins. We are seeing a bifocation of the market,  the compliant white market and the dark shadow   market. The Dutch law creates a massive incentive  for that shadow market to grow. Ironically,   by trying to squeeze every cent out of investors,  they might end up driving the economy into places   they can't reach at all. What's the verdict? To  be blunt, for Dutch investors, hodling is set to   get a lot more expensive. The law fundamentally  breaks the mechanics of long-term investing. It   will force you to trade, to sell, to churn your  portfolio just to pay the bills. But globally,   the resistance is strong. The fact that this  law passed with such reluctance and with a new   coalition government already promising to try  and reverse it shows that even politicians know   this is a bad idea. The unrealized gains tax is an  existential threat to property ownership. Taxing   wealth you haven't realized is taxing potential,  not income. It forces you to sell the very thing   you are trying to build. But here's the silver  lining, guys. Capital goes to where it is treated   best. As the Netherlands and potentially other  desperate nations tighten the screws, places like   the UAE, Singapore, and perhaps a more pro- crypto  US administration will absorb that wealth. The   choice is coming sooner than you might think. You  need to look at your portfolio and ask yourself.   If my country passed this law tomorrow, would I  be solvent? If the answer is no, it might be time   to start drawing up your plan B. But what do you  think? Is the Dutch law a sign of things to come,   or will it collapse under its own weight like the  wealth taxes of years past? Let me know in the   comments down below. And if you want to know more  about the best countries for crypto investors,   check out that video right over here. And if you  want to see how the US election actually impacted   crypto taxes, you can check out that video right  over here. Okay, that's all for me today. Thank   you guys very much for watching and I'll see  you again soon. And this is Nick signing off.",
    "sort_data": "2026-02-17",
    "summary_hu": "A holland parlament által jóváhagyott új törvény 36%-os adót vezet be a meg nem valósult nyereségekre, ami 2028-tól lép életbe. Ez a jogszabály arra kényszeríti a kriptovaluta-tulajdonosokat, hogy eladjanak eszközöket a befizetendő adó miatt, ami jelentős piaci zavart okozhat. A törvény kivételt képez a valós ingatlanok és induló vállalkozások részvényei számára, ami kettős mércét alkalmaz. A nemzetközi adópolitikák trendjei és a költségvetési hiányok következtében a globális kriptovaluta-piacra is kihatással lehet. A törvények szigorodása arra ösztönözheti a befektetőket, hogy más országokba költözzenek, mint például Portugáliába vagy az Egyesült Arab Emírségekbe, ahol kedvezőbb adózási környezet van.",
    "summary_en": "The new law passed by the Dutch Parliament imposes a 36% tax on unrealized gains, effective from 2028. This regulation forces cryptocurrency holders to sell their assets to pay taxes, potentially causing significant market disruptions. The law exempts real estate and startup shares, creating a double standard. The international trend of tightening tax policies and budget deficits can also impact the global cryptocurrency market. Stricter laws may incentivize investors to relocate to countries like Portugal or the UAE, where the tax environment is more favorable.",
    "crypto_sentiment": "Bearish",
    "sentiment_score": 30,
    "key_points_hu": [
        "Az új holland törvény 36%-os adót vet ki a meg nem valósult nyereségekre.",
        "A törvény kettős mércét alkalmaz, mivel az ingatlanok és startup részvények kivételt képeznek.",
        "Globálisan ez a tendencia egyaránt ösztönözheti a befektetők elvándorlását kedvezőbb környezetű országokba."
    ],
    "key_points_en": [
        "The new Dutch law imposes a 36% tax on unrealized gains.",
        "The law creates a double standard, exempting real estate and startup shares.",
        "Globally, this trend may incentivize investor migration to countries with more favorable environments."
    ],
    "main_topics": [
        "Unrealized Gains Tax",
        "Impact on Cryptocurrency Market"
    ]
}