[
    {
        "video_id": "gssYwqKzE6M",
        "title": "The Most Boomer Asset Just Proved Bitcoin Right",
        "published_at": "2026-02-03T14:11:51Z",
        "sort_date": "2026-02-03",
        "url": "https://www.youtube.com/watch?v=gssYwqKzE6M",
        "transcript": "Gold is trading like a memecoin. The silver chart looks worse than your average fartcoin copy after the Binance listing dump. 41% drop. How can it be gold and silver? The foundation of the proper financial system for grown-ups. Not that toy Bitcoin that those tech kids are playing with which is not backed by anything without proper backing from central banks. >> No, I am a bit skeptical about this idea of the Bitcoin standard >> of this idea of the Bitcoin standard. I think it's a healthy competition because um healthy competition no gold silver that we can trust stable connected to real utility industrial demand boomus 41% in two trading days. How what's happening to the world? So gold market cap dropped 6 trillion in two trading days. $6 trillion. The entire France M2 money supply is 3 trillion. Bank to France central bank balance sheet is 1.5 trillion. The entire euro system consolidated balance sheet which is ECB plus all euro areas national central banks is 6 trillion and the silver drop 41% in two trading days is also in the trillion. So who's laughing now? Bitcoin has dropped a similar amount, but it was years ago. It was during the COVID dump last time in March 2020 here when the world was supposedly ending. Gold also dumped then and silver too from here to here. That's 39%. Not so different after all, is it? So I never again want to hear the argument that Bitcoin can't be money, can't be store of value because it's too volatile. Gold dropped 6 trillion. Silver dropped 41% in 2 days. Also, I never again want to hear the argument that Bitcoin will be less volatile now. No more crazy dumps because the adults are here now. the Wall Street, the hedge funds, the banks, the ETFs, the grown-ups, the institutions, 41%. The most boomer asset we have. If silver can drop like this, so can Bitcoin. So make a mental note now. The next time you hear that Bitcoin will be less volatile now because institutions, you note BS in your mental book. And the next time you hear that Bitcoin can't be money because too volatile, you also note BS. What I said at the beginning that gold and silver are trading like a memecoin. Was that hyperbol for effect? No, it was actually factual. Here is the silver chart. Note the inverse head and shoulders, perfectly straight neckline, breakout, and then note the accelerating slope of the increase. Even on the log chart, which is what we loosely call a parabola, you can see it goes up, then it goes up faster, then it goes up faster, then it goes up even faster and even faster. And let's switch to daily candles, and it goes up even, even even faster until boom, parabola break. Now, let's look at the original meme coin, Dogecoin, at its last major advance. I mean, latest advance. I'm not saying it's going to be the last. First, we had the same inverse head and shoulders, more or less clean breakout, retest, and then you see the same pattern here of accelerating speed of increase. Can make it even steeper like this until one day it breaks, which becomes the precursor for the next major drop. Here is Dogecoin on one day candles. Inverse head and shoulders. Parabola parabola break. Here is silver on weekly candles. Inverse head and shoulders. Parabola and parabola break. Here it happened again in Dogecoin. Now I switched to 6-hour candles and went to somewhere 2025 bottom pattern in the chart. More of a cup and handle or an ascending triangle. Parabola and parabola break and down again. Same thing here in 2024. bottom formation breakout parabola parabola break here at the parabola break we even got the same crazy candles as we saw in silver now huge week up then huge week down stopping somewhere in the middle hesitating don't know in which direction to go on silver it looks exactly the same and even more so on gold how is this possible these assets can't possibly be any more different can they on one side One is the original boomer coin silver and the gold chart looks basically the same silver and the next is a memecoin and it's the same chart just on different time frames. Why? How? Because people this isn't about what the asset really is. >> But this idea of a Bitcoin standard, >> he's wrong. It's about human behavior. This is about beliefs. This is about speculation. It's about the stickiness of trends, how they accelerate, how that translates into parabolic price behavior with increasing euphoria until the climax after which the parabola breaks. Then after a while it can pick up again. Use whatever analogy you prefer to remember how that works. That's why classical charting trend models are so powerful. That's why it works on everything from gold, silver, tech stocks, and meme coins alike because the charts develop in much the same way. That's how I could spot it. That's how I could raise warnings hours before this break. This was on the 29th in the morning when the gold chart looked like this and price was 5,559. And I wrote gold just bonkers. Now, maybe consider trailing stop or tight parabola model if you're still holding this. Now, that was a few hours before it broke. Then, during that day, I recorded this video. I clearly wrote, \"I'm out.\" How could I do that? Because I was prepared for it. I've seen charts like this so many times before. And when it started breaking, it was so clear to me again. Why? Because I've seen it a thousand times before in crypto altcoins. And I know that they will probably behave the same. While if you were only ever trading silver, you might never have seen this if you are young. And even if you are not so young, you see that this has only happened twice before. One time here in 2011, 15 years ago and one time here where it was even clearer that this went into this clear parabola and then a clear parabola break which was in 1980, 46 years ago. This is the power of synergizing across crypto tech stocks and commodities. Crypto guys, first time gold and silver guys, huh? Okay, you guys want to hear about Bitcoin? As a reminder, the first warning sign was in the beginning of October. Lion line turned blue at 1089,000 on the 21st of October and down we went. Now, Bitcoin has actually had a solid bounce at key support. And you see the point where it turned was exactly the point where it turned in April 2025 twice on the 7th of April and 9th of April. And you can see that it's to the pixel. It turned exactly there again. That time that was actually enough and it moved up to new all-time highs after that. I don't know what will happen now. But there is decent riskreward to enter at support touchdown because distance to invalidation is almost nothing. So you risk very little and you could right now today move up stops to lock in a profit. Then if it turns out that that was the medium-term bottom like last time, that's perfect. If it still drops below, you either lock in a tiny profit or lost practically nothing. And by the way, this level generally came from the high of the early 2024 move, which was resistance at that time and then a resistance a second time in October 2024 just before that breakout. Then it turned support. Now it could be support again. Will it be? I have no idea and I don't need to predict it. I just need to react to what actually happens. Personally, I would love for this support to break and for price to go much lower, maybe for at least a 50% or so retracement. Why? Because there is no doubt in my mind that at one point this will turn around and then the lower the prices when it does, the more money we can make on the next uptrend. But at the end of the day, I'll just play what happens. And to answer the question that will otherwise come, remember that the process is not the indicator you see here alone. Loian Line Pro is available at regular price 5K per year, which would have saved Bit and Tom Lee $6.6 billion on his ETH strategy portfolio. if he had worn CTO Lson's Hodel Sucks socks and instead only held Ethereum in uptrend and not in downtrend. $6.6 billion. And not only would he have saved the money, he would have turned the 2025 Ethereum Adventure into a profitable trade. and even more if he had traded the ETH BTC chart separately and the BTCUSD chart separately because this the ETH BTC chart was actually super clear and it was based on this chart that I dare to take risk on old coins last summer quite successfully 5K one guy would have saved a million times that in loss avoidance plus making profit instead on Ethereum in 2025 now I don't think we need to feel bad a worry for Tom Lee personally. He has allegedly a rather healthy compensation package in the millions. It's the people who invested into this vehicle that could have taken the course because what Tom Lee said here at the end of the year that Ethereum looks great. It didn't. The chart looked garbage. In fact, it's hard to imagine how it possibly could have looked any worse than this. And if your strategy then is to listen to the cheerleader who is allegedly incentivized with a multi-million dollar bonus to get you to put in your money. Well, everyone do as they find best. Just saying that some own education maybe wouldn't hurt. So whether you're a gold, silver, Bitcoin, Bitmine, tech stock or altcoin investor, put them on. Thank you. Attack City of Lords. Not"
    }
]