[
    {
        "video_id": "6n3__mvLDQ4",
        "title": "Altcoin I’m Buying in 2026",
        "published_at": "2026-02-03T17:26:08Z",
        "sort_date": "2026-02-03",
        "url": "https://www.youtube.com/watch?v=6n3__mvLDQ4",
        "transcript": "If hype can pass the test, then it means that crypto has matured significantly and in my opinion, it is a massive massive badge and and achievement for this industry. So that's why I think we should all be rooting for hype to blast off and really make new highs. Um that would be amazing. Um I'm definitely going to start concentrating a bag even above 30 bucks. Feels crazy to be buying alts right now, but it feels crazy kind of not being in hype right now. So that's kind of how I feel about it. Um again, uh all disclosures, most things will dump throughout the bare market. As you guys know, this is like gun to your head. Absolutely insane risk. If you're going to buy altcoins, expect them to go to zero. We know the drill.",
        "summary_hu": "A jelenlegi piaci hangulat a hype körül forog, amely a kriptovaluták érettségének jele. A felhasználó hajlandó alacsonyabb áron, akár 30 dollár felett is vásárolni, ami a hype elfogadását tükrözi. Azonban figyelmeztet arra, hogy a legtöbb altcoin a medvepiac során drámaian leértékelődhet.",
        "summary_en": "The current market sentiment revolves around hype, indicating a maturation of cryptocurrencies. The user expresses readiness to buy altcoins even above 30 dollars, reflecting acceptance of the hype. However, there is a cautionary note that most altcoins might experience significant devaluation during a bear market.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 30,
        "key_points_hu": [
            "A hype fontos a kriptovaluták fejlődése szempontjából.",
            "A vásárlási szándék jelentős kockázatokat hordoz.",
            "Az altcoinok értéke a medvepiac során akár nullára is csökkenhet."
        ],
        "key_points_en": [
            "Hype is crucial for the development of cryptocurrencies.",
            "The intent to buy carries significant risks.",
            "Altcoins can drop to zero during a bear market."
        ],
        "main_topics": [
            "Market sentiment analysis",
            "Risk assessment in altcoin investments"
        ]
    }
]