[
    {
        "video_id": "WXl7Qu1Eg44",
        "title": "Why Hasn’t the Stock Market Collapsed… Yet",
        "published_at": "2026-02-03T14:00:06Z",
        "sort_date": "2026-02-03",
        "url": "https://www.youtube.com/watch?v=WXl7Qu1Eg44",
        "transcript": "If you're holding stocks in companies like Nvidia, Apple, bonds, or maybe even a savings account, or really just any investment right now, what you're about to reveal could either protect your wealth or leave you potentially devastated. Right now, something very strange is happening. The stock market just hit the all-time highs, while unemployment is climbing up. Here is the chart on the screen. It's only a little move, but it's a big move by historic standards. And this is backwards. It's like your car running better when you're out of gas. It doesn't make sense at all. And what's really going on could determine whether your investments survive what's coming next or not. My name is Felix Pin. I'm a former investment banker. This is Winston back. They're the brains behind it all. And we've spent years studying how Wall Street actually operates. We've seen the system from the inside. I'm also the founder of the goat academy where we've taught about 20,000 regular people which is what I used to be apparently. Now I'm a little irregular and I teach them how to protect their wealth from the schemes and shenanigans of the loveies on Wall Street. I'm also the co-founder of tradevisioner.io where we provide market news and data at the quality level if you're working in banking. And for this video, Winston has analyzed Fed data, institutional patterns, historical market crashes, and talked to my research team of several cats and come up with something that I think is really worth understanding. So, we're going to break down three critical things. First, why the stock market looks strong when the economy is weakening. Second, the three forces artificially propping everything up right now. on the third, the specific steps you can take this week to position yourself before this house of cards shifts. So, by the end of this video, you'll understand exactly how to protect and grow your wealth no matter what happens next. Of course, I'm not a financial advisor. I'm not registered for anything at all. Winston might be, but I'm not. So, you see this as the basis of your research, the beginning of it, not the end to all your questions. So, let's dive in. Let me put this into perspective with some hard numbers. In April 2025, I know it seems like a long time ago, but the market crashed like 5% on one day, April 3rd, and then another 5% on April 4th, $6.6 trillion of wealth disappeared in two days. So, if you'd invested 10K, you would have lost $1,000 in 48 hours, which is real money. Now, the weird part, within weeks, all that money came back. By June, the market was higher than before the crash, and now we're sitting at basically all-time highs, while unemployment is the highest in four years. The Fed has cut interest rates three times in a row. And get this, the US government is spending 2 trillion more per year than it takes in, which is just bananas. But here's what makes it worse. Companies like Nvidia are worth like $5 trillion now, more than most countries. And just seven companies, seven out of the S&P 500 companies are responsible for almost all market gains over the last 12 months. And these deficit numbers seem abstract, like what does it matter? It's a trillion more or less. You know what is that between friends? Well, it's the as if you if you were the average American household, it's like spending $266,000 more per year than you earn. Imagine putting that on your credit card year after year. How long do you think you could keep going before, well, the house would fall apart? But this isn't the first time we've seen this pattern. And that's why I'm a huge believer in stud studying patterns and where the money flows because that leaves great big giant elephant footprints even larger than Winston's. So let me take you back a little. In the 1970s, we had something called stagflation. That's when two bad things happen at the same time to nice people. Prices go up and jobs go down. It's like getting sick and then breaking your leg at the same time. Double trouble. Back then, the stock market fell 50%. So, if you had $10,000 invested, you lost $5,000 and it took a very, very long time to recover. Are we in stackflation right now? No, not yet. But we are seeing early warning signs. Inflation looks elevated. Unemployment is rising. Same pattern we saw in the early 1970s. And then just a little bit later in 2000, we had the dot combo. Everybody was excited about the internet, right? The latest thing and stock prices went up on the basis of how much these companies spent, which is a little bit like what's happening with AI right now. But people then said this time is different. And then well, it busted. Right? I was investing back then as when I just started. I started in 1999. Not the greatest timing, but maybe it was because it was a very early lesson which helped. Now, if you fast forward to 2008, the uh they call it the housing bubble. I call it the credit rating agency fraud paid for by investment banks. But then I have a large imagination and of course that wasn't the case because credit rating agencies are honorable people who care about nothing but the wealth of the country and not their personal you know brown envelope jobs those never happened clearly. But what happened then is that banks were taking hidden risks that regular people didn't see, right? And if you go a little bit further into where we are right now, well, Silicon Valley Bank, a top 10 US bank collapsed in 2023. That shocked everybody. I remember I was in Mar, which is a really, really horrid place in the south of France that used to be nice once and has now been overrun by uh You're not allowed to say that anymore, are you? But uh they have an issue uh that is pretty significant. Now every time we've seen markets rise while fundamentals weaken, history shows us the same pattern. Eventually reality catches up with us. So the question isn't if but when. So what's the solution? Well, most people think we can just solve this with traditional approaches. Well, let me tell you that each one of those does not work. And why? You could print more money. Yes, you can. That leads to hyperinflation. They are going to print more money. quite a few trillion more. They keep doing that. They enjoy it. Maybe you don't believe me. Just type M2 and Fred into Google. I don't know who Fred is, but he seems to be the guy. He's got all the data. It's the Fed's data depository. And this is how much how much money there is in dollars, right? So, if you think this won't cause inflation, uh well, you should apply for the Fed chair. Although, the mole I think just got filled. Um because uh you are a lunatic. So when you go from say 2020 we had $15 trillion and now we have $22 trillion. What happens when you add 7 trillion to 15 trillion? You've almost increased the amount of money by 50%. What do you think happens to the value of the dollar? There's 50% more of them. Therefore, it's worth 50% less. That sort of simple maths, right? And they're going to continue to do that. But they can't do it to the extent they'd like to because then it would cause hyperinflation and then we become Zimbabwe and we all know how that turned out. You could cut spending which means you lose your job if you're a politician by next Tuesday. So it's never going to happen because would you vote for the guy who cuts spending in all honesty you don't right the social security recipients would vote with their feet and you'd be out of the door faster than you can say you know Botswana. I don't know why I thought of Botswana. I just um you could default on the debt. Yeah, it would destroy the dollar's reserve currency status. It would be the end of the global financial system. No country would trust the US ever again. Could you raise taxes? No, you can't because again you get voted out of office and it wouldn't fix the problem. If you took all the money from every US billionaire at 100%. It wouldn't make much of a dent. What could you else could you do? Well, you could grow the economy, right? That's what Papa Trump says. Well, you'd need 8 to 10% GDP growth for decades. That's never ever happens in modern history. US did a little bit of that after World War II, but it isn't something that continues for a long period of time. So, the reality is there is no traditional way out of this, but there is something happening behind the scenes. And here is what Wall Street understands that most retail investors don't. There is only one path that makes financial sense right now and it has already happened. The Fed is artificially propping up the market, not because the economy is healthy, but because it is sickly. Think of it this way. The Fed is like a nice parent. When things start to look bad, they step in to help. They're cutting interest rates three times in a row. But here's the key. They're giving the economy medicine because it's sick, not because it's healthful. When you lower interest rates, borrowing becomes cheaper. Companies can invest more cheaper. Consumers get cheaper loans. Historically, this makes markets go up. But it's treating the symptom. It is not treating the disease, which is a lesson I think the Fed learned from pharmaceutical companies. Yes, hello, my pharma friends. We love you. We know you have the interest of humanity at heart. Now, the second thing institutions know is that there are only seven stocks out there that are holding up the entire market. Imagine you've got a backpack and you got 500 books in it, but only seven of those books are actually heavy. Those seven heavy books are making the whole backpack feel heavy. And that's the market right now. Those seven companies stumble, the whole market could fall with them. That was probably a terrible analogy, wasn't it? I couldn't really think of a better one. Winston, can you think of a better one? No. All right, let's move on. Put one in the chat down below if you can think of something better. It'd be a good thing to use. Now, here's what separates Wall Street from retail investors. They understand not just the three pillars I'm going to walk you through, but they understand the systematic pattern-based approach that's been around for 50 years. Institutional investors have been using for over 50 years. Why haven't they taught this to you at school? Well, they pay quite a lot of money to politicians to make sure you stay uninformed so that you have to hand over your money to them so they can charge you fees. It's my conspiracy theory. There's almost no basis of that in reality. Well, you judge for yourself. But I want to do something better for you than just give you this video. One, I'm going to give you a workbook with all the information and data that we're walking you through here. That's in our free community at felixfens.org/resource. You can download that. There's a link to that down below. And then secondly, for those of you who are a little bit more seriousminded, who actually want to learn the skills to make better decisions, I've recorded a 17-minute video for you which walks you through the institutional rules for finding the right industry and the right stock and then making better decisions all around as an investor. And you can watch that also for free at felixfens.org/getfree. Now, I kind of thought that link would be good because it would say you can get free as an investor, but that's apparently not permitted to be said by the, you know, the the almighty rulers who rule the sort of YouTube world. And then generally speaking, um, so it is now called get free because it's a free video. No, you see what I did there? Yes. Okay. All right. So, let us break down the rules one by one. We've got Fed rate cuts, more incoming from the new Fed chair. It's medicine for a sick economy. We have an insanely concentrated market with only a couple of stocks holding up the whole thing. You saw what just happened when Microsoft coughed. Um, they coughed out a little bit of Sam Oldman. Apparently, the whole chatbt open AI. It just it just smelled evil, doesn't it? I'm not saying it is. I'm sure Sam Oldman is a standup guy and all that, but it just it just comes across as really evil. I don't know why. And then we've got insane government spending. So, how does this work? Well, the Fed cuts interest rates. That means banks get cheaper money and that means they lend more easily. So, companies therefore get more money. They're going to buy back their own stocks and consumers spend more because consumer credit got cheaper. So, you pay less for your car loans and your credit card loans and all the stuff you have on higher. Do people still do that higher purchase or is this like an 80s concept? Let me know if you're American in the comments down below. And all of this flows into the stock markets is an artificial boost. And on top of that, you also have government spending. The government spends two trillion more. What is it spended on? Well, services and companies and building things and weapons and weapons and more weapons probably. So all those dollars flow into companies who then pay other companies to pay other companies. So it ends up in the stock market. So we have artificial support, the Fed spending, general AI hype. Um, and so the markets rise while the economy looks a little bit shaky, but there are warning signs. People are ignoring it, but you are smarter than that. So, you're starting to understand what's going on here. First of all, inflation is a hidden tax, right? So, if inflation were just 2.9% official government number, then you'd be losing 2.9% of your money every year. Right? Now, in reality, I think inflation is much higher than that because there are things that have gone up a lot more than 2.9% last year. So, if we look at QQQ, the NASDAQ, how much has that gone up by over the last year? About 89%. Can that be right? That's insane, isn't it? No. No. This is gold. Not a tech stock. It's gold. It looks like a mean tech stock, doesn't it? Well, there was a good example. the people owning lots of gold who are the wealthy institutions, the Fed, central banks, uh they're 800% richer than you. And that I will tell you will make other things more expensive because these guys are now richer. That is inflation. Asset prices going up, it's in our inflation. It's not the price of milk or eggs or any of the nonsense they want you to believe. But even if you believed in this 2.9% you know myth of inflation over 10 years your $100,000 lose $25,000 in value. Whereas if you invested in assets you'd have $47,000 more. So altogether you're still losing what is that $602,000 compared to the guy who was in the right thing. That is the wealth transfer. So who wins who loses? Stock owners. if you're on the right stocks, not all stocks, because look at the S&P 500. There are seven winners and 493 losers as your president likes to say, uh, real estate, it's the right kind of real estate, commodities, gold, silver's done insanely well. I think will likely continue to. If you got in savings accounts, you got fixed bonds, you got cash, you've got those douff stocks, then I think you're in trouble. So, what's our solution here? Oh, Son is one to put all eggs in one basket. It never sounds particularly sexy. Everybody always wants to be in the latest thing. But the AI thing, I think it's going to be great. It's going to be amazing, but it's going to take way longer than you think. And we're going to have a period where the market is disappointed with AI and then it's going to go back up again. So, you're going to look at your arise now. You're retiring next year or in 30 years, right? That'll impact how you decide what to do with it. So, I would have eye exposure. I do. I own tech stocks absolutely but I also diversify into other things certain financials metal stocks biotech solar all those stocks sectors are doing very well right now now will those sectors be still the ones I'm holding in a month or in three months whenever you're watching this no not necessarily so learn yourself the rules so you know better where to put your money uh and you can do that at felix/getfree but the goal is always if the latest thing pops you have other holdings that'll actually go up when those go down. That's what we do. So, corporate bonds can be a good place to be. Some of them pay 7% with relatively reasonable risk. Again, I'm not a financial adviser. You got to come to your own conclusions. Short duration bonds can be a good thing for those emergency funds and so on. Long maturity bonds generally a terrible place to be because inflation could destroy them. So, what do you want to have? Look, we got to have some money in an emergency fund, right? Put that into a high yield savings account. It's sort of dead money, but it is there if you ever need it. Now, could you put that into gold? Yes. But if you really want to access it, you're probably going to pay a premium to sell it quickly. We want to have some real assets, gold, silver, real estate if it's within your price bracket. And those are an inflation hedge. those protect you if the dollar keeps losing value, which I believe it will, new Fed share or not, and just avoid this. What I see so often, I've seen thousands of people's portfolios and it's always like it's 100% in the latest thing. I'm like, you're taking so much risk or they have 98 stocks, but they're all in the same sector. I'm like, just buy one or buy the sector or buy three. Don't make your life so complicated. Right? But the worst thing to do in my humble opinion is to wait for the crash. Because given what the government's doing and how much money it's spending, I don't think there will be a crash. And that's my humble opinion which Winston's willing to back up. Aren't you, Winston? Not much support, is it? No. Thought I could count on him. Oh, never mind. And let me give you one more bonus rule. Particularly if you watch the mini master classes will help you. If your position is up a lot, right, set a stop loss somewhere. Could be a break even. It could be 10 or 15% below or 6% below. Depends on what you hold. You could learn about ATRs. There's a lot of stuff to that. There's layers to that knowledge. But the key is to never let a winner become a loser. Right? I have losing stocks. For example, I bought United Health. It went up, I don't know what, 15% and then it went down again and I exited with a small loss. Why? because I'd set a stop. I didn't have to think about it. When it collapsed, when it crashed, a rule got triggered and it's out of the portfolio. And now there is a nice bit of cash that I can then reinvest. So, we don't ever want to allow something to become an anchor, right? Tied around your ankles as you are swimming in a sea full of sharks, which is pretty much what Wall Street is. Now, the new Fed chair is going to be an interesting one. If the Fed becomes really supportive and starts cutting rates frantically, I think we should be more in stocks and gold and silver. If the Fed becomes more hawkish, I would reduce my stock exposure, certainly the higher risk parts of the stock exposure. So, you always want to be trade with the wind and I will judge that simply by where the money is flowing and by that I mean the institutional money and again what the free master class you want to go a little bit further into that. So, some exit rules here and these are not financial advice. They're not firm. They depend on where you are in the risk world of age and income streams and portfolio size and those values and so on. But never letting a winner become a loser, adjusting for the market conditions, doing some rebalancing, cutting losses somewhere, maybe not those numbers, but somewhere is something that is a very good thing to do. And then you're going to ask me, well, when will the market collapse? Surely it will because of whatever you believe. And look, we can't predict the collapse. But we can see very clearly when the warning bells start ringing. And there are a couple of things to that Vick's term structure and a few other things that almost nobody understands. And it's something that takes a little bit more than 30 minutes or whatever you have in this video to teach. But we have need to be aware that we are in a point where we are at stretched valuations. We're at sort of hoopum of AI. I'm still going to participate in this bull run because I like money and I like my money to perform for me. So that looks after me and my family. But I'm also wary and I always have automated risk management in place because that way even if something happens that I didn't see coming, I'm protected. So order your portfolio, identify the risk and the concentration risk you have. We got a tool for that actually in the in the community that we have. Don't have to join that but if you wish there's a tool in there called called retire which tells you all about that. um and make some smart diversification moves here. And the bottom line is simple. The warning signs are there. You got a government. If the government wasn't spending all this money, if interest rates being weren't being artificially suppressed, we'd have a massive recession. But the powers that be don't want a recession. They're enjoying the bonanza. So enjoy it, too. You don't need to complain about it. We don't need to scream it's manipulated. Well, you can it doesn't do anything. just participate in it in a smart way that protects your money, protects your risk. But the trouble is most people are flying blind. They have no road map. They have no target. They have no exit rules. They have no automation set up. And that's really what I want to want to help you fix. So watch the free mini masterclass at felix.org/getfree and put in the chat what you find most confusing. Put in the chat your questions and I will read those. I read all comments and then maybe we can do a follow-up to v video to this where we go deeper into the steps that we actually need to take. You can also jump to one of my other videos because we've walked through quite a lot of this how to protect ourselves in this year and any other year by following the same patterns, the same rules that have been out there for 50 years plus that my Wall Street mentors taught you. So, if you got some value out of this, share it with a friend, share it with a golden retriever, protect yourself, but enjoy the party. Just make sure you're not the last man standing. I wish you all the best. If you hold a 401k, a savings account, bonds, or cash, shares, ETFs, what I'm about to reveal to you could mean the difference between preserving that wealth through the biggest monetary shift in."
    }
]