[
    {
        "video_id": "6KTBD2rYxIQ",
        "title": "ISM Above 50: Altcoins Ready to Explode? #shorts",
        "published_at": "2026-02-03T19:25:40Z",
        "sort_date": "2026-02-03",
        "url": "https://www.youtube.com/watch?v=6KTBD2rYxIQ",
        "transcript": "Now they have at least the ISM guys. The ISM now is above 50. All of the ISM guys from RP Paul and everyone else who has been saying that all coins are going to moon since October. They're going to 40x 20x. They've all been saying that ISM is going to come and ISM is going to save the party. The ISM is going to fix everything. As soon as the ISM will come back above 50, which is a signal that the economy is running hot, it is a signal that the manufacturers are spending money and it means that they're bullish on their business and so on so forth. When that comes, when that ISM index goes over 50, which is a metric of how hot the economy is, that's when we're going to pump. That's when alcoins are going to 50x."
    },
    {
        "video_id": "k-gkqrFA9TA",
        "title": "Trump&#39;s New Crypto Coin? #shorts",
        "published_at": "2026-02-03T17:17:10Z",
        "sort_date": "2026-02-03",
        "url": "https://www.youtube.com/watch?v=k-gkqrFA9TA",
        "transcript": "But there are rumors that Trump will do another coin and u it's for his DJT company. Actually, we covered it a few weeks ago, but uh yeah, I didn't understand it's going to be so quickly. So, turns out that it's going to be very soon. Uh maybe even today, guys. Let's see if something's going to happen here, but that's be very bad. I mean, Trump, he cannot do more coin. We have enough. We have enough, man. We have enough. We have Trump. We have Melania. We have World Lacy Finance. They're all down to zero. They're breathing down his neck, but also our neck when it comes to crypto, you know, all of the corruption and all of that. That that they're going to they're going to let the hounds loose, guys. If they get any kind of power damage, they're going to get the let the hounds loose on Trump on all of his crypto ties. Crypto is gonna be hit hard. is gonna be hit hard."
    },
    {
        "video_id": "7SxLqR2coek",
        "title": "Tom Lee&#39;s Potential Trading Record #shorts",
        "published_at": "2026-02-03T11:47:40Z",
        "sort_date": "2026-02-03",
        "url": "https://www.youtube.com/watch?v=7SxLqR2coek",
        "transcript": "He's currently number five in the biggest losses ever in trading worldwide. The biggest one is 10 billion. So, he can still reach number one if he keeps losing another four billion, [laughter] which is not impossible. If ETH goes to the range lows, he's going to be number one winner for the biggest public trading loss on Wikipedia, which is currently at 10 billion. So, he definitely has a chance. And now, Bitcoin is at 2.3. But listen sorry if is at 2.3 but uh it's you know the sky is the limit here because we have a range low at approximately you know 1.4 1.2 to it's quite a big area here that that we can bottom at but around one low 1.1 one low 1k basically low 1k so you can still do it. So as always guys follow the price follow the chart people who are speaking on television they have other uh incentives that you may not understand. I mean for Tom Lee for example it is the compensation. I mean nothing wrong with that but it it is compensation. He now has the compensation from uh from Bitine. His his job his job is to be bullish ETH to attract more ETH to Bitine and that's his KPI. His KPI is not to be correct because he doesn't get paid for being correct. He gets paid for Bitmine growing ETH stack and Bitmine stock going up and that's it. And of course when he speaks publicly, how does he attract the investors into Bit? He needs to say that ETH is going to go up because Bitmine is ETH. I mean Bitmine is an empty shell around ETH. Okay, they don't produce a lot. It's not Apple producing iPhone that people buy. It's not Microsoft producing anything that producing software people buy. It's not, you know, some some kind of production going on where there's customer demand for the goods and services. No, it's just a wrapper around ETH. So, if ETH goes down, Bitman also goes down and even more because it's a company. It has more risk. It's kind of like a leverage play on ETH. And the same is to the upside. If ETH goes up, then Bitman has a place in the world or at least to some extent. And that's it. That's it. Obviously, he cannot be bearish his own company. It would go against his KPI. kind of the same for Kathy Wood."
    },
    {
        "video_id": "pdpUrzqUSZ0",
        "title": "BITCOIN AND ETH: BULLS HAVE A CHANCE HERE!!! 🚨🚨🚨 (ISM)",
        "published_at": "2026-02-03T09:51:33Z",
        "sort_date": "2026-02-03",
        "url": "https://www.youtube.com/watch?v=pdpUrzqUSZ0",
        "transcript": "another episode. And as you can see right now, we do have a bit of a bounce here for Bitcoin. It's back towards 78. I mean, to be fair, we have support here at the previous year low, 2025 year low. And now, Bitcoin is using it as support. We could go all the way to 84 to fully close the CME gap. As you know, we discussed it yesterday. It's not news for you if you're watching the channel that we have a gap on the CME. And we expect this gap to close sooner or later. We don't know if it's going to be this week or next week. But guys, the Bulls actually have one more catalyst, probably their biggest catalyst, their most important narrative now flashing and flashing, flashing, flashing a big fat bull signal. Will it help the bulls to get over this line, get back into the range? I mean, number one, they have to get back into this range, which we've been for months and months and months. Then they have to go back to 50 week. This is like Frodo going to Mordor trying to fetch the ring, destroy the ring. It's kind of mission like that. But now they have at least the ISM guys. The ISM now is above 50. All of the ISM guys from R Paul and everyone else who has been saying that all coins are going to moon since October. They're going to 40x 20x. They've all been saying that ISM is going to come and ISM is going to save the party. The ISM is going to fix everything. As soon as the ISM will come back above 50, which is a signal that the economy is running hot, it it is a signal that the manufacturers are spending money and it means that they're bullish on their business and so on so forth. When that comes, when that ISM index goes over 50, which is a metric of how hot the economy is, that's when we're going to pump. That's when all coins are going to 50x. And of course, what happened? They hold held all coins minus 80% most all coins down minus 80% since October and now finally ISM is above 50. It hit 52 and like this guy is saying this entire cycle since 21 we've been below 50 with only tiny blips above the surface. This is by far the largest move this cycle run it hot. They're saying run it hot. It's time for the bulls to run it hot. And here is where of course it's really make or break. I mean it's a make or make make or break because if the ISM narrative disappears as a concept also just like M2 narrative disappeared you remember everyone was looking at M2 until it didn't work and then everyone start to look at the ISM until potentially it doesn't work and if you are in bull mania you know you I I sent you this newsletter in November you received this new letter newsletter in November this was already many many months I mean November how many months like three four months and so I told you listen a few months ago everyone was talking about the global M2. This is already in November, we knew the global M2 is dying out as a as a narrative and that was supposedly the reason Bitcoin simply had to keep going. And now they have a new thing. They have a new chart. They found a new micro chart, the ISM. Why? Because the Global M2 is no longer fitting the bullish bias. And so the ISM guys now have their foray, so to speak. They are actually testing their narrative and they may actually get a bit of a tailwind here if Bitcoin for example goes and closes the gap at around 84 or even comes back here to 86 to test this breakdown. But for us it's very important to just follow the chart guys. I mean as you know we just follow the chart and here I agree with Ben Khan because he did an analysis of the ISM and also conclude that it's a very bad signal. I mean it is it's true that in general when economy is hot bitcoin should be hot and sometimes those numbers overlap but sometimes the economy is below 50 ISM and bitcoin still pump. So it's more you know this charts where you compare ice cream sales and shark attacks in the in the water. Have you seen those when you basically want to prove that it's it's correlation but not causation. I mean there are many such charts. You have the correlation versus causation charts. Let me just show you now shoe sales versus diabetes or something like [laughter] okay look here you have letters in winning word of I don't know some spelling be thing number of people killed by venomous spiders overlapping exactly ice cream sales and shark attacks they go exact because both happen during the summer you know and next autism organic food sales up and up so there are many of these things you can overlap And of course in crypto we do this all the time. We're the best at, you know, finding some kind of fractile, finding some kind of opium. When you're down 90%, you you're not too picky, man. You're not too picky. I I as long as you find something that kind of looks similar, even if it's not the same, you can tilt the chart a bit. You can zoom in, zoom out the chart until it looks kind of okay. And then, of course, you have a new narrative, you get Twitter engagement, and so on so forth. So all in all, guys, with the ISM, what's the conclusion? The conclusion is like you probably already know if you're watching the channel, we follow the chart the chart and we follow the price. We actually expect Bitcoin to go to 84 to close the gap, maybe even come back here to 86. But for bulls, it is a bit of a make or break because if this doesn't work, if this doesn't pump us, there is literally no other narrative uh until we go and and hit 200E moving average because then I'm bullish and then we have a big bullish narrative. the fact that Bitcoin is is a very good fair price and very good long-term riskreward at 200 week. Look here, Tom Lee has come out and said yet again that we're bottoming, bottoming, bottoming, bottoming, bottoming. He's been saying bottoming since October. Maybe another bottom, maybe not. Let's see. >> Are in place for crypto to be bottoming right now because we're getting the level and enough time has passed. So I think as long as crypto fundamentals are good which is the case you know Ethereum active addresses is going parabolic right now and activity part of it is >> take the the simplest metric like asking him like just give me something okay active address it's like you know the simplest I don't say dumbest but you know you can create a lot of addresses I can be one guy I can do a million addresses that's why this onchain guys when they say you know active addresses you can have one guy with a million address I mean At the end of the day, it's, you know, the simplest model, you know, what do we have? Okay. Active address. Okay. Okay. Let me see. Let me see. >> Wall Street is building on digital assets in >> Guys, guys, sorry. Sorry. This is wrong. This is not Tom Lee. This This is real Tom Lee. >> I really think crypto has bottomed. And I know I've called for the bottom the last 800 times. And I even said that Ethereum would be at $9,000 by the end of January. And I'm one of the worst public investors of all time because I'm down $6 billion on Ethereum. And at this point, I'm sure you don't believe anything that I say. And the only reason I'm saying these things because I'm getting paid by Bitmine to do it, including my $5 million stock bonus for buying so much Ethereum. And Ethereum is one of the worst performing assets in the last 6 months. But I just keep buying it and buying it and buying it. And I'm going to keep buying it while Bitmine is paying me to do it. And I'm going to keep saying it's the bottom even though it really won't be. And we're going to be going down forever. But I'm going to [laughter] keep going on CNBC and saying that it's the bottom until I stop getting paid to do it. I [laughter] really think >> Listen, I big shout out to Tom. I know we're joking. We're joking. We need a bit of humor. I'm sure if he watches, he will understand. He should watch the channel because it could have saved him $6 billion. I mean, this is the price of not watching the channel, not following the mechanical rules. He is currently number five in the biggest losses ever in trading worldwide. The biggest one is 10 billion. So he can still reach number one if he keeps losing another four billion which is not impossible. If ETH goes to the range lows he's going to be number one winner for the biggest public trading loss on Wikipedia which is currently at 10 billion. So he definitely has a chance and now Bitcoin is at 2.3 but listen sorry if is at 2.3 but uh it's you know the sky is the limit here because we have a range low at approximately you know 1.4 1.2 to it's quite a big area here that that we can bottom at but around one low 1.1 one low 1K basically low 1K so you can still do it. So uh as always guys follow the price follow the chart people who are speaking on television they have other uh incentives that you may not understand. I mean for Tom Lee for example it is the compensation. I mean nothing wrong with that but it it is compensation. He now has the compensation from uh from Bitine. His his job his job is to be bullish ETH to attract more ETH to Bitmine and that's his KPI. His KPI is not to be correct because he doesn't get paid for being correct. He gets paid for Bitmine growing ETH stack and Bitmine stock going up and that's it. And of course when he speaks publicly how does he attract the investors into Bitmine? He needs to say that ETH is going to go up because Bitmine is ETH. I mean Bitmine is an empty shell around ETH. Okay. They they don't produce a lot. It's not Apple producing iPhone that people buy. It's not Microsoft producing anything that producing software people buy. It's not, you know, some some kind of production going on where there's customer demand for the goods and services. No, it's just a wrapper around ETH. So, if ETH goes down, Bitman also goes down and even more because it's a company. It has more risk. It's kind of like a leverage play on ETH. And the same is to the upside. If ETH goes up, then Bitman has a place in the world or at least to some extent. And that's it. That's it. Obviously, he cannot be bearish his own company. It would go against his KPI. kind of the same for Kathy Wood. I I must say as well this is from when Bitcoin was 87. She was also so bullish. You know, we're bottoming. We're bottoming. Now we went to 75. But just just to give you some perspective, this is this was when Bitcoin was 87. >> I know there's a lot of fear about the four-year cycle. We didn't have much of an upycle by Bitcoin standards. So, we think we're pretty well through the down cycle here. We may test in this 80 to 90,000 range on Bitcoin >> or 75. We actually went to 75. Kathy, what about that? >> But we do think that the test will be successful. It will be the shallowest uh fouryear cycle. >> I agree. But this is the shallowest four cycle is already part of our strategy because the 200 week is very close to the price now. It is the closest it's ever been to the top. It is just 54% below the all-time high and this is way way short. Let me actually see how long it was in this situation. Here it was 70. I mean just to give you a comparison. So when people say that oh Ivan your strategy about 200 week is wrong because this time we didn't go up as much. I'm telling you it's actually exact because uh 200 week moving average is now way closer to the top than it was back in 2021. So our strategy already takes care of that. uh and instead of trying to guess for cycle this for cycle that, we just follow along and we see what's happening. I mean, in fact, uh I I sent it out yesterday to our to our members. But you see the uh current year uh year-to- date performance of Bitcoin, which is the green chart, it is exactly where the average is of the midterm years. So, why not be a bit humble? I mean, that's that's my message to everyone who is saying that the for cycle is over this and that and that it doesn't apply. Why not you be a bit more humble? Sometimes people tell me to be more humble. People are saying, \"Ivan, why why you congratulate yourself so much?\" I mean, otherwise people listen to this kind of stuff that I just showed you. They they don't understand that they're being uh bamboozled. They're the pleb, you know, these guys is bamboozled, fully bamboozled in instead my my message is instead that why are they not that humbled? Because I mean, our strategy is very simple. Uh we follow the trend, we follow the price trend, we also respect what happened previously. I mean you understand it's exact like what do you want midterm year it goes exact like like the average midterm year okay can it change it can change we're going to react if the price changes but you understand why try to frontr run the change when it is exact ever since the year started people have been saying but I mean it's not exact you cannot compare to previous midterm years you cannot I mean it is exact what do you want like what else you want what else you want and if it's not exact then we're going to react but trying to front run that is going to not be exact that's foolish but guys the final thing I want to show for the bulls that bulls really have is the year of the horse. Let me know if you know the Chinese the Chinese wisdom the Chinese uh the Chinese um uh was it astrology horosc horoscope astrology Chinese astrology and this is from the Nvidia CEO confirming that it is the year of the horse >> and this year this year is the year of the horse some music I cannot play it he said it's the year of the horse and he's bullish so let me know guys if you are bullish on the year of the horse and um yeah if you know the Chinese uh astrology, but I'm also bullish once we hit the 200 weeks. So, it's going to be fantastic, fantastic, fantastic, guys. Also, I hope this does not happen, but there are rumors that Trump will do another coin and u it's for his DJT company. Actually, we covered it a few weeks ago, but uh yeah, I didn't understand it's going to be so quickly. So, turns out that it's going to be very soon. Uh maybe even today. Okay, maybe even today. Uh let's see. today confirmed the record date, but that that was yesterday. February 2nd. It was yesterday. Guys, let's see if something's going to happen here. But that's be very bad. I mean, Trump, he cannot do more coin. We have enough. We have enough, man. We have enough. We have Trump. We have Melania. We have World Liberty Finance. They're all down to zero. We have Democrats who are likely to capture some kind of power in the midterms. They're breathing down his neck, but also our neck when it comes to crypto, you know, all of the corruption and all of that. that that they're gonna they're gonna let the hounds lose, guys. If they get any kind of power damage, they're gonna get the let the hounds loose on Trump on all of his crypto ties. Crypto is gonna be hit hard. It's going to be hit hard. Okay. If they get any kind of power. So, why dig the grave even deeper? [laughter] Well, let's see guys. That's kind of what's what's happening now. Uh oh, yeah, this one. You f me, I take away your super psycher psycher. Is that how you say it in China? Super. You know, there's a lot of fat against CZ. There's a lot of fat against CZ. Everyone is is uh that's saying that he is the reason that we had the crash in October 10th. Um I don't know if you can blame CZ for Bitcoin crashing in Q4 of a cycle, top four cycle. Okay, I don't know if you can blame him. It did the same thing in 2021. But here people also blame CZ because he said he said that he's selling FTX coins and FTX collapsed. So he This was also his fault, guys. And this was his fault also. Everything is easy fault. But yeah, I take away your super psycher. [laughter] You pardon me? I take away your super psycher. Oh yeah, just one patai, please. Oh, no. No. I take away your super psycher. [laughter] Big shout out. Big shout out. Big shout. But yeah. Anyway, guys, CZ, listen, you cannot blame CZ for everything. People blame CZ for everything that they lost since October. But um I mean we've been calling it pretty accurate. So clearly there was a way to to navigate to navigate this situation. Clearly there there was a way to read the markets in in [clears throat] a way where you start the risking in October. So we didn't uh I mean we don't we don't blame CZ for anything. We don't blame CZ for anything. I mean did he do something? I mean who the hell knows? Binance. Who the hell knows? No one knows. It's it's too complex to know. Maybe if you or a Binance user you have a different perspective. I've seen many people complaining that they got liquidated. The system did not work. There was a small bug like Tom Lee said. There was a small bug in Binance that just cascaded all the liquidations. Maybe maybe I don't use Binance myself, so it's hard it's hard to know, but from a outside like market reaction. It it hasn't been impossible to to read it and to adapt and to play it fantastically well. And in fact, when things are dumping, you know, some people lose, but also many people gain. I mean, that's what we're doing in Bulmania. I mean, I'm I'm sharing all of the wins here. Passive in uh shorting XRP. This was a few days ago. He actually posted a new one. Let me show you here. Uh yeah, actually before the stream, he posted 76% up shorting XRP. So even when market is down, like it's not necessarily bad. You can short it. I mean, there's a button to short uh on most exchanges. So if you go to bulmia.com, you watch the free training about the mechanical rules, you will have the confidence to act in the market also. I mean, most people don't have the confidence because they they're they don't they don't trade. They gamble. They just go all in and then they get wrecked and then they get burned and this and that. They don't have the mechanical rules. You can also make manual longing. For example, SK76 in our discord yesterday shared a nice long here at a ASX. Is it is this AXI or what is it? AXS AXI, right? Anyway, 100% fantastic, fantastic, fantastic. You don't have to huddle for too long. You a nice move with good stop loss, good risk management, good take profit. This these are the mechanical rules and people also say Alan can you share some losses? Do you guys only have big big wins every day or losses also? Of course there are losses as well. This guy for example lost 31% trying to long silver but as he wrote he tried to long it in a a bare trend and big shout out to Mooncat. He also had many wins that he posted previously but just to highlight that in all journeys like you are on your trading journey is going to be good days and some bad days. So Mooncat had a big big winning streak in our discord and then he said listen I tried to frontr run the bull flip and uh now he had to cancel it with loss as the takeaway apply the mechanical rules follow the system don't try to be smart don't try to outsmart it so absolutely I mean whenever you learn something new whether it's English you try to speak I mean you see myself I'm still kind of you know 50/50 English you're going to have good days you're going to have bad days it's part of the journey but the law of large numbers says that if you have good position sizing you have good risk management, you will over time be mega profitable. Okay, that's the law of large numbers and it's all trading is it is position yourself so the cards are stacked in your favor and over time you're going to be doing fantastically well. So all in all, go to booming.com to sign up. And if you haven't yet, check out the exchanges I use uh in the description. Uh go to this URL, booming.com/partners, and there you can sign up for Pionex. So you can go long, you can go short, you can sign up for buy bit, for Bit Unix, for weeks, for for all of them basically. And you get nice signup bonus. Also, big shout out to Guzman for time stamping us. And on this note, let's continue. [snorts] Look here. You have something interesting going on with Hyperlid. Hyperlquid. Now they're launching they're launching all kinds of features. They're launching um prediction market. They're launching everything basically with this HIP4 uh upgrade. So this is the outcome trading as they say. They don't want to say betting. They are smart here. They're not saying betting. They say outcome trading because it sounds sophisticated. It sounds like it should not be regulated as betting because betting is regulated. But guys, we're not doing betting. We're doing outcome trading. You know this this meme, Vinnie the Poo in like a normal shirt betting. Vinnie the Poo in like a smoking outcome trading. Exactly. [clears throat] They're doing outcome trading aka prediction markets. So this is going to be the upgrade. HIPP4 outcomes are fully collateralized contracts that settle within a fixed range. They are a general purpose primitive that are useful for applications such as position markets and bound options like instrument. Listen, they're targeting predition market like this, you know, bound adoption. They want predition market. They want polymer market. There has there has been extensive user demand in both of these areas. And builders will likely think of novel applications as well. Outcomes bring nonlinearity. Basically, either this or that. They are discrete. You have a bit of discrete mathematics. If you understand um dated contracts and an alternative form of derivative trading that does not involve leverage or liquidations. There you go. The outcome, let me make some coffee. The out the outcome primitive expands the expressivity of hyper core while composing with other primitives such as portfolio margin and hyperm. So guys, keep an eye on this because uh obviously hype is another coin that um is super interesting to huddle for the next uh bull. Super interesting to huddle for the next bull. Uh let's see where is the biggest chart. Where can we see the biggest chart? It and it is actually a nice bull trend. I going to show you when it flipped bullish. But as soon as Bitcoin starts to hit that 200 week moving average, we have to consider the the top portfolio still in bare trend here. Uh on um uh on the weekly on the daily let me see here on in the system where we have hype on the daily it has been quite fantastic let's see boop boop bullish bullish bullish bullish look here since a week ago on the daily bullish 50% pump since the bull flip a week ago so for short-term trading this has been great for long-term accumulation Even though it's hyperlquid, I will not buy it until we get to 200 week for Bitcoin until Bitcoin shows a bottoming because just like it pumps fantastic. It also dumps fantastic. So all in all, short-term trading, yes, long-term trading, it's a bit too early long-term huddle. But this is just to prepare the ground in your brain for the type of assets that likely are going to do extremely well uh once we enter the the next bull uh towards the middle or end of this year and early next year. I mean, Sol is obviously one of them. We've been speaking about it a lot, but we should be speaking more about Hyperlid also. Look here, Hyperlquid versus Robin Hood. Market cap, Robin Hood is 80 uh 89, Hyperlquid is just eight, fully diluted 89, Hyperlquid 26 at current price. Revenue 4 billion, Hyperlid 844 million. So, you need to see the relationship between these numbers. Here it's just a 4x difference or like 5x difference. Here it is 10x difference in the in the market cap. So fundamentals and the market cap gap uh are way different. The gap between fundamentals of Robin Hood and Hyperlid and the market cap are way different. And so also staff count your staff count. Well, look at all the expenses Robin Robin Hood has. 2.3,000 people working at Robin Hood. Hyperlid 11. [laughter] It's going to get crazy guys. in the next bull. This is [clears throat] going to be one of the uh top picks to dominate to dominate the uh the portfolio from an all perspective. For now, we keep to the strategy. Even though I'm excited about Hyperlid, I need to keep to the strategy, guys. [clears throat] And that's that. We risk off even though it's uh fantastic updates. We're on a big picture. We risk off for short-term trading. Let's say a week ago it fle bullish 50% up. Fantastic. Totally valid. Totally valid. But uh if it turns bearish, we're out. I mean, because it's on the short term, we don't drink the Kool-Aid. We don't drink the Kool-Aid when Bitcoin is is still weak and still risk up. Now guys, um there is some concerns with OpenAI. The reason why I'm telling you this is because OpenAI is a big part of the growth of the stock market because the growth of the stock market normally comes from the big tech firms and they're super much invested in open AI, especially Microsoft. And um if AI doesn't pan out, there may be problems for the economy, for the stock market. So listen to OpenAI CEO uh Yansen speak about the fact that they're not really committed to Open AI. This was kind of new. I mean, for for the media, this was kind of new that he isn't as bullish as he as they thought he was. That the deal, their hundred billion dollar deal isn't actually a deal. It was more of a you know more of a discussion more of a possibility. It's not actually a deal. Listen to this. >> Can I ask quickly about open AI again? So last uh yesterday you said that uh the uh Nvidia is not going to invest uh as much as uh 100 billion in open AI. That's the current law. >> We never we never said we were going to invest a hundred billion dollars in one round. That never was said. >> But how? And guys, by the way, this video is real, but the background like the camera it looks like AI, but it is a real video, but you also see like the background is like it's like AI. You see, you don't see any difference nowadays, but the video is real. >> About the overall commitment because last September you and open. >> There was never a commitment. It was if they invited us, they invited us to so so what? Let's start over again. >> Yeah, exactly. He's Nvidia. So, did I say open AI? Nvidia. Nvidia. >> They invited us to uh invest up to $und00 million. >> And of course, we were we were uh very happy and honored that they invited us, >> but we will invest uh one step at a time. >> All right. [laughter] >> Okay. >> M you see in his body language, he's not happy with open with open AI. He's not happy with OpenAI at all. And this Nvidia deal you see yourself. [laughter] I can tell you I listen I have experience raising money. We raised 50 million for Morales. I can tell you when an investor says like this this is uh very very very bad. Okay. I can tell you that uh uh may many maybe you guys don't know but I'm actually a bit of a fundraiser myself [laughter] like in the Spider-Man you guys. I'm actually a bit of fun. So we raised 50 million for Morales. So I I have full experience on the VC Silicon Valley race. I know all about it. Guys, when you see this, it's not good. So if there is an issue with open AI, it's going to be felt for big tech and so it's it's one of the risk factors we have to consider when it comes to the stock market. Also, if stock market dumps, crypto also going to nuke. So yeah, I mean the >> they invited us to uh invest up to a hundred million dollars >> and of course we were we were uh very happy and honored that they invited us >> but we will invest uh one step at a time. >> Mhm. >> There is something fun, >> right? But uh is that overall commitment still stands or it it's not the commitment? >> I told you just now. Okay. >> Yeah. You keep putting words in my mouth. It's notable. Yeah. Yeah. Yeah. I know that. Yeah. >> They invited us to invest up to >> $100 billion. >> Peace. Peace, guys. And and we are honored that they invited us. We will consider each round one at a time. >> Yeah, man. This smile I I can see it's not real. But he he he's bullish for the year of the horse at least. Uh yeah, I mean this, you know, looking around. Yeah. He's not happy. He's not happy. So yeah, hopefully Nvidia is okay. Hopefully Nvidia is okay. Uh why would he be so mad? I mean that's another thing. Why would he be so mad? I hope Nvidia is okay, guys. If Nvidia is not okay, your crypto bag shitcoin is not going to be okay, guys. It's going to be flushed. It's already flashed. It's going to be flushed again. It's going to be mega flashed. So risk off is risk off, guys. Risk off is risk off. And by the way, it's kind of a systemic, you know, you know how everyone in crypto was saying we don't have any exposure to FTX. we don't have any exposure to FCX. When FCX collapsed, all of the other exchanges, all of the like apps, all of the crypto service providers, they said we have no crypto exposure. Everyone like went around saying we have no crypto exposure. Kind of the same thing now is happening with AI because Oracle is another infra company. As you know, they invested a lot in AI and they're now coming out saying the Nvidia Open AI deal has zero impact in our financial relationship with Open AI. So the fact that Nvidia OpenAI deal may not happen, they have they're saying it's okay for us. It's okay. We remain highly confident in OpenAI's ability to raise funds and meet his commitments. Exactly. It's like literally bankr run language. It's a signal to investors that listen relax. Please relax. So for big tech guys, this may be a bit problematic. I don't want to fud too much but um yeah respect the dump in terms of weakness when um when crypto is down and stock market is around alltime high which it still is if stock market goes down let's say 10% which it can easily do it can easily do and still be in mega bull trend uh it's not going to be great it's going to be great for shorting it's going to be great if you know how to short if you if you have uh buy bit if you have bit unix if you if you have all of the different platforms where shorting is allowed and you know how to short with the mechanical rules. Uh to get the sign up bonus, you go to exchanges I use in description. You sign up buy bitx and all them. Uh and yeah, if you have the mechanical rules, you can actually shorting is a reality. Uh to get mechanical rules, you go to bullming.com. But otherwise, it's better to be on the sidelines seeing how this will play out. Once the bull bull flip happen, that's uh that's when we act. Okay, that's when we act. That's when we act. Guys, if you are in Germany, ING Bank now allows retail to to trade Bitcoin ETH Solana. A bit too late. I mean, listen, Bitcoin was $100 10 years ago. Now it is 78,000. So, yeah. I mean, it's I guess I feel sorry for Germans. I feel sorry for Germans. They're milked like cows for tax, bad weather, bad safety, no investment opportunity. You know, now they give you I mean I mean at least there's something you know at least at least something at least something at least there's something you know and also you know part of Germany has also a bit ugly Soviet architecture you know at least you know in other high tax countries at least you don't have this commi block stuff but in Germany they have both they are both the high tax bad weather no safety and commi block How how if you're from Germany, let me know. Let me know. Let me know. I mean, the first time I was in Berlin, I thought I was in Minsk. It was the same. [laughter] But I mean, yeah. Like, what is this? It's uh it's uh far east Siberia or is Berlin? I'm not sure. [laughter] Guys, let's go to Q&A. That's it. Big shout out to Guzman. Let's go. Let's go. Let's go. Exactly. Yes. You should study the the history with division. It was divided. Exactly. Exactly. Let's go, guys. Let's go. [clears throat] You're wearing lipstick today. Maybe, maybe not. I mean, the the question I always get. [snorts] You tell me, guys. Lipstick or no lipstick? Guys, let's go to Q&A. Big shout out to Guzman four times something else. While you are thinking about your great questions, check out the link to bullmania.com for the mechanical rules. bulm.com/partners for the exchanges and all of that. Let's go. There are many very Yeah, I know. I know. In Germany, there are some beautiful places. Yeah. Yo, I Avan, will you add stocks? So, in Bullman, I'm going to share the my new uh portfolio for 2026. It will be it it will be with stocks. I'm now repositioning uh for for 2026 because what I like to do, you know, once I'm out of a great trade like with Bitcoin, we had from January 223 until the end of 2025 until October. It's a great trade. I don't want to, you know, just be, you know, jumping in, you know, throwing in. I I wanted you know to let some time pass some you know some let it calm down let it um and then thinking clearly we can decide on our next move and that's the next move right now but yes it's going to be uh it's going to be more 360 than before meaning there's going to be stocks uh via ETF there's going to be exposure to uh precious metals not now though not now we need we need to dump and of course crypto and of course crypto so uh we have to be 360 guys in in this kind environment we have to be 360. I mean you see yourself a lot of stocks and a lot of precious metals are are pumping like uh like crypto and and also like ETH and uh Bitcoin they don't they in the last five years they have not outperformed even the money market fund you know just the yield 3% per year u looking at for example m uh Michael Sailor if you follow his strategy he hasn't outperformed even the treasury yield you know the so-called hyperinflating fiat so we have to move away from just you know slogan slogan after slogan after we have to build a nice portfolio that goes up and uh goes for bull mania in the portfolio. Okay, crypto is going to be a big part of that. I still think Bitcoin is going to go to 1 million uh within the coming the coming uh years and uh the same thing. I mean there there going to be many many great trades in crypto but all in all we have to be 360 uh 100%. [clears throat] Oh it's the year of the fire horse. Exactly. It's not I remember checking it. It was not just the horse. It was the fire horse this year. Exactly. [snorts] Matt, I'm a Europore German. I'm a Europore. Okay. You're a Europore. German economy ain't what it Yeah, they nuked it, guys. I mean, the the Green Party nuked everything like the or their influence with shutting down the nuclear plant. I mean, it was so dumb. Everyone knows it's dumb. That's the Dambo, you know. It's uh it's crazy. It's crazy. But yeah, now now they are learning the hard way. They're learning the hard way. So yeah, hopefully they're going to fix something. Or maybe not. Probably not. I mean, it's still lefty country. So very bad. So yeah, let's see. Even the, you know, the problem with the lefty countries is that even the the so-called, you know, rightwing or free market guys, they're also lefty. It's a bit less lefty. Uh but anyway, it's maybe they're going to fix fix something. But um I mean for us entrepreneurs, you give so much in tax for what? For sitting there. You have a chair there. You have a chair somewhere else. You can if you're just click click click on the computer, your dumboo. If you are in high tax, you can sit in a chair anyway. I mean your your botox will not see any difference if chair is there or the chair is somewhere else. It's the same computer. Maybe you can even have a bit of ocean view somewhere else. Uh so it's uh yeah, let's move on. Yes, let's move on. Actually, I don't like like the topics anymore. It's uh like I told you I'm with I mean with everything else with crypto with AI like we said what want to say I everyone who understands understands if you don't understand good luck great let's just focus on crypto that's it what should I teach in my counseling lecture regarding crypto not sure what you mean counseling lecture which counseling lecture the most meaningful aspect uh is self counseling yes I'm getting up early to go for a long swim in an outdoor pool exactly you You can do it in January, in February. It's very good. Russian gas is oxygen for German economy. Yeah. I mean, they order nuclear, but they they don't this is this the green greeny greeny brain. Don't want nuclear and don't want Russian gas. Okay. So, but they want nuclear weapons. I thought that was funny. The Green Party in Germany, they want nuclear weapons. Nuclear energy. No, no, no, no. nuclear weapons. Yes, [laughter] guys, be careful. You give Germany the nukes. I'm not sure it's smart. Look at history. I know that, you know, everyone kind of forgot, but uh I don't think it's smart. I think it's uh things change quickly. I mean, today they are nice and lefty and tomorrow maybe not so much. [laughter] German green call for developing nuclear weapon. Exactly. Nuclear power. No, no, no. Nuclear. Exactly. [laughter] Man, things can change quickly. things can change quickly. I I wouldn't give Germany. You got to be super careful, man. You give them, you cannot take them back. [laughter] So all of you guys, you know, Netherlands, France, I mean, you you but you don't know. Everyone always forgot everything. [clears throat] Okay. Um I will teach students how to do counseling, how to find what they're what they're good at. Oh, just so here's the thing. Uh you're going to give like an inspirational speech to your stu students or something. I think they just need to try different things uh to uh I mean see what what sticks. Don't necessarily follow the passion. Just get good at something. I mean that's the thing. You you you like what you're good at. I don't like the advice. Some people say, \"Oh, follow your passion.\" But when you're not good at anything, you don't like anything. Follow your passion. Oh, you know, it's kind of a mental shield against working hard. Because obviously learning something is hard. Learning anything that's worth learning is hard. So it's easy to say, \"Oh, but I don't want to learn. is not my passion. So I would say just get good at at something because whatever you're good at, you're going to like that. You're going to see appreciation. You're going to see money coming into your bank account because you're good at something. So just get good at something. Be smart picking something that you know when you get good at it, it's uh it's is profitable. I mean people sometimes get good at things that are not profitable. They can identify a million genders. No one cares about that. Speaking about the can identify a million genders that they imagine and um yeah, no one cares. So yeah, you got to be good at something that is valid and that's it. That's it. That's it. But then it's hard, man. It's hard to it's hard to it's hard to give advice. I mean people have to figure out themselves. It's uh but it just gets good at something does that identifying genders is now this well it was good maybe 10 years ago 10 years ago a lot of this I mean you could make a career just like doing me too stuff I actually know a girl she she's a nice girl in Stockholm she was like on her LinkedIn like it was organizer of me too movement uh Sweden Stockholm home. I was like, man. And then she like got inv she got, you know, she got to be like the IT girl of the year by Microsoft because she was, you know, she was a bit in tech and then she organized a bunch of me too stuff and uh yeah, she was like digital IT girl 2016. So that worked that that back then. Now I I think she's looking for a job now or at least that's the last thing I saw that she was like looking because she's not she's not a dev. She's not an engineer. So she was like organizing a bit of this, a bit of that. Um, uh, yeah. So you you need to know hard skill, guys. You do you know hard skill? You don't know. It's very bad that you don't know. You need to know hard skill. Hard skill. Soft skill. It's uh you're too man. You need to know hard skill. Hard skill ideally you need to use AI also. Okay. You need to use AI so you understand the So you learn something where you use AI where you're not replaceable by AI. Anyway, it's a it's a deep topic. It's a deep topic. [snorts] It's a hard job in Thailand. Exactly. Exactly. You need all of the all of the experts there to identify. [laughter] Uh no, but I think that that time has passed, man. You know, you all of the social justice stuff it was it was you know the peak of zero interest rate phenomena. You know, some things are just zero there are zero interest rate phenomena. When there's a lot of money, people don't know what to do with the funds. They start uh you know dreaming into they you know they think they can turn off nuclear as an example in Germany uh they focus on stuff which don't matter and then bam smack back to the reality and that's what kind of what happened now and now you need hard skills okay now they understand hey maybe we should have not removed the military now they need the dudes in the military but they just told dudes for 10 plus years that they are the root of all evil and they take all the you know all the high paid jobs and uh so how we going going to get let's say Germany. How how we going to get German dudes to to the army to to defend Germany? You just told them they're the root of all evil for Temple. How we going? So anyway, it's a back to reality. Maybe it's going to be okay, maybe not. I I I mean, frankly, I don't I I I don't care. I don't care. Uh moving on. And we're moving on. Looking for an intern? Absolutely not. But thanks for asking, Bor. But absolutely not. No interns. I don't want to hire I I I hire as little as possible. Why? Because uh AI like we need to figure out the extent of AI first. All the interns not needed. That's a that's a harsh reality. You need to tell your students whoever asked if you want to be an intern, you're actually not really needed. Okay? And um now the next frontier for companies is to have as little people as possible. Like a big flex is if if you have very very little employees. kind of like what we read with um uh with uh Hyperlquid. They have 11 employees. So no intern, no low entry levelvel plebe. I mean that you have to be good at something. That's what I told you. You have to be good at something. Be good at hard skills. There is there is no room for plebbea. For low skill pleba, no room. You have to be you have to be obsessed. You have to be obsessed with some kind of skill. uh um I mean obviously there's a room of a bit of plebe I mean you need some kind of you know new generation in in a big organization but no not not to the same extent as it was before not at all not at all and also there is there are different kinds of pleba I mean you have and plebe in this case is let's say someone came from university there is someone who is mediocre as hell mediocre doesn't really know too much doesn't you know just kind of you know coasted glided through and then you have a guy who is obsessed he has some interest. He became good at it. Obviously, he has an opportunity. Everyone else was a kind of mid do you say midwit? Is that a word? I have it in my brain. Is mid is that is that a word? [laughter] Then you have some middle guy. I I don't think that the mediocrity is going to be uh rewarded. Instead, what you could do, let's say you're a bit of midwit, okay, use AI, maybe you can create something on your own. Uh you have so many tools now. It's kind of I mean on the flip side if you want to be an entrepreneur maybe it is the age of the midwit because as long as you can use AI like you but you need you need to know how to use AI that's the thing but before you are like the the idea guy you have no power nowadays if you're idea guy you could have a lot of power you could create create MVP you can even get the first clients first income but then you have to be street smart and hustle and see the money you have to smell the money you know so at least that you have to be you have to optimize As for revenue, your nose has to be trained to smell dollararis, satoshes, pesos and other such instruments in real time. You have to do it. The worst thing I think is no idea guy who cannot build and also is not good at business, not good at marketing, cannot get client, cannot get anyone. His idea also sucks. [laughter] You don't want to be that. Oh yeah. They need to make the coffee now. That's going to be the job for Optimus. When is Optimus coming, guys? All of the all of the Tesla fanatics. When is Optimus? You can also become a welder. You could you could, but Optimus is gonna weld. That's the problem. Optimus is gonna weld. I mean in the near future within the 5 years I think I think all of this blue collar guys they also should be replaced because it's not a good service now like in many cases you know you want to repair let's say you want you want to repair bathroom man you have to call they are busy oh come back in a week what do you mean in a week they should be all be replaced the whole bunch of the blue colors big shot of your blue color but you understand the frustration as a client >> you know you call oh we cannot we cannot or they home they repair it's broken again like it's so many the blue color is not a good user experience it is ripe for disruption with AI ripe Optimus repairing toilet optimus repairing roof leak all of that should be robot robot as soon as possible there is going to be a lot of demand a lot of demand for this h and both when it comes to overregulated countries like uh for example in Sweden I remember man to get someone to freaking repair stuff to do this you know white collar it's actually they need a lot of certification man they need a lot so it's kind of uh in demand service but because of that it's also bad service because you know they they come can you come today maybe maybe not I mean and in other countries is is just bad quality the flip side is okay they come they repair is bad repair slop something together blah blah That's it. So, it it's the I I'm looking forward to that uh blue collar replacement. And sorry if it sounds harsh, but it's true. It's going to happen. It's uh I because I I as a client I have a pain here. I would rather overpay for an Optimus to fix stuff. And if it I mean honestly has to work. It has to work uh than to handle you know call in call bam bam. Can you come? Okay. I can what is this? [laughter] So if you are blue collar you have to figure something out here. You have to become Optimus operator. [laughter] I mean at the end of the day, obviously Optimus cannot calm himself. He needs to have some guy that is responsible for the end result anyway. So maybe there's room there somehow. And maybe it's going to be five, maybe 10 years. I mean, who knows? But it should be within the foreseeable future that we have Optimus doing blue collar stuff. Let me know what you think about that, guys, by the way. But I can tell as a client there there is a big demand from me at least to to have freaking robot that fixes stuff otherwise too much money and they're late like I have a call u let's say I have a meeting the guy should have come for for electricity he's late what the hell now I have to both track my phone when he gives an update and this and that and do like what is this what is this you understand optimus delivered by Tesla exactly they to be Tesla self-driving car exactly >> [snorts] >> I mean, man, I would overpay so much for a freaking Optimus to, you know, do the electricity, do the So, either one can do everything or maybe in the beginning we need to have different ones. One Optimus for electric, one Optimus for uh bathroom like plumbing stuff. He dives deep in the freaking uh in the pipes. Third one for what? I don't know. Third one. Maybe two is enough of them. Oh, yeah. Third one maybe for the roofing. He he he he he checks the I mean this is the problem guys when you have a larger house like things it's like it's constant it's constant it's oh gardening another one with the scissor gardening in a large house I have a bit of experience holy cra I mean it's like 360 it's like a cycle this breaks this this fix this fix this fix until you fix like everything okay now restart the cycle now there's a new issue there now the freaking Grass and trees grown again, man. We just cut it. What? What is this? We just can't. Ah, the pool, man. The pool. Okay. Okay. Okay. So, it's like it's like a Yeah, we need Optimus, guys. We need like an army, a freaking army of them. [snorts] Uh, but big shout out to all the all the white color, blue color guys. I'm just brutally honest with you. when it comes to the the the customer need like the industry is not serving it good so it's going to be disrupted just like Uber came for taxi driver but see the blue color guys they can organize in union they can organize in regulation so I guess that's like the final frontier maybe that's why it's going to take you know more time more time for this revolution to happen but it's going to happen it's going to happen it's going to happen at some point if you're brutally honest if you're making a miniame would you slap a token and and some tokconomics to it or avoid it. If you do a mini game like which which mini I mean normally mini game is inside a big game you play a mini game like you play GTA San you doing mini game but you mean like you're just going to do maybe you mean a casual game you going to do like a casual game like tic-tac-toe and you're going to slap a token. I mean yeah there's no good or right answer here. I think the the the answer is can you make it pump? Do you have good mechanics to make it pump? Because the your mini game no one cares about. I mean, to be fair, no, no one cares about freaking mini game. Uh, no one gives a flying f uh kaka uh about some kind of mini game. Just like no one cares about the Axi game. Even when Axi coin pump, no one cares about it. People care does the coin pump. So, focus on that. Focus on making coin that pumps. If you want mini game, I mean, no one care. No one listen, no one has time to play your mini game. Crypto is already a mini game. Okay? So, uh, when it comes to gaming, uh, either you're serious and you you're going to capture the non-crypto, uh, or this mini game. Okay, maybe it's even if it's fun. Okay, let's say it's fun. You okay, it's fun for how long? A week, like how long? So, just make a coin that pumps and uh, the mini game. Yeah, mini game. Make it if it will help the coin pump. Let's say it's a gaming narrative. Okay, have a mini game just so you're part of the gaming narrative. Now there's no gaming narrative. So I would focus making it pump then whether it's a game, whether it's this, this is that or you you you're planning to do an exit scam that you do a game and you launch coin and then kind of uh you need to be upfront with your intention here. It kind of sounds like you kind of want like a get rich quick exit scam kind of thing. Then I say don't do it. It's not [laughter] worth it. There there are many ways in crypto to make a lot of money without exit scamming. [laughter] I mean on your message to be if I'm frank that's what it sounds like. I have a meaning. Should I have sloped something so at least I I get something out of it. [laughter] At first there was a law lawn mower the created resource resourcing machine. You can now mow your lawn, drive through your farm and take care of it. No, see, it's not. Yeah, I mean there is lawn mower, but um you even have this robot that can mow law, but you still need someone to It still takes mental capacity. It uh Yeah, it gets stuck. You got Yeah. Uh but absolutely, it's a bit easier. And also, it doesn't work for like super big uh more complex lawns. That's another problem with this. I mean, technically, maybe it works, but practically, yeah, it's you, it's still kind of a part of jump to oversee this robot uh mower [snorts] and then it rains. They have to Yeah, maybe it finds its way back. Maybe not. I mean, it should find its way back, but yeah. Do Have you guys tested those uh robot? Uh oh, yeah. Another thing like that's the worst when the freaking cable is cut. Okay, I think that was the end of my uh robotic lawn mower saga when I lived in Sweden. It was it was quite okay. I mean, it was mowing, it was this, it was that. Then somehow the freaking cable broke because the area the circumference of the lawn, it needs to have like a cable that needs to be like connected to its uh station. So around your whole lawn, you need to dig down a cable. Okay. Freaking thing. I don't know what happened. It's uh if it breaks it's fito. If the cable breaks fito you need like a guy to find the the where it broke. How I know it's such big long. How how I know where it broke? I don't know where it broke. You need a guy and that guy calling getting a guy. See what is this? Should be Optimus. Optimus. Bum bum bum bum bum. Locate the the leak. Bum bum bum bum. Fix it. All of you chat noobs. I've been here since Crypto Yoda was around. Young Ivan, TV screens behind Black Coffee. Those were the times. Baby Yoda, are you Crypto Yoda or what happened? Why you don't have your original account? Why does Dr. Pepper come in? No idea, man. No idea. If you want to drink poison, at least drink the the like the, you know, the highest grade, which is maybe Coca-Cola Zero. Why? You know, Dr. Okay, it's uh if you want poison, at least pick the, you know, the best poison. [laughter] Dr. Pepper, I don't know, man. I don't know, man. I never was never a fan. I I don't know what some I see it as like a low somehow low quality or something. Maybe it's better. I I don't know. I've been watching since 2019. That's awesome, man. That's awesome. The defa was 2020. Was top entertainment. Sweet. Yummy yam. That was great. Pickle Pickle Finance all went to zero got hacked and so on or or maybe in insider hack. You never know with these things. It will take many years before Optimus will do all of that. I know, I know, I know, I know, I know. But I just want you guys to prep because how did we get into it? We're speaking about the future. What to tell kids about the future. So let's say your son or child wants to be, you know, practical. he could probably make a lot of money now because again you see there's a problem in the market like this blue collar job to have nice service it's not straightforward especially in like regulated countries where you need a bunch of licenses to to do it. So yeah maybe starting yourself doing a company and as soon as the freaking Optimus can do it you're the first one to deliver the freaking Optimus. You're the Optimus god. You're the Optimus papa. You are the one selling Optimus everywhere in your local community. Could be. Could be. But but here's the thing. Many blue collar guys think that they're immune against AI because currently AI is only software. But I'm telling you the blue collar physical guys, they are in big trouble because their service in many cases suck like I told you. And uh as soon as there is an option, there's going to be a flight. There's going to be a big flight to the freaking Optimus. Ivan, do you suggest taking your whole family uh out of EU? Yeah. Yeah, I mean listen, everyone's situation is different. I mean, obviously if you do if you want Yeah. If uh if you want their help maybe for your family, absolutely. Why not? Why not? Still in search of crypto. Exactly. Where the Where's the Y? You need an Alfred from Batman to take care of all of this. All of the blue color stuff. Exactly. Exactly. Then then you need a guy to take care of the other guys exactly after AI takes every job. What will be the point of humans? Well, there will be new problems. There will be new problems. Um I mean whenever you solve a problem, new problems arise always 100%. I can just tell you that using AI now like at there comes a point where it's also becomes a bit messy to work with all this AI crap. You just need someone to like take it over and manage it. So it's uh it's uh always like that. You will become more efficient. You can do more as a person but you cannot do everything because even the software AI like the top of the the blizzing you all the marketing you see about agents like autonomous they I have fired 500 employees now I have a employee most of it is guys I mean AI can do a lot but it cannot you know something that it's missing now for example on a strategic level you still need to set the strategy you can discuss the strategy with it a bit but basically you still need a human to own a KPI. Okay, now it's a big difference because before you needed like a human to lead a team to own it and then he can own a KPI or [ __ ] Now a human doesn't necessarily need a big team. You don't need any copyriter nowadays. I mean copyrightiting as a thing. It's not a thing. It's AI. Uh you don't need uh researchers in many ways because it's I don't think it's a thing either. AI can do all research depending on the type of business but many businesses now like let's say you you had some an assistant that did the reports or presentations or market research or business feasibility research you don't need any of that AI can do all of that but so one guy can now own a KPI with way fewer people but you still need a guy to own a KPI so that's uh that's why I say if you can be that guy you can level up from the plebber doing the simple plebber stuff to being a guy or girl who can own a KPI. I guess that's that's what I'm coming to that you need to own a freaking KPI. You cannot be just producing stuff for the sake of producing stuff. You're told to I mean, for example, if you're a dev, you're also in a bit of a big trouble because you're not owning a KPI. You're not responsible for any business KPI. So, it's going to be tougher and tougher because you're going to get more and more out competed with AI. Yes, maybe AI coding is not on par, but look, six months ago, six months ago, coding AI was even worse. Now, it's kind of on par. I mean you can do many things with AI. Uh and this oh but not the quality of code. Okay, you're one prompt away from telling it how you want the quality of code. I mean literally you can tell AI how you want your code to be structured. You can tell you can have another to double check the code of the first AI. So everything which is far away from the KPI I think is in a big danger. If you're the person that can own a KPI and some people what is KPI? Okay, maybe if you are uh doing uh marketing, it's the number of hot leads. For example, you're doing sales, how many of them are closed? If it's content, how many people reached? What's the audience size? yada yada. So, guys, that's it. Thanks a lot for being here. Uh thanks all for contributing to this great discussions. I mean, that's that's the best thing with the Q&A. Sometimes we speak about things non-cryptoreated, but uh very important. Thanks a lot for being here. We're almost at one hour. Enjoy your uh Tuesday. is Tuesday in it. Big shout to Guzman. Have a good day and goodbye guys."
    }
]