[
    {
        "video_id": "RULm77jm_b4",
        "title": "#crypto #bitcoin #ethereum #ytshorts #fypシ",
        "published_at": "2026-02-11T10:30:17Z",
        "sort_date": "2026-02-11",
        "url": "https://www.youtube.com/watch?v=RULm77jm_b4",
        "transcript": "Bitcoin dominance rises and falls like the tide. When the market is bullish and confidence is high, investors rotate out of Bitcoin into smaller, riskier coins, [music] pulling dominance down. But when the market turns bearish, caution sets in. People retreat [music] back into Bitcoin as the safer bet or exit into cash or stable coins [music] entirely. That drives dominance back up. Regardless of whether Bitcoin's price itself is rising or falling,",
        "summary_hu": "A bitcoin dominancia folyamatosan ingadozik a piac hangulatának megfelelően. A bullish piacon a befektetők gyakran kisebb, kockázatosabb érmékbe fektetnek, ami a bitcoin dominancia csökkenését eredményezi. Amikor azonban a piaci hangulat bearishra fordul, a befektetők visszatérnek a bitcoinhoz, mint biztonságosabb lehetőséghez, vagy teljesen készpénzbe vagy stabil érmékbe lépnek ki. Ez a tendencia megnöveli a bitcoin dominanciát. A bitcoin ára ebben az összefüggésben lehet emelkedő vagy csökkenő, a dominancia változása a befektetői viselkedés alapján történik.",
        "summary_en": "Bitcoin dominance fluctuates in accordance with market sentiment. In a bullish market, investors often rotate into smaller, riskier coins, leading to a decrease in Bitcoin's dominance. However, when the market sentiment shifts to bearish, investors retreat back into Bitcoin as a safer option or exit entirely into cash or stablecoins. This trend results in an increase in Bitcoin dominance. Bitcoin's price itself may be rising or falling, but the changes in dominance are driven by investor behavior.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 50,
        "key_points_hu": [
            "A bitcoin dominancia ingadozása a piaci hangulatektől függ.",
            "Bullish piacon a kisebb érmék felé mozdulnak el a befektetők.",
            "Bearish piacon a bitcoinba való visszatérés növeli a dominanciát."
        ],
        "key_points_en": [
            "Bitcoin dominance fluctuates based on market sentiment.",
            "In bullish markets, investors rotate into smaller coins.",
            "In bearish markets, a return to Bitcoin increases dominance."
        ],
        "main_topics": [
            "Bitcoin Dominance",
            "Market Sentiment"
        ]
    }
]