[
    {
        "video_id": "NxlfHXcw2vM",
        "title": "US Panic: The Great Liquidation Just Started",
        "published_at": "2026-02-11T14:00:06Z",
        "sort_date": "2026-02-11",
        "url": "https://www.youtube.com/watch?v=NxlfHXcw2vM",
        "transcript": "I just got over a nine flies and I was reading about the Japan elections and Wall Street's reaction to it like the hedge fight fund inside and then I was reading as I arrived here the mainstream news and I was surprised because the stories are polar opposites and I was not planning on making a video on this but I think you deserve to understand the difference between what those who understand financial systems do and think about how Japan could be a catastrophic risk. for US investors. Now, I know Trump just gave his endorsement to the new Japanese prime minister and congratulations to her and all that, but if you want to understand what mainstream media isn't telling you, then stick around for the next few minutes. Right after the election, Japanese interest rates spiked to their highest level since 1999, more than 25 years ago. And if you own just any US stock, which let's be honest, most of you do, right? You need to understand what's happening right now because there is 1.4 trillion dollars of money sitting in Japan that could move US markets overnight with no announcement. And the lovely lady that Trump just endorsed, well, she's the one with her finger on the trigger. So, my promise to you here is a little unplanned to break down exactly what happens in the election, why it matters for your portfolio, and then I'm going to give you my one, two, three, I think three-step framework for protecting yourself. And hey, maybe even profit from this because I think that's possible, but only if you understand what's actually going on here. If you're wondering who the heck I am, my name is Felix Pin. used to be an investment banker and normally uh always chaper owned by my trusted uh golden retriever. So it's just my thoughts might be a little less coherent today. But I'm also the founder of the goat academy where for the last six years my world street mentors, the guys I look up to and learn from have been teaching over 20,000 students how the markets really work. So my mission for my little retirement here is to give you guys the regular investors the same knowledge the same understanding that's really taught only to bankers because when something like a Japanese election happens and you know the analysts on Wall Street they write those 20 30 50page reports for their clients you know the hedge fund clients and and you well you got 30 seconds on CNBC you see um of somebody not selling you anything particularly useful. So my goal here is to give you what the hedge funds clients get, the real story, the actual risks, how you can position yourselves and by the end of this video you'll understand literally more than 99% of investors out there and why what happens in Tokyo can you know empty out your retirement account if you're in New York or anywhere else in the world. So let's start with actually what happened here. Japan just elected a new prime minister, San Takichi. And I'm undoubtedly mispronouncing that. My apologies to, you know, everybody Japanese in in the room. And she won a landslide victory. She won a 2/3 super majority. That means she basically has unlimited power more or less to push through whatever policy she wants. No gritlock, no compromises, none of that nonsense we're used to in in Europe and the US. Just unfiltered whatever she wants. Now, who is this lady? Well, three things I think that you need to know. One, she's a big nationalist, big on Japanese identity, big on defense. Two, she's a well, bit of an China hawk really. And then three, and the one that really matters to you, is she's very pro- stimulus. That means money printing, stimulating the economy. She wants to spend a lot of money. She's promising massive government spending product promises. She's promising tax cuts, a 2-year suspension of the food tax. It's particularly uh popular apparently in Japan. And if you tune in last week, I was just in Japan, right? Um but her message to Japanese voters is, I'm going to put more money in your pocket and I'm going to spend more on everything. And if you're a politician, that's usually what makes you popular, right? But what it actually means is that they're going to flop the system with the money and they're going to hope that it works. Does that sound a little familiar? We've seen this before. Yeah. Because the thing about printing money, when one central bank does it, all the other central banks eventually do it, too. It's sort of the race to the bottom. So, how does this work? Well, Japan prints money. Their currency, the yen, weakens, and other countries now have to respond or their exports become more expensive. So everybody does the same thing. It's a paper race to the bottom, a feared currency race to the bottom. And there's really only one thing that wins. And we'll get to that in a moment. My thoughts are hopefully coherent enough. So what happened when right after the election? Well, the markets actually freaked out. Japan's 10year interest rate went to 2.35%. Bear with me on some of these numbers here because it doesn't sound like a lot, right? And in America, you've been used to, you know, four 5% interest for a while now, thanks to the the transitory inflation there. But for Japan, this is insane. This is historic. It's the highest interest rate in 27 years. Why should you care if you're in New York or Ohio or London or wherever you might be tuning in from? And let me know about, by the way, in the comments. Let me know where you're tuning in from. Be interesting to see. Um, and why does it matter to you? Look, for the last 30 years, Japan has been in the land of free money. Interest rates were a big fat null zero, sometimes even negative. So imagine if you could go into a bank and they pay you to borrow money. That's been Japan for the last 30 years. And now suddenly you actually got to pay interest. Now the market freaked out and the new prime minister, Takayichi, she saw the reaction and she went into damage control. She said uh she used the phrase fiscal responsibility, whatever that means. So, she's going to be like, \"Yeah, I'm going to spend money, but I'll try not to completely blow up the financial system while doing it.\" So, rates have come down a little bit. As I'm recording this, we're at 2.2 something. But that's still pretty extreme. And you might still be thinking, \"Okay, Felix, get to the point. Why the heck should I care?\" Well, there is something called the carry trade. And I'm going to try and explain it in sort of, you know, golden retriever terms. Imagine you have a friend who loans you money. 0% interest. It's free money. Free loan. There's no strings attached. And you take that free money and you invest it into something that pays you 5% a year. You buy a US government bond. So you're making 5% on free money. It's a free profit. That's what Japan has been doing for years with trillions of dollars. So the real version is this. Japanese investors borrow money in Japan at basically zero. They then convert that money to United States dollars and then they buy US stocks, US real estate, US everything with it. And then they collect the returns, you know, the 5% or whatever. And then they pay back their 0% loan in Japan and they pocket the difference. That's been one of the biggest free money trades in the world for decades. But what's changing? Well, that 0% loan is no longer 0%. It's now over 2%. US interest rates have come down at the same time. They're no longer 5%, they're now 4%. So the gap, the profit margin is getting smaller and smaller. And because they have to deal with their currency risk, there's a little bit of cost there, too. This trade is starting to end. Now, why is that a problem? Because if they want to unwind their trade, they have to pay back their loan in Japan because it's now too expensive. They need to sell their investments. Now, where are their investments? They're in the US. US stocks, new stocks. Now, more selling means what? Stock prices go down. And then when the stock prices go down, you kick off this whole automated selling thing that goes on with ETFs and pension funds and the leveraged funds and the margin calls a bit like what we've seen in the silver markets, right? So, Japanese investors are some of the biggest owners of US assets and they start to sell, you're going to feel it. We got a preview of that about a year and a half ago in 2024. Um, Japan said we might increase interest rates and the US went into a bit of a mini meltdown and that was because this trade was starting to unwind. Now, if you're thinking, well, what does that mean? Should I sell? How I protect myself? That's exactly what I'm going to teach you. Now, we would make this video insanely long and I'm literally just just landed here and not quite ready for it. What I'm going to do for you instead is this coming weekend on Saturday, I'm going to teach you Wall Street's rules on when to sell. Because the biggest mistake I see retail investors make, seen it thousands of times, they have these beautiful profits, something is up 20%, 30%, 80%, whatever, and then they watch it go back down to zero, maybe even negative, and they don't ever sell it. And I'm just like, I want to shake people. So, we're going to shake you up. And secondly, I'm going to teach you how you protect yourself because what if the market actually takes a nose dive? Then what are you going to do? You're going to get emotional. You're not going to know whether you should sell, should you buy, should you buy the dip, what should you do, right? All that kind of good stuff. So, Wall Street has three very simple rules for this. And I'm going to teach you this. Um, there's no catch. It's just education. Felixfriends.org/training. And all I ask is you sign up for that. Maybe share it with somebody else too who might might enjoy it and come with a note not notepad um and take you know make sure you get the most out of it. But let's get back to this carry trade in Japan and how affects you because there is another pile of money that we need to bring into this and this one is controlled by the Japanese government. Japan has $1.4 $4 trillion in foreign reserves. This is money the government holds mostly, you know, US dollar assets. And now remember that the new PM Takahi wants to spend a lot of money, lots of it. Tax cuts, stimulus, defense spending, all of it, right? But she's also promising to be fiscally responsible so that she doesn't blow up the stock market on day one. So she can't borrow endlessly and just print money endlessly. So where's she going to get the money? Well, this is the clever bit or scary bit depending on your timeline, but Japan has this thing called a special account for managing their foreign exchange. And this account just posted a surplus of about 5 trillion yen. Now, I never know how much a yen is. It seems like a very large number. It doesn't seem to be worth all that much. Um, but the point is that Takayichi is eyeing the surplus fund to fund her tax cuts without borrowing more money. Now, what does it mean? She might sell US government debt to fund Japanese tax cuts. So, she's sort of raiding the piggy bank that holds American IU. And what happens if you think this through? Look, if Japan starts selling US debt, what happens? Well, first more as US debt for sale means the prices drop and interest rates rise. And that's never intuitive. By the way, bonds are just not intuitive. I was very lucky. I had a bond trader sitting next to me two chairs over and he actually did taught me this. And the next thing is that happens when US interest rates rise. What happens? Your mortgage costs go up. Your car loans go up. the financing costs for all those data centers go up because you know Google just borrowed hundred billion dollars or whatever. So companies have to pay more to borrow money and higher costs means lower profits which means stock prices in the US fall. It also means the dollar gets stronger which again hurts US exports. It's a chain reaction. It starts with a lovely lady in Tokyo. So here is where I see this going. If Japan floods their system with stimulus money, which is I think what they're going to do, then what what's the Fed going to have to do? Well, they'll have to keep rates even lower to avoid this debt spiral. So, you've got Japan printing money. Europe is printing money to stay, I was going to say, competitive just to, you know, not become the Soviet Union. And America is going to keep their rates suppressed because that's what Trump wants. That's how they can keep the debt more affordable. So what does it mean for your dollars? Well, your dollars are melting slowly, right? Because when they're printing more of it, it is just worth less. It's very, very simple. So what wins? What's the thing that we should be doing right now? Well, gold wins, silver wins. Thinks they cannot print wins. So why is Trump apparently being very nice to this lady who could threaten his US stock market? and he famously is promising the Dow index to go to Dow Jones index to go to 100,000 points by the end of his term. Well, Japan has promised to invest $550 billion in the United States and Trump lowered tariffs on Japanese goods in return. They signed a rare earths deal which is very important for tech and for defense. So, this looks like kind of a win-win, right? Trump and Takahuchi seem to be aligned quite a bit there. They both want more defense spending. They're both tough on their, you know, adversaries and both believe in very strong sort of identities, national identities. So from a geopolitical standpoint, this makes sense. Plus, let's face it, Japan is essentially another colony of the United States, right? So Trump endorses her because they're politically aligned. But he's also endorsing a leader who could really really hurt American investors. If a stimulus gets a little bit out of hand, right? If she just prints a little bit more than people were expecting, that carry trade unwinds, US stocks sell off. And if she needs to fund her tax cuts through selling debt, she's going to be selling US debt, which makes US interest rates go up, makes the dollar go up, the opposite of what he wants. So, in my opinion, Trump likes Japan as an ally, but is also very concerned about the carry trade. Now, I'm sure the US is going to try and put a little bit of a squeeze on Japan to make sure they don't do anything too aggressive, but just bear in mind, this lady just won a super majority. She has more than twothirds of all the seats in the their parliament, right? The opposition party literally has like three seats left. So, she can basically do whatever she wants and she's going to probably want to do that. Now, one thing I learned from my mentors, and I'm a huge believer in in in learning from people who've been there, and I've got Wall Street mentors who've done this for 20 years, 30 years, 50 years, and that's who I go to with situations like this because they remember stuff from the 70s and 80s when, you know, I wasn't around. And what they would say to me is these kind of situations are where the real money is made and lost. if you don't know what's going on there. And by the way, these these guys are exactly who's teaching you and our goat academy if you ever interested in joining that. But just just just come out join us for the free live training on the weekend first. But what these guys taught me is that when you see a situation with this many moving parts, it's a little hard to comprehend, right? There's a lot of stuff going on here. Currencies, interest rates, you know, Japanese food. And I don't know what I'm thinking about Japanese food. It's just so good, isn't it? But what can you do? Well, you could do nothing. But if you do nothing, you're at the mercy of the forces that you don't really want to understand. That's the worst thing you can do. The second worst thing you can do is just to panic sell because you're going to get some scary headlines and they're going to come and just be quite late. And what's the best thing to do? Well, understanding the structure, having a framework. And that's what I always always teach people is like there's always a pattern. There's always a framework. We're not reinventing the wheel. We are just following the same thing again and again and again. So, what's the golden rule here? Well, it's a bit of a literal golden rule, I'd say. My mentors taught me is that when the government starts printing, you don't fight it. You own what they can't print. And that's gold, that's silver, and that's high quality companies with real earnings and low debt that can survive whatever companies are next, right? Zombie companies loaded with debt and they get crushed. And by the way, we have a zombie um company scanner now in our in our community. If you guys are in there, um I'll put a link down below as well to that. I think it's $27 a month. Obviously, if you're in the mentoring program, you get access to everything. Anyway, but um that's that's there and that'll literally give you a list of zombie companies, which I think is going to be very useful and we update that um very very regularly. So, what does the math say right now? Well, as I say, own what they can't print. So what do we do? First step is we always follow the money. Exactly. Follow the money. Ask yourself where is the big money moving and why. And we can track that and see that. And again we've got tools for that. In this case the carry trade has been flowing from Japan to the United States for decades. Now that flow is threatened. When that reverses well US assets get sold. So how do we know that's going to happen? Watch Japanese interest rates. If they keep rising, more money leaves the US. Watch the yen. If the yen strengthens, it means Japanese investors are bringing money home, right? So, watch Japanese investors positioning in the US markets. And if you know where to look that kind of data, these two point data points are pretty easy to find. And then if you see that happening, well, consider reducing your exposure to like rate sensitive US stocks. And those are the highest risk stocks, right? The high debt stocks, the the new tech stocks. And then number two, we want to identify what's the pressure point here. And I'm about to go for a massage because this pressure point up here is killing me. But what sectors or assets are the most vulnerable to this? Well, basically US stocks that rely on cheap borrowing. So think your growth stocks, tech companies with lots of debt. And even the big guys are about to load up with tons of debt. Real estate, commercial real estate, that depends on low interest rates. So the US government debt itself is an issue. But that same pressure also creates opportunities. If US rates go up because of Japanese selling, US banks could benefit. The dollar strengthens. It helps some companies that import goods, right? But most importantly, you want to have an exit plan. You don't want to prematurely run for the door. And that's often what people do in in this. But you wor about this, so I sell everything. I'm like, no, no, that's not what I'm saying. I'm saying we stay invested in tech and growth stocks and all that good stuff until we see the big money starting to leave the building. And that women, I believe, we want to get out. Obviously, you got to come to your own conclusions. So, you got to plan your exit before you know the mer hits the fan. So, what I would recommend you do is you sit down and you have a look at your portfolio and say, well, what of this is actually most exposed to the carry trade? one of this is most exposed to high interest rates and then you're going to want to automate your cell rules on those things because when stuff goes down the emotions kick in and it's very difficult for us to make decisions whereas we pre-plan it well it's a lot easier and I think you want to look at the gold and silver story um I would use the the dips the forced selling as uh as opportunities personally again you got to come to your own conclusions on that and then I would really shift towards quality stocks and I've been doing that even the last couple of months. We bought some really boring big companies with very very good numbers and fundamentals and earnings and low debt and so on. And those guys have something unique. They have products so good or customer is so loyal, so addicted that they can raise their prices no matter what happens. So, if we get more inflation, which I think we will, yes, you can be in gold, but you might also want to be in some of the greatest businesses in the world because they have the ability to simply raise their prices and go up faster than inflation. So, let's try to bring this all together. Japan just elected a new prime minister. Her mandate is to spend bigly and to cut taxes, and that's pushed Japanese interest rates to their highest level in more than 25 years. Higher Japanese rates threaten this carry trade which means Japanese investors may sell US assets and it also threatens the 1.4 trillion that Japan holds owns in in US debt which if sold would push up borrowing costs in the US. So this is not a crisis yet and you don't want to know about it when it is a crisis. You want to know about it before it's a crisis. Right? It's a big big risk that most you investors and US investors aren't even aware of. And being aware of risk before they become a crisis means you can protect your growth, your profits, your wealth. My belief is that Japan is going to print money. It's going to mean other central banks are going to print more money faster, especially the US. So it is a race. Your paper money is the loser. Your salaries, your savings are the loser. But hard assets like gold, like silver, like real estate and like high quality companies. I think they're going to make an absolute killing out of this. And then there'll also be the companies that are going to get some of that government spending money, right? Think defense stocks for example. Look at Europe. What's pushed European stock exchanges up the last year or so. It's been just purely war. That's incredibly unethical and immoral. Well, poor, you know, sods are dying in the trenches. But would you rather be morally right but broke or would you rather do something that doesn't hurt anybody because it doesn't um and be in a position to actually have more of an impact because you have more money and you have more time. That's a question you could ask yourself. But yeah, think about your real estate your your your gold and your silver real assets. Those companies with fortress balance sheets. Again, we got a tool for that in the community. And just remember when governments print money, you lose this paper paper stuff, right? You can create more of anything and it becomes worth less. It's just very very very simple. So I hope this has been somewhat helpful for you. A bit bit unplanned and a bit all over the place perhaps. Apologies for that. Come and join me on Saturday. Today I'm going to give you a very structured, very simple rules-based framework of how Wall Street's been selling and selling automatically for maybe 20, 30, 40, 50 years. Uh the same stuff that I learned from my mentors. I'm going to give that to you as my gift and I hope it'll make an impact and help you shift from feeling like you made a lot of money and then being disappointed that you lost it again. And I think that's a that's a vicious cycle a lot of people get into. And it's not just the money you're losing, it's not just the time you're losing, the compounding you're missing out on, but it also is incredibly disheartening and therefore puts you off investing, which is the biggest problem problem of all really. So join me on Saturday for some real education. Felix/training as a link down below. And you got some value out of this, just forward it to somebody else. That will be my only ask. forward it to somebody else who might want to understand how this really works and what the heck just happened and why mainstream media isn't trying to scare you out of this yet because well look they have advertisers and you know they have they have commercial motivations which is one of the reasons I've never ever taken a single endorsement or advertisement or anything on this channel and never will because I think it changes what you talk about and how you talk about those things so I don't have to do that thankfully and therefore I never will. Thank you for watching and share this with people. All the best. In the last 30 days, gold dropped nearly 9%, silver crashed over 26% and a major private credit fund managed by the largest asset manager on earth So,",
        "summary_hu": "A Japánban frissen megválasztott miniszterelnök, Takayichi San a jelentős állami kiadásokat és adócsökkentést ígér, ami 1999 óta a legmagasabb kamatlábakat idézte elő Japánban. Ez a helyzet veszélybe sodorhatja a carry trade stratégiát, amely évtizedek óta vonzza a japán befektetőket az Egyesült Államokba, mivel ez a kamatláb-emelkedés elindíthatja az amerikai eszközök eladását. A piac túlreagálása, amely alacsonyabb részvényárakat okozhat, szintén jelezheti a közelgő pénzügyi válságot. A beszélő hangsúlyozza, hogy a befektetőknek figyelniük kell a japán kamatlábak alakulására, és fel kell készülniük a portfóliójuk átértékelésére, hogy elkerüljék a veszteségeket. Az arany, ezüst és a stabil vállalatok részvényei a jövőbeni gazdasági zűrzavarból profitálhatnak.",
        "summary_en": "The newly elected Prime Minister of Japan, San Takayichi, promises significant state spending and tax cuts, leading to the highest interest rates in Japan since 1999. This situation could jeopardize the carry trade strategy that has attracted Japanese investors to the United States for decades, as rising interest rates may trigger asset sales in the U.S. The market's potential overreaction could lead to lower stock prices, indicating a forthcoming financial crisis. The speaker emphasizes the need for investors to monitor Japanese interest rate developments and reassess their portfolios to mitigate losses. Gold, silver, and shares of stable companies may profit from the forthcoming economic turmoil.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 50,
        "key_points_hu": [
            "Japán új miniszterelnöke hasonló kiadások növelésére és adócsökkentésekre készül.",
            "A japán kamatlábak emelkedése veszélybe sodorhatja a carry trade-t, amely az amerikai eszközök eladásához vezethet.",
            "A befektetőknek fel kell készülniük az esetleges piaci reakciókra a japán választások kapcsán."
        ],
        "key_points_en": [
            "Japan's new Prime Minister is set to increase spending and implement tax cuts.",
            "The rise in Japanese interest rates could jeopardize the carry trade, leading to sales of U.S. assets.",
            "Investors need to prepare for potential market reactions related to the Japanese elections."
        ],
        "main_topics": [
            "Japanese Elections and Economic Policies",
            "Impact on U.S. Financial Markets"
        ]
    }
]