[
    {
        "video_id": "VAgyE_8w1MM",
        "title": "⚠️WATCH BEFORE YOU BUY THE DIP⛔ IF YOU OWN #PLTR #SOFI #NVDA #AMD #HOOD #TSLA",
        "published_at": "2025-12-20T14:00:06.000Z",
        "sort_date": "2025-12-20",
        "url": "https://www.youtube.com/watch?v=VAgyE_8w1MM",
        "views": 62653,
        "duration": "00:18:44",
        "transcript": "If you were worried this week about your favorite tech stocks and you're even more concerned what's going to happen this coming week, you found the right video for you. We're going to run you through the Nvidas and the MDs and the Palunteers and the SoFi and the Robin Hoods and the big tech stocks, the Microsofts and everything else. But before we do that, we need to look at like what actually happened yesterday. Well, look, the market actually turned out to be absolutely flying, right? All the stuff that went down was absolutely flying. So, were you a little bit freaked out on Wednesday or Thursday? I know many of you were because we did a live session last week and you were telling me about it. And honestly, what that says to me is that there's fundamentally a knowledge gap here that we can fill. It's all your fault. Just there's no financial education out there. Right? If you look at the little thing called the VIX, the sort of fear index that never really moved very much. It was at 17. It's at 14 right now. That is very very low and is in a place where we're not worried about the market. And because so few people understand this and institutions built their entire strategy around this, their entire framework is built around this that nobody really understands and what's underneath this thing called the VIX. We're actually literally launching a program on this this coming week and I'm super excited for it and I know about a hundred of you existing students have already jumped on board of that because it's it's it's fantastic and I'll tell you a bit more more details about that in the coming week. But it's called Trend Monster and essentially it's an indicator that what our smartest um head coach built and who was an institutional trader and who understands exactly how this works. At the moment we're looking pretty aggressive. I'm not telling you you should do that. Not saying you should follow us. Don't copy this. But what I'm going to do is I'm going to put a million dollars of my own money on this system and I'm going to start trading it next week exactly the way it tells us because it just looks freaking amazing. Okay? Past performance doesn't guarantee future and so on. You got to you got to understand it. That's really the point. So, in this program, we're going to teach you how to do that. If you want to potentially be part of that, look, you can what you can do is you can just have a conversation with us about this. Just have a chat with us. It's free. There's a link down below, felixfens.org/freedom that books you a freedom call as I call them, you know, like freedom fries and a liberation day. No, the hope here is that it gets you faster towards your financial freedom. That's the that's the intention. So those calls are just calls where you can ask us all the questions that are not triggering in in your head and then we can continue with the with the actual video which is what we're going to do here. Right. So let me pull up the watch list here and we're going to kick us off with the AI stock of AI stocks Nvidia. Now Nvidia had a little bit of a wobble and I know a lot of you are worried about that. You know we went down pretty significantly here but where did we stop? Well we stopped at the recent lows. So, literally at the recent lows, we didn't go all that low. And then yesterday, big beautiful recovery there. And we did that on big volume. What does that big volume down there tell you? It tells you institutions are likely buying this because you don't get that kind of volume. Like, we're talking 300 million shares traded. At least institutions are loading up the boat. So, that's a really, really useful thing to look at. There's a little line down here, that sort of skin colored line there. Um, that's probably racist, isn't it? My skin is not pink. Well, mine sort of is. So, you know, uh I'm translucent. What can I say? That's pointing up there, and it's a little volume indicator that just tells you what's going on there with like institutional money. That's very, very useful. So, is this good or bad? Look, it's bad for a few reasons. That yellow line there is the 50-day moving average line. I write this down. It's the line of all lines, right? We're below that. Still below that. So, that's sort of a right. We also have bounced against that 50-day moving average line here, which also isn't great kind of resistance on the way up, but ultimately we're still trading in the box, aren't we? You see that blue box I had in here, right? It's been in there for absolute ages. That one we're still going sideways. So, it is not the end. It is not beginning. It is just it is just is basically. So, am I buying Nvidia here? No. Um, it's just having a sideways exhaustion thing. That's all that really is. So, we're just waiting for some news. There was some news yesterday. If you look in in Trade Vision here, you're always the most best informed. There's always a summary of what's going on there, but you also get the live news alerts, which is super cool. And that's really how I I literally don't read any financial media anymore. I just read this. So, at the moment, I only have a one on my screen. It's it's a Starbucks one. And the and the goal here is not to give you a gazillion news items, but we just want to give you the news and move your stock. So you can decide which stocks you want those news for. It's literally a custom news alert service that only triggers for the stocks that you select. So it's it's it's it's like intended to give you the the stuff that moves your stock without the noise and the bollocks and the fearongering and all that crap that's out there, right? So Nvidia going basically sideways. Well, what about some of the other guys in that space? What about AMD? Think about AMD. What do you see? You see a very very similar story, right? You basically see here that same kind of downtrend. You saw that nice bit of recovery there yesterday, right? The gap to the 50-day moving average is even bigger than it is on Nvidia. And it is also sloping down. That is a double basically, right? We love that sound, don't we? But we did see a significant pick up in volume down here, which is bullish. So again, it didn't drop below recent lows here. So it is just kind of again zigzagging a little bit sideways trying to figure out what's the next step in in AI chip weld. Now what's next on our watch list? Let me just move this drawing tool. This is a bit big, isn't it? Whoever designed this. Uh what else have we got here? Good Google, right? We put out a video last week on Google on what they're up to with their chips. And I think it's it's not as black and white as people think it is, but it's definitely interesting thing. So, Google having a beautiful, beautiful run here. I mean, just look at how long that's been going up for, right? Let's just let's just put put a little trend line out there. Um, wherever we want to start somewhere here, right? And you just sort of get this beautiful upward trend. It also has a channel like pretty much everything else. So, it sort of tops out when we when we hit sort of certain levels, but it's a pretty pretty nice story. And at the moment, what's happening every time we hit the bottom of that channel, right, we kind of bounce off it like we did it here, too. And it looks again like we're doing that here. Now, one of the reasons for that is called CPI, which stands for inflation that we made up. Sorry. Now, it's it's the official inflation measure of the government. Of course, it's entirely truthful. Everything the government says in the US, it's entirely truthful. So, you can trust them. Yes, you can. You should you should believe everything they say. And that came in softer than I expected. and and that's therefore good for the whole for the whole market. And if you look at some of the other sort of big tech stocks out there, you know, build soft thing. Microsoft has gone a little soft lately. It broke here through the 50-day moving average line. Well, actually, it did it there. That was your warning sign. That was your get me the f out of the sign. The 50-day moving average line then went flat. It went downwards. That was your second run sign, right? That one. And then you get a little bit of a fake out. You usually get those. And then we collapsed properly here and then went down 50 bucks or something like that. Found its footing. And it's um hasn't really come out of the woods. You know, it's picturing Bill Gates in the woods. I don't know why the man isn't even involved in running the company. Strange images in my head. No. So you got this resistance here. that one, that line there, and then you have the 50-day moving average line resistance. And if you look at yesterday's sell-off, I mean, I know they went up 0.4%. Some extraordinary volume there. We should actually look into like what the heck triggered that. Maybe it was the Oracle OpenAI story that I I covered also yesterday. Could could be something like that. Um the the the OpenAI Amazon story rather. They're going to use some Amazon chips. Um is that good or bad for Microsoft? I think it's neutral. I don't think it matters. I think it's a tremendous business to be honest with you. I think it's one of the greatest businesses out there, but at the moment it's just lacking momentum. It is looking a little flaccid, right? Which is what we don't want, do we? Okay. What's next on the list then? We're looking at Amazon, which had that potential open AI investment for which they're going to give potentially Open AI some money. So, just just think this through. This is such a crazy world that we live in. Amazon might give10 billion dollars to Open AI, you know, the ChachiPT guys, and Open AI will then give the money back to Amazon and we'll go to chips for them. So, what what is this really? This is Amazon financing a chip purchase, right? That's really all that is. It's like they're not paying for it. They're just getting shares instead. So, OpenAI is sort of trading shares in itself to buy chips for free. That's really what that is. So, it's kind of an interesting one. But to Amazon, I mean, it's a huge business. It isn't actually that relevant because it's a relatively small part of the business at the moment. Um, but either way, it's probably a good deal for Amazon if you ask me. And we're seeing that nice recovery here. But Amazon again struggling to break through the 50-day moving average line there. In fact, most of the magnificent seven stocks have struggled this year. they just haven't really done all that much. And I think that has an opportunity in that quite frankly because actually their earnings and their businesses have gotten a lot better but their their stock prices haven't. So I I'm I'm I'm liking it. I'm not saying you should run out and buy Amazon. I'm just saying I'm liking it. And one of the reasons is also just like they're a big part of you know what I referred to earlier as uh well what we call a trend monster. Now you know the big tech stocks are what's what's driving the performance here. And at the moment to me this still looks even though it's going sideways fundamentally it looks very very bullish and that's something that you need to understand on a deeper level which is why I'd encourage you to book a free strategy call with us if you are serious about ending this year on a on a on a skill high which is really what it's all about. Managing money is just another skill. It's like driving a car or learning to swim or chopping wood or throwing a ball or kicking a ball or something. It's all a skill that you learn right now. What about Zuckerberg's little thing? Well, where was the warning sign? It was there. Broke through the 50-day moving average line. That was your your risk management. Better be in place. Should have been in place before that. And then the 50-day moving average line starts to slope down, which was your real like get me out of here. Uh I'm in the jungle sort of thing. And then you get a fake out that always happens almost. And then you get the massive gap down and then you collapse and you cry to me about it. Um but we're seeing a reversal potentially in fortunes, but it isn't quite there yet. It's just we're just hoping for it at this point and hope is definitely not a strategy. So, what are you seeing here in terms of good news? Gap up. That's good. We are at the 50-day moving average line. That is sort of, you know, it's not above, but it's not. It's it's it's at we tried it here, too, but the moment we're still got to break through that. And then you have the institutions. Do you want to see where those sit? Institutions sit much higher at present. So institutions are not going to give us any trouble until we hit $700. So this is literally an indicator that tells you the place where institutions where they sell. At the moment it looks like they would sell at $700. And that means we've got a fair bit of air here. $30 $40 to go up by. So very useful to understand that. It's an indicator you literally only find in Trade Vision, which is what I'm using here, which is a platform that we built to give you guys better data. Um, and myself, quite frankly. So, Tesla Tesla's momentum is looking beautiful. It made my my Sunday watch list last week. And those of you who understand a little bit more about this and watched me a bit or or one of my students, you probably see why, right? We had a high here. We had a high there. And then all we really wanted for Christmas is you is u just put a line here that blue line there right you just wanted to exceed that you want to do a close above that we did that beautifully at the beginning of the week and that was therefore our you know buy me buy me buy me please signal doesn't mean you should now run out and buy Tesla obviously this is just my opinion and and yada yada yada but the other thing I'm seeing is that volume down here institutional volume is picking up that average there right it's really really picking up so that is Again, a good thing. Good thing. Gap up. Good thing. Taking out the recent highs. Good thing. So, you can you can never have too much of of a good thing except for Christmas cookies, apparently. I keep getting told off, \"Don't eat all the stolen.\" Like, but it's so good. Um, all right. Palanteer. Well, almost. I would say almost. Well, okay. What are what are the good what are the goods? The good newses. Uh, well, you can't have a plural of news, can you? News. Newses. Um, you see the resistance line here at 190. We're above that. You see the 50-day moving average line. We're above that. You see volume down there. It spiked significantly yesterday. We've taken out this high. We are at that high, slightly above it. So, that's sort of a one to one to watch. Those are meant to be eyes to watch. And then the only other high we have up here is that one at 205. So, if you're really really conservative, you wait for 205. If you're a little bit more gung-ho, I would say 195 is the present entry point. But again, that's not financial advice. Not telling you what to do. I'm just saying that's how I read the tea leaves. Now, Hood Hood had a pretty decent day yesterday, up 4%. But it isn't as pretty a chart as the Palanteer chart, right? Hood not as pretty at present. Why is that? Well, just look at where the highs are. So you got a high here, you got a high there, you got a high here, you got a high there, you got a high here. So are we above or below the high the the high the high. We're significantly below the high. Got to be careful with that one. So that's not good, right? So there's resistance here, right? Then you have additionally the resistance at 130, which is the red line here from institutions where they sell. You have the yellow day 50-day moving average line that is is hanging down very flaccidly and that is not a pretty sight. Uh, so therefore, we are no man's land. Neverland even. So, it's still a thing. Neverland. Um, what do you think about Michael Jackson? What are the views on on Michael Jackson? I I I kind of feel like the chap was framed so they could get his musical rights. Um, but never mind. That's another another story for another day. It's a bit random as a thought, isn't it? My my mind works like that. It jumps all over the place. What about SoFi? Well, Sofi, and I'm still in this, by the way, um, you know, hanging on for dear life, but it isn't looking wonderful. I'll tell you why. What happened from this moment onwards is that our accelerating 50-day moving average line started going sideways. That is a sign that you better have a parachute on and you better dust off your hard hat because bad things could happen. We then gapped down through the 50-day average line there. That was your oh my god moment. And we're still below it. Now, we're recovering somewhat because inflation came in softly and it's killing me softly with this um inflation data, but it is still below the 50-day moving average line. It's still sloping down here. So, that's not good. We're below it. We didn't drop below recent highs significantly, which is which is good. So, as a lows even, but also yesterday, no volume on that rally there. So, there is a lack of enthusiasm presently in the fintex. And one way you can look that up is look at the one of the fintech ETFs and this is Finex for example and you can see what a disaster that is. I was going to say but that would have been a bit impolite. You can also look at things like PayPal who um apparently woke up this week and said daddy I identify as a bank and they're going to get a themselves a bank charter which is what SoFi has done. Why would they do that? It gets you around the stable coin regulation. So the Genius Act basically gives only banks the rights to issue stable coins. Otherwise, it's insanely difficult to do. So therefore, every Tom, Dick, and PayPal wants to become a bank. Um there are also advantages. It generally lowers your costs and you're more likely to get bailed out by, you know, the Fed chaps. So PayPal here, yeah, looks terrible um right now. Um and some of you say, \"But Vid, you used to love PayPal.\" I did. I did. Yes. But I liked it. I can't remember when somewhere on this rally and then it started going down again then I stopped liking it. See I think an important thing is you want to love the people in your life you know furry and otherwise um the stocks we just look at ways of making money. That's really all it is and that's ultimately all about risk management. That's really what this is all about. So a good way to do that is get yourself some better data, get yourself some better indicators. You don't need a lot. You just need a little. Um you can do that with Trade Vision. It'll just give you all the news on the stocks you care about and that you have and on your watch list and so on or in your portfolio. And then secondly, you want to understand like what is actually the structure driving the market. And yes, charts look like squiggly lines, but they're very important. Uh and then there is if you are more of a buy and hold chap or lady, apparently there are three watching then yeah, you you always want to understand kind of the market structure. And the market structure is really like what we start measuring here with with with trend monster which is launching next week for mentoring students only because we don't throw out powerful indicators like this because that would be super super responsible. So um book yourself a freedom call if you're serious about taking your portfolio and your skill level most importantly to another level in 2027. And I hope you got some value out of this. If I missed any of your favorite stocks, please let me know and I shall um grovel about it and and aim to add them to next week's review. And I wish you a beautiful, happy, extraordinarily wonderful Christmas season. And um I hope that you will make this the Christmas where you've taken action and where you've improved what's between the ears in terms of financial skills because that's ultimately what's going to get you to the the place that you want to get to. All the best. If you own Nvidia stock or you've been thinking about buying Amazon or maybe you just own an index fund, what I'm about to show you could change everything about your investment strategy. A massive $10 billion deal just broke that's sending shock waves to the AI chip market and Wall Street is scrambling to figure out what it means. I got a notification for this on my phone"
    }
]