[
    {
        "video_id": "90A7oJUUrNk",
        "title": "TOM LEE JUST SECRETLY TOLD INSIDERS TO SELL BITCOIN?! (WTF)",
        "published_at": "2025-12-20T16:28:54.000Z",
        "sort_date": "2025-12-20",
        "url": "https://www.youtube.com/watch?v=90A7oJUUrNk",
        "views": 29736,
        "duration": "00:08:27",
        "transcript": "Holy crap, guys. This is big and this is very, very serious because as you know, Tom Lee has been extremely bullish calling for 200k Bitcoin for 62K ETH and so on so forth in the media. Meanwhile, his private group, basically people that pay him to receive his private calls, they are getting bearish calls. You see here, this is a letter that someone published that they received because they are a paid subscriber to Tom Lee. And here a person on Tom Lee's team who is the head of digital asset strategy is basically having a bearish call predicting Bitcoin to fall between 60 and 65K in the beginning of 2026 while he expects ETH to go to 1.8K 8K and this is again in the beginning of 2026. They expect Sana to go to 50 between 50 and $75 and they're saying that these levels would present attractive opportunities into year end. Holy crap guys because this is basically what we've been saying on the channel since October 8th. Since October 8th as we've been risk off I don't have any altcoins since October 8th and this is basically what we've been saying. Meanwhile, this is also what Tom Lee's fund strat their company are telling to their private subscribers who are paying them or maybe investing with them. As you can see, this document is being provided for the exclusive use of and then a blurred name. So, they are sharing this privately to people. Meanwhile, Tom Lee publicly is super bullish. And here is where you really have to watch the videos we did on Tom Lee during the last two weeks. We had this video where basically I explained to you why he's super super bullish into January because his compensation package at Bitine depends on him being bullish. He's going to get around $100 million guys in total compensation. Watch this video. I will link it below and you can also click here. And then another video where he decreased his targets on the on December 11th. Now we have been covering Tom Leaf for quite some time already during the last few weeks because as you can see Retail is guessing fleece here. When Retail gets Hopium and they hold for another week or another month they stick to their losing old coin bets. Meanwhile, meanwhile everything is collapsing. Bitcoin is a bare trend. This is the cost that retail is paying. If you look here at the worst performers over the last 30 days, you have all of the so-called blue chips that should theoretically pump if ETH pumps. I mean, if all of the bullishness that Tom Lee speaks about becomes a reality, a lot of the so-called blue chip like optimism, near Cosmos, Celestia, Axelar, Ien layer, like they're all supposed to go up if ETH pumps. When Tom is bullish ETH, he's making retail hold all of these coins and retail then is losing between 30 and 70% per month. Okay, per month. And since the beginning of the year, if you look since uh since the beginning of the year, most of them are down between 60 and 90%. So why is this so important? Because this is a rate of loss. You can say how much do you lose if you believe the Fugazi for one one month or two months or 3 months or a year and this rate of loss is likely to continue like this because if Bitcoin breaks down which is not impossible here as Bitcoin is in a bare trend as you can see if Bitcoin breaks down here all obviously they're just going to accelerate their loss even even faster. So keep an eye on this because you hear people say one thing in the media one thing publicly and then they do totally different privately. That's why we look at the chart as the number one thing guys. This is yet another proof where you cannot listen to what people are saying in the media. If Tom Lee has been your reason to hold the coins and you're down now 70% in two months because of that. Meanwhile on this channel since October 8th people are always asking me Ivan when did you the risk? I'm telling them since October 8th. Meanwhile for the last two months on this channel over two months we have been bearish. We have been risk off. You understand the uh the difference? And we operate. How did we become bearish? Because we see that the price is weak. Price is bare trend. Doesn't matter what people say public. It doesn't matter what kind of news, what kind of headlines because headlines in most cases are fake because they are made for a specific use case. The use case for Tom Lee is to get his compensation in Bitmine. Go and watch the video about that. It's uh this one I will link below. Uh the use case for other headlines is different, but the use case is not to make you rich. Okay, that's for sure guys. No headline in the world is formulated so you become rich. There's z I I can guarantee you that there is zero headlines or news or or tweets that are intended to make you rich. The only thing that can make you rich is in case you look at the chart and you understand what it's telling what it's telling you. And so uh looking at the Bitcoin chart and looking at any altcoin chart, you're going to see a bare trend. You're going to see that we're below the 50we moving average. And while we expect a relief rally to the 50 week, we're not uh uh really betting on it because likely it's going to get rejected as this is a resistance now. So all in all, until Bitcoin goes to this cheap cheap area in the green closer to the 200 week or I mean ideally even lower uh most smart money most smart players in this field they are waiting and they're seeing how this will unfold because uh if you have a fall here to the 200 moving average these prices there's such I mean they're so fantastic from a riskreward that you you have many buyers here. you're going to have many buyers. Currently, as you can see where we are right now, there are not too many buyers stepping in and pumping the price up because it's still not too attractive. It's still too bit too expensive. As you can see here, it says Bitcoin expensive. But once we get down here, guys, I think Bitcoin is going to get a lot of support. And ironically, I I kind of agree with Sean Farrell here. I think this analysis makes total sense because into year end, that's when uh that's when you're going to pump. Okay? That's when uh a lot of crypto is going to pump with a new Fed chair with liquidity and everything uh being positioned in the in the correct way. And by the way, some people are saying like for example here in the comments you see this guy saying this is not Tom Lee. This is like his fund guys. I mean are you five years old or of course it's Tom Lee guys it's his fund. It's his fund and he's he here's a guy who is head of digital asset strategy. There's no way they tell their clients in in such a clear way that they expect that this guy expects 60k without Tom saying okay it's you can write it. Uh obviously the strategy here I mean in my in my view the way I see it is that Tom he has his KPI to get the compensation in Bitine at the same time they cannot lie and Fugazi their paid clients they cannot do that so they need to do proper analysis to the paid clients so that's what paid clients get now yes it's not Tom Lee this is Sean Farel who is employed by Tom Lee I mean I guess he Tom Le is the founder is the head of digital asset strategy so they can technically say oh it's not Tom Lee it's not Tom Lee Eric Are you are you 5 years old? You think they're going to send it? This guy's going to send this analysis uh if it's um if it's not in one way or another uh coordinated and approved. Of course not, guys. I mean, of course not. Anyway, but of course, hopeium is hopeium. Uh people want to be bullish. Uh fantastic. And there will be a time to be bullish, guys. There will be a time to be very bullish around here at 200 week moving average. That's the time to be extremely bullish. And in case we go above 50 week and then we go into bull trend on the on the money line on the weekly that's also a very very important signal to be bullish guys. That's I mean that's it. That's it. The only thing that would make me bullish are are those are those things. So until then we follow the plan. We follow the strategy. Subscribe to the channel. Also share this video. I think this video has to be shared because many people they live in La La Land. I mean they think that people speak in the media to for for for your sake to help you guys. Come on. Come on. Come on. That's why, listen, look at the chart. Don't trust the media. You You don't even have to trust me. Just look at the damn chart, okay? Chart doesn't lie because the chart is literally the track record of everyone. It's everyone's buys and sells in one visualization. The chart is the truth. It's the purest purest truth. What everyone is doing, no matter what they're saying. Guys, thanks a lot. See you all very soon. Smash it up. Smash up the like. Subscribe and goodbye. Goodbye. Goodbye."
    }
]