[
    {
        "video_id": "64KxAEvTBIw",
        "title": "Palantir Huge Announcement Comes With Major Market WARNING!",
        "published_at": "2026-01-08T04:21:23Z",
        "sort_date": "2026-01-08",
        "url": "https://www.youtube.com/watch?v=64KxAEvTBIw",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. I hope everybody is having a wonderful day. The market is in a very interesting spot right now and we're going to be talking about that and why I'm personally remaining cautious here over just the next few days uh in terms of trades and taking active trades. On top of that, we see a lot of political headlines that are coming out today affecting defense stocks and Palanteer is probably going to be affected. Now, it could be a benefactor here. We're going to be talking about that and currently that's what we're seeing in terms of a reaction. Palunteer is doing quite well uh in terms of its daily movement where it's sitting at on the charts and also on top of that we're going to be talking about some of the higher beta speculative names that we've been talking about on the channel talking about Iran, Cipher, Zeda, where are they all sitting at right now and currently cryptocurrency and what the broader market is looking like and why I'm getting fully prepared for Friday. If you are a new or returning viewer, hit the like button, subscribe for daily videos, and follow me down at X below if you want to communicate or see more active post. Now, popping up on the screen here, what you see is Palanteer currently trades at 18414. This is awesome in terms of just a technical perspective. We see Palunteer that comes up about 1% on the day and another 1% in the overnight session. Uh you can see currently right here at 184. Palanteer is both above its 50 and its 200 day on a technical perspective. and it's currently at the top of its consolidation range. I like to always look at Palanteer on this 3-month chart right here. And we talk about this in all the videos that Palanteer has this large zone between 170 and 184. And anytime it sits in that area, I'm pretty comfortable with it because it's just continuing to build out this long base here. Uh you know, from last Friday's sell-off, Palanteer lost that support, but was recaptured pretty quickly. And you can see here this is kind of like a magnet for Palanteer to trade in before we see any major catalyst or basically big pieces of volatility. Uh in terms of the actual individual price right now though, Palanteer's at the top of this resistance zone for this consolidation area right here at this 184. If it can break above that, that's where you can see Palanteer that can retest the 190s uh kind of get more of a bid up. uh in terms of why we're seeing a more buying pressure here at Palanteer, you know, one of the big geopolitical uh headlines or just you could say political headlines that we saw here. Of course, we talked about this yesterday. We'll mention this first truest this was about yesterday reiterating buy target here at 223 even though justifying the high valuation talking about that how they're going to continue to perform and execute at a rapid pace in terms of the products that they offer. Watch yesterday's video if you want to learn more about that. Today what we have here, Trump actually comes out here and saying that the 2027 military budget should rise to 1.5 trillion from 1 trillion here signaling a step change in defense investment. Now this shift here, this does favor Palanteer cuz they turn massive defense spend into realtime intelligence. We know that they are basically the AI solutions for the government and of course for the commercial side of things. But we know that they have a ton a ton of credibility contracts in relationships with the government right here. So after difficult negotiations he says right here uh they want to boost it to in 2027 to $ 1.5 trillion. That could mean a lot of contract money allocation money could be allocated to Palenteer. They could be definitely a beneficitor of that. One of the things that was also interesting here about defense contractors says here executives of US defense contractors will no longer be able to make more than five million unless they build new and modern production plants. During that time they are banning dividends and actually stock buybacks for defense companies until these problems are rectified. Right. So putting some more stipulations and constraints here on actual these defense contractors and the executives of these defense contractors trying to produce production trying to bring bring more concurrent and modern production plans right here. Uh and during that time they can't banning dividends and stock buybacks. So interesting to see here uh really making a lot of headlines regarding defense stocks today. [snorts] Uh in terms of the general market where are we sitting at? The S&P 500 is at all-time highs which is great. It's awesome to see here that we've seen a relatively strong hold above the 6900 a little bit here for some time now for a few trading days. Uh what we saw here intraday though, you know, palent or not the S&P 500 pushes up here uh to about 6966 getting close to that 7,000 test. I think we're going to definitely see some resistance around that 7,000. It's just a huge psychological resistance area. Um and what you see here is a large kind of intraday selloff. Uh in terms of the actual futures right now they're relatively flat down about 65 cents in terms of the spy low rates right here below is 15. It's 200. Um what we are seeing though a lot of people are pointing out is kind of these morning rips and a lot of buying pressure are turning into these intraday selloffs and reversals and a lot of tops. Um you know these can be signs possibly that the market is running out of breath. I don't really, you know, take that too much to heart or put too much into motion much emotion into that. The big thing that I'm looking at and the X is starting to pick up here. And we kind of talked about this yesterday. You know, this is more of a fear type of clickbay type post saying this Friday will be the worst day of 2026. But, you know, you know, never know what can happen. Uh, this is where we're going to have the Supreme Court that's going to give their opinion regarding the legality of the tariffs. Uh right here what they highlight here at the tariff revenues is that the US government is collecting 350 billion right now and annualized at the moment and you can see just a large jump here from when the when the tariffs were implemented. Now you know of course signaling we've seen this chart right here years of good times and talking about when to buy when to sell uh in terms of valuations and we've talked about the valuation the S&P 500 the p you know price to earnings ratio the S&P 500 is a little high right now. Uh so everybody's kind of looking for when is this top going to come. They have it you know uncertainty that's lingering in the background. This is probably going to bring a lot of volatility. Uh for some reason if we do have a main catalyst that could bring a lot of volatility. It could be the Supreme Court ruling that hey these tariffs are illegal and we can't do them and then now they got to be paid you know got to be returning and paying back money. That's going to cause a lot of uncertainty in the market if that does happen. The big question is we just don't know what exactly that opinion is going to be. But that's going to be coming out on Friday. Uh, another big thing here, you know, talking about possibly a liberation day, you know, 2.0, uh, if the tariffs, you know, that's going to cause a lot of volatility is looking at the VIX here. The VIX has held decently high over the previous few days up about another 5% just hanging up here at 14 and 15. So, the market's doing really interesting things, especially with the VIX that's hanging up here in the 15s. And we also have on Friday in terms of macroeconomic data, a jobs report. Now, the report from the Bureau of Labor Statistics is expected to show the US economy added 73,000 jobs in December, while the unemployment rate here ticking down to 4.5% from 4.6% uh looks like month over month. So, we'll see what happens here in terms of the jobs report that comes out. Nonetheless, though, you know, I think the jobs report, yes, is going to have some indication because that's going to continue to lead the Fed on what they're going to be doing with interest rates. We know the labor market kind of has already weakened a little bit. So what the Friday report, you know, what's that going to reveal? But if you couple that on top of here with the Supreme Court is going to be ruling and probability markets are right now, you know, pricing in about like a 70 to 80%, you know, probability that this could be overturned the tariffs. Um, in terms of I don't think the market has really priced in as a possibility yet. Uh, so that's why I'm personally not taking any trades cuz we could see some large swings here. But of course, for the long-term portfolio, any type of big dips, you know, building up cash reserves, uh, trying to take advantage of those dips because I'm still overall bullish on the market uh, for 2026, I'm bullish for over the next 5 years here, especially with the AI infrastructure, the whole AI boom. It's just more of these kind of more volatile moments that could come ahead soon. Uh, talking about Cipher, you see Cipher right here is at 1621. We kind of saw this intraday selloff. You know, we could possibly see a retesting here of the 16s at the support level right here. Could we get a bounce there or are we going to go back down here to the 151 14s if we continue to see selling pressure? If we see buying pressure, you know, let's back up to the 18s. Same thing with IEN comes down about 5% today. So, uh you see some of these high beta names. This these could be some pieces of you know, the uncertainty that's lingering around that we see some risk off type of movements that are being made. Um you know, and we're seeing that here with IWM kind of closes here in the red. Um SoFi, we saw that crazy drop in SoFi price action. So was literally nuts. This launched at the 29, came back here to 26. We'll see if this forms a base here and kind of tries to re, you know, regain some momentum back to the 29. Um, and we also see uh Zetta right here at 2321 being pretty relatively resilient with the recent run that it has had. Um, just don't want to chase right here at these levels, especially with some of the volatility that's ahead. I'm going to wait till that kind of gets priced in to see which direction the market's going to be going. Uh, in terms of cryptocurrency, uhoh, Bitcoin right here experiencing a little bit of a drop or continuing to see a little bit of a sell-off. This could be also due to some de-risking. Uh, you see at 90,000 right here. We'll see how 90,000 acts as a support. Hopefully, it does cuz if it doesn't, that's where you could see further pain. And Ethereum right now currently still above $3,000. Good to see there at 3136 currently where that settles for BMR. You know, BMR right here at $30. We do have good support here uh at BMR for30s. Um you know, of course, this uh stock is still, you know, highly highly uh correlated with the actual price of Ethereum. So, we'll see what happens. Uh let me know what you think down in the comments. Do you think Friday is going to bring more volatility? Do you think this could be what they call, you know, a catalyst for a warning here? Talking about a possible correction? Are we long overdue? Or do you think this is all just going to brush past us and we're just going to continue to inch up towards that 7,000 for the S&P 500? Peace out. Take care and I'll catch you guys later. Have a wonderful day."
    }
]