[
    {
        "video_id": "_oL9-64m6ro",
        "title": "Palantir Stock RISES During Major Market Sell-Off!",
        "published_at": "2026-02-04T04:13:46Z",
        "sort_date": "2026-02-04",
        "url": "https://www.youtube.com/watch?v=_oL9-64m6ro",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope everybody at is at least having a decent day with the major sell-off that we saw in the tech sector today with some of those high beta names that are taking a strong beating. We're going to be talking about possibly the reasons why we don't have any major headlines or catalysts. It's more kind of all these different pieces of uncertainty that seem to be piling up on each other and the market's really taking a breather right now in terms of some of these tech names. But however, Palanteer has Palanteer has remained relatively resilient after its earnings. I wasn't able to make a video yesterday, but of course I saw the earnings quite astronomical. Palanteer really needed those earnings and they continue to really really surprise Wall Street in beating those expectations. And right now it's at a really support level, a strong support level. We'll see if this move holds here in terms of a technical move uh or what we could possibly see for the future. So, if you're a new or returning viewer, hit that like button and subscribe for daily videos. Let's pop it up on the screen. Palanteer up about 7% on the day. Not too bad. Down about 1% in the overnight uh session and is currently at 15633 as we speak. But Palanteer came up came up about $10 today. And this was a nice bounce that we saw from earnings of course when this had this last local bottom at 142 before swinging up here even to 166. Now 166 that's where it was on the intraday before it kind of got faded back down to about 156 as we speak right now. So you know down about 10 bucks after a $20 move. Not too bad. It's right between its 50 and its 200 day moving averages. Uh right here is kind of reclaimed an important support level. And this is because when Palanteer has not been consolidating between the 174 like the 170 and the 184 area. uh the last time the balance here hit this 150 that's the last time we had a strong bounce. So it's basically at that level right now depending on the macroeconomic situation. If the sell-off here kind of across the tech sector and a lot of these AI names and especially the SAS sector um if that's finally kind of reaching a bottom who knows uh this could be a nice support level for Palenteer. However, you know this mood h from post earnings has also been kind of faded a little bit. Um so if we have any big catalyst or big changes to the macroeconomic structure possibly you could see another sell-off. So we we'll see what happens. But nonetheless, fundamentally, Palanteer, you know, of course, crushed their earnings with a 70% revenue surge. I mean, with a rule of 40 score now here of 127, that is pretty crazy. And that 2026 revenue guidance of 7 to 7.2 billion implying a 61% growth. Um, that shows you here that AI momentum is still very, very strong. The uncertainty is just what value are we putting behind that. But I think Palanteer did a good job just showing here fundamentally that the AI industry is still continuing to build out at a rapid pace. So what does that mean for where we are in terms of some of the other names? Um I had posted here that we have entered fear finally and for all those people that are always you know calling to want to dip uh that dip is here especially with a lot of these high beta names. We'll be talking about it. some of the names that have been relatively resilient though and have been on the top of my radar. You know, Cipher right here is still at 1614 after all the volatility and some of the moves. This dipped down here into the 15s just for a little bit, but today has remained pretty resilient. Didn't really make any crazy moves. Down less than 1% and looking at INE here, basically the same thing. Down about the same, a little less than 1%. Holding some strength here at 54. Um and looking at Nibbius right here also down and holding string. So the data center stocks did a good job showing a lot of resilience today which was important and I can I think further kind of ensures my confidence here that you know if cyher is going to hold a strong support level like this during a selloff um that shows you what's going to be happening once you have a lot of liquidity that could be possibly coming back into the market. [snorts] And looking at the S&P 500 index, you know, this dropped down here to about 68 69 and literally bounced off where we had this dip last time. Um, one of the main things that we did have, I think that took, you know, a little bit of a basically, um, uncertainty away and brought a little bit of a breather into the market was that Trump had finally signed a bill officially ending the US government shutdown. So, some of the other names that have been relatively resilient is here and uh, the drone company, they did pretty well. And you also have um actually more of a dip is here in Zetta. Now, we've been talking about Zetta and Path. My two kind of favorite names for Agentic AI. Path has been really disrespected recently. Uh sitting down here at 12. Uh Path is probably right now, you know, kind of what I have a lower conviction in compared to Zetta. I have a higher conviction in that in terms of earnings too. That's going to be coming, you know, relatively soon. And with Zetta here below 20 now below even 18 and 1789 uh once I think this finds a little bit of a relief I do like this name as an agentic theme for 2026 and holding and touching some nice support here with multiple touch zones here in the high 17s. So I like Zetta. I'll be keeping it definitely um on the radar on the top of the watch list. And let's talk about some of the new things I'm getting interested into. So very interested in that. SoFi had really good earnings and was really disrespected in the fact here that they had dropped down pretty tremendously down here to 21.81. You can see SoFi is currently right at its 200 moving average. Um so we'll see what happens here [clears throat] if this gets a little bit of a relief um being slightly below that or if we see a further breakdown with SoFi. And one interesting thing is you're seeing Hood here that is also taking a huge beating. Hood is dropping here very quickly at 87 and I think this has kind of been oversold and overdramified in terms of why is Hood falling this quick. [snorts] One of the big reasons is I think Hood has of course a lot of correlation with cryptocurrency's prices and that's because Bitcoin and Ethereum literally fell off the map today. I don't have any current exposure uh with this, but looking at Bitcoin here, this dropped down here to 72,000 um and even had Ethereum that came down here all the way down to basically 22100 before seeing a little bit of a relief. So, both Bitcoin and Ethereum, we've seen a lot of rotation outside of that. Looking at the general market here though with this buy, it's up slightly up about point, you know, 10 basis points, up about 70 cents, you So, what things are we going to be having in terms of volatility after this big tech selloff? Uh, that's going to be looking at the um Google and Amazon earnings. Those are our next big things. Yeah, Google that's coming out tomorrow and Amazon. So, more type of Meg 7 earnings. Of course, we saw with, you know, one of the big sellouts recently was with AMD. You also saw about a 2% drop in a video Microsoft and even a recent much stronger drop in Microsoft. So I think just in terms of the tech selloff, we're seeing a lot of rotation and more of to these safe haven more energy, you know, consumable utility type of stocks. And this is where we're seeing, you know, SCHD that's doing quite well in terms of a lot of these dividend ETFs that are actually catching a decent bid and are outperforming the general S&P 500 index and even the QQQ. Um, so you're seeing some rotation out of that and I think hopefully, you know, once some of this uncertainty settles with some of these headlines and things that could be happening, especially with this new Fed announcement that really wasn't warmly welcomed by the market, that's where I think you could possibly see a little more confidence. It's just, you know, how far is this knife going to fall with a lot of these individual names before we see some things that are continuing to kind of find their bottom? And like I said, some of those things like Cipher are, you know, and I are starting to find their bottom. But of course if those break you know they could fall even quicker in terms of BMR. We've talked about that on the channel now here just quite low right now down here at 2241. As we know BMR is highly correlated to the price of Ethereum. So I think I saw here Tom Lee was still buying but people losing a ton of confidence recently just with the recent price targets that were announced and they're just going in the complete opposite direction which really shows you you know some of the top you know Wall Street analysts and people out there that are calling for these huge you know price predictions they can definitely be wrong and we can see that uh just with what the market is pricing some of these things in. Looking at some of the nuclear names like Oakllo, this is back down here to a 78 right now. Testing some some support here in the mid70s. And we'll see if it kind of recaptures its 200 moving day. If not, we could possibly see even a further break down into the mid60s. So, everything's [snorts] just not looking crazy hot right now. But I don't think that means that, you know, a reversal or a bounce here is uh unjustified. I think what's interesting and of course the volatility that is still going to be heightened. You know, we could have any big changes with the administration or any type of changes that could restore a lot of confidence into the market. Um so year to date in January really hasn't made any moves. Um so for the first month, everybody's just been kind of hanging out or losing a decent amount of money if they've had long positions. So we'll see what happens. Other than that, we're staying diligent, of course, making a video no matter what. if the market goes up or down, no matter what happens to the Palunteer. We're going to keep you guys updated on all the news that I can find out. And um hopefully we'll get some confidence back into some of these names, especially for the longs out there that are getting absolutely crushed. Of course, it's always like, you know, how much conviction, you know, can you have until you get shaken out and then of course if you get shaken out, you could miss, [snorts] you know, that's just the beauty of training. So, peace out. Take care. I'll catch you guys later and have a wonderful"
    }
]