[
    {
        "video_id": "6L7YV2kjNDU",
        "title": "Alex Karp Leaves Audience Speechless on Palantir&#39;s Q4 Earnings Call",
        "published_at": "2026-02-04T18:00:06Z",
        "sort_date": "2026-02-04",
        "url": "https://www.youtube.com/watch?v=6L7YV2kjNDU",
        "transcript": "Welcome to our uh earnings call um celebrating one of the truly iconic uh performances in the history of corporate performance or technology just to underscore some of the the numbers that Glazer um read in uh a a kind of dry form which is very hard to do. Um this company uh grew 93% in the US. We had an aggregate growth of 70. Yes, that's a 70 handle. Um we have a rule of 127. Um and we are guiding to 61% growth this year. Now those results would be stellar, unusual and sublime for a company that was uh in a much earlier stage of its development. Um uh but we have been doing this for quite a while and you just cannot expect a company like ours to perform at anything like this level. At the beginning of last year we were guiding to roughly in the 30%. Which is which would be a stellar performance for a company. At the end of the year we grew our company almost 20% in one quarter. If you were a company sitting in continental Europe or in Canada or in any other similarly situated country and you grew your whole company 20% and you had a rule of 50, you would be one of the premier companies in your nation if not in your continent. And we also did this while supporting in critical manner some of the most interesting, intricate uh unusual operations uh that the US government has been involved in. many of which we can't comment on, but were the highlight of last year and were highly motivating to all of us at Palunteer. Um, and so this really just raises the question, what do bombastic numbers like this mean? Because, you know, if you're growing a company like ours at 40%. Um, you would then say somehow this is tethered to a broader category which is doing well. But with a rule of 127 and 70% aggraate growth, 93% growth in the US, you really have to look at this and and and the numbers speak very volumes that we are an N of one category of our own and we are doing things unlike any other company has done which has of course been confounding to people over the years because they said we were a services company when we're doing FDES. They said that our products were were somehow merely software in fact they are implementation and orchestration machines. Um, and no one thought we'd be able to generate this kind of revenue while having an anemic and and declining Salesforce. Um, and this obviously has import for the world. And what does it mean for the world? Well, it means that the first of all that the way in which we view value is obviously no longer relevant. that the bottom of the stack somehow is where the value is is lessened and the top of the stack where we impregnate the world with AI with ontology and FDA and tribal knowledge is represented at this table is actually where the value is created and that value is so large uh and so disproportionate that you can create a company that seemingly is exploding in terms of growth and quality of growth. It also means the riff we've been we've been saying for years that it's chips and ontology meaning investing purely in commodity products LLMs that are not orchestrated. Uh, of course it not only ruins the unit economics of of your business, but it also provides the market with a very distorted view of what value creation would mean because obviously if you're making revenue with no way of making profit because the cost of it is so high, that's not valuable. And obviously if you're producing something that is the same thing everyone else is producing, it's obviously of dimminimous or no value. So we've inverted the stack. We've proven that the investment in what we've done uh uh is uh with small numbers can have disproportional impact both on top and bottom line. And we've also seen unfortunately that there's a real hesitance to adopt these kind of products in the west outside of America. And the two places leading here are China and America. And what we're seeing in America is so widely divergent. And so the non-adopters, the have not um are are hoping for a kessup function. But these numbers are a breakout function. With with these numbers, you have broken through to a new category. It is not the category the basket of category of AI is actually meaningless. It's the basket of category of performant value creation with the tools we have at hand of which AI is crucial. and and and and to believe you can go and build companies without this is is is is supremely dangerous. And we're going to see over the next year companies that adopt things that actually work. We know ontology FDA orchestration is is explosive and revolutionary. And obviously companies cannot be expected to perform at this level because this is truly historic. But how do you even perform at half this level is going to be a real question for tech companies and a real question for countries. Can we produce companies that are producing what we produce in a quarter in a year? And one of the things we've got to figure out in the west is how do we do this? And this is putting enormous political pressure on our on our institutions because quite because because obviously political leaders struggle with how do I provide value when there's a disproportionate have and have not. Now, in the Palunteer version, the halves are the workers and the people that know how to actually use these products. And even the the ground truth of this is so far away from what people intuitively believe. It's actually not the capitalists against the workers. It's the capitalist and the workers. But that's very confounding to political leaders and it's confounding to structures that don't know how to adopt this and cultures that are not producing these kind of products. Last not least, these numbers are extraordinary because they're fully organic. They're not just organic because we we don't do acquisitions. We don't do acquisitions because we are a thick dense culture. Uh which means you'd have to fit in. And we have the perfect excuse now of not being able to do them because no one has numbers like this and it would reduce our numbers to do acquisitions. But they're also fully organic in the sense that we have no intertwined economics. Palunteer has direct relationships uh with our clients in defense, intel and commercial clients. We are not co-investing. We are we are we are not investing in commodity products. The numbers are pure. The pro the purity of the palunteer enterprise and the courage of the enterprise and we have lots of debates internally about what we should do, how we should do it and but from the beginning we have stuck to our very strong values of expanding what we believe is the noble side of the west which means being lethal on the front end meaning outside against adversaries if necessary. Hopefully adversaries do not want to mess with us. And on the inside, meaning domestic institutions, uh, intelligence institutions essentially taking an incination of the fourth amendment, which is completely represented by our pipelining foundry and impregnating institutions with it. so that every institution that uses our product is doing it within conformity of the law and the ethics of America and hopefully a logical extension of those around the world. Thank you. >> Thanks, Alex. We'll now turn to questions from our shareholders before opening up the call. We received a question from Jeff J who asks, \"How are you thinking about your international business and do you anticipate reaceleration in the near future for instance due to European rearmament?\" >> Um, well Sham and Ryan should comment on this. Um, but one of one of the big difficulties outside of American Clear and the Allies is and again as these numbers show, it's not how much you spend, it's with whom. And so we we we you know, we're we're currently, first of all, Palunteer is in a unique position where we we really don't have the bandwidth to do anything that's difficult outside of America. So, and as this learning curve goes on, it's more and more difficult to help people understand how to implement these things and the demand in the US is so great. But the core issue for our allies is going to be can we get to a point where there's a clear recognition that you're going to have to buy products that are much much more advanced than what is building being built domestically. And that's complicated for them because the because they tend to want to buy products from themselves. But it but if you just go back to a wider frame is this institution loadbearing? Is the purchasing structure of a European country actually allowed to bear the load of buying the best product? Can they understand the delta in a way that allows them to to to to make a decision that might go against the narrow economics of their own country? And I think unfortunately what you see is you see in the Arab and non-Arab Middle East, so Arab countries in Israel, you see adoption, you see widescale adoption in China and you see lack of adoption in Canada, Northern Europe and in Europe in general and and then but but but but the real difficulty for the world is you know if Palanteer is going to bear a lot of the weight of this work uh we are scaling I mean Sham should talk about this but like the demands on our product in the US government in defense and in civil are extraordinary. So how h how do you how do how do you in fact even justify moving into something that's more complicated is a real issue and again but the issue ends up being their issue more than our issue. I think one of the things you're going to see in Northern Europe can and other places is a real pressure to move to the left and right politically very far because the the way you deal with this when you don't have an answer to the question, you come up with ideologies that make no sense and you try to implement them and then that's the pressure they're going to have. The pressure we're going to have as a company, as a country, is how do we actually service the demand at the unyielding level of quality that that we demand from ourselves? And you know, the bar at Palunteer is not we're the best. It's that it's got to be magical. We're not in the business of delivering the best products. We're in the business of delivering magically uh projects that are magical on the front line. And and we unfortunately can't talk about some of that, but we've seen that in the last year. Magical implementations that have actually changed how people view US deterrence. Obviously, the primary heroes here are the war fighters. But you know the implementation orchestration which Sham and many many people at Palanteer have have spent tireless nights working on has actually changed what people are ever do. If you have any questions about this you can actually go if you speak or or read French go into the French newspapers. The one of the countries that has the clearest idea of the problem is France but they don't really know how to solve it because solution involves buying American products particularly Palanter. >> Nothing to add to that. That's great. >> Thanks Alex. Our next question is from Mariana with Bank of America. Mariana, please turn on your camera and then you'll receive a prompt to unmute your line. >> Good afternoon everyone. Can you hear me? >> Uh so two questions as usual. One in the commercial side, the other one on defense. Uh on the commercial side, the markets have already decided that 2026 is the show me story for AI. Have you seen that in the customers or software partners? like you talk about this I think you call it hesitancy but like over time you have talked about like this resistance from some corporates to implement AI the way you thought it was the right way. Have you seen a change on that dynamic? The other one is related to ship ship building has not been the only thing that the Pentagon has struggled to ramp up. uh there is a major effort to reindustrialize the US and especially the military related stuff but like is there an opportunity to have like I don't know an ammo OS or a missile OS and like where else we could see that >> so I would say our whole our whole commercial go to market strategy is showing and actually delivering value impact to our customers directly as quickly as possible and that's why we're seeing the stories of customers that are starting at larger sizes and expanding more quickly We closed um you know in our overall business we closed uh 61 deals over $10 million. That's because of the impact that we're delivering to customers and the customers are, you know, I'm having a lot of those conversations with those customers and they're all, it's all because we're showing them what we can do with the software and we're showing the impact and we're the only one that's delivering that leveraged impact from the models with the ontology, with the FD, with our products in those organizations. In the again here you you'd have to disambiguate America from all other markets but in the American market we we we we have inbounds where people have already seen proof points at other companies and not on one use case. It'll be like migration of this kind of product um underwriting a myriad of use cases and the conversation two years ago was much more I've heard you're kind of this weird thing that might be able to make it work. In general, the conversation now is I've heard you made this work. I don't understand where you fit into a slot. The reality of Palunteer is we're not a one-slot company. So, it's like if you want to view us, what people know us for is it it will work and it'll work really well and it'll be very quick. And then but but but a lot of our customers come now with I know it'll work. What do I need to do to make this accelerate? And then on the on on the end where it's like not as positive it might be it you know I don't quite understand how this would work or why this would work but there's a lot less of that and quite frankly we're in a much better position to shape who we work with than we've ever been and part of what we're doing quite frankly is shaping who we work with because you know like Ryan is sitting on one of the more interesting deployments both technically and commercially and the person running that deployment on their end de facto is the CEO and they're very far in the wheats and it's like and there they're like they've reshaped their org to absorb our product and like we've we've never had anything like and it's the same thing should talk about this in the DoD but it's not um one of the unusual things that unfortunately we can't talk about is also just how much we can shape what's going on under the hood including like how do you orchestrate something in a in a a defense or civilian context. Now, it's not that we're the deciders, but it is the the first time that, you know, we can help shape the footprint against which we or against which we execute. Not in all cases, but in the first for the first time in many. And what we need to get done this year is to expand that. It's it's much more density of client base than volume. We're we're we're into transforming large institutions and then making a lot of money with them. It's very counterintuitive, but because of that, they they see very deep alignment and they're willing to listen to us when we say, \"Yeah, we know that won't work.\" Like in the past, we had to show them it won't work. Now, a lot of our conversations, look, we know this won't work. Everyone thinks this work. This is some BS that companies tell you. It's never going to work. If you want the advanced fan event planning and the steak dinner, you can have that. And quite frankly, some companies are like, \"Yeah, we have some part of our company that's not real. We'll use some other company that does an event planning and stake dinners for that and then we're part of the real part of the business. >> And on uh on defense and re-industrialization, obviously re-industrialization is something we've been talking about for the better part of two or three years now. It's something we're very focused on. It starts in defense, but I think it it goes to pharmaceuticals. It goes to chain reaction where we're helping build data centers. So like there's so much activity there that we're uniquely positioned to go after. >> Sham's being overly modest. Sham's phone rings off the hook all day. And what they want from him is how do I do the same thing across government. That's literally what's happening. >> And that's what it is. The ship OS. Of course, we're starting with the subfleet, but people are asking us to help with all sorts of different weapon systems, fighters, bombers, surface vessels, drones, weapons themselves, munitions. Uh, and it's a big area for us that spans not only the production of the weapon, but also sustainment of them. And if you think about lethality, the ability to deliver combat power, you need an integrated ability to do this from the factory floor to the foxhole. And Maven is a huge investment that is has changed how we fight across the joint force on the foxhole side. And what we're doing that ship OS is really the kernel of um and is powered by warp speed is how we're going to reinvigorate the the factory floor and provide an integrated view to the Pentagon through this. >> Thank you. Our next question is from Dan with Wedbush. Dan, please turn on your camera and then you'll receive a prompt to unmute your line. >> Yeah. >> Yeah. So, great to see you again and might look uh obviously a phenomenal quarter. My my question is does it feel like you're getting more and more of the budgets on the commercial as well as even on the on the government defense side where you go in to do X and all of a sudden instead you're doing Y. Is that starting to happen now? You're just getting a bigger bigger piece these budgets when when Palanteer comes in. >> Well, if you look at you you look at our numbers very closely. What you will see is inexplicable growth in revenue, but not inexplicable growth in customers. And it's inexplicable growth in revenue because customers that are serious are putting a lot of their most important problems in our hands. And then the value creation, we're downstream from that, but the value creation is so large. So it's both, you know, it's it's it's not just that you get more problems, it's that you solve them in a way that is determinative for the business and then they they pay you a lot more. And and then there's also just this consensus, right or wrong, that the alternatives to us are not great. You know, it's like um you know, I'm constantly before these calls, I get 50 texts. Could you please be more modest? and it's an issue. Um, but we we struggle we all struggle with something. Um, but the thing is I I I think the the true answers to this, it's not like I I don't understand this false modesty of like the customers we work with know that we know things other people don't. And we've been sticking to the way we do things for a long time. And now AI has just put gasoline on all this tribal knowledge we have in our products. And I would say it, you know, and then and then we're we're much better at actually, I wouldn't say being modest, but saying you may be a customer or a country that's not getting this right now. Like Western Europe, I'm very pro- Western Europe. I I've been admonishing Germany in German to like wake up because I care, not for commercial reasons. But the reality is most people there are not they're not ready. So it's like we're very we're in a position to say yes you understand what we can do and m this is how it would work. The best examples are in all the stuff Sham is doing and other people are doing in government which cannot be talked about but the initial discussions are like well how would you shape the problem no one's you know it's like that's what people want from us because like our our our our weapons software is in every combat situation I'm aware of now maybe the more people with higher clearances are aware of some things we're not involved in. So, and people say, well, this should not have worked and it did. And and then on the commercial side, which is I think of great interest to to investors. I mean, that's why we have, you know, these that's why we have a rule of 127. That's why we're growing 93% in the US. That's why our guidance is at 61%. It was at 31% last year at the beginning of the year, something like that. So it's like it's because we have a very tethered and deep and dense proximate relationship with the leaders in almost every field of industry. And last adjacent to your question but is like and these relationships are not circular pay relationships in any way. It's like we are we we provide value. I tell I mean not that it comes up very much but I used to tell people all the time just imagine we're a Swiss company but you know you have to pay us a little more. Like we deliver a highv value product, we don't want any BS about getting paid. We're not going to give you any BS about why our product didn't work and offer you a steak dinner or event planning event. We're going to deliver and then we get paid and and like and we got paid last year a lot. 127 70 93. Those are my favorite numbers. >> Thank you, Alex. As always, we have a lot of individual investors on the line. Is there anything you'd like to say before we end the call? >> Um, you know, um, when we are thinking about what we're building, we are building, uh, these things with our internal culture, our our defense clients, uh, partners and and and with great thought to people have put their own money into Palunteer. Um and um it it's just a very important part of why we continue to perform and what motivates a lot of us here and definitely me. Um and I I hope that you are having a great time when you run into professional analysts who thought we would never be free cash po positive. We'd never be profitable. We'd never we'd never have a two-handle, a three-handle, a four handle, a five handle, and now a seven handle on our aggregate growth. And the rule of 40 was some uh unattainable category. Uh although 127 is unattainable by everyone besides us. Um so I hope you're enjoying the ride. Uh there's always ups and downs and there are ups and downs for all of us. We've been doing this for a long time. Uh and um but uh we're having fun tonight. I hope you are too. And uh yeah, congratulations",
        "summary_hu": "A Palantir erőteljes bevételi növekedését és a kritikus kormányzati alkalmazások iránti keresletet hangsúlyozta Alex Karp az utolsó negyedéves eredményhívás során. A 93%-os növekedés az Egyesült Államokban figyelemre méltó, és jelentős számú ügyfél számára biztosítanak értékes megoldásokat. Karp kiemelte, hogy a világban az érték és a termelési módok megítélése átalakul, különösen az AI spektrumában.",
        "summary_en": "Alex Karp emphasized Palantir's strong revenue growth and the demand for critical government applications during the latest quarterly earnings call. The 93% growth in the US is remarkable and provides significant value solutions to a large number of clients. Karp highlighted that the perception of value and production methods in the world is transforming, especially within the AI spectrum.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 50,
        "key_points_hu": [
            "A Palantir 93%-os növekedést ért el az Egyesült Államokban.",
            "Karp hangsúlyozta az AI és az ontológia szerepét a jövőbeli növekedésben.",
            "A nyugati országokban a termékek elfogadása lassú ütemben halad."
        ],
        "key_points_en": [
            "Palantir achieved a 93% growth in the United States.",
            "Karp emphasized the role of AI and ontology in future growth.",
            "Adoption of products in Western countries is progressing slowly."
        ],
        "main_topics": [
            "Revenue growth",
            "AI adoption"
        ]
    },
    {
        "video_id": "ymztand0-S4",
        "title": "Elon vs Honeywell CEO on Energy Future",
        "published_at": "2026-02-04T12:01:55Z",
        "sort_date": "2026-02-04",
        "url": "https://www.youtube.com/watch?v=ymztand0-S4",
        "transcript": "Hello ladies and gentlemen. I've got three massive clips for you in today's show. First up, the Moonshot crew reacting to Elon Musk. Then we've got Google's DeepMind CEO describing the moment when AI stops learning from humans and starts discovering things we've never found. And finally, a bonus clip at the end which I think you're going to really enjoy. And I'm going to keep it a secret from you just for now. >> All right, let's take a listen. This is uh Vimal Kapoor, the CEO of Honeywell. When you talked about the energy solutions available for these unbelievably energy hungry data centers, your list was short. Your list had one thing on it. If I listen correctly, you said gas. You didn't say gas and renewables. Can you educate us why not? Always like to tell people the mix of energy doesn't matter. How much is wind? How much is solar? We like to advertise that kilojels matter because energy intensity has to shift not the mix. So solar power cannot produce cement. Solar power cannot produce steel. >> They are very energy intensive. That's right. >> You still need a gas based heating or >> even after three or five more years of innovation and renewable physics. It's against physics. Word needs to build more infrastructure. It still needs steel. It still needs cement. It still still need fuels. Now how do you do that energy mix change while you also want to build data centers and consume more energy? That's an interesting problem to solve. And today the the problem is single threaded with the gas fired power plant maybe a little bit of nuclear renewables remain in the mix but cannot bring the the amount of jewels we need >> to produce this infrastructure which is required in the world. All right. And the counterpoint here put forward by Elon. >> Yes. I mean, wow. Is is my experience about that as well, Sel? Let me hit let me hit uh uh Elon's point and then let's come back and talk about that cuz that's a critically important kilogjles versus total energy. It's really all about the sun. Um and that's that's why uh one of the things we'll be doing with SpaceX uh in within a few years is launching um solar powered AI satellites, >> right? Um because the space is really the source of immense power and then you don't need to take up any room on earth. Uh there's so much room in space and you can scale to ultimately hundreds hundreds of terowatts a year >> and Elon goes on to talk about the fact that 100 by 100 mile area provides all of the US energy requirements. Same thing for Europe. Uh but Seem uh the most about natural gas Yeah, >> I'm I'm so livid at this. Uh so um couple of initial thoughts. This is the first time I saw this video, by the way. Um so uh first uh infrastructure of the future will not be steel. Um uh it's going to be um digital bits and uh if anything, it'll be fiber. Uh so that's one problem with this. Number two, uh yes, you need energy density to to make steel and and concrete etc. But the problem is not the that it's the it's the marginal cost. So for example, um if you have a a a big increase, even a marginal increase in renewables, the cost of the the fossil fuel cell will drop dramatically. In 2013, when we had the last oil price crash, it was because of a 2% over supply in the market. Okay? It's a very tightly market. The reason we have all these non-stop wars right now is to keep the price of oil high. Um, and so this is a a completely I find issues on structural issues on on on every one of the three points he's making. And then you go, \"Oh, Elon who goes straight to the thing. It's all about the sun for for God's sakes.\" Anyway, enough. >> I I'll take the other side of that if I may. I didn't hear anything unreasonable in my mind. Elon and SpaceX use methyloxs for rocket launches. They don't use solar power to achieve escape velocity and to I would say energy density and and power density matters an enormous amount for certain applications. I I think >> that's not the point I'm making. I'm not making that point. >> What's the point you're making, Sel? >> I'm the point I'm making is yes, you absolutely need energy density for those things. The point is that the energy density, we use so much oil for home heating, for example, if you shifted homes to solar, the amount of oil available for the energy dense applications goes through the roof and the price drops dramatically. And then you can use them the the marginal amount of oil for the energy density needs for those applications. Right now, we use oil for everything or natural gas for everything and you don't need it once you have solar coming online. So that's my >> I would say a couple of points. One, Honeywell, as I understand it, is a pretty diversified operation. It's it's not just like the thermostats or the the home heating systems that perhaps they're well known for. They're they also have a pretty sophisticated quantum information operation. So, it's it's a diversified company. It's not just home heating, but I I would say also in in some sense this feels like such a temporary debate uh almost a a false trade-off between petroleum legacy petroleum economy on one end and pure solar photovalttaic economy Dyson swarm on the other when the reality is we're going to in the not too distant future assuming no tragic left turn by civilization we're going to solve compact fusion and compact act fusion is going to give us energy densities for rockets and it's going to give us energy densities for home heating and for a lot of civilian applications and the Dyson swarm. So in some sense I think this is sort of like latestage uh petroleum economy discussion that we're having like hand ringing when it's all about to get torn down anyway >> 100%. And but the third beef I have is where he talks about renewables as this play thing on the side when your point is exactly right. Once you have fusion all of it becomes irrelevant anyway. So like why are we having this conversation? >> Well guys going to take the counterpoint here. Take a look at this chart on this next uh next slide here which is the growth of energy generation. This is in Europe in particular where wind and solar have now outstripped fossil, nuclear, hydro and other clean. And yes, we might get to fusion reactors and we might start building fusion reactors. But the timeline I'm seeing on fusion timeline I'm seeing on even gen 3 fision reactors is decades uh just from permitting and from construction. I don't see any of them. Even the SMRs are are currently slated to be, you know, 5 to 10 years out. If you want to understand the AI infrastructure side of things, the chips, the compute, why energy is the real bottleneck, I made a course called the AI landscape. It breaks down AI in a step-by-step fashion. The link is in the description below. You get lifetime access and the price will be going up as we add new modules. Back to the video. So they're breaking down the energy debate from completely different angles and they're all making points which are worth understanding. So Vimal the Honeywell CEO starts with a physical argument. He's saying forget the energy mix solar versus wind versus gas. What matters is kilogjles energy intensity. You can't make cement with solar. You can't make steel with solar. Those processes require the kind of heat you get from oil or gas. And when someone asks if that changes with a few more years of innovation, he says no, it's physics. His point is that renewables are fine for certain things, but they can't deliver the raw energy density you need for heavy industry. And then Elon comes in with a completely different framing. He's saying it's all about the sun, but he's talking about solar powered AI satellites in space. SpaceX is going to start launching these within a few years likely. The pitch is that space has immense power potential. You don't take up any land on Earth and you can scale to hundreds of terowatts. Slim pushes back hard on Kapor. He makes three points. First, the infrastructure of the future isn't steel. It's digital. It's fiber. It's bits. So, the premise that we need massive amounts of steel and concrete might be overstated. Second, it's about marginal cost. Oil markets are incredibly tight. The 2013 and 2014 crash happened because of just a 2% over supply. So even a modest shift to renewables frees up fossil fuels for the applications that actually need energy density and the price drops. Third, we're wasting oil and gas on things like home heating when solar could handle that, which would leave more for the stuff that genuinely requires it. Alexandra makes a fair point. Elon himself uses methane rockets, not solarp powered ones. energy density matters for certain applications. But then he pivots to this whole debate feels temporary. We're arguing petroleum versus solar when compact fusion is probably coming. Once fusion works, it handles everything. Rockets, home heating, civilian applications. So in his view, we're having a latestage petroleum economy debate that's about to become irrelevant anyway. And then Peter brings it back to what's actually happening on the ground. He shows a chart where wind and solar have now outstripped fossil, nuclear and hydro in Europe. But his point is timeline. NextG vision sounds great, but permitting and construction can take decades. Even small modular reactors are 5 to 10 years out. So whatever we think about the long-term future, renewables are what's scaling right now. So that's the infrastructure side. Now let's talk about what AI is going to discover once we get there. In this next clip coming up, we have DeepMind CEO who brings up Alpha Zero, which is the version of their go playing AI that taught itself to play better than any human ever has. And then he gets asked the question, what happens when you do that same thing with general intelligence? Check this out. >> It's been incredibly gratifying to see, you know, 3 million researchers around the world use it in their important research. I think in future um all almost every single drug that's discovered from now on will probably have used alpha fold at some point in that process which is you know amazing for us and you know really that's what we do all the work we do for >> I also read that moment you tell me if I'm wrong as something of a of a metaphor small uh passionate AI division kind of yelling in a big company get this out cut the red tape >> yeah potentially but look I mean we've had amazing support from the beginning from Google and they the reason that we you know we we joined forces with Google back in 2014 is Google itself is a scientific research engineering technical company always has been and has that at its core and that's why you know I think that we have the scientific method and the scientific approach that thoughtful approach that rigorous approach in everything we do so of course they're going to love something like Alpha Fold >> okay here's here's the big question at the end um you built Alph Go >> uh trained um the computer to play on human knowledge and then once it mastered the human level playing you kind of like let it loose. >> Yes. >> With a program called Alphazero >> and it started doing things that you could never even imagine and making new circuits in ways that surprised you. >> Um eventually maybe there will come a time where LLMs or some version of them >> um reach a a mastery of of human knowledge in the same way. uh what is going to happen when you then let that loose and it does the same potentially does the same thing as Alpha Zero. >> I think it' be very exciting. I mean that's that's what to me is would be the AGI moment is you know then it will discover a new superconductor room temperature superconductor that's possible in the laws of physics but we just haven't found that needle in the haststack or a new source of energy a new way to build optimal batteries. I think all of those things will become possible and indeed not just possible I think they will happen uh once we get to a system that's first of all uh got to you know human level knowledge and then there'll be some techniques maybe it will have to help invent some of those techniques but kind of like alpha zero that will allow it to go beyond into new uncharted territory CEO is describing a moment when AI stops optimizing on human knowledge and starts exploring territory we've never mapped so AlphaFold is already being used by 3 million researchers around the world. And he says basically every drug discovered from now on will probably use it somewhere in the process. That's a pretty big deal. But the more interesting part of this clip is when he talks about what comes after the transition point. The moment when AI stops learning from human examples and starts generating knowledge that humans have never produced. That's what Alpha Zero did with Go. It learned the game from human play first and then basically said, \"Okay, I got it.\" and started inventing moves that no human had ever conceived of. Some of those moves looked insane to professional players until they realized they actually worked better. The examples Demis gives are room temperature semiconductors, new energy sources, optimal battery chemistry, problems where we know the physics allows for solutions, yet we haven't found them. We know there's a needle in a haststack somewhere. The search space is just too large for humans to explore systematically. An AI that can reason about molecular interactions and run millions of experiments in simulation could find those needles way faster than we can. Drug discovery is the obvious first application because the feedback loops are faster. You can test molecules against proteins computationally before you ever touch a lab. Demis is describing an AI system that has absorbed enough human scientific knowledge that they can start generating novel hypotheses and testing them at machine speed. the gap between that and today's system might be smaller than people think. We already have AI that can code reason through math problems and synthesize informations across domains. The missing piece is really the agentic loop. Having the system design experiments, interpret results, and iterate without human guidance. And if you zoom out, there's a feedback loop between what we talked about in clip one and what he's describing here. AI discovers better battery chemistry which makes energy storage cheaper which makes AI compute cheaper which lets you run more AI which discovers more things. Same with fusion. If AI can accelerate fusion research by running better simulations you get abundance energy which powers more AI. The whole thing compounds on itself. That's why these two clips are connected. The infrastructure enables the discovery and the discovery improves the infrastructure. So we talked about where I compute is going and what it's going to discover. But all of this still depends on actually manufacturing the chips. And right now there's a massive bottleneck in the equipment that makes them. Before the bonus clip, if you enjoyed this video, please consider hitting subscribe. >> Boss disruption could crush these stocks. I've seen it happen so many times before. Given how much they've already run, if you don't already own them, let's just say I think you're too late. But there is a relatively safer way to play the same theme. These are not safe stocks but safer versus those others. And that's the semiconductor capital equipment plays. Whenever there's a chip shortage like we have now, sooner or later these companies start buying more manufacturing equipment in order to boost production. That's why ASML, Applied Materials, KLA and Kramer fave lamb research have been roaring because people know that they'll have big orders as the year goes on. The big four semiconductor capital equipment makers rallied like crazy last year. They're up anywhere from 29 to 39% just since the beginning of January. You're not early, but they haven't run nearly as much as the storage and memory makers. So, relatively, they've still got more room to run. Plus, I think this industry has a lot more going for it. Uh, two weeks ago, Taiwan Semi, the world's largest semiconductor manufacturer, reported a total blowout quarter. More important, management said that the demands on fire. They plan to invest heavily in building out the production capacity. For this year, Taiwan semigguided for 52 to 56 billion in capital expenditures. That'd be up 27 to 37% from last year. Wall Street was expecting less than 45 billion. When management was asked if that would be enough to fix the chip shortages, their answer was a clear no. Taiwan semi doesn't see supply and demand coming into balance until 2028 or 2029. So, they're planning to keep their capital expenditures high for the next few years. Again, great news for the semiconductor capital equipment makers. Now, the specific commentary was about Taiwan semi-investing to meet demand for AI semiconductors, not necessarily memory or data storage chips. [snorts] But if anything, that's better for the capital equipment makers because manufacturing AI chips requires more advanced hardware. ASML is best positioned for this type of leading edge equipment, but all the big four semi-ductor capital equipment companies participate in the market, which is why they all had such huge gains in response to Taiwan Semy's quarter. Rational. We got another big clue the very next day when I got a chance to interview Sanjay Marocha, the CEO of Micron. What a stock on what a company on Squawk on the street. That's when Micron broke ground on 100 billion dollar semiconductor foundry in our state, New York. While that facility won't be up and running until 2030, you better believe it needs equipment. On top of that, Micron's working on a new fab in Boise, Idaho, which will begin adding output by the second half of 2027. Micron also broke ground on a new fab in Singapore yesterday that should start producing in the second half of 2028. Dizzying, right? The key takeaway, Micron's investing in new production now, and it'll continue investing in new production for several years into the future, which means consistent orders for lamb research, KLA, and applied materials. >> Finally, when Intel reported last Thursday, the stock got clobbered. Remember, it was down 17% on Friday, another 5% on Monday before stabilizing today. That's not because the numbers were bad. The quarterly results were actually quite good. Instead, Intel gave dismal guidance because they just don't have the ability to meet the demand for their chips. From my own reporting, I've found out that Intel simply doesn't have enough manufacturing equipment. It didn't predict the strength of its own markets correctly. Again, as with Taiwan Semi, this isn't about memory chips. In this case, it's CPUs that Intel can't make enough of. That means more business for the capital weapon makers, especially Lamb Research. CPUs are the bread and butter. Lamb's also one of the leading providers of the type of equipment used to make memory chips. So, they'll be one of the first companies to benefit as the memory and data storage companies look to boost their productions, which I know they want to. That's why this stock valued 137% last year before tacking on another 39% gain in January. Now, some of these semid capital equipment companies will be reporting earnings in the next few days. As Mel reports tonight, overnight from Europe, so we'll have numbers when we get in tomorrow. Lamb reports after the close tomorrow. KLA reports on Thursday night. YouTube isn't just entertainment. It's one of the best client acquisition tools because it builds trust at scale. We've helped businesses grow from scratch to a $100,000 month just by launching them a YouTube channel. Book a call with me below and let's see how YouTube could help your business scale.",
        "summary_hu": "A videó két CEO, Elon Musk és Vimal Kapoor, energiajövedelemmel kapcsolatos elképzeléseit vitatja meg. Kapoor azt állítja, hogy a megújuló energiaforrások, mint a napenergia, nem elegendőek az ipari termeléshez szükséges energiára, míg Musk hangsúlyozza a napenergia potenciálját, különösen a világűrben. A vita középpontjában a jövőbeli energiaellátás, a megújuló energiaforrások, és a globális ipar energiaszükséglete áll.",
        "summary_en": "The video discusses the energy perspectives of CEOs Elon Musk and Vimal Kapoor. Kapoor argues that renewable energy sources like solar are insufficient for the energy demands of heavy industry, while Musk emphasizes the potential of solar energy, particularly in space. The debate centers around future energy supply, renewable sources, and the energy needs of the global industry.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 50,
        "key_points_hu": [
            "Kapoor szerint a megújuló energia nem elegendő az ipari termeléshez.",
            "Musk hangsúlyozza a napenergia hatalmas potenciálját a világűrben.",
            "A vita azt is megvizsgálja, hogyan lehetne kombinálni az ipart és a megújuló energiaforrásokat."
        ],
        "key_points_en": [
            "Kapoor states that renewable energy is insufficient for industrial production.",
            "Musk emphasizes the immense potential of solar energy in space.",
            "The discussion also examines how to integrate industry with renewable energy sources."
        ],
        "main_topics": [
            "Energy Solutions",
            "Future Infrastructure"
        ]
    }
]