[
    {
        "video_id": "gjgCa39Z0Oo",
        "title": "Bitcoin Buy Zone &amp; Next Cycle Explained #shorts",
        "published_at": "2026-02-04T20:02:19Z",
        "sort_date": "2026-02-04",
        "url": "https://www.youtube.com/watch?v=gjgCa39Z0Oo",
        "transcript": "If this support will be broken, we'll be teleporting quite quickly to the 200E moving average and Bitcoin would basically be losing its last last important support before our big beautiful buy zone. You know that buying at around 200 week is the best possible riskreward. So I'm not against us breaking support. In fact, it will be fantastic for us to go to the 200 week, load up the bags and uh prepare for the next big cycle which will happen later this year and to especially towards the beginning of next year because now we are repeating 2022. 2."
    },
    {
        "video_id": "VvwyBW6yEGI",
        "title": "BITCOIN AND ETH: EVERYTHING COLLAPSING, THIS IS URGENT!!!!!!!",
        "published_at": "2026-02-04T19:31:01Z",
        "sort_date": "2026-02-04",
        "url": "https://www.youtube.com/watch?v=VvwyBW6yEGI",
        "transcript": "episode and as right now we have emergency. We have emergency because the button is getting pressed. The flash button is getting pressed in real time. Bitcoin flashed all the way to 72. I mean even below 72 it went here for a second. Now within the last 10 minutes or so it seems that we have recovered a bit. But the truth is guys is that the that this flash button is getting pressed right now in real time for Bitcoin. And the flash destination is towards the 200E moving average. But it's not only Bitcoin. The flash is also happening in real time for Sana where as you know we are looking at at a juicy juicy entries for Sana at $30. If this flash button will actually be pressed and it is being pressed in real time but it's not fully pressed until we break below here 90 uh 87 88. We need to start breaking here. So of course of course many people are asking Ivan what the hell is going on? Look here Sana minus 6% today. It was minus 8% just 10 minutes ago. Bitcoin was minus 6%. Now it pumped back a bit now minus 3%. But the volatility is crazy. Volatility is crazy. And you know this flash button doesn't only apply to crypto. When you look at the stock market, it is a bit of a bloodbath there as well. I mean look here, Nvidia down, Amazon down, Meta, Tesla, everything is down. Everything is down. Everything is down. Especially the growth stocks down a lot. - 18% -7 - 16 - 15 - 15. I mean it's a lot a lot everything is uh it's going down everything is going down and you know we have been warning a bit about that because the S&P has this very very weak chart I would say it has this all-time high right here but it instantly got flushed and normally it's not good when you see something like this it's a it's a tired market man it's a tired market so can it still pump and bring more gains it can but I mean it does look more and more tiring there is less and less and less momentum here And I don't like seeing that. And also, if S&P keeps dumping, you know that the flash button for Bitcoin is going to be smashed even harder. It's not only going to be one flash, it's going to be bum bum bum bum bum continuous flashing and flashing and flashing because S&P is still around the all-time high level. It's very, very high still. And if it goes, let's say 10%, 5 10%, what's going to happen to Bitcoin? We're going to be buying it at 200 week moving average. Many people are going to get greedy. They're going to say we're going to go to, you know, 30, we're going to go to 20. is too greedy, man. Buy at 200 week is good price. Say thank you. Purchase the coins. Get them in the wallet. Say thank you again very much at 200 week moving average is very very nice price. But currently the people that are making money are the shorters. The it it is people who are shorting in our community. Just during the last hours we did see Mooncat post 60% gain from shorting Sana. Then you had Pacin 40% gain. Then you had also uh Don Banini saying that he had 40% gain trading the 4hour swings. Also passive with another passive actually had all kinds of gems here. All kinds of snipes. This was actually yesterday. We covered this this morning already. And all in all, you need to be comfortable shorting. And that's exactly what we teach in bullmania.com. How to use the mechanical rules to long to short to do anything. And some people have been asking but Ivan why don't you post losses? There was a guy who wrote this morning, Ivan, you should post losses, not only gains, show us the losses. But guys, I keep repeating to you that we never allow small mistakes turn into big disasters. So mechanical rules always ensure that your losses are super cap. So if I keep posting losses, it's going to be no minus 2%, minus 5%, minus it's boring, but there's no content. There's no show business in me showing the small losses because this system ensures that you never have big loss. It's part of mechanical rules. So if you listen carefully, there are no big losses. actually shared with you a loss that happened that was quite big here from Mooncat a few days ago, but that was because he did not follow the mechanical rules. And that's a very very important signal that if you follow the mechanical rules, your losses are always small. You're never in a position where you buy something, it goes down 20%, you still hold, you still pray, please, please, the dear founder, the the big BMI founder, please make it pump. [gasps] It never happens. It's always never let small mistake turn into big disaster. or go to bullion.com learn it learn I mean otherwise you're you're you're offline if you are not able to use this market and this market can only be used by shorting now you're you're offline which is fine which is fine but you know you can trade both markets people also ask me Ivan why why why are you so excited why are you so excited for when prices because we can short them I mean we need movement I would rather have prices fall fall rapidly getting flushed in the toilet rather than be than being sideways because sideways I mean that that's a market where it's hard to make money but we want to have uh money every day. I mean it's bull mania. Bull mania means your portfolio needs to grow to be in a bullish bullish trajectory every day. And when markets dump it happens you can make it work. If a markets pump it's also easy to make it work inside with chop. You could apply the uh bots. I mean that's basically the only thing that you can do that you can go to bulling.com/partners. You can get the pionex bot. they can work in the shopping market but otherwise when the market is trending buy bit bit unix weeks are the best and you get nice big juicy signup bonus if you go to bullmay.com/partners or click the link in description we have a very very nice link it is called like this exchanges I use so guys all in all we have fantastic fantastic trajectory for all of these different assets uh they haven't yet clearly broken uh the the support so here for example bitcoin I mean it does want to break but you know it's a bit here a a bit in a bit out the but it's only kind of pushing on the small toilet button but if you see this thing close weekly below I think the next week we could be at 200 week already okay we could we could easily be easily be the bulls are fighting for their lives the bulls are trying to defend this level if they can defend it maybe we you know pump a bit here you know maybe back again it just it just works for everyone if we pump back here you know the bulls just delay their destiny they their fate they just delay their fate eight. The bears obviously have to wait again for this to come. So it's basically bad for everyone. It's bad for the bulls because it's likely it's not going to lead to alltime high. Likely it's going to lead to rejection here. It's bad for the bears. So it's bad for everyone. So the best option for everyone is that we actually have a fast flash. It's best for the bears. It's best also for the bulls because when you have a fast flash, okay, then we can rebuild from there. Always better. When you have slow bleed, that's the worst. Slow bleed for the bulls is the worst ever. You never want slow bleed because it never ends. gone for years. Okay, you don't want slow bleed. You want fast flash. Okay, so that's that with uh the markets in terms of Bitcoin, in terms of Solana, we discussed in terms of stones. I mean, let's see the stones. It's guys, the stones can easily come back to 50 moving average, bounce and still continue and be bullish. Okay. And in this scenario, what will happen to Bitcoin? That's my question to to you. And are you prepared or not? Because if I mean, we need to go 7% down to moving average for stocks. And if we bounce here, it would still technically be in a very very bullish long-term structure. And let's check here quickly on the money line. The money line is here at 6.6 uh okay for for S&P. So the money line would turn bearish a bit earlier than the 50 week. So keep an eye here. But stocks can easily either dump to the money line or they can dump to 50 week. And in both scenarios, they would have an okay level of uh uh recovery. So min is the first signal to short and to be conservative. And then if we start breaking here then yeah then you have to really be careful but let's see what's what's going to happen here. Stock market hasn't even started the dump basically. NASDAQ NASDAQ has a bit different situation because it has been technically bearish since November. Uh it hasn't really been able to do a new all-time high and this thing is also kind of waiting for a flash guys. Uh either to the upside or to the downside. Uh but uh everything depends on this. Everything depends on this. I have a bit of uh uh hopeium for you guys and that's basically that uh Nvidia CEO is saying that stocks are still the soft software is still needed. Okay. The reason why all of these different stocks dump why many many software companies sell off is because everyone is afraid that you don't need software anymore. The reason why stock market is a bit shaken now it's a bit wobbly is because claude entropic ch they're adding more and more features. So the question is will you need expensive Vas will you need software as a service as a thing even so that's why the stock market is a bit shaky obviously it has a direct impact on crypto as well and so if you can have conviction that actually software is still needed it would be a very good thing for the market and this is where Nvidia CEO came out today or yesterday I mean this was super recent and he explained that guys guys software will not die AI will not kill all software listen to this >> what remember what software ware is software is a tool. There's this notion that the tool ind the software industry is in decline and will be replaced by AI. You could tell because there's a whole bunch of software companies whose stock prices are under a lot of pressure >> because somehow AI is going to replace them. It is the most illogical thing in the world and time will prove itself. Let's just give it let's give ourselves the the ultimate thought experiment. Suppose we are the ultimate AI. Artificial general robotics. The ultimate AI. The physical version of us. You could of course solve any problem because you know you're humanoid. You could do things. If you were a human or robot, would you use a use a screwdriver or invent a new screwdriver? I just use one. Would you use a hammer or invent a new hammer? Would you use a chainsaw or invent a new chainsaw? It just don't. First of all, ideally, they don't use it at all. But but do you understand what I'm saying? If you were a human or robot, artificial general robotics, would you use tools or reinvent tools? The answer obviously is to use tools. And so now do the digital version of that. If you were a artificial general intelligence, would you use the tools like Service Now and SAP and Cadence and Synopsis or would you reinvent a calculator? Of course, you would just use a calculator. That's the reason why the latest breakthroughs in AI is what? Tool use. Because the tools are designed to be explicit. There are many problems in our world where F equals MA. Please could you please not come up with another version? >> FA is not. So what he's saying here basically is that software is fine because AI will actually use software and let's see if it calms the markets. I mean in one sense it does make sense. It's not like AI will reinvent all software. But the way a lot of these companies are charging is based on seeds and man you don't need that many seats anymore. They will have to reinvent themselves. So yes the shakiness in the stocks I think it is justified. They're not going to go instinct, but it is in many ways justified because the amount of money this software sometimes charge you for just adding a new team member is insane. It's morbid. You know, when a person is morbidly obese, that's the that's the invoice you get from SAS providers. It's morbidly obese invoice. When you just add a new team member, that cannot continue. That cannot continue. Obviously, if they have a nice tool, great. But AI will be one single user that integrates them and that's it. So there needs to be a repricing. A repricing needs to happen in the stocks. That's why I think it's kind of justified that they fall a bit. They will not go instinct. They will still be needed because the their business model has to shift. They have to shift a bit. Okay, that's very very important. And I let know if you've experienced that. I mean sometimes we use different tools. It can be design, it can be CRM, it can be anything. You just want to add another guy. You need to add another then you come THOUSANDS OF DOLLARS I HAVE TO PAY TO ADD ANOTHER guy man instead the share password get AI and like figure it out we're not going to pay thousands of for just another guy another low water get out of here [laughter] it's crazy it's crazy so what you're saying is correct but some repricing needs to happen it needs to happen guys by the way small thing if soul goes to 30 can you guys nominate me to Nobel uh prize in economics okay because I think it is our nobel idea that it goes to 30. I haven't seen anyone discuss it in the same way. So guys, if Solana goes to 30, please send in my application. If someone from Nobel is watching this, then I would gladly accept the price in economics. If Saul starts breaking down here and actually go to 30, [laughter] okay, simple simple simple deal. Now guys, in all seriousness, I have to tell you something about this 30 prediction, and that's that we don't know if it's gonna go to 30. And when you have a target such as 30, it doesn't have to go to exact 30.0000. If you find soul as a great asset and you really are excited about it, you could start lading it lading in around 45 around 50. Like it's just a target. And I think it's it has a high likelihood of reaching it if we break down. If we break down, it's a very high likelihood we're going to reach it. But at the same time, do you have to be greedy and buy it at 30.0000 or can you buy it at 40? So you have to be a bit pragmatic. Personally, I think I'll be lading it lading in a bit higher. Maybe at 40 a bit. Maybe. Yeah, but that's the target. That's the ultimate target. Can we reach it? I think we can. I think we can. If we [clears throat] break the support, we first, you know, first break the support. First chicken, then egg, okay? Or egg and then chicken. First support break, then big fat short, then accumulation around good levels as close to the target as possible. So, that's that. Uh what else we have? Uh uh. Oh, by the way, apparently we will not get bailed out. Not that we needed a bailout, but you know, Brad Sherman, he's trying to muddy the water. The Charminator, the absolute most, how do you say, not most hated. I mean, from crypto's perspective, he's most hate, but he hates crypto the most. The most hating person against crypto is Brad Sherman, the Shermanator. So, he's being a bit provocative and asking Scott Besson, the Treasury Secretary, whether he's ready to bail out Bitcoin in case it goes down or bail out Trumpcoin. So, he's asking a bit of pro provocative questions, but yeah, it's a bit interesting. Listen to this. >> Uh, do you have the authority to order banks to buy Bitcoin or to invest US tax dollars in Bitcoin or Trumpcoin? >> Uh, I I am secretary of the Treasury. I do not have the authority to do that. And as chair of FSOC, I do not have that authority. >> There you go. Okay. So, we're not getting any bailout. >> Sana can go to 30 without any bailout. And Bitcoin can go to 200 week moving average without any bailout. Uh what else guys? I want to keep it quite short. There is some FUD happening at Binance. This guy has been sharing his views on October 10th basically saying, you know, well, looks like it's all unfolding and the truth is coming out. Binance is insolvent and they're solely responsible for 1010. October 10th, the effect will have the effect this will have on the market will be catastrophic guys. I mean actually uh if you have something on Binance just to be sure I mean you never know but you know what Mark the bottom of the last bear it was the FTX collapse. So if something happened to Binance just from a you know probabilities perspective for our bull trade it would be quite good because when you have a black swan let's say Binance collapses holy [ __ ] Binance Binance is solve it. I'm not saying they are. I'm not saying they are but just you know if we are to look at what can happen so you can be even more sure to take a big fat bet on or to be bull is when you are around 200 moving week moving average and something collapses like that's the best that's like the best bingo. Um obviously be be super I mean listen who the hell knows what happens to Binance have self custody this and that. Someone saying Binance is rolling in money. That's that's that's not a good way to see it. FTX was also rolling in money like all of these big institutions they all have money still they collapse Celsius was also rolling in money they said they had all you know billions here billion there turns out it was billion in their own coin then their coin collapsed MTX also they had so many billion big reserve big billion billion revenue billion there billion here it was all the coin and then collapse also billion is great but if you have more liabilities it's still insolvent it's you need to look at the net you look at the net so we don't know what's happening here Binance is getting a bit nervous. They're sending C's and deceased to this guy saying to him, please don't discuss anything. On February 3rd, you published a post on X asserting that Binance is insolvent responsible for 1010 and that the situation is far worse than FTX collapse. These claims are demonstra demonstraably. Demon de guys, demonstrably. Say it with me. Demonstrably. Never heard this word. I mean, obviously I understand what it means, but demonstrably. I've never said it in my life, so I don't have neuron pathways to say it. Malicious and constitute liable per se. So, just to be clear, we're not saying anything on this channel. We're not saying anything. We're just saying that if that would happen, it would be very nice riskreward signal to buy Bitcoin like a mfer, like an mfer. [laughter] If you have Bitcoin 200 moving average and then something happens, maybe to this, MAYBE TO THAT, MAN [screaming] IS THE BEST. THAT that would be the best possible scenario from a riskreward. You know, you buy and you buy bigly bigly bigly. Okay. So, notice violation your assertion regarding Binance F are factually baseless. So, yeah. Um yeah, let's see what's going to happen. Immediate demands permanently delete post a public retract. And so, this guy says that, you know, I want to expose everything, but I can't risk a legal battle. There you go. But let's see what what else he said. [laughter] Like that's the that's the problem with you know season this is now I'm a bit interested what else he said if the news is real we're royally screwed. What else he said? What else he said? And that that's that's the now now I'm more curious what what prompted this um um what happened? Uh Trump Trump. But did he even say or he did he just write that one tweet? Maybe he just wrote that. Is is this it? He just wrote this. Maybe that's it. I mean listen if that's it then yeah maybe it is liable. He needs to have more more proof if the news I just received. Okay, so he's a bit of click bait. Yeah, listen. Maybe it is liable. Who the hell knows? But guys, if something happens, it will be from a riskreward. Very good. Obviously, pull out to self custody. You never know. You never know. Uh we're not saying anything to be clear. We're not alleging anything. We're not We're just saying that if that would to happen, bye bye bye bye bye bye. That's it. That's it. Okay. So, what else? What else? Uh let's go to Q&A. Let's keep it short and sweet. I think we said everything. Um everything is uh exactly as predicted. Uh yeah, I that's it guys. That's it. That's it. People like Evan, why you so happy? Why you so happy when Dubs guys? Because I mean listen, we've been playing it very well and you can short and uh that's it. And uh if you don't know how to short, go to bullion.com, watch the free training. This is how to make money now, guys. It it is this it I don't know any other way now because markets go down and the good thing is when they go down, you can short. When they go up, you can long. When they go sideways, you cannot do too much. Maybe you can do a pionx bot, but uh shorting is the way for all the guys. Ian, show us losses. Show us losses. The losses are boring because mechanical rules don't allow losses. They allow they allow short loss, small losses, because then stop loss hits in. The only big loss I know people want to hear see big loss. Big shout to Moon for for posting big loss. It was this one. And this was because he didn't follow mechanical rules. That's that. That's that. But I don't know everyone. There's also a guy but you only post wins Ivan post losses but what do you mean it's minus five minus like no well if you have if mechanical rules your losses are just boring they're boring no one wants to see them so guys that's that go to boom.com to watch the mechanical rules and let's go to Q&A questions answers debates discussions uh let's go what do you buy I mean Bitcoin you can buy listen if something happens to any exchange let's let's go away from Binance specifically but if something happens to some significant ificant exchange you buy bitcoin I mean you can also buy majority some some olds but the strategy is the same I wouldn't say that it's you know moves the strategy it it's just that when you are at significant levels for bitcoin 200 moving average is a sign significant level and then you have some you know black swan some exchange collapse it's just more confidence you can be more balsy maybe for example you can deploy a bit faster instead of waiting with many trenches deploying slow you can deploy a bit faster lading faster for example Ivan no monthly bounce is pretty crazy but I will wait for papa and no one owes us a bounce guys no one owes us a bounce it doesn't have to happen I mean at some point it's going to happen but when people count you know we had this many months without a bounce and then they say but so this month it means it means that there must be a bounce I mean not necessarily at some point there's going to be a bounce but not necessarily but let me actually see do we how many monthly candles we have that are red. Yeah. Yeah, there are many. So, we have one, two, three, four, five, five monthly candles that are red. Uh, even last bare market didn't have. I mean, you see the weakness in this market. I mean, you see the weakness in this market. Oh, guys, I'm so sorry. I remember some guys were hoping for bull money line to hold, bull trend. People are saying, but I look at the monthly. We're still, guys, listen. Weekly is the best signal. Monthly is a bit too late. If weekly has flipped bearish, likely monthly is also going to flip. Just going to get a later signal. that that's how it works for Bitcoin. That's why on Bitcoin, I don't use monthly money line too much. I use weekly. It all depends which assets it is, but w with Bitcoin and with uh uh with all of the different big uh big coins, it's it's weekly. I went, why are you late? No, the question to you, why are you late? Because I was here this morning. You missed it. You missed the stream. You don't even understand that we do two streams today. Okay? You don't even understand the effort and the dedication we have to this community. See this is how I expand your horizon. Both when it comes to education on booming.coms you actually understand what trading is. You can long you can short. You always have boring losses. That's what I wish to everyone. Always have boring loss. It's captured very quickly by stop loss with the mechanical rules. But also I expand your your horizons of how much content we can do in a day. Okay. So you're welcome. You're welcome. We do morning, we do evening, whenever there is something we do you guys. And now we have full bearer. I mean we have bear. We have bear. He is full bearer each and every day. Exactly. Exactly. [snorts] I mean give us some guys. I mean unfortunately I cannot play classical music because I played it last time and you know classical music it gets content I did for stuff that uh uh there was some song YouTube basically demonetized that video because there was another song which was copyrighted that used inside of it and YouTube AI they're not too smart they say that I use that you know copyrighted song which used a portion of Shaikovski. Then I did a bit of research. Apparently for classical music, YouTube is very bad. Uh that I mean it should be classical music is in public domain. U if you want to be more exact the the music like the notes the actual song is but the the playback of it may not be. But even if you have a playback a orchestra that is in the public domain that did the song that you know bam bam bam violin violin play the song still it can get content matched because AI in YouTube is not great. So yeah that's a problem. That's a big problem. If you if someone from YouTube is watching it please fix classical music content ID because it gets matched uh aggressively. I would say it got matched aggressively against some random song that used the that used Yeah. Chaikovski. If you could only pick one entry for next cycle, would it be 30? Solana 30 or EA 20. Solana 30, guys. Not no brainer. Solana 30. Sulana is not going anywhere. It's not going anywhere. Uh I wouldn't do like ADA or or like XRP because I'm I'm not a user. So I don't have the conviction that they're going to stay. And guys, I don't have any Solana now. So again, I'm not trying to shield you Solana. Do what you want, but because you ask me a question, I I answer it. So, uh, I don't know if AD is going to be long-term in crypto, guys. I don't know. It's a ghost chain. I don't know many people that use it. XRP, I I don't know, guys. I don't know anyone that uses XRP. I just have, uh, I know some people that hold it on exchange. With Sana, I myself use it almost every day on chain and I know many people that that use it. So, I know for sure it's not going to go anywhere. So, Sena is not gonna go anywhere. Very important. It's not gonna go anywhere. which means that if you can buy it at 30 versus ETH at a,000 is just better riskreward from the growth perspective. So that's so that's it. That's the only thing and and guys I don't want to you know get into into the debate Sana versus you ask me a question I answer it. I I don't want to debate know which one is better. Yeah, I answer it. I I don't want to debate it. I don't we we debated for so so long. Uh we've been fully correct by the way. I I just posted a video how uh we've been exactly correct. [laughter] I mean, we said this morning. We said this morning. Go and read this tweet uh about um from this morning. Uh since 2023, my mission has been to save ETH from the L2 industrial complex. Let me play you a bit in the beginning. This is from this morning. I'm not bullish on this crap because when you have a wallet that looks like this, this is what I said in 2024. I said this in 2024 to the founder of of unis swap when he launched his wallet. He was so excited for the wallet. I said, \"Listen, it looks horrible. It looks like dog shit.\" [laughter] Okay. Okay. Anyway, you can you can go and rewatch from this morning. But we said that L2s are not going to work out is exactly what happened. So anyway, that's the that's the answer. And uh I don't have any Solana, so I don't care what you do if you buy Solana or not right now. It doesn't affect me in any way. you don't add buy pressure to my bags at all. So that's it. That's it. Ian, can you talk a bit about Cloudbot and what's actually going on with AI? Uh yeah, I mean Cloudbot is I I feel the hype has died out died down a bit, but it's a wrapper around cloud. And if guys, if you don't use AI now, you're falling behind. So cloud is an AI like chat GPT, but uh more of a paid version more for corporate. And um Cloudbot was a third-party wrapper around it. So it can do like automated tasks. You can kind of be you know your employee basically. Uh many many security problems with it and uh I feel the hype has down a bit now. There have been this all of this posts on social media that they create their own social network. I think that many of these posts on this mold book are fake. Uh but uh CL you you should use cloud and uh you you don't necessarily have to like use all these third party tools like cloud bot because it's not done by anthropic the I I would say you can even ignore it mainly all these third party ones why because for most people it's just a security problem it's just security problem where some you know third party code has access to everything and then AI can go nuts there so for most people I would just say use claude download the clawed app, it has CL clawed code in it, it has claude work in it. So already is there you have most of it. And now they added a a new thing which kind of dumped the stock market where they uh let's actually see what they added. They added they added that it now can work with Slack. So you can uh yeah, you can like compose messages and everything and everything and coordinate your Slack team. So that was done just yesterday. So my my my point is that they are adding all of these things into into cloud natively and properly and without all of this like security issues. So for most people I think that's best. If you just use all of the latest cloud stuff you are already on the bleing edge. You don't have to feel that you're missing out on anything. You're already you're already on the bleing edge. So for most people I think that's the best. That's the best. But obviously if you're a geek you're interested you can try it. And the problem is that you know you try something and then the hype dies and like everyone moves on. So cloudbot is kind of like that. So let's watch this. They just added this like yesterday and this tanked the stock market because everyone is saying that now you can use cloud for so many new things. Uh look at this. [music] So let's see. Draft a message summarizing an incident in Slack. Oh guys, again with the song I cannot play. I don't know if it's copyright or not, but hopefully not. But yeah, then it summarizes the the incident and post in Slack. Yeah. What else they did? So this was 20 hours ago hours ago. I also read they have a new Exactly. They have plugins here in in work and uh that also tanked Exactly. Here we're open 11 plugins for sales. See, try this. I would say try this. This tang the stock market also a bit because now finance, legal, data marketing support and more plugins have been open sourced which means that you don't necessarily need to pay a bunch of subscriptions for data and stuff like that. This I actually need to try myself because especially for finance like getting more financial data would be interesting. Let's see. Finance streamline finance. Yeah, this I I have to check this myself. I haven't I haven't checked it yet. To prepare accurate fixed asset entries, prepaid payroll. Yeah. So, go download Claude, use it, learn all of the latest stuff with it. Don't worry too much about like this other hype stuff that is happening. That's the practical the practicalities of it. Um, do you follow what's going on in I don't follow dig uh I mean your opinion on holding stables on Slana during the drop to $30 safe or not safe? I would say it is as safe as it could be with stable coins because uh tether is natively issued on Solana. So let me actually double check that. So USDT natively issued. So basically Tether is responsible for the coins. Okay. Yeah. So USDT tether is issuing native coins on Solana meaning that it's not a bridge. The problem is if you use some kind of weirdass chain that doesn't have native Tether support where Tether, the company, issues the coins on that chain and you have some bridge. Palchain is a great example. It's a a bit of a fugazi chain, they don't have native support for any stable coin. So when you have stable coin on pal chain, it's a bridged one. So if anything happens to the bridge, anything happens to the chain, fenito, you're fenito. Let's say something happens to Solana or whatever. Still Tether is liable for all of these different coins in circulation. So, and they still have all of the dollars in the bank account outside of the chain. Okay. Big shout out to Pulse because I see people I'm discussing some pulse crap. [laughter] But but but that's one example. That's one. And by the way, Cardano is the same. ADA does not have native USDT, for example. I hear they have some kind of, you know, they're going to celebrate their first stable coin. Which one guys? Which one is this? It's not one of the big some small one they found. So yes, on Sana on Solana I would say it is as safe as it gets with USDT and also let me check USDC. I believe USDC is also native on Solana. Yes. Yes. Yes. Yes. Yes. Yes. So USDC and USDT are native on Solana which means that I mean let's say worst case Sana something happens all of the Solana fad is true is centralized. they just take everything they run away or I mean or whatever fugazi uh still tether has the banking in uh the dollars in the bank so they they they have all the assets and the funds backing the coins anyway and this is versus a a chain that does not have native stable coin you have to bridge something happens to the bridge the coins on your chain they they don't matter like no one cares about them the real tethers are stuck in the bridge or they're stolen or what they are tether only cares about them like the real native tethers then how you bridged it, how you got it to your to your poo poo chain, no one cares. No one cares. You have some token, it says stable coin, it can go to zero. No one cares. Okay. [laughter] No one cares. So that's that. Um, exactly. guys like ignoring hundreds of pulsing. What what do you want me to say? I just I just mentioned pulsion in a great education example like we we need to be educ educator how say pedagogical we need to be like pedagogue do you say that in English educator do you say pedag pedagogue in uh in English do you say like that so we use it in the in its proper context I don't want to take it out of context you guys use it out of context as a you know you you assign properties to it that don't exist I use it in the proper context okay so I think I think we I think We we fairly fairly fairly addressed it. [laughter] Bish out to all of the posy guns. Why are there no uh native stable coins on P? Because no one wants to touch it with a 500 mile yard stick. Okay. No one wants to touch it. Uh no one wants to touch it. No one wants to come close to it or have anything to do with it. [laughter] Okay. That's why uh Ian do you only use the main line for signals or also other indicators? Well, I mean there are a few others like for example when you see some of them is just uh experience for example a fake alltime high that was the first signal when Bitcoin did a fake alltime high in October for us. uh then it was daily uh money line and then uh moving average very important uh 50week moving average 200 week and then when you break a horizontal structure I mean the after the money line the most important thing like in you know traditional TA it's actually the simple horizontal lines I avoid I avoid the sloping lines uh because you can always just move them a bit and everything changes but horizontal lines and horizontal levels um are super good I mean you See here, for example, we used it here. Bam. It broke. Fantastic. Big acceleration, big flash. What did I tell you guys? Once this uh uh range here breaks, it flashes fast. And that's exactly what happened. So, this was horizontal uh lines. And isn't it crazy that just a few weeks ago, Bitcoin was at 93. Uh but yeah, things happen fast. Once you break down, you break down very fast. Very, very fast. What is a fake alltime high? I mean, it's here. Here. We went to alltime high and then instantly collapsed. So, this is what I call, you know, fake alltime high, you know. I mean, it is an alltime high, but it's not it's not real. Like, we were here for a second and boop down. It's very similar to what happened uh here. Here, boop down. Fake alltime high. Technically, alltime high, but uh it's for a second and then boop down. That's why I'm telling you guys to be a bit careful with the stocks because um I mean, you never know, you know. Oh, by the way, by the way, where is this? This year is by the way here you see in S&P fake alltime high boop down. This was in 2022. Um man it happens quite often. You see here fake alltime high in 2025. You see fake alltime high. This was alltime high but it was fake and then boop down. So just in stocks I just gave you like another example here. Fake alltime high. Boop. three examples on the on the stock chart and now and now we also had one but the thing is you don't want that front run like pleum high it's it's not like you know we sold everything in October it was the first signal to get a bit like shake you know we got we got a bit shake we started to derisk when it when it happened but you don't want to like you know just sell everything because maybe just continues to upside there are many examples also where you have alltime high then a bit of pullback and then then continue so but it it is a is the first signal to be a bit shaky to be a bit you know a bit neurotic slightly neurotic [laughter] when you see a bag I have to be a bit you know a bit careful doesn't mean sell everything short 100x no no but it's the first you know it's a everything is a range only noobs go all in and all out only noobs you know click a button then they invest everything or sell everything if you are professional you it's a spectrum for you more allocation less risk on risk off so [snorts] payi is normally the bum bum is is is it's time to to shake to shake the leaf. I mean does that mean you you deploy 10% around that area 60k? Yeah, I would be starting let's see I I would be starting with probably 10% as the first trunch and then see where uh where the market takes us. I mean we could go below 200 week also. So yeah 10% is probably good. Once we get closer, I'll make a proper plan. How much we put, where, this, and that. But yeah, we still need maybe I mean, it can, guys, it can go quite fast. It can go very f, you know. I mean, look at the percent. We just need like 15%. Actually, yeah, we need like 15% to get into the buy zone. We're almost there, guys. Almost there. Almost there. I mean, it's going faster than I thought. Well, what did I tell you guys? I mean, again, people sometimes they they debate with me. They try to like prove me wrong. Why? Not because I think they also themselves know that uh they're wrong but just their portfolio is that something they don't want things to happen so they fight reality they argue with me I've been saying that is going to be quite fast if we break so yeah just a side note I I just it blows my mind the confidence with which people debate sometimes someone like me but also other people who have been trading for a long time and uh it's interesting but uh yeah you yeah I also understand that they in many cases they just don't want to hear what the truth what's going to happen and for them it's just easier to you know close eyes close the eyes okay um let's see so but what was your question what's your question uh what will be the next FTX mode maybe micro strategy selling yeah we don't know yet I have no clue I have no clue what's going to be the next FTX maybe some exchange collapse we don't need also we don't need any you know next FTX we don't need it we can just go to 200 week moving average for Bitcoin and buy there it's just that if something happens it would be like you know the cherry on top the full bingo card bare market go to 200 week something collapses it will be like the full set how do I royal flush how saying in cars all of you gamblers with the cars I don't even know like poker like the cars I don't know [laughter] I have enough gambling in crypto what say royal flush full flashful uh full full house or how you say so uh you still buy a 200 week anyway so here on micro strategy Uh yeah, it looks very bad. By the way, 200 week only applies to Bitcoin. For micro strategy, it's it can go easily way way below go 50% below. So it's bleed bleed bleed. It's in a bare trend. Yeah, I wouldn't touch it. I this one I would only touch in the next bull trend, but also you can buy Bitcoin. And if you want more more volatility, you can buy Bitcoin with leverage on Pionex or on buy bit. So I don't even see any reason to buy Micro Strategy. I mean honestly guys what's was the reason if you want to make more money than Bitcoin offers go to exchanges I use in the description bull.com/partners you can go here to again pionex offers long short with leverage buy bit you have big fat signup bonus on all of them bitunix weeks all of them all of them so what's the point of micro strategy I don't know guys I don't know is it's you need to you need to trust sailor I don't know what else is happening is in his head he issues he changes what micro strategy is by iss issuing new debt instruments, strike, strife. Like I don't I don't follow I I don't know what's happening. It's too complex. I don't know the risk. I don't have understanding of everything, all the risk. So I don't know. It's not for me. I'm not touching it. Like USDT is not touching pal with a 500 foot pole. I'm not touching micro strategy with a 100 500,000 foot pole. Okay, that's it. That's it. Even James is no longer buying my strategy. He took options on IB. Okay, there you go. There you go. Do you think the recent gold silver correction will affect crypto prices in the long term? Both metals are behaving extremely volatile, more into some high some high crypto. Uh if it if they go down, I think it's going to pull Bitcoin down. Uh yes, if they go down now, they're kind of uh like an kind of like you said, like an old coin. The volatility in them is crazy. But for me, this is the end of my journey with gold and silver. Uh I'm I'm keeping DCAing out in from them. I I should be done this week. And yeah, we're we're we're going to new pastures, guys. We're going to new pastures. Uh although technically still in bull trend on the daily it looks very bad. So I mean it's a big enough signal for me. If they continue to the upside, I'm fine. I'm fine. We've had great rides. I mean we have great rides. Uh so I'm fine. [clears throat] So we're kind of sailing away from that opportunity. We're thanking the market, thanking the the bitter shifts of the world for that opportunity, for the bull trend and uh yeah, there there are new bull trends, new new chapters in life. So that's that. So I'm tracking it a bit less, but yeah, if it keeps going down, likely it's going to pull crypto also with it. Baba Vanga, yes, [laughter] this time around. Yes, this time around. But thanks for appreciate. I mean I should have listened to now I'm bag holding soul should I bag hold to 30 man it's very tough to answer that because number one when it comes to 30 I don't know if it's going to go to 30 I don't know it could go to 45 maybe it's just just a target just a target and from a risk perspective it will be interesting to buy but I don't know if for sure it's going to go to 30 so you know to tell you to sell now wait for 30 maybe it will never come it's just not a great place to uh to be in currently I mean the way it is um and Um yeah I mean there there no easy answers. The correct answer like the professional answer is to ladder out into things that are uh in a bull trend but there are there are few fewer things now. So just you know the correct answer would be to ladder out a bit uh and wait for good opportunities u and see what's what's going to happen. You don't have to sell everything but you know just so you release the the mental pressure a bit. Um we discussed it a lot in bulmia.com. Go and check the free video there. And um yeah the alo there are no good answers. Uh the best way would be to uh transition into bull assets. Sometimes there are just no bull assets like now there are very few and and from that perspective just having a bit of cash ready to be deployed is good. Of course like listen nothing is a guarantee. The worst case scenario is that you start lading out and it moves to $10,000 and uh that's it. It can [laughter] happen but that's why you ladder. You take it one step at a time. In most cases what happens when an asset is bearish you start lathering out it goes down more now like it feels good you know now you know the sunshine returns into your life you know now you did something smart for the first time maybe in months okay that's what happens with with most things [snorts] so yeah there are no good answers but um could be something like that um if you really believe see with salana with salana I think it's gonna come back uh because I use it every day and yeah So I don't see it disappearing. So just hodddling down could work also. But uh personally what I would be doing is to make a plan maybe 10 trenches take one trench out. Nothing's going to change because of that is going to release some mental pressure. Uh and then you can figure out later on if you if you keep withdrawing or yeah what you do. Inflation is way too high on soul. Yeah. That's why you stake. So when you stake it's not a problem because inflation goes to stakers. So you can stake. If you don't stake, you are in a bad position. I support Ivan for being honest, telling the truth, and willing to help. That's a real man. Thank you very much, baby. Thousandx. Fantastic. That's a good review. That That's the kind of review I appreciate, guys. Thank Thank you very much. Thank you very much. It's true. It's true. And uh I appreciate the kind words. I mean, aren't you tired of win [laughter] tired? You guys going to be tired of winning? Yeah. Uh, I actually have a sadly It's also with a song. I had a tweet on this with, you know, tired of winning. Where is it? Let me find it. This, you know, Trump first day in office. Trump uh Yeah. Yeah. Here. Here. You know this movie about the first world war. I mean, in general, history is very interesting. This is, you know, are tired. First day of Trump. First day of Trump. [laughter] Are you guys tired of winning and now where we are now with Trump? [laughter] Yeah. Uh, exactly. That's where we're now. No close of the CME. So, not now. Not now. It can close later on still. I mean, at some point it will close, but doesn't necessarily have to be now. Guys, listen. Let's wrap it up. We are at 46. We're going to be back tomorrow morning. Let's see what's going to happen. Thanks all for being here. Smash the like. Subscribe to the channel. Enjoy your Wednesday and um yeah, see you tomorrow morning tomorrow morning. Go to booming.com for mechanical rules. Booming.com/partners for for exchanges by bid bit ununics weeks big fat signup bonus just how you like it and you support the channel and we have more motivation to do this every day and that's winwin win-win exactly how we like it. Guys, goodbye. Have a good day. Thanks a lot. I appreciate you. Bye-bye."
    },
    {
        "video_id": "Xi5hf2waVkk",
        "title": "EU censorship exposed. France raids X (Twitter) office #shorts",
        "published_at": "2026-02-04T17:24:36Z",
        "sort_date": "2026-02-04",
        "url": "https://www.youtube.com/watch?v=Xi5hf2waVkk",
        "transcript": "France is now raiding ex office. They're raising the the offices of the ex you know Twitter of Twitter. Also there is more and more light being shed on EU censorship. So Pablo Durov is saying the US Congress has exposed the EU commission for censoring political opponents for over a decade and interfering in at least eight elections across six European countries. This is consistent with the French government's attempt to force Telegram to censor speech in two of those count. You look at all of the uh uh things that have been hidden when it comes to migration, when it comes to crime that was was fully censored before the mainstream media didn't tell you anything. And after Twitter bought uh bought Twitter, now everything is open."
    },
    {
        "video_id": "05YuhDNMumo",
        "title": "Vitalik declares L2s dead: ETH bullish news #shorts",
        "published_at": "2026-02-04T15:30:39Z",
        "sort_date": "2026-02-04",
        "url": "https://www.youtube.com/watch?v=05YuhDNMumo",
        "transcript": "Vitalik has come out basically declared L2's dead. This is massive and also very bullish ETH. This is fantastic to see because this is something that I've been fighting for for over two years to get ETH to focus on L1 and stop doing all of this retardio L2s, all of this moronic L2s that just steal users, they steal the fees, they fragment everything. So, Vitalik did this long long blog post, but basically what he said is that listen, many L2s they are parasitic. They don't actually help L1. They're just a copy of L1. And um and many of them are also super centralized."
    },
    {
        "video_id": "md6nK4g8c4U",
        "title": "BITCOIN AND ETH: TRYING TO BOUNCE!!!!! 🚨🚨🚨 (Vitalik kills L2s)",
        "published_at": "2026-02-04T09:47:38Z",
        "sort_date": "2026-02-04",
        "url": "https://www.youtube.com/watch?v=md6nK4g8c4U",
        "transcript": "episode. And as you can see right now, Bitcoin is trying to bounce. We do have quite a nice bounce from this area right here, the previous yearly low. But I also got to tell you that yesterday we did poke below it. And this is not too good of a sign. The good thing is that the bulls did step in. The bulls did pump us above it. But guys, if we break this support, if this support will be broken, we'll be teleporting quite quickly to the 200E moving average. and Bitcoin would basically be losing its last last important support before our big beautiful buy zone. And in many cases, if you've been watching the channel, you know that buying at around 200 week is the best possible riskreward. So, I'm not against us breaking support. In fact, it will be fantastic for us to go to a 200 week, load up the bags and uh prepare for the next big cycle which will happen later this year and to especially towards the beginning of next year because now we are repeating 2022. Uh it is the midterm year. The similarity is exact. [laughter] It's really crazy how similar it is to 2022 and other midterm years. We are now in the green year right here. When you look at year-to- date performance, you look at the average year-to- date performance of the midterm years. But the next year, 2027 is going to be kind of like 2023. And when you look at what happened in 2023, it's up only. And that's exactly exactly exactly why personally I would be super excited if we break below. If we don't break below, we're just going to we're just going to be derping around here. We we're just going to maybe we're going to go back here and then here and then break it. If we don't break it now, maybe we, you know, go back in the range, come back from the range. It's just going to be prolonged. It's just going to be prolonged. For the bulls, it's also better that we just smash to 200 weeks so we can recover from there and and build. Uh so for bears is good, for bulls is good, for for me is good, for you, for everyone is good, for everyone. So keep an eye on that. But guys, the big news today, the big news today is the Vitalic news. Vitalic has come out, basically declared L2's dead. This is massive and also very bullish ETH. This is fantastic to see because this is something that I've been fighting for for over two years to get ETH to focus on L1 and stop doing all of this retardio L2s, all of this moronic L2s that just steal users. They steal the fees. They fragment everything. I mean, this is what I said here as well a few minutes before the stream. No more L2 stealing users. No more L2 stealing liquidity. No more L2s stealing fees. So, Vitalik did this long long blog post, but basically what he said is that listen, many L2s, they are parasitic. They don't actually help L1. They're just a copy of L1. And um and many of them are also super centralized. This is a big problem. many of them are super super mega centralized and they don't help anything. So all in all ETH should focus on uh L1 and if you want to do L2 it should have a specific use case not just a copy pasta of the L1 basically the same I mean look at optimins look at arbitrum look at any of these L2s they are parasitic because they do exactly what L1 is doing but they take all the fees they take all the users and it becomes fragmented because none of them has critical mass instead you have this monstrosities this is what I want to show you because this is close to my heart because I am an ETH believer from the beginning. Then when L2s be became so big in the L2 in the ETH discussions and in ETH focus was all on L2, I had to leave ETH. I have to basically say, listen, I'm not bullish on this crap because when you have a wallet that looks like this, this is what I said in 2024. I said this in 2024 to the founder of of Uniswap when he launched his wallet. He was so excited for the wallet. I said, \"Listen, it looks horrible. It looks like dog [ __ ] [laughter] I KNOW IT LOOKS LIKE DOGS. Looks insane. How can you have ETH on this, ETH on that? E, E, E, E, E. How do you expect the normie use this dog [ __ ] [laughter] Sorry for the French, but it is dog [ __ ] And I cannot be bullish on an asset that I was bullish on before if the devs make dumb decisions. I mean, really moronic. I'm telling you that as a computer scientist. I'm telling you that Assanound who's been in software basically all my life. I worked as a full-time dev before going all in crypto. I've been I know all about software. So when you look at this, this is very very bad. But of course, it took it took so long. You know, he was trying to say we're working on the UX blah blah blah. I mean, listen, it's horrible. It's horrible. And then also you have the ETH marketing was for the longest time, you know, this uh cheerleading flash mob or something. You know they do all of these chains with retweeting each other. In ETH if we trust in ETH we trust. This was in 2025. I told this and the flash mode will not this flash mode will not fix ETH. This I told get Ethereum valation to scale L1. Compete with Sana for real. Stop this childhood. Stop this childhood fanatic, you know. Yeah, we're ETH. We're ETH. We're ETH. We're ETH. Vitalic. He was posting you know some philosophy crap. I told him less philosophy more build scale L1. This was when this was in 2024. So you understand how excited I am now because this is very close to my heart. This guys this guy was saying you know Ethereum rollups 101. I said let's scale L1. Too many L2s and different L2 types just scale L1. I have hundreds of these cases. I also tried to highlight when others were saying that L2s are for guys. This was from March 2025 approximately a year ago. You even had Wall Street saying that B and other L2s removed 50 billion of market cap from ETH. But obviously no one wanted to listen. In fact, people called me Solana shield. People said that I have Sana bags. That's why I faded. They're beautiful, beautiful, beautiful L2. And uh you understand that if you don't focus on the fundamentals, they will catch up with you. If you focus on crap tech because you have a mantra, you have high priest podcasters that have big allocation in L2 and they keep telling you the same thing. Oh, L2, L2, L2, L2, L2, L2. It's going to catch up with you. Now, um, ETH lost basically five years of progress by focusing resources, capital into this garbage. And, um, they can still compete. O, they can still come back, but you know, it's five years lost. Five years lost. Okay. Very, very important to realize. So, I'm bullish ETH now. I mean, but now it's actually good for for ETH. This is exactly what you want to see. Uh, if you are ETH bull, you have to let go of this craziness. And this is totally from from Solana. Remember all of the L3s and aggregation layers and based rollups and rollups as a service and every corporation was going to have their own roll up instead of just using the stupid tokens of the stupid blockchain. Thank you for coming. Exactly. You remember? I remember. I remember. Absolutely. And listen, from the beginning, L2 actually made sense. I mean the the early early early L2s I was bullish on them because from the beginning they were use case specific when you had the plasma L2 this was way I mean this was before the the official L2 definition even was existing you remember back in the day in 2017 there was this plasma project they tried to make payments on top of ETH faster I mean that made sense because it doesn't compete with ETH then it became so [ __ ] where basically you had a copype copy paste copy paste copy paste copy paste you have one ETH here another ETH here. They do the same thing. You have the same ETH there and here and here, but this one is centralized on in the wallet. You have crazy ugly wallets like I just showed you. So guys, uh I'm very excited, guys. I mean, for ETH, if they now finally use their brain and not just this uh collective collect collective uh trance that they've been in that they repeat the same garbage in in and out, they have a few people that set the tone and if you tell against them, you're going to be out of the job. That's why only we on this channel and a few others channels have been telling you the truth all along because we don't care whether we lose sponsorship or lose allocation in an L2. Well, if you are an ETH specific podcaster, you cannot monetize in any other way than to have the L2 industrial complex as it's called. I coined the term also L2 industrial complex. Uh they're the only ones that can fund you. Without them, you have no income. You have no food basically. >> [laughter] >> Okay, so they've not been telling you that. Instead, they have been as attacking everyone else. They've been attacking Suland. They've been attacking everyone else. Actually asked speaking about the L2 industrial complex. Last year, I also asked Vitalic, what do you think of the L2 industrial complex? He he posted this, you know, if you're scaling all of this, you know, L2 foris at this point. He still didn't change his mind. I was trying to explain to listen you have a L2 uh industrial complex going on here. I I I asked him, listen, what do you think about now? Sadly, he did not reply. If he was the reason what I wrote him, he would save what is it? A a year, not a half a year here [laughter] of of progress. So, everything is possible to catch up. I mean, ETH, I'm very bullish. ETH if they scale L1, there are a few things they still have to do which they're not doing too well. For example, there is no connection between Vitalic and big projects on on ETH, which is very bad because you build software for your customers for users who are the big biggest user DeFi applications. Uh this news for the founder of unis swap was a big surprise. He didn't know about it that Vitalik would uh basically discard all of the L2s. So he's like, \"Oh, okay. So ETH is going to focus on L1 and it's about defy on the L1 request number one. Please, please, please increase the code.\" So he has a bunch of requests. Vitalik should have spoken to him. Should have coordinated with the builders on the chain he is doing. And by the way, some people I'm not saying I'm I'm the only one who's been calling. There is some guy I mean this guy is saying that he's been calling for six plus months. I've been calling for six plus years. Not really. Maybe three two three years that I' been speaking about L2. But this is another way of putting it. Listen to this. >> Here your most controversial take. The thing you shouldn't say >> this will get me cancelled. But I think general purpose L2s with not without a specific industry thesis are in fact parasitic to L1. >> Justin's a hot one. >> Look at how nervous they become because he just swore. He just how do you say swear in the church? He just swore in the church. He said a swear word in the church of Eith. This was be I mean look at them. Look look look at them. They're like look at them. Look at them. Look look at all of these dudes. They're like what should they're like uncomfortable. They're uncomfortable. They don't know should I should they attack him? So, Vitalic loves me and if L2 podcast complex likes me, what what should I do? Look, look at that. Look at that. >> Are in fact parasitic to L1. >> Justin like look at what he said this crazy thing. What should I do? >> Go a bit deeper. Ash says, >> so what is the history of this right? What is the scaling history of this? So, the idea was look, we do these L2s and they will scale Ethereum and what ended up happening was uh that L2 stack got sort of productized, right? So you have this this sort of RAS type model where anybody can launch a rollup and so then you now you have a bunch of these rollups. Then after IP 4844 batch submission costs went way down. So what exactly are these rollups doing that are occurring valid one? Yeah, it's very handwavy, right? Where is the value cruel? Post protoank charting the value cruel from posting blobs is dimminimous, right? So that's problem one. Then problem two is why do you need all these roses are the same, right? They're all general purpose. They all want to do DeFi. they all want to do NFTs, something payments, AI, something other things, and they're all trying to do the same thing, and there's no focus, right? And there's no sort of unique product iteration loop that's happening that's focused on a particular thesis. It's just the same idea again and again. And so, of course, you're fragmenting the user base like that, right? And I think the future needs to get away from this. The future is you need roll-ups that are highly highly focused on specific use cases, specific industries that are deeply deeply confident in them that just wake up all day. For us, we wake up, we think about stable coins. We go to lunch, we think about stable coins. We're in the bathroom, we're thinking about stable coins. At night, I'm thinking about stable coins. Right. >> Yeah. I mean, he's really correct there. There is place for a specific type of L2, which is super super mega focused on a specific use case that the general L1 simply cannot meet. I'm fully in agreement there. That's how L2s actually started before they all start to just copy ETH and was another version of ETH without any specialtity, without any kind of use case really except, you know, cheaper fee. But uh that's it basically. So and you can get cheap fee on L1 also if you scale it. Look at Solana. Look at everyone like everyone has cheap fee now. There are very very few chains that have high fee. Many main chains have cheap fee. Like the cheap fee problem is solved. It's solved. You you don't have to have expensive. You can have cheap fee. It's solved. It's solved bro. Okay? You know you don't you don't need to funnel money to all of the L2s. So guys in summary uh this is actually good for L L2. Believe it. uh sorry for for ETH for L1 for ETH price also because the amount of capital that has been siphoned into all of the L2s is crazy like it's insane it's insane obviously they don't pay anything back to ETH the the blob like the guy just said you know the blob um the blob uh contribution is very small which is the fee they pay to settle on L1 look here polygon this POS they had 300k K revenue I guess in like in daily revenue or how long the time frame is paid to L1 $196. And you remember a few uh months ago I was showing you I mean in I remember clearly last year during the summer we were looking at this website where you see all of this you see the financial statements of the different L L2s and how much they paid to L1 and we saw already there it was like a few cents confirm in the chat that you remember but now you know this guy post the same thing. This ch base chain made 1.2 2 million paid 1K to L1. I mean, it's ridiculous. I mean, it's ridiculous. Lineia made the 6.4K, paid $19. [laughter] So, they don't contribute, guys. They don't contribute. So, all in all, good, good, good. Uh, for ETH, I think it's going to be great. Everything on L1, let's use L1 for as much as possible and L2 only for some specific specific stuff. But guys, welcome everyone who's watching live. We have a lot to discuss today. A lot to discuss. Big shout out to Dab who is time stamping us today. Uh smash the like, subscribe to the channel if you haven't yet. And also we have some new uh new updates from our community. Passive with another win. Uh basically shorting the crap out of XRP. XRP short is a big fat goose golden goose that is giving golden egg every every day. If you want to join Bulmania, learn the mechanical rules. You actually know how to do this because most people they don't know how to short. They go all in, they get wrecked, they do use too high leverage. Instead, go to bullman.com, learn, watch the free training. You can use the link below. So, you actually have a nice strategy, a nice step-by-step way of longing, of shorting, of taking position in the market. Now, this guys, this guy Don Banini just paused as well. He said, \"I don't usually post because I don't like to brag, but I managed to nail the top of the 4hour range so so hard, I can't help it.\" and he made fantastic 36% in 30 minutes using the mechanical rules uh ensuring that he has good stop-loss and the good takeprofit strategy. Then you have this guy you see this leaf means that he just joined. So pool cleaner just joined [laughter] just joined Bulmania. The leaf means that he is very very new but obviously now he has fantastic fantastic results as you can see right here. Uh shorting Bitcoin in this case and also shorting Sana as well. So again, you don't really have to wait for Bitcoin to hit 200E moving average before you start making gains. You can short it, you can long it, you can trade on smaller time frames. You don't have to make, you know, big generational bets because currently the time is not for that. The time now is to trade what the market gives us, which is volatility mainly to the downside for all coins, sometimes to the upside, and then do the generational entry at super good levels, such as the 200WE moving average for Bitcoin, such as $30 for Solana, such as 1K for ETH. We're going to be discussing more about that. Uh then also Supreme Governor is back with another with another trade. This time long. This time he longed the crap out of Bitcoin plus 67%. High leverage. But it makes sense if you know the mechanical rules if you can have nice stop loss. And then another one he did. Oh yeah. First he did the short. Exactly. Yesterday he did the short. He shorted the crap. Then he did the long. Okay. First he did the short and then long on the bounce. See this is how you trade them shorter time frames. You can do it in both directions. So this is the power of Bullmania. Go to bullmania.com, sign up, watch the free training, okay? Like we always say right here in the comments, booming.com. Bum bum. Watch the free training. And to get access to all of the exchanges, you click this link. Exchanges I use booming.com/partners, you have all of them. Buy bit, bit unix, wigs, all of them have big fat signs. That's exactly exactly how we love it. Now guys, moving on. Moving on. As I told you, we have some significant targets here. We have some significant targets. If Bitcoin breaks down from the support that I showed you in the beginning of the show, which we are at right now, Soul is going to go towards 30. [laughter] Okay, just [clears throat] as a reminder, if Bitcoin breaks down, they will start coming to Papa. The small altcoins, the smaller altcoins, well, I mean, they're big, but in comparison to to to Bitcoin, they're they're small. the smaller altcoins sold if they're going to come to papa. Well, they're big altcoins but in comparison small. So if it happens guys, you should you should uh keep it in I mean keep it in mind [laughter] because when we go to 30 people going to say we're going to go to 10. They're going to get too greedy. Don't get too greed. 30 is great. E we're going to go to 1K and the people going to say we're going to go to 500. But in reality 1K is going to be great great buying opportunity. Again, it's just basing on the fact that ETH wants to go to the range low here at approximately 1K. Okay, super simple. I mean, nothing nothing too complex. And Saul also super simple analysis. You see that they have a support here, but that's like the last support before 30. Okay, that's the So, if Bitcoin breaks down, Soul breaks down, we're coming, I mean, we're going to get magnetized, magnetized, magnet. Then, of course, you can buy a bit before you could buy at 40 already, start lading in a bit, but the big big target is around 30. It doesn't mean you have to wait for 30.0000. 000000. You can you can start buying a bit before if you want. But in general, this is the area of interest. The mag magnetism magnetism is right here at 30. Then uh let's look at XRP. I mean XRP it's again from for for the shorters. It's also a very very nice goose here. If it keeps breaking now it's kind of retesting the breakdown area. Let me actually test do this. Now it's kind of retesting it. Guys, if this gives gives in, if this support really gives in or so, I mean, you can either do do like this or you can do like this. You can you can measure the wicks or you can measure without wicks. If you measure without wicks, then it's already confirmed. It it really depends on your on your strategy as long as you're consistent with it. Some uh traders that measure the actual weeks, then for them, the breakdown is just starting. If you want to be a bit more risk, you can measure from the bodies, then it's already started. It's already started. uh either this or that both are valid if you have your own if you have a strategy to follow. You have your own way to be consistent with it. It's just uh two things of the same of the same coin, two sides of the same coin. Uh this one is a bit more risky without the wigs. This one is that you you wait for more confirmation basically. So for if you do the less risky trade is basically just starting. Uh if you do the more risky then you're already your risk has paid off already in in XRP. So that's that. Uh next we do have um hype doing a lot of stuff. Hype is breaking out. They have all kinds of updates. We're not uh really buying it now because they have unlocked also. I mean still it's bearish. So we're not buying it for long-term huddle. We're trading it. We're trading it. It isn't bull trend since a week. It's been doing quite well. Uh but in terms of marrying it now it's it's not the time. I mean you see let me actually refresh here. Since a week ago let's get the latest data. It's actually dumped now a bit. Yesterday it was up um uh 50%, now it's up uh 34% since a week ago. So uh all in all, we just see it as a short-term short-term trade for us right now. Not a long-term uh life changer. Okay, it's it's not about that. Um it will be about that when Bitcoin hits a nice uh bottom when Bitcoin uh bottoms out. Nowad is out saying that Bitcoin is not really behaving how it is supposed to. I mean, I love when this, you know, talking heads on uh the so-called uh, you know, legendary market. You see, no, his goal is to just get more capital into his uh funds. So, when he's when he speaks on television, you have to be very careful. Don't listen to what he's saying. He needs to be very careful. He can never be bearish. Why? Because he will not be able to get the money in his fund. So for him, he would rather say that, you know, we're soon going to bottom out and then we're going to fly and then your portfolio with your L2 [ __ ] or what the hell you hold it goes down 90%. That's that's what he prefers. That your portfolio goes down 90%. Because he's bullish, you listen to him and he gets more inflow into the fund. That's what he prefers. If he would say, \"Guys, now we're bearish, like we said in October on this channel. You save your portfolio, but he doesn't get inflow in his funds.\" That's bad for him. That's bad. So, you you got to use your brain. Most people don't use their brain. [snorts] Okay. Uh listen to this. >> Bitcoin was not supposed to act like this. Something went wrong. I think we're getting close to the bottom. [laughter] >> Wasn't supposed to [gasps] like it blows my mind. I He He must be smarter than this. He must be smarter than this. If he is a active market participant for decades as as he's supposed to be, I think he is just dumbing himself down a bit because when you are a trader and you say that an asset, oh it wasn't supposed to do like this. Oh, it wasn't supposed you're a bad trader. You're bad investor. If you blame the market for your losses, that's the first signal that you are very bad at trading. I don't think he's so so dumb. I don't think I think he's quite smart but uh you know to he knows who's who who he's speaking to. He needs to speak to the average plebe and the average plebe thinks that some manipulation happen manipulation manipulation. So he basically says what what what most people going to like basically >> but we'll see. >> Fresh off the conference call this morning and you said that quote pain is part of the ethos of this whole industry. [laughter] >> Unfortunately. >> Unfortunately. >> Unfortunately that's true. >> How much more pain is ahead? Listen, you never actually know where markets bottom. When Bitcoin went through 100,000, that was a major level that it broke down on. And and so, you know, when I look at the chart, 70 to 100 is probably the new range. And, you know, we're at 76. So, I think we're towards the bottom end of of the range. There's a lot of pessimism out there. Uh, a lot a lot of leverage has been taken out of the system. Um, Bitcoin was not supposed to act like this, right? You had >> Oh, yeah. Exactly. He must have removed the Luna tattoo. You remember he did the do the Luna tattoo. Teral Luna. I guess he removed it. Can you remove it? I have I have no experience with tattoos, guys. You let me know. Can you Can you remove a tattoo? It's easy or it's hard. He must have removed it now. He must have removed it. >> Gold prices higher, the NASDAQ higher, uh rates going lower. Uh this was a an Yeah, the Trump administration was very pro crypto. And so, you know, something went wrong. Um, you know, the Bitcoin the crypto market is still less than 20 years old, right? Uh, right. I think Bitcoin 09. So, we're we're 16, >> I guess. I mean, I know he's he's rambling. He's bumbling. Wasn't supposed to go like this, guys. That's why we follow the damn price. I mean, it was actually kind of like as predicted. Not to toot my own horn, but I mean guys, it's it's I I I still I think it's my responsibility, guys, to toot my own horn here because most people they they they still argue with me. They still argue with him. They still say, \"Ivan, you don't know. You don't understand. You don't understand.\" And now your leader who was telling you all of the bullish stuff, he's saying, \"Oh, it wasn't supposed to be like this.\" It wasn't supposed to be. your portfolio down 90%, man. [laughter] Oh, it wasn't supposed to be like that. Bro, that's why we don't follow news. That's why we don't follow fundamentals. We follow the price chart, man. The chart tells everything. The chart tells everything. You have great fundamentals. You buy at the wrong time, you're still going to go down 90%. Guys, we need to toot our own horn, guys. I mean, it's it is what it is. We need to save people from themselves. Save people from themselves because they have wrong understanding what the market is. Most people don't know what the market is. They have wrong understanding what investing is. And and I hear that because again people have such confidence sometimes, you know, I I tell them actually how the markets work. I tell them actually how the markets work. I have over a decade experience trading crypto and then they argue back with me like as if they have some kind of weight in the discussion. I mean, I'm sorry, but sometimes you just have no weight. I have in some topics I also have no weight but in tracing I have a lot of weight. Okay. I'm I'm a 500 pound gorilla probably a thousand 2,000 pound gorilla. So when when some play speaks you know with such confidence he speaks such confidence it really blows my mind and in one way I feel sorry for him because I know that you know he's stuck based on what he writes. I can see exactly what's happening in his portfolio. [laughter] Based on his opinion I know exactly what's happening there. I know exactly because I've been there. I've been there in exactly the same Dumbo thinking. I've been there. Anyway, so that's that. Uh now let's turn to Washington. There is some things happening there. You know, they they really want to get the stable coin regulation through uh and banks trying to stop it. They banks don't want to allow stable coins to have yield. Uh listen to this. trying to get at this fundamental issue which you used to regulate yourself which is the banks say look if you guys want to be if if the crypto world wants to be a bank god bless but go be a bank be regulated like a bank live with all of the the the features and regulations that exist in the banking world and two in success meaning if if the crypto world succeeds as much as I think you probably hope it does it ultimately could destroy not just the banking system >> add that up 30 cents. It wasn't supposed to be like that. Someone wrote exactly. [laughter] Oh yeah. >> But but the the economic engine behind the country which >> So guys, let me summarize it here. So this is a debate between the bankers who don't like stable coins. Stable coins now issue yield as you know and bankers want to stop that. Bankers want to ban all stable coin yield. That's what they're lobbying for in this new market structure bill. So this guy is is now having this injury where he says listen if stable coins want to be a bank go be a bank go get regulated be a fully compliant bank why don't you want to be a fully compliant bank which is to say the the loan volume would shift materially not just that it would shift to crypto but that there actually would be less loans because there would be less treasuries available. >> So okay let's unpack this. So the banks are fearful of a new technology that's not new. This is the same discussion with money markets just as Ian said and with ATMs. Don't forget that ATMs were about deposit flight. Um so there are two things that can stand as true that when you have a tokenized money market fund the economics of that may be more conducive uh than non-tokenized money market funds. That's where sits. You also have stable coins. stable coins could have the same attributes where they give you rewards just like credit cards give you rewards. And so the question here is whether or not uh you can get a compromise that garers sufficient votes through the Senate Banking Committee. Um and that means that Tradfi and uh crypto have to cut a deal on this question of yield. Stating the middle of that is Coinbase leading the effort. uh they have an economic model that is uh that with circle uh that is at the center of this debate and center of the concern that banks have on this debate. But I do think the banks have an o overblown concern that crypto is going to destroy them by one regulatory change that enables uh people to get something back for having uh money their dollars stored as a stable coin. >> There you go. So this is the big this is the the the center the epicenter of the debate. So let's see what's going to happen there. Strategy massive loss should have listened to mechanical rules. Should have gone to bullion.com could have saved them billions and billions and billions of dollars. U yeah billions in in unrealized losses for micro strategy. Uh six billion unrealized loss for Tom. Again, if you just went to boommy.com, learn the mechanical rules. Uh L2 stuff, we already talked about that. Let me remove some of the tabs because I have like a million tabs. [laughter] Okay. Oh, this guy uh is posting something interesting. He's saying that I'm not exaggerating when I say that uh when I say the onchain traders are the only vertical that matters for the future of crypto besides Bitcoin. Death to the infrasop. I fully agree here. You know before memecoins we had so many coins which were just you know scam fake fugazi infraslop you know you buy l coin it's L2 coin you think you're a smart investor you're [ __ ] and then you think you're smarter than the memecoin investors they buy also stuff that doesn't exist but at least it's it's honest about that you know you buy fartcoin okay and so you have this people who are buying you know L2 and this and that the so-called infra or interperability solutions also historically performed very very bad and it's called this infra slop I like how he said it's infra slop okay instead you need to focus on stuff that really is very close to trading instead of trying to you know do some kind of infra going to be used for intraability like what some bridge some L2 do invest in stuff which is close to the trader okay where the trader trades whether cell one that's why you know Slana is really serving the trader need a lot uh or whether it is some kind of thing that they use whether it is an app or whatever. I mean that's the true product market fit for 99% of crypto beyond bitcoin it is trading on chain okay if you ask if you ask yourself what you do most days it is uh trading holding and uh sending stable coins that's it I mean crypto has the three use cases and that's it okay uh for example when you look at all the gaming stuff someone asked where's this guy from yesterday he asked should I do a coin for my game listen games normally they don't matter it's you have a coin you need to make it pump if you have attach some kind game to your coin or you you say it's vice versa, but really it is vice versa. You say that you attach a coin to your game as if your game matters, but in reality it's vice versa. People don't care about your game. Who's going to play your freaking game, man? Like, no. No one's going to play your game. What do you mean? People have too little attention span nowadays. They watch Tik Tok. They don't gaming is it's not the same as before. You know, you you really need to be honest with yourself where you do a crypto game, it's for like no one cares, man. Even Act infinity, no one cares. No one plays that crap. They care about the coin. Okay. When the coin was mooning, actually was big. Coin is not mooning. No, no one gives a f. It's not like Runescape. I remember before playing Runescape. Click, click, click, click, click. Cowhide, click, click, click, click, click, fishing lobster. It was great. It was there's none of that in crypto. So, coin trading is is the use case [clears throat] that what everything needs to be focused on. Uh, and instead this infrasop is going to die. Aen layer another classic like remember I layer I told you from day one is for guys but no I layer I yeah yeah yeah yeah yeah guys let's go to Q&A I mean I think that's it questions answers debates discussions um let's go as soon as possible let's go as soon as possible oh yeah by the way guys if you are in uh France you know that France is now raising X office they're raising the the offices of the ex you know Twitter of Twitter and Um also there is more and more light being shed on EU censorship. So Pablo Dorov is saying the US Congress has exposed the EU commission for censoring political opponents for over a decade and interfering in at least eight elections across six European countries. This is consistent with the French government's attempt to force Telegram to censor speech in two of those countries and also now EU is raiding ex office in uh uh in uh Paris. So uh it's fantastic. I mean, I love that the US is releasing all of it, all of the files they have. Uh, this is from the House of Judiciary. Um, so what it say the the EU censorship files part two. For more than a year, the committee has been warning that European censorship laws threaten US free speech online because whatever the bureaucrats tell the big platforms to do also applies to US users. Because if you are a big platform, it's just easier for you to click one button and delete something for everyone than to make a complex system where you know it's only deleted in this country but not in MS is just easier. B gone. Okay. So that's why it's really is about US uh US uh censorship and free speech. And so now we have the proof the big tech is censoring American speech in the US including true information to comply with Europe's far-reaching digital services act. It's very important. I mean this this needs to come to light. In February 2025, the committee subpoenaed big tech to understand how foreign censorship censorship laws are hindering America's free speech uh rights. Americans free speech right. Thousands of internal big tech documents and communications with European regulators released today for the first time paint a clear picture. Europe has led a successful decade long campaign to achieve global online narrative control and they failed drastically. Okay. And thanks to Elon for buying Twitter because without Elon, I'm not sure this would be possible. And it's it's scary to think where we would be today without Elon. I mean, we would still probably not know most of the things that are happening behind closed doors. I mean, even look at what what with the Epstein stuff was happening now. Everything is on Twitter. Like everything is on Twitter. You look at all of the uh things that have been hidden when it comes to migration, when it comes to crime that was was fully censored before. The mainstream media didn't tell you anything. If you spoke on online, it would be shut down. And after Twitter bought uh Elabas bought Twitter, now everything is open and all other social media actually also have to adapt to this reality because if they don't allow free speech, everyone will go to Twitter. So that's that's important. So it began as early as 2015 when the EU commission created codes and forums through which it could pressure platforms to censor speech more aggressively. uh this and also you have to understand that it's not like EU has any moral high ground. They are a slow GDP economy. The economy is not growing. They have very very bad crime. I mean look at the uh I mean sadly if you're in France and you have cryp you have to be very careful. I mean you may get in big big trouble. Uh wrench attacks are the on the rise in France. They have no safety. They have let in god knows who in their country without any checks. They have uh no border basically and somehow they're going to be the the moral high ground. It's crazy. It's crazy. Europe is not Europe anymore. I mean, it's it's some some kind of new thing, but they they try to have some kind of moral high ground. But from the very beginning, commission used them to pressure platforms to censor political speech and other legal content. In private, companies state the obvious. The commission sets the agenda forces consensus and platforms don't really have a choice. Why is there a meme here? So it begins. What is this? Thank you for your thoughts. So it begins. Someone on Google said, \"So it begins. Sens begins. The commission's target was clear companies community guidelines that set the bunch what can be discussed in the global in the global town square. A key pressure point for governments to censor content at scale. So basically they wanted to decide what the the big social medias put in their community guidelines. Put simply, the boundaries of debate on political topics like mass migration, men and women's sports, and more are set by community guidelines. When governments pressure platforms to change their community guidelines, they're changing what Americans are allowed to post in the United States or elsewhere. Oh yeah, yeah, yeah, yeah. I mean, thankfully the US actually has free speech because uh EU has doesn't have it. Uh so now there's a push. So everyone in Europe is super thankful for this kind of push. It's fantastic. So guys, yeah, you can read more. This thread is quite long, but I think you get the gist of it. Guys, let's go to Q&A, questions, answers, debates, discussions, and of course, UK. Europe, let's say Europe. UK is included. UK is very bad. UK is very bad, of course. So guys, let's go to Q&A. Big shout out to Dub for time stepping us. That's number one. Number two, smash up the like. Number three, subscribe to the channel. Number four, go to bullmania.com. uh watch the free video if you want to join Bulmania. You saw all of the results uh we shared from the community members and thanks to everyone in the community who is sharing their games because it's really about showing what's possible, showing what's possible. The average player doesn't know what's possible or he has wrong understanding of things. He tries to long, he tries to short, he has liquidated very quickly. Doesn't understand anything. no stop-loss of obviously uh no entry strategy just all in [laughter] or just sit on the sidelines which is also not great in many cases. So go to boommy.com learn learn learn learn learn learn learn learn learn learn learn learn learn learn learn learn learn learn learn learn learn you're going to join our discord you're going to get the education most importantly you're going to get the money line very important you're going to get the money scanner very important and so on so forth um and where to trade go to buy bit using the link below link is called exchanges I use go to bitunix weeks you get big fat signup bonuses if you have one of them get the others so you spread out you have uh more decentralization and you get the nice signup bonus and you support the channel it's a winwinwinwin Win win. That's exactly what we're all about, guys. Let's go. Let's go to Q&A. Questions, answers, debates, discussions. Some guys like it's like infomercial. I love it. It's like, oh no, Ivan, you're not allowed to monetize. No, no. Why you have why you have promotion? No, you should you should work for free. This guy's like is like, \"Oh, no. You Ivan, you're not allowed. You do this every day. You should do it for free.\" No. What do you mean you're going to monetize, guys? We're for capitalism. We're for uh transactions. We are for commerce. So, of course, we're going to have a bit of promotion, a bit of infotainment, a bit of ta, a bit of in, it's capitalism. You want communism, get out. Go to Kuba. Go to get out of here. Only capitalism. voluntary exchange of goods and services. No hidden uh hidden um sponsors only open sponsors bybit great sponsor click the link bit unis great sponsor wigs big big shout out you understand or you don't understand okay very important very important it's haram to make money exactly no Ian why you make money why you make money it's haram you you shouldn't make money you should just do it for free you should just do it for free every day you should just be here for free no ad What do you mean add you you sold out? Uh I haven't sold out. Get out of here. Go back to your communist hall. Don't speak to me here, man. Crazy man. Crazy man. It's all about capitalism. Capitalism. Capitalism. Capitalism. Guys, let's go. Questions. Actual questions. Actual questions. Silver. Let's check silver. Let's check gold. they do have a bit of a bounce but um for us it doesn't change the picture. I mean as you know from from last from last week we started to uh derisk and we continue doing that. Uh so silver did have a bit of a bounce here. Gold also did have a bit of a bounce. Uh but I mean we have ridden this trend fantastically well. So we're and I'm still going to now ladder out and go to new new pastures to new adventures. I don't like the the week on gold. Uh so could can it continue? It could continue. But um at the end of the day there is there is something happening every day. I mean there's there's a new trend every day. So I would really love I would really love for Bitcoin to go to 200 week. So we have a new trend. Okay. I would love it new new bull trend on the on the weekly is the best. Is the best is the best. Will Mong go pay out the final bottom in the next pay. Will Malong go pay out be the final? I mean that that would be great. I mean I would let's have them pay out now. We got we have a bottom situation over. No more fad situation over. That would be the best. That would be best. Ben from Inter Cryptoverse thinks we hit the bottom near October but it seems that we are already close to the bottom. Your thoughts earlier? It could be October, but uh uh the thing is we're going to be buying at 200 week anyway, but we're not going to be buying all in. We're going to be deploying, lading in. It can still be until October. I mean, the thing is I don't like the the time to be the number one criteria. Okay, the time is important criteria. I mean, the cycles are very cyclical. Although, Ivan, you're wrong. You're wrong for all of the retardous they say they're wrong. they're very sick. So obviously time has some weight but at the same time uh if it is around 200 week you just know it's good riskreward anyway. So it could be that you know we go like this just a long time when from when we hit 200 week to when the actual explosion starts it can it can be quite some time. We're we're fully prepared for that and uh we're okay with that. We're okay with that. And so here for example it did take us a bit of time. We reached 200 week in June and then we bottomed out here in November. So and this cycle is one month ahead in terms of the months. So maybe it is going to be October. It could easily be something like this that we come to 200 week and then we go a bit below and kind of you know derp around here. So when I say 200 week I'm not saying it's the bottom. The bottom could be lower but it doesn't matter for us. Why? Because we start deploying already around 200 week because historically is good. Historically is good riskreward and that's what I care about. I don't care about the exact bottom. Only play cares about exact bottom. [laughter] Big shout out. I was play before. Also, I don't care about exact bottom. I care about buying when I know it's good riskreward. Okay. I care about buying when I know with the biggest probability, highest probability is great. It's great. And uh buying at 200 week around 200 week it is great. I don't know when it's going to bottom. Could be October. Could I don't care either. I don't care guys. I don't I don't care where the actual bottom is. I know that buying here around 200 week gives the following simulation result. Within a month, you're going to have approximately 8% based on the averages. Yes, within 6 months, you're going to have approximately 53 53% based on average. Within a year, you have over 200. So, I don't need to know more. I don't care about where the actual bottom is. But the strategy is going to be that we start lading in at around 200 week. Okay? And actually a bit before. So, basically, when we come within 10% of 200 week, we start laddering in. Okay? That's step one. we're not going to go all in. Uh and then when the trend changes, which can still take a lot of time after we meet we hit the 200. Let me let me show you here. So we hit 200 week back in June 2022 here and then it took basically until January to go into bull trend. So we would be basically know starting to ladder in here not for more you know not don't not do anything crazy and then once the bull switch happens that's the big signal that's the big signal to go uh you know loca [laughter] that's the big signal to go loca okay but we will be already starting to DCA in the bare trend why because it's 200 week is 200 week is fair value like it is great it's great it's going to be great it's going to be great [snorts] but you should be prepared that we may fall below I mean here for example if you started somewhere here you fell 30% it still fell so but that's okay That's okay. It's part of the plan. It's part of the strategy because the problem is if you wait too long, we may just go up. I mean, we may just explode to the upside and then you're chasing. I would rather be in control. I would rather have skill in the game already around 200 week. So, in case it starts mooning, it's easier for me to boop boop boop boop accelerate. Otherwise, you know, you're on the sidelines, you're waiting, mate. Please come back. Please come down. Please listen. That that that's the that's the uh that's the plan. That's the plan. And I mean it's a very good plan. It's fantastic plan. And oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh another thing guys. Another thing I want to update you on [snorts] guys. I mean again with the money line our strategy has been so brilliant. I I need to guys I have to toot my horn because most people they they don't learn if I don't toot the the horn. If I'm humble, you know I'm humble pie. Humble pie Ivan, it doesn't help anyone. I mean, humble pie Ivan, I can I can just turn off the stream. I can uh do my own stuff and that's it. You have no information. So, I would rather toot my own horn, be less humble pie. At least I give you a bit of signal, a bit of information. So, what do I want to toot my horn about now? Look here. The flip level for the money line is currently down to basically where the 50week moving average, guys. Okay. Holy crap. Okay. This basically will mean that if we let's say that the bare thesis is fully wrong like you know we we actually pump from here well the signal for us to become mega bull is at 102k now and this is very important because we started to do risk here at 120 when we had the fake alltime high the daily trend broke down and uh so now we'll be buying way below our uh average uh exit price which was here. This is the beauty of the money line. This is the beauty of the system of booming.com because you understand you you have all of the upside and you have very limited you cut the downside you have limited downside super limited downside and now if we start pumping let's say that this bare thesis is wrong bitcoin let's say say for argument sake it's not going to go to 200 week which can happen I mean everything is probability maybe I put 10% probability on it but 10% you spin you know you spin the roulette it can still land on 10%. So all in all uh we would be back in at 102 in case we go to Valhalla now which is super unlikely. I mean it's like you know broader going to mortar basically alone it needs to it needs to go back into the range it's resistance it needs to go here it's resistance but like you know two mortars it has to cross then it needs to go here is resistance another M AND THEN it needs to so it's kind of you know it's a it's a lot of work and for us it's not about what's possible anything is possible all scenarios are possible bullish bar like anything can happen for us it's all about what's most probable and what's the path of least resistance that's what we based on and if we're wrong we boop boop boop boop auto correct in real time so that's the system you don't you don't have to put yourself in a corner you don't have to bear or bull forever that's a very bad thing it's dumbo when you say I'm bull I'm bear Ivan are you bull or are you bear someone asked me that I already know their portfolio is fito instead we we bet on what's happening there is clausy we take umbrella okay and then when there is sun we remove umbrella people ask Ivan why you remove the umbrella You're SUPPOSED TO BE BARE NOW YOU BULL. WHY YOU REMOVED UMBRELLA? Or I have sunglasses. I see cloud. I remove sunglasses. I take umbrella. No. No. What do you mean? IVAN THE BEAR. IVAN THE UMBRELLA. WHY? LISTEN. SIMPLE. SIMPLE. SIMPLE. SIMPLE. Whatever happens, we adapt. It rains. Umbrella. It's sunny sunglass. Is that how or or how you do it? Because some of these dudes when they when they say that Ivan, you don't understand. No, but you're a bear. You're bear. Okay. So when it rains then you have sunglasses or what you but why don't you apply the same mindset in real life that you have in markets. Oh because it's [ __ ] Okay. Thanks. Thanks for confirming it's [ __ ] Yes. So that's why we've been bullish until October. Then we're bearish. We have sunglass until rain. Then we have umbrella. Okay. That's it guys. Thanks a lot for being here. Thanks a lot for contributing to the show yet again. Great questions, great discussions. Go to boom.com. Click click click click click. Watch the preview. Go to boom.com/partners for exchanges. All the links in the description. Uh big signup bonus. Uh free market capitalism. Uh our sponsors exchanges. You can go you want a dex hyperlquid. Go to a deex. You want some people say I mean I don't want essential exchange. I want dex. Okay. Hyperlquid. The biggest deck right here. Fantastic. Fantastic. Fantastic. Also uh also our uh our partner go here. You want dex? You want central exchange, you want decentralized, we have everything. We have everything. If you use the link below, you support us, you give me a bit of motivation to do the uh to do the stream. Otherwise, listen, you got to understand, it's a win-winw win. You want win win. You want more streams, click the crap out of the links. Enjoy. And big shout out to Dabby the Dabby Dab who times us, guys. Thanks a lot. Bye-bye."
    }
]