[
    {
        "video_id": "i5KuifhvYqM",
        "title": "Palantir Investors NEED To See This Before Year-End!",
        "published_at": "2025-12-31T04:04:26.000Z",
        "sort_date": "2025-12-31",
        "url": "https://www.youtube.com/watch?v=i5KuifhvYqM",
        "views": 4650,
        "duration": "00:10:52",
        "transcript": "Uh ladies and gentlemen, welcome back to Data Dispatch. Hope you guys are having at least a decent day with this insane amount of low liquidity and low volume that's basically just brought choppy price action within the market. Kind of just chilling sideways here. We're seeing some selling pressure. These individual names, you know, possible profit taking. You could see some tax loss harvesting, you know, end of the year rebalancing from some of the big funds. Uh lot of da da say what you want, but man, these markets are kind of boring right now. So hopefully, you know, as these institutional investors with this low volume, you know, if they're packing it up, if they're calling it quits for 2025, kind of coming back into 2026 after the holidays, hopefully we'll get some more excitement. We'll be talking about that. But nonetheless, let's talk about how the markets are probably going to end in 2025. Uh what we see in terms of some of the numbers, how Palanteer is looking. Uh we'll be talking about some of the other big names, the broader market, some news that we got today. And of course, we'll finalize with crypto because that's always an interesting wild wild west, too. So, if you're new or returning viewer, hit that like button, subscribe for daily videos, follow me down below on X if you want to talk on a more frequent basis. Pop it up on the screen here. Let's talk about Palunteer. Now, Palanteer was at 180. We talked about this in yesterday's video. Basically, Palanteer kind of did have this nice swing in this local run up. Uh what we saw here on the weekly, you know, Palanteer was able to come to about this 196 here. That's what we saw last week. This was in Palanteer kind of had what you could call that Santa rally before uh you know right leading up here to Christmas and then now we've seen some selling pressure since then with that selling pressure along with Palanteer below its 50 below its 200 moving averages. You know Palanteer is probably just going to re-enter back into this consolidation zone. You know to be honest some of the charts they don't look that exciting right now. Uh so there's a lot of boring kind of price action like I said. Um, so if Palanteer just re-enters into this consolidation zone, that can be anywhere between the 170s and the 184. Palanteer has done a great job establishing a base within this zone. And I mean, if it falls down here, you know, I'm not going to get personally concerned about Palanteer for a further type of breakdown or um, you know, downtrend unless it lost this 170 support. But right now with some of this end of the year, you know, moving around and like I said, not a ton of crazy action, don't really care about it coming down here about 1.8%, we see in the after hours currently down about another half percent. Uh it doesn't really matter to me. Uh Palanteer has had an incredible year. I think for a lot of people that are kind of waiting for this crazy immense, you know, Santa rally that hey, we were promised, you know, historically it's what the numbers say. Yeah. You know, the market's pretty close to all-time highs. And speaking about the market, you know, the market is currently sitting at 68.96. So, it's very close to its all-time high values. Um, in terms of the SPY, you have it here close at 686. Um, right below it's 50 and it's 200. You know, at this 50, you know, right below here, uh, we could continue to see some selling pressure most definitely. But nonetheless, this is kind of basically consolidating. uh you could have the market basically we could see some consolidation here between the 6,800s. You know, in terms of a base though, the index has done pretty good holding support at this 6,800 with that last dip that we had at 67 with a nice reversal that we saw that pushed it basically back up to these all-time highs to literally all-time highs of 69.46. So, I do like where it sits right here, you know, at this level. It's been relatively resilient, you know, below its 50 but still below, you know, above its 200. uh it's not necessarily a horrible thing and I like this going into the end of the year here. I think this is a good setup uh going into 2026. Of course, we could have further draw down, but you know where it's sitting at right now. S&P 500 has had a great year. So, uh for people that are really kind of, you know, mad about not getting this end of the Danner rally that everybody, like I said, is expecting a lot of times the opposite can happen. I mean, just win it out, zoom out. Look how the bull market's done this whole year. Uh I think people should be celebrating that instead of getting so caught up on just these few final trading days. And that kind of leads into what's you know what's happening in the market today. Well, you got futures that a little changed. Uh we're seeing a little bit of down pressure. Talking about the Santa Claus rally that's not here. Blah blah blah. Uh what we're starting to see though a lot of analysts still expecting the S&P 500 to possibly post out another doubledigit advance here in 2026. But many worry that there could be more rangebounding. uh we could see more choppiness across in the market, a bit more volatility. You know, I guess we'll see what happens. You know, I think there's still move before we see the next earning season. That's going to give us some more uh validity to some of the numbers that are, you know, kind of being pushed in terms of multiples. Uh AI, as we know, is a driving force. I think AI is continuing to be very strong. See, I don't really agree with this whole AI narrative being fractured here. right here. I see, you know, there's some concerns and a lot of AI top callers, but, you know, across the board, you know, in terms of the whole AI buildout, you still have people making insane deals with Open AI. It's still going to continue. Hopefully, they can start um paying some of their bills. You see Soft Bank here fully funds a 40 billion investment on Open AI. Uh Sam Alman is still just somehow reeling on all these crazy deals. We see here Elon from uh Tesla and of course XAI here building third mega data center per the information right here. Here you can see they move a move outside Memphis signaling XAI is going all in on owning its full AI stack instead of leaning on some of the hyperscalers. They want to own it themselves. So this could possibly mean a push for a deeper alignment with SMCI uh and for racks and infrastructure. But the obvious as we know here the bullish outlook is Nvidia really really kind of the monopoly behind the whole AI boom and having the whole kind of headwind. Uh in terms of the index a lot of people are a little kind of scared uh looking at the chart here. Here's where the index is literally right off these all-time highs. A lot of people are talking about this. I want to give my get my quick opinion about this. This is right before in 2025 here that in April when we had the huge decline that brought the index basically back here to slightly under 5,000 and everybody was talking about of course you know all the tariff scare liberation day really pushed the markets straight down and talking about a very similar type of head and shoulders pattern that was invalidated 5% off bounce right here and barely making these new time highs. similarities saying here are very very close. Um the only difference here is you don't have a huge type of cascade or headline event like liberation day something that was unprecedented I think uh a very large geopolitical event in terms of tension and uncertainty that really brought the markets down. Uh you'd have to couple that with another event. Um you know some people commenting here you know probably alignments with the Supreme Court ruling on the tariffs. We don't have the definite ruling on the tariffs, but in terms of that, I just don't think it would be as much of a market shocker compared to the original push from the liberation day. Uh what those tariffs are. So, as of right now, yes, you know, of course, the pattern looks the same, but as we've seen with all the other seasonality and historical things we're expecting, you know, those haven't played out. Just look at the Santa rally. So, you know, with that being said, uh I'll just kind of see where it sits here. I'm not really much of a chart squiggler, but that's why I don't really care about this chart that much. Uh, you know, in terms of a long-term portfolio, I like to, of course, keep dollar cost averaging, maybe, of course, in the short term, more swing trading. You know, maybe a little more hesitant here until we see some more confirmation on what direction we're going to get going into January. Uh, talking about crypto, let's talk about what the heck's going on. Um, Bitcoin's basically hanging out here at 88,000, above 87,000, I guess, which is good. It's been sitting there for a while. It's just been between 87 and 89 for a while now. I mean, the price action is quite kind of odd. See here, just these ups and downs and these quicks ups to 89s, back down to 87, up to 89, back down to 87, blah blah blah. You see crypto that lose or Ethereum right here loses its 3,000. It cannot hold 3,000. I mean, the, you know, local resistance or the short-term resistance here at 3,000 is quite strong, you know. And how does that mean play out for BMR right here? Uh Tom Lee, I'll tell you, you know, a lot of people, I think, lost some trust in him with the amount of bullishness that he pushed behind his crypto and Ethereum and Bitcoin end of the year price targets. Uh not saying that they're not going to happen, but the timing was off. Uh you know, there's still a chance, you know, of course, for tokenization. I'm still bullish on that in terms of the synergy between traditional finance and the whole cryptocurrency industry and how that kind of gets worked in terms of a hybrid type model. I do like that and the products that can come with tokenization. I'm bullish on that uh more in the long term. Obviously, we can't time it if even the big experts can't time it though. So, how does that relate to BMR right here at $28? Uh, you know, it's below its $30, you know, area, which is important cuz, you know, Bitmine does have a strong correlation to Ethereum's price. But what we are seeing, what I do like about Bitmine specifically is they're continuing to stake more Ethereum. Probably because they need to acquire more Ethereum. we need some revenue in that balance sheet with the unreal, you know, with the um uh unrealized losses that they're probably sitting on. No, but you know, with the um this means that what are they going to do? They can start accumulating a lot more Ethereum now just by staking it. Uh and with this, you know, locked into their actual protocol into the Ethereum consensus. You know, what this means is that uh you know, with these rewards, they could pay out more of a dividend. They can help to accumulate their 5% quicker. So, I think it's important that they're staking their Ethereum, and you can see that they're finally doing that. Uh in terms of the AI data center stocks, also not really catching a bid. Like I said, a lot of these charts are looking kind of ugly right now. You see Cipher right here, uh up a little bit in the overnight hours, surprisingly. Uh and you see Ren, it's actually up a little bit in the overnight hours, but it came down uh about 3% today. Now is at 3833. Uh the only thing I don't like about Iren is it's below its $40 level of support. There's some strong support there. So, we'll see if this possibly comes back down here, retest possibly the 33s. That could definitely be a possibility as last support and Cipher could possibly test back in here into the 13s and the 14s if uh the charts do not kind of hold up and we're not seeing any volume that comes in. So, we'll see what happens. Nonetheless, I'm still maintaining a bullish outlook. I mean, specifically looking at this, you know, Cipher right here is now priced as if the AI partnerships with Amazon and Fluid Stack and Google didn't exist at all. So, I think it's at an attractive price in terms of the long-term uh kind of conviction and uh sentiment type of perspective. However, of course, trading on the chart right here, talking about head and shoulders, you know, lower lows, blah blah blah, lower high, lower highs, lower lows, you know, of course, this could face more downward pressure, but uh I'm not going to let that really phase me in terms of the long-term bullish perspective. Uh let me know what you think down in the comments. Peace out. Take care and I'll catch you guys"
    }
]