[
    {
        "video_id": "kpShnKWJNg8",
        "title": "Bitcoin Dominance Explained (And How It Affects Altcoins)",
        "published_at": "2026-02-02T10:45:13Z",
        "sort_date": "2026-02-02",
        "url": "https://www.youtube.com/watch?v=kpShnKWJNg8",
        "transcript": "Bitcoin dominance is a simple metric. It measures how much of the crypto market belongs to Bitcoin, calculated by taking its market cap and dividing it by the total value of all cryptocurrencies combined. Simple math, but the number could say a lot about where we are in the market cycle, like whether it's time for altcoins to shine or get wrecked. Let's rewind. From Bitcoin's launch in 2009 until early 2017, Bitcoin was practically the entire crypto market with dominance holding at 95 to 99%. Then Ethereum came along with its ICO craze and money surged into every so-called next big thing. That flood of speculation dragged Bitcoin dominance all the way down to 35% by early 2018. When that bubble popped, the unforgiving bare market wiped out most altcoins. Bitcoin held its value better than other tokens and led the recovery into the next bull market. So by 2019, its dominance had rebounded to around 70%. Then came 2020's DeFi summer with promises of the next future of finance and sky-high yield. Capital poured back into altcoins and Bitcoin dominance slid again towards 40%. When the bare market hit, Bitcoin weathered the storm better than the rest. By the time 2023 came around with the next bull market narrative, Bitcoin dominance was back up to nearly 70%. You may have noticed a pattern. Bitcoin dominance rises and falls like the tide, not fooled by the moon, but by market psychology. When the market is bullish and confidence is high, [music] investors rotate out of Bitcoin into smaller, riskier coins, pulling dominance down. But when the market turns bearish, caution sets in. People retreat back into Bitcoin as the safer bet or exit into cash or stable coins entirely. That drives dominance back up. Regardless of whether Bitcoin's price [music] itself is rising or falling, this back and forth is what people call Bitcoin season and altcoin season. And when you pair dominance with Bitcoin's price, it gives you a clearer picture of where the money is flowing. If both price and dominance is rising, Bitcoin is leading the rally, which is how most of a cycle tends to unfold. It's usually only in the later, more euphoric phases that altcoins start to outperform and dominance begins to slip. So, if Bitcoin is still climbing, but its dominance is falling, that's the hallmark of alt season, a rising market where alts are running faster than Bitcoin. If Bitcoin is falling and dominance is rising, it means altcoins are bleeding even harder, which is common in bare markets. And if both price and dominance are falling, that usually signals sharp capitulation. Bitcoin is leading the drop, falling quicker than alts. But over a prolonged downturn, dominance typically recovers as alts bleed out more. That's why some traders use the Bitcoin dominance chart to gauge the likelihood of an alt season. If dominance is on a strong uptrend, [music] the odds of alts outperforming are slim, no matter how many times you hear people calling for it. It's only when the uptrend finally breaks that conditions for a real alt season start to line up. Of course, Bitcoin dominance isn't a flawless metric. It doesn't adjust for coins that are permanently lost, and it doesn't fully reflect the role of stable coins, which often act as a safe haven during market downturns. Still, these factors mostly affect the exact number, not the bigger picture. The balance between Bitcoin and altcoins, how they move relative to each other, is usually the more reliable signal. It's not a crystal ball, but it's a useful lens for understanding how money flows through the crypto market. Bitcoin may rule the market today, but will it still be around at all in a 100 years? We explore that question in this video."
    }
]