[
    {
        "video_id": "maWAzAKLWpA",
        "title": "Bitcoin COLLAPSES, Metals Dump, New Fed Chair &amp; More",
        "published_at": "2026-02-02T14:10:51Z",
        "sort_date": "2026-02-02",
        "url": "https://www.youtube.com/watch?v=maWAzAKLWpA",
        "transcript": "Another [music] [music] leg lower. Crypto just keeps taking fire as Bitcoin crashes below $80,000 and the community [music] tears itself apart. Our savior, Trump has named the man he wants to replace Jerome Powell as Fed chair. We take a look at who Kevin Walsh is and ask whether he might be the one to inject some positivity back into the market. Beta plays. There's always a bull market somewhere and everyone is looking for some smarter exposure to metals and AI. We look at some names you should have on your radar and we'll have the best of the recent tweets, TA with Lewis, dates for your diary, and much more besides. This is the Coin Bureau News Live. Hello everyone and welcome to another episode, another installment of the coin bureau live news. My name is Guy. It is good to see you. I am joined as ever by Nick. Hello sir. >> Hey, how you doing guy? >> I've been better. >> Yeah, better. >> Amazing. Fantastic. Incredibly opt optimistic and really glad to be here talking about how you guys can make money in cryptocurrency. >> Yes. Yes. The only people who've had a worse week than the Crypto Bros are those whose names popped up in a certain set of files uh released recently. Um and there's actually a bit of overlap between those two categories which maybe maybe we'll get into or maybe that's a little too much of a hot potato. >> I said I said I said I put a tweet out the other day and said that why is Bitcoin trading like it's mentioned in the Epstein files [laughter] and it indeed was like a thousand times. >> Yeah. Yeah. Um, so, uh, well, we might, uh, we might discuss that a little bit as well. We're going to discuss, uh, the recent, uh, cryp cryp apocalypse, crypto apocalypse. Um, and as we said, looking at the new Fed chair and also some beta blaze for metals and AI. So, there's alpha in there. It's just not really cryptoreated. Um, now before we get underway, folks, we would very much appreciate it if you could pound that like button. Um, you'll see there's a little status bar underneath Nick there. Um, if we get to 100, I don't know. Um, one of us will set the other one on fire or something. >> Yeah. For the for the fans, you know, >> for the fans. For the fans, for the guys. >> Um, and yes, as Nick says, uh, ring the notification bell as well. So, uh, Nick, should we kick off and talk about the week in Bitcoin? >> The week in Bitcoin. What a week it was. This is actually the current mood right now. [laughter] [laughter] >> When was that taken? >> I don't know. It was taken probably when before the furniture moved, but that's the current mood for us right now here over at Coinb HQ. But um that's the mood last week. Anyway, so roll back to last week, Monday. Uh you'll remember that we opened up a CME gap to the upside 87.9 to 89.3K. As per usual, uh when you have a drop on a Sunday evening, you generally tend to open up a gap. Uh Sailor also on Monday just kept on buying. This was slightly smaller than well 10 times smaller than the week prior, but about $264 million. So, he is still stacking. And indeed, he did allude to another purchase potentially this last week in a uh yesterday. So, we'll see if he buys during the stream, guys, let us know or he tweets during the stream. Let us know. >> Yes. Yes. Please do uh please do drop a drop a comment. Let us know how many sailor buys uh today, if any. >> Um so, uh yes, that takes us to about Weddednesday, right? >> Yes. On Wednesday, we closed that gap quickly. So, great. There we go. Bang on. There we Yeah, exactly. Called it. Called it again. >> Someone long someone logged up to close. >> Another one. Another one, guys. There we go. Uh, Bitcoin reclaimed 90K. So, the market's looking today. >> It was all going fine. It was all >> such a good day. Things are looking good. >> Meanwhile, the S&P 500 is actually making record highs. >> Crazy. Record highs above on record highs of green. And then uh and then we went into the FOMC meeting on Wednesday. >> We did indeed. Uh it was much anticipated but of course not much happened. There was no rate cut of course and it was termed a hawkish pause uh and two so essentially in terms of the the sentiment and pile statements uh and two of the governors desented and and favored for a 25 basis point cut. >> Okay. Okay. So it was another eventful uh eventful FOMC meeting. Uh Thursday meanwhile obviously the story of last week as we discussed uh was very much gold uh up to a point. Gold broke $5.5,000 per troy ounce. >> Mad mad times indeed. >> That chart is just something else, isn't it? And of course Bitcoin >> nothing going on. Digital gold not so much. >> Yeah. uh then markets actually started falling across the board risk on and risk off assets because of rumors indeed someone got the inside scoop that it wouldn't be Rick Ryder who would be the Fed chair in terms of the you know pro probabilities but uh it would be Kevin Walsh which came out of nowhere to be honest because it was jockeying potentially for Kevin Hasset or Rick Ryder and we'll get into why that caused markets to crash in a bit but um it also led to massive collapse in the price of gold. And this is good news because many of the crypto bros were looking at this wondering does this mean that the Bitcoin gold bit Bitcoin rotation is taking place and what happened with Bitcoin? >> Yes, it also crashed. [laughter] >> The crypto bros pivoted into gold and gold duly dumped. That uh that's just the way it goes. Yeah. Um, so there was I mean a big a big change in sentiment and as we'll as we'll get into that seems to have been around uh this new Fed chair. So um this took us into Friday. Things weren't looking great. Bitcoin kept falling and then broke below 82K. A real nose bleed there. >> Exactly. Uh then it was just then of course the actual announcement came that Trump nominated Walsh for the Federal Reserve >> and this just this just kept on uh bringing gold and silver downs. They kept on collapsing. It was a massive fall last week in terms of both silver and gold. I think the biggest fall for silver since the 1970s and gold since the 1980s in terms of percentage drop. Madness. Madness to see this in moves like this. >> I mean, it just underlines how overheated those two markets were. I mean, you know, as we discussed last week, there were plenty of fundamentals behind them, but I mean, it really was uh a market mania. Um, and I guess, you know, it because it's funny, isn't it? because it wasn't, you know, you would expect looking at that looking at those charts, you would perhaps have expected like some massive announcement like, you know, some some really bad news like the eruption of a war or something like that or a huge natural disaster. And in fact, it was just Trump nominating some officially confirming someone as as next Federal Reserve chair. >> And I think this comes to in terms of what sort of monetary policy we could see if he is nominated, which we'll get on to in the next section. on the week going into the weekend on Monday, uh we had generally over the we had record ETF outflows over that week and indeed this is the first time ever since the ETFs have been around that we've had three consecutive months of outflows. So not not looking good there. >> Not looking good, Brav. Um there's also uh talk of a uh a partial government shutdown. >> Yeah, so we entered a partial government shutdown on Saturday evening. Uh so it's 24 to 48 hours. they're going to vote on it today. And what was surprising was that even after an announcement of a government shutdown, the only asset that is really one of the only assets that is tradable over the weekend, Bitcoin, did not react, which led me to wonder, hm, >> that's suspicious. >> What's going on here then, >> of course, was not meant to be. Bitcoin duly collapsed Saturday evening over there, you know, uh falling for like $3,200 in under 15 minutes. >> Ouch. And um it also collapsed below the strategies break even cost which is crazy. >> Wow. Not a great weekend for Michael Sailor. Really considered >> not great weekend. >> Um and that actually continued uh as Monday morning broke uh here in the eastern eastern hemisphere. >> Um crypto still struggling. Um but uh you might be pleased to know or you might not. It's not just crypto. Global markets are actually there's red almost across the board. >> Even orange juice is selling off. >> Oh my word. It's all over now. >> It's all over, guys. The orange juice. >> All over. I was I was I was all in orange juice. >> The guys who pivoted into the soft commodities, [laughter] orange juice and coffee sudden. >> Hey, why don't we move out of the orange coin and into orange? Oh no. Sold as well. >> Um, >> okay. So, so just a huge a huge flip in sentiment. >> Exactly. What is good though, of course, because it was a Sunday and you have a collapse or big move on in the price of Bitcoin on a Sunday, you know what that means? It opens up a CME gap. And in this particular case, this was the There we go. There we go. Guy spotted that first. There we go. >> This was the second biggest CME gap ever in history. I think it's about 6.3K in terms of size. So, there we go. Yeah. >> You're welcome. You're welcome. >> Welcome. Well done, guy. Well done. Enjoy that gap, guys. That's for you guys. That is >> There we go. So, what's coming this week? Well, uh for one, there's the partial shutdown vote which is taking place today. So, hopefully they'll reopen the government. Uh there's the employment report coming towards the end of the week. There's also really important data coming out today. And this is the ISM uh manufacturing index numbers, and we'll get into that why that's important a bit later in the stream. We'll have to see how markets open uh in terms of the the stock markets today. The futures are slightly down. It'll be interesting to see if there's going to be a massive sellout in the ETFs or there'll be inflows. Taking a quick look at the charts on the daily charts, we broke well below the yearly open. I think we're down like 15 or so percent from the yearly open which is not looking good, bro. Not at all. 12% down on the year. Uh we did indeed almost we did hit actually the 74.5K level which is a resistance level. It did bounce from there but that was the uh low last year after liberation day tariffs. >> Was it really? Yeah. Yeah. 74.5K. >> Okay. Testing those levels. >> Testing very we plum in those depths. Um but do remember that we now about 76K which is strategies cost basis. Um so in the short term let's see hopefully we can close that gap bring us above you know um and hopefully we can close that and where we go after that well you know only God knows [laughter] >> and we're all about to find out. Okay. Okay. Well, folks, uh whether you're feeling uh bullish or bearish on crypto, um if you're going to want to trade it at all, you're going to want to use a top tier international exchange. Isn't Isn't that right, Nick? >> Indeed. And that's brings us to Tubot. Now, uh they are an international exchange as Guy mentioned. Uh they have a solid interface, deep liquidity, and competitive fees. And the onboarding is super simple. All you really need is an email address. You go and scan that QR code over there or hit the link down in the description. go and create an account with an email address and that's all that's required. Play around with it and if you want to trade on it, you can deposit. And if you deposit, if you meet certain deposit requirements, you can get up to $90,000 in trading rewards. And on top of that, if you start trading, you'll get a VIP level one upgrade, which is 50% off trading fees for life. And this is exclusively for the Coin Bureau viewers. So, if you want to avail yourself of those bonuses and discounts, QR code in the screen or link down below. Check it out, guys. >> Okay. Absolutely. Absolutely. All right. Um, we will have a look at the uh sentiment. Um, I can tell you sentiment in in this particular chair is not good because I'm current my left leg is currently really cramped. [laughter] >> You thought it couldn't get worse. You thought it couldn't [laughter] get worse. >> Throughout that whole bit, I was trying not to like uh Yes. Sorry. So, look, it could be worse. It could be worse. Your leg could be cramping up for for Oh, ow. >> Okay. [laughter] >> Okay. >> This is not planned, guys. This is completely spontaneous. >> Yeah. It's completely spontaneous. You >> okay, guy? You going to be okay? >> Really? >> You need to go and stretch. You need to >> No, no, no. I'm fine. I'm fine. >> I I feel scared for you. The fact that you go into you need to stretch before you do a live stream. Now, [laughter] >> that's you get that. >> That's the kind of That's the kind of shape that that I'm in after all these years in crypto. I can't even do a live stream without cramping up. >> [sighs] >> Oh dear. Oh dear. Um, yes. So, uh, as you can, well, I don't know. Sentiment is holding up quite well. Things are so bad. Lewis is now selling guys crypto. Um, I I hope not. I hope not. Um, uh, other people though seem to be uh seem to be uh, I'm loving the BTC price. Love the bears. Once in a lifetime opportunity to get discount BTC. >> Hey man, you know, positive. Half glass half full. I love that. or indeed in this case he's seeing the glass with a bit of a speck of water in there and he says hey we've got some water in the glass it's [laughter] not completely empty >> um in oh god can you imagine sailor rotated to gold >> yeah he's announcing his new uh gold treasury strategy >> yeah that really would be uh Max Payton um someone saying uh people are deliberately taking new Fed chair out of context he will change depending on situation he thinks >> yeah we'll be talking about that well which brings us to our next topic, right? Because now this is the new Fed chair. Now, this was actually the best episode of The Apprentice yet. I must admit, guys, >> we are the final [laughter] showdown. Walsh and the two Kevins, Kevin Hassid and Kevin Walsh, you know, down the K squ. And what's interesting is that the odds completely shifted. If you'll remember last week, we were talking about Rick Ryder being the top contender and then overnight someone got word of the potential nominee, Insider Trading, no doubt. maybe just check Trump's side wallets. Um, and the the the odds completely shifted to Kevin Walsh and it was then indeed announced by Trump on Truth Social. >> Okay. In a uh in a typically uh in a typically short and measured Truth Social post, whatever they're called. >> Um, not too much in the way of truth. They're called truths. Okay. Well, there's there's the truth. >> Um, so, uh, Nick, you did some digging into who Kevin Walsh is. Now I didn't I didn't really know much about him. So you've you've found some interesting things. Who is he exactly? >> Yeah. Yeah. From good cast. What did Trump say? Cost, you know, comes from a good cast of characters. So yeah, his father-in-law is Ronald Lauder who is a major Republican donor. Go figure. He's also a massive billionaire and a chair to the Estee Lauder fortune. >> I mean, he does not look in any way evil, does he? >> No, not at all. >> He looks He just looks like a benevolent old gentleman. >> Mr. Burns over there. Mr. Burns [laughter] over there. So he's also Kevin Walsh is also a member of the Bilderberg group. Interesting. Interesting there. >> Okay. So he's he's connected. He's connected to say. Um so yes, he then spent uh he spent seven years at Morgan Stanley. He joined George W. Bush's inner circle of of economic policy advisers way back in 2002. Um and was a member of the Fed board of governors uh from 2006 to 2011. So this is not his first first time around the block at the Fed. >> Exactly. [clears throat] He was actually the the youngest Fed governor at appointed at 35 back then. Um and for the past 14 years he has served as a partner at famous Stanley Draimiller's family office uh helping to manage the fortune estimated 11 billion. >> Okay. Okay. So he's wellconed. He's got a lot of experience. Um Wall Street must absolutely love him, right? >> They love him. Yes. The Wall Street Journal wrote this great op-ed. He's one of their own. One of us one of us in the Fed chair seat. Okay, >> now this brings us to policy. Uh, now the reason the market sold off was because many have considered him to be a hawk, a monetary hawk given statements that he has made in the past. For example, from 2006 to 2011, he was known as an inflation hawk and he was advocating for tight monetary policy and criticized the low interest rate uh programs. >> Um, he uh he's also been a consistent and very vocal skeptic of QE for over 15 years. Yeah, exactly. So, and markets of course traded as if there was a hawk coming into the Fed because the dollar rallied. Long end rates which are a sign of inflation expectations came down and you also had gold selling off. So, these were all signs that you stocks were down as well. >> Stocks were down as well. So, these were all signs that we could potentially have a hawk in the Fed seat. >> Mhm. However, uh there were some people sort of questioning uh the hawkish narrative. Stanley Ducken Miller himself was actually saying um that uh Kevin Walsh is not a permanent policy hawk. He said quote the branding of Kevin as someone who's always hawkish is not correct. I've seen him go both ways. >> Yeah. So this now brings us to the potential impact on the markets or on crypto. So if he is a hawk that means potentially tied to liquidity which isn't good [clears throat] for risk on assets. though what is why the markets love him and and why Wall Street loves him is because if he's he was potentially going to be less of a yes man than Kevin Hasset. So he understands the markets. Yeah, he speaks their language and if he's going to be he's potentially keep the feds more still independent, right? So he'll be able to corral Trump and all this kind of stuff. But let's still not forget who his boss is, right? It is Trump. And as a result, he won't meaningfully meaningfully shrink the balance sheet as this will lead to a contraction in an election year. And President Trump said that he will uh that Walsh will cut interest rates, which is in I I don't think Trump really knows that there's at least 12 members on the voting >> the voting on the FOMC. And he also said over the weekend, I think he made a quip that um he'll sue Kevin if he doesn't if he doesn't drop rates, which I'm pretty certain he would do. >> I I imagine he would. Yeah, he's fairly trigger happy as old DJT when it comes to the lawsuits. Yeah. I mean, it's an interesting one, isn't it? Because you sort of think, well, Trump wants Trump wants rate cuts. He wants looser economic policy. So, why would he nominate someone who is sort of famously hawkish? Um, it it kind of doesn't make a awful lot of sense. >> Yeah. And I think look what like like the previous person who commented said, I think, you know, wash can be adaptive to the market, to the conditions. It's also around how you think about short-term rates and then you can reduce QE but then bring down short-term rates and one other very important point here and this is quite a cool coincidence again in terms of the connected circles bessent is also there obviously at the treasury and you can bessant and and wash can work together in terms of besson can look at you know fiscals QE which is a different term they can look at build issuance on the short end and um Walsh can look at what they do on the Fed's funds rates and potentially long end rates with regards to the treasur the the Fed's balance sheet. But another interesting point is that uh Bessant was while Walsh walked worked with Draen Miller and his fund for like the past 15 years. Bessent was Draen Miller's junior over at Soros's quantum fund. Okay. Back in the day when they were crashing the pound. So there we go. There's the connection. Three hedge fund, two hedge fund guys, one running the Fed and the other running the Treasury. What could go wrong? >> All one big circle joke. Um now he uh Kevin Walsh has made quite a few statements uh in relation to uh to Bitcoin. Um Michael Sailor for one is is pretty bullish. He says quote Kevin Walsh will soon become the first pro- Bitcoin chair of the Federal Reserve. >> Yeah. Yeah. Walsh has made many statements about Bitcoin. We've shared some of these on the Twitter so you can guys go and take a look at that. But uh he was generally more on the optimistic and un understood the technology than many of the other Fed shares. So yeah. Okay. I mean, I guess perhaps the [clears throat] most important thing because it's going to be very it's it's it's impossible to kind of second guess how someone is how someone is going to act, but I mean, this is this is Trump's man. >> Yeah. >> So, you kind of think, well, at least in theory uh the relationship between the Fed and the uh and the executive branch should improve a little bit, which you would imagine would perhaps be better for uh for the economy. But um yeah, whether he turns and as you pointed out like you know Kevin Kevin Walsh the the chair can't influence what the rest of the FOMC decides to do. I mean there were two as you pointed out earlier there were two descents and the uh in the recent meeting weren't there. >> Um but I mean you know it that suggests you're going to need quite a few more in order to turn that round. >> Yeah exactly. Um this is it. But generally the Fed chairman if they they can they have more influence obviously they can try and get the rest of board man board members to vote with them uh by consensus that has been the historical norm but in these polarized times you know and especially now it depends if if if Powell is going to stay on as a uh as a voting member and you've also got Lisa Cook there >> two people have basically been attacked by Trump I don't know if they're going to necessarily feel very interested in in queasing to his demands given and what they what they've been through. So, we'll see. It's an interesting time. >> He hasn't made an an awful lot of friends at the Fed recently. >> He has no Okay. Okay. So, that is uh that is going to be an interesting uh interesting thread to uh to pull on over this year and to follow. What is Kevin Walsh, the incoming Fed chair? Uh how is he going to uh is he going to pump all our bags in time for the midterms? >> Please. Yes. >> Yeah. Okay. Now, however you're feeling about the markets, uh if you want to keep your crypto nice and secure, then you need to be using a hardware wallet. And Tandem is the one that we recommend. Not only does it function as a hardware wallet, it also functions as a web wallet as well. It is absurdly easy to set up and use. And if you scan that QR code on screen, you can get a 10% discount. >> Yeah, as they say. >> There we go, guys. Yep. Lovely. Now, there is Yeah. >> Oh, yeah. Guys, although Bitcoin may be trading around bare market territory, don't forget that there's always a bull market somewhere. And one of the strongest bull markets we've seen over the past year or two has been in AI. So, this made us question what sort of potential beta trades because AI itself, some people say the actual AI trade in terms of AI stocks could be overheated, but what other beta players could there be in the AI space? If you bet if you if you're optimistic about the future of AI and the and the AI buildout, what sort of assets could you invest in that gets you that beta beta exposure to the AI trade? So >> yeah, >> one of these for example is uh a metal and this is copper. >> Okay, this is an interesting intersection of both AI and metals. Um you were tweeting about copper quite recently, weren't you? >> So I was saying yeah, there we go. Copper, [laughter] you guys are so creative. I love it. even with the shirts and everything. And >> I knew that copper copper t-shirt you insisted on buying would would come in useful. >> Um, so uh yeah, so this was a couple of weeks ago. >> Yeah, exactly. So it's about two three weeks ago. So I was saying that look, if metals are pumping, then people are looking for the next beta that's going to pump on the metals trade and that's copper potentially. And if you're bullish on AI from a fundamental perspective, it's also copper because copper is very important in terms of building out data center infrastructure in terms of electrical cables and all that and not just data centers but also like all types of buildings, right? Uh so that's very important. Uh so that's why I think copper could have been a good could could be a good trade at that time at that time and it did indeed rally post that. Uh you can look at the price action of copper since it's been going on a mad tear and we recently broke through all-time highs. Okay. Um, now fundamentals as Nick said, uh, you know, copper is extremely important material, you know, for its conductivity, you know, all sorts of electrical uses. There's also a projected 330,000 ton refined copper deficit for 2026. Now, that's a big driver of this particular narrative. We also saw a deficit with silver, of course, but this is perhaps even bigger. Um and copper is arguably used much more widespread, you know, um much in much more places and uses than silver. >> Yeah. And these the supply disruptions are because of a lack of new mega mines that are entering production. And this has created a bottleneck just as EV and grid infrastructure demand peaks. >> Okay. So, it's not exactly uh it can't exactly match the likes of gold and silver for glamour. Uh but copper is a damn useful substance and it seems like uh demand for it is only going to keep going up and to the right along perhaps with its price as well. Fun fact, Nick, when I lived in London, um people quite often used to uh steal copper from the street lights on our road. >> I mean that's a regular feature over in South Africa, mate. In fact, so much copper has been stolen that there's no electricity. [laughter] >> Wow. >> Yeah. I remember trains in the UK are quite often cancelled because someone's ripped up all the copper wiring. So they they can't >> once in a while there's someone who accidentally touches a copper wire and learns a very quick lesson in terms of why you should not try to steal copper on live wires. And yes, >> that's karma for you guys. >> Well, there you are. There you are. So, uh I mean something that gets stolen at that level must be valuable, right? >> Okay. Um let's talk about another beta play on the AI narrative. Um and this is an interesting one. So this is ASML. No, not ASMR. Uh, that is what we are pivoting into if crypto goes any lower. Uh, no, ASML. What What on earth is ASML, Nick? >> ASML. Um, and this is also not SNM, by the way. Um, it's I tweeted this last week. This is basically um a chart, not a chart. So, basically, I tweeted this fact. There's a company out there with a $500 billion market cap. one that has seen its share price rise over 80% in the past six months that sells only 40 machines a year and it has not a single competitor and and this is puts puts into context the scale of ASML uh and so basically what is ASML they manufacture lithography machines advanced lithog lithography machines and these machines are used in the production of semiconductor chips right and they are the only producer of these machines and these machines like they cost about $300 million per machine and very very tight constraints on the export of these machines and TSMC which is the chip manufacturer is one of the biggest buyers of these machines and just look at that price chart I don't know if it was up on the screen but um >> it's gone parabolic recently >> so uh I mean that's quite a moat isn't it you're the only manufacturer of the machines that can make the one thing that pretty much everyone wants at the moment >> okay so looking at the investment case for it from a fundamental uh point of view um ASML's revenue guidance for this year has exceeded market expectations. Um this is because the likes of TSMC and Intel are expanding production. Um and gross margins are projected to climb towards 56 to 60% by next year. >> That's crazy those kind of margins and that mode helps with those margin protection. Uh and the technicals the stock is trading near its 52- week high. So it's currently supported by a 65% one-year total return. Its PE ratio is also quite high at 49 times. So, it's quite pricey though, but indeed it is a monopoly. It's a it's a singular monopoly. >> Okay. And just in case you need confirmation, TSMC, which is ASML's largest customer, as I think Nick said, um recently raised its capex uh figures from uh to 52 to 56 billion for this year. >> So, it's it's basically committed to buying >> a lot of these machines, >> a lot of machines, >> even given even given how expensive they are. So that kind of basically guarantees a multi-year demand floor for um for ASML's equipment. >> There we go. Yeah. Many years into the future. The next uh stock we wanted to talk about as potential beta play on uh AI. It's actually a beta on a beta because essentially many people looked at um the stocks that rallied after the AI chips like the GPU chips and Nvidas and the likes rallied was those that produced memory uh because memory is required in terms of these AI computations and these are the likes of SKH High and Micron which rallied a lot but now they're looking at the third component there and that's potentially storage and storage like after the computations are done to store the data >> and one of these that has rallied in like gone parabolic over the past few months is that of SanDisk which has recently spun out of Western Digital. Look at that price chart. I think like a thousand a thousand% or so over the past um over the past year and this is it. It's the you go first compute and then it's memory and then it's storage. >> Yeah. >> Uh that price action it's quite parabolic. >> You've been uh tweeting out about quite a lot of this stuff, haven't you? Sideline >> in Hey guys. if you're in if you're in crypto pivot that's the [laughter] point. >> So um from a fundamental point of view um there's also a supply chalk with sand supply shock I should say with SanDisk. Um revenue grew by 61% year-over-year to three just over $3 billion and that's a 64% surge in data center revenue you won't be surprised to hear. >> Yeah. And the stock is now in price discovery mode. It's gone near vertical. Uh it's broken all historical resistance levels and it's supported by an adjusted adjusted gross margin of 51.1%. >> Which is nearly 10% higher than many analyst projections. >> Okay. And we recently did a uh a video on this over on CB Financedeed, our finance channel. Um, so if you haven't checked that out, >> yeah, on the memory shortage and it's actually quite interesting in terms of like how valuable memory devices have got, you know, memory chips have become because of the AI surge itself and to the extent this is going to mean that more expensive phones, more expensive memory for people who buy gaming machines, etc. So, it's crazy what's going on and how much the AI spend is leading to an increase in the cost of memory. >> Yeah. Pushing up prices across the board. It's interesting, isn't it? cuz when you when you mentioned SanDisk, I was like, where have I heard that before? And it's like, you know, it's just one of those names that you sort of see if you pop into an electronic shop or something like that to buy some, you know, like a memory stick or something boring. And it never really sort of occurred to me that there's probably, you know, there could be a very profitable company behind all this. >> Yeah. Well, those hedge funds made a,000% returns whilst we were betting on digital gold and internet money. So, you know, good for them. Yeah, >> but if you guys want to trade uh these stocks or indeed metals and this AIB to trade uh and you want to do it through a crypto exchange, the best place to do that is over on BitGet. This is our next brand partner. And a bit you can you can exchange your crypto for gold. You can just send your USDT there and you can swap a tokenized gold and use leverage for that as well. And you can trade up to 500 times leverage. If it wasn't risky enough, you can go and bet 500 times leverage on the silver right now. on the silver recovery. >> Mhm. >> And enjoy deep liquidity and low slippage. Uh so in order to do that, all you need to do is scan the QR code over there or hit the link down in the description. And there's also a user offering uh bonuses on uh there as well of up to $50,000 subject to meeting deposit requirements. So yeah, if you guys don't have a BitKit account, scan the QR code link down below and go and trade some stocks and copper. >> Fantastic. Fantastic. Okay. Now, uh if you were watching last week's live stream, you may have uh you may remember that we got something of a bombshell dropped on us by Lewis. Um he we we went over to him on the TA and basically he announced that he'd sold out of crypto and into metals. Um which was >> quite a surprise. >> Yeah, it's um as someone was saying in the comments earlier, it would have been great if we had some footage of us reacting to that in the studio. It's a shame we don't actually because there was quite a strong reaction to that in the studio. Um but uh yeah, so um it's about time we gave Lewis another airing. Uh perhaps he will explain himself. So uh here he is with this week's helping of >> TA. [music] [music] >> All right, guys. So, I have some pretty good news right now, which is that we might actually be getting a temporary bottom in crypto. I'll explain it very very shortly in just like one or two minutes here. And in my live stream on Thursday, I'll explain a lot more. But, um, essentially what you could see for Bitcoin is that we actually came down and we tagged this weekly low right here and we essentially came underneath of the close. If I zoom in a little bit more, and it does look like we are on our way back above it. And if we go to the 12 hour, you can see that it's setting up to form a pretty decent looking bullish candle right here with a few sweeps of the previous lows, which is also pretty good. And we have the RSI and stoastic RSI in the oversold territory, plus the MACD in the oversold territory just starting to turn up. So that's pretty decent for looking where the bottom might be. However, I will say that if we go back to the weekly chart right here and we take the Fibonacci from the bottom to the top, you can see that the 61.8 golden ratio is around $58,000. So I do think that we could go back down there eventually. And also the 200 weekly moving average is around 70. So I am sort of expecting a bounce from where we are right now. But I would say probably 84 is a good area where it might end up turning over and then going back down to either 70 or maybe even 58. But still though, the fact that we are in a place where we could get a little bit of a relief bounce is pretty nice, especially after how brutal everything's been for the past couple weeks. Also, taking a look at Ethereum, this is quite a significant area where we are around $2,000 to $2,200 where it's been a major major support multiple times and before that it was a major resistance. So, this is a really big SR flip area for Ethereum after another huge move down, you know, 33% straight down. So, I would expect somewhat of a relief rally right here, even once again if it is just short-lived. Uh, but still, that's better than down only. The only thing that is a little bit worrisome about it though is that we still haven't reached the amount of time that I believe this bare market is going to take. I do think we have many more months until it actually does really bottom out and then go up. But uh that doesn't mean that we're not going to get relief rallies along the way, right? And basically we have to look at the charts and use the best areas that we could find to uh make the best probability bets that we could come up with. And I mean the fact that if you just look at this chart, it it bounced off of this area. so many times there is a much higher probability that's going to bounce off of this area than for instance just you know like a random area up here or up here right so um yeah that's Ethereum and lastly I got to say this because I know there's going to be some comments no I did not buy any silver anywhere up here in fact I explicitly said in the stream when I said I was going into commodities and I was going into metals that I was not going into silver and I was not going to gold so I read some of the comments people oh you top blaster silver first off no I didn't thank you very much um however I will say that Maybe silver is not too bad of a play right now. Although honestly, I would probably either just stick with uh crypto and wait until that bottoms and going there because you'll get much better gains or I would be looking into the other things that I actually did mention like uranium and lithium and all the other stuff, right? Um but yeah, I just had to mention that on this stream as well or on this live. So, uh with that, I will hand it back to you guys and on Thursday I'll do another analysis like a much bigger one. So, I'll hand it back to you guys now and I'll see you later in the week. So we we pivoted back to crypto analys [laughter] crypto analysis. Great. The rotation cycle got the continues. There you go. >> I like that he I like that he had to clarify that. No, he did not get into silver at the top there. That's true. He did not he did not say silver comments that way. >> Um but uh yes, thank you very much, Lewis. All right, let's have a look at some of the best tweets of the week. >> Okay, let's start off with this one. This is from [laughter] Ah, yes. A good old cucking meme. This is gold and silver um cucking Bitcoin on the currency debasement. >> Nothing worse than sitting on the sidelines watching the debasement pump literally and figuratively. [laughter] >> Yes. Yes. Thank you. Thank you for reminding us. Okay. Uh next up we have this one from Coin Mambber. We were right. Looks like metal sellers are rotating to selling crypto. [laughter] >> There's the rotation. That was a good one. >> Oh, >> plenty of gallows humor in this one today. Okay, next up we have um Oh, right. What's going on here? >> This is the state of the trenches. So, some guy goes and tweets, I got rugged today for $37,000500. Not a fun experience. Wouldn't recommend. Then some guy responds, \"What happened?\" Then he responds, \"You got rugged, too, for the same amount. Check the Discord.\" >> Oh, wow. >> Absolute state in the trenches. >> Absolute state, bro. >> Okay. And of course, I mean, it it has to come up at some place. Uh, this is, uh, Gwart's response to it. Um, this is obviously referring to the Epstein files. One of the most dis deplorable, sadistic humans of the modern era somehow drew the line at pumping crypto tokens. Law. So, so this is an email back and forth between Jeffrey Epstein and someone >> some, yeah, some other individual. And, uh, Jeffrey responded, \"I am more than happy to fund things, but I am high-profile. I can't do be questionable ethics.\" So he he questioned the ethics of pumping coins. The most sadistic pedophile known to man has questioned the ethics of pumping and dumping cryptocurrency coins, which can only mean one thing. He's more moralistic than many of your typical Koss who dumping on their their audience members. Wow. >> Wow. Even Jeffrey Epstein wouldn't touch tokens. Okay. Um well, that says it all, doesn't it? Any uh any dates for the diary this week, Nick? >> Quite a few actually. It's a very busy week on the mac on the macro and crypto front. Firstly on the cryp on the macro fund, we've got the potential vote on the reopening today with regards to the US government. We also have ISM manufacturing PMI numbers which are very important especially if you follow Mr. Ral Paul's theory around the around the ISM um data leading to an expansion in potentially altcoins and altcoins season. This is if the ISM gets above 50 that reading. So that reading is coming out today. Keep an eye on that. Speaking of Ral Pal also did a podcast episode with him on uh the Quo Bureau podcast channel. So if you guys haven't seen that yet, go and check it out. >> Okay. >> We've also got the Clarity Act meeting in the White House. So the White House is going to try and push this forward uh in terms of a vote for the market structure bill. >> Okay. >> Tuesday, Wednesday, and Thursday, we've got a PayPal, Alphabet, and Amazon earnings. So some big earnings there from some of the MAG 7 and and PayPal. Uh so that could potentially role the e equity markets depending on what happens in terms of where it comes in accord above or below expectations. >> Okay. Uh Thursday we also um you want to be watching the US Treasury um their quarterly refunding. Uh this is when the Treasury outlines its borrowing needs. Higher issuance can spike yields and guess what? Hurt risk assets like crypto. >> Indeed it can. Well, but hey, if it's lower borrowing needs, then it can potentially bring down rates. So let's see and then Friday is the big one. Uh the employment report the NFP numbers uh we expecting 55k whereas 50k was the previous reading. So keep an eye on that guys the first one for the year. >> Okay. >> February sorry. Yeah. >> All right. Thanks for that Nick. Um so uh interesting um interesting sentiment going on in the discord. Let's just um I I was a little confused by this >> discord in the comments. You actually I'm getting them confused. Um, I'm interviewing Lewis for the Fry Station tomorrow. I I was reading that. I was thinking the Fry Station, is that a podcast or something? It's like, no, it's No, it's McDonald's. It's McDonald's. Very good. Very good. Very good one. >> Um, guy, you need to get your uh butt over to Puerto Rico. Rob has the right idea. Great spot. Have you ever been to Puerto Rico? >> No, I have not, unfortunately. No. >> It does look nice. I do I do look at Rob living his best life out there and get a little a little jealous. There's no taxes as well for US citizens who live in Puerto Rico. It's one place you can go and live as a US citizen and not pay tax. >> Yeah. Oh, Robert has a great time. He goes there, he doesn't pay tax. He does press ups. He plays volleyball on the beach and then, you know, the only the only black spot in his week is doing a live stream with uh with Ben and I and then it's back to having a great time >> and the occasional hurricane. >> And the occasional hurricane. Yeah. Um so uh also good news. Um, the UK and South Africa aren't the only places where they're stealing copper >> in Australia. >> Australia as well. And indeed, that's normal in America. Tweaker's favorite pastime. >> Jeez, guys. Really? >> So, so I mean that if that makes it all the more, you know, all the more strong an investment case for copper. People are stealing it everywhere. >> Um, >> so guys, if you guys are out of if you lost all your money in crypto and you want to go and make some gains, go and steal some copper. [laughter] Not financial advice. Please do not steal any copper or health and safety advice either. [laughter] >> Yes. Do not just with the avoidance of doubt, don't go and steal any copper from anywhere. Um bad news, it's raining in Somerset. >> Oh no. Okay. >> I have heard that it's been raining in Somerset. Fortunately, the in-laws weren't flooded. Um and then uh Brett Thompson um AI will replace Guy and Nick by year's end. You think it's going to be You can think it's going to take that long, you Brett? Just as long as it's not the AI that they have at the beginning of the stream, I don't care. [laughter] >> Yeah. >> Not those guys. >> Those images are those images are too much. Brett, you almost sound like you want that to happen. You sound like you're looking forward to that. >> You know, as our as our, you know, most reliable viewer and commenter, you you want us to be replaced by AI. Say it ain't so. Say you ain't. So, >> um Okay. And um uh always love the stream. Um Count Bureau. >> Count bureau. Okay. We could maybe if we rebranded to that that would uh you know that things talk more about metals and what have you. Counter bureau. I like it. >> Okay. Um and there was a lot of French in the uh in the comments as well. >> Someone [laughter] there was some person just commenting a lot in French which probably tells you something about where we are in the cycle. >> Um and uh >> they speak in a very weird dialect of French. What's going on here? >> Yeah. Very strange. Very strange. Um Brett says no comment. Well, that speaks volumes, Brett. Thank you very much. You'll you'll be sad when it's just AI bots chatting away. Okay. Uh Nick, we I think we said at the end of last week's stream perhaps it couldn't get worse. It did. >> We shouldn't be saying that, man. We basically we setting ourselves up for it. Let's just say now it sailor got 855 Bitcoin. Oh, sorry. I seen a comment there. Okay, >> so Sailor bought a little bit. That's great. >> So, yeah, he's still buying, man. More than last week. Still stacking. >> Saber keeps going. There we go. >> Um I I don't know whether to believe this. Good news, guys. There's a small CE gap at 107K if you go to the hourly. >> We really look we really starve for those gaps. >> Saying there's a chance. Wonderful. Wonderful. Okay, folks. Well, I mean gosh, who knows? It could get worse. It could get worse. It wouldn't surprise me at all if it does. >> It definitely could be worse. You could be mentioned in the Epstein files. And so far, I haven't seen our name there, guys. So, we we good. [laughter] >> Thank goodness for that. At last, some good news. Managed to keep my name out of the Epstein files. That is >> that's a low bar we got to cross, bro. [laughter] That's just look for anything. The silver lining somewhere, bro. >> That's the positive. Wonderful. Okay, thank you everyone for watching. We will be back next week. Let's hope the news is better, but who knows? [clears throat] Um and uh yeah, lots more content coming your way across all our other channels as well. Stay well out there and we'll see you soon. >> Keep going, guys, and huddle on. Let's go. HEAVY METAL BUREAU. LOUIS, CAN you buy my gold [music] METAL HEAD PRODUCTION TEAM? [music] >> Thank you, boys. >> Louis rugged coin [music] metal for the win. Louis is for the [music] win. Louis is for the >> So speaking of the Epstein files, do you think that Epstein was secretly Satoshi? >> Okay, that's the latest theory. Is >> that's latest theory and that it wasn't the CIA that invented Bitcoin, but Mossad? Okay. So, I basically it that you're saying what what you're saying is there could be a way for people to hate crypto even more than they already do. >> There is it's it's totally possible. It could have been perhaps invented by",
        "summary_hu": "A Bitcoin árfolyama jelentős csökkenésen ment keresztül, és a kriptovaluta közösség feszültséggel teli. Trump bejelentette, hogy Kevin Walsh-t szeretné a Fed elnökének, ami új aggodalmakat keltett a piacokon. A nemesfémek, különösen az arany és ezüst árfolyama szintén drámaian zuhant, ami jelzi az általános piaci pesszimizmust.",
        "summary_en": "Bitcoin's price has experienced a significant decline, causing tension within the cryptocurrency community. Trump announced his preference for Kevin Walsh as Fed chair, raising new concerns in the markets. Precious metals, particularly gold and silver, have also seen dramatic drops, indicating general market pessimism.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 25,
        "key_points_hu": [
            "Bitcoin árfolyama 80,000 dollár alá zuhant.",
            "Trump Kevin Walsh-t jelölte meg a Fed elnökének, amely új aggodalmakat vetett fel.",
            "A nemesfémek árfolyama, különösen az arany és ezüst, jelentős mértékben csökkent."
        ],
        "key_points_en": [
            "Bitcoin's price dropped below $80,000.",
            "Trump nominated Kevin Walsh as Fed chair, raising new concerns.",
            "Precious metals' prices, especially gold and silver, significantly declined."
        ],
        "main_topics": [
            "Bitcoin Market Collapse",
            "Fed Chair Nomination and Market Reactions"
        ]
    },
    {
        "video_id": "yLyMuI_E7qg",
        "title": "Are We Pivoting To Metals? Tune in Live!",
        "published_at": "2026-02-02T09:48:49Z",
        "sort_date": "2026-02-02",
        "url": "https://www.youtube.com/watch?v=yLyMuI_E7qg",
        "transcript": "What a surprise, guys. Yeah, you can't drop that on ice in the beginning of the stream. Really? It threw me off my game, man. >> Uh Oxford row coach has got problems of his own as well. It's almost flooding in in Oxford, but I'm drowning in bad news. Help. Well, if it's flooding, at least you at least you have some transportation on hand. You're probably the best uh best place person to deal with any flooding in Oxford. I don't know why you're complaining. It's everyone else in Oxford that's that that's got problems. Um, uh, guys rocking man boobs. >> Central banks are looking to stock up on an asset that can, you know, that that is more neutral than the US dollar. >> Exactly. Exactly. >> I'm going to let you know that I sold pretty much all of my crypto and moved it into metals and I'm going to explain why right now. >> Well, thanks for the heads up there, Lewis. I mean, that would have been great to know. It seems like that pivot to the bullion duro has gone off swimmingly.",
        "summary_hu": "A beszélgetés középpontjában a befektetési irányváltás áll a kriptovalutákról az arany és más fémek felé. A központi bankok egyre inkább olyan eszközöket keresnek, amelyek semlegesebbek a dollárnál. A narrátor elmondja, hogy a kriptovalutáit eladta, és fémekbe fektette a pénzét, amit a piaci helyzet indokolttá tesz.",
        "summary_en": "The discussion focuses on a shift in investments from cryptocurrencies to gold and other metals. Central banks are increasingly seeking assets that are more neutral than the dollar. The narrator mentions selling his cryptocurrencies and moving his funds into metals, a move justified by current market conditions.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 30,
        "key_points_hu": [
            "A központi bankok a dollárnál semlegesebb eszközöket keresnek.",
            "A narrátor eladta a kriptovalutáit, és fémekbe fektette.",
            "A piaci környezet indokolja az arany és fémek irányába történő elmozdulást."
        ],
        "key_points_en": [
            "Central banks are looking for assets that are more neutral than the dollar.",
            "The narrator sold his cryptocurrencies and invested in metals.",
            "The market conditions justify the shift towards gold and metals."
        ],
        "main_topics": [
            "Investment shifts to metals",
            "Central bank strategies"
        ]
    }
]