[
    {
        "video_id": "xOSVVuD9-_8",
        "title": "Palantir Stock FALLS Overnight Ahead of MASSIVE Earnings!",
        "published_at": "2026-02-02T03:30:00Z",
        "sort_date": "2026-02-02",
        "url": "https://www.youtube.com/watch?v=xOSVVuD9-_8",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. And holy Toledo, things are getting pretty hectic here as we're continuing to see a lot of individual names that are selling in the overnight session right now. We'll be talking about Palanteer that has been selling off uh pretty strongly um with earnings also that's going to be happening after the market. This could be a big big move here in terms of volatility. Uh and that's either a possible reversal and a nice bounce or a further breakdown. We're going to be talking about that because right now the market is very uncertain. It started with the um new Fed chair pick which I don't think was warmly welcomed by the markets. And you also see crypto that is crashing um right now as we speak and has sold off dramatically over the weekend. Uh so if you're a new or returning viewer, hit that like button, subscribe for daily videos. Let's pop it up on the screen here. We're talking about first Palanteer. That's because we got earnings tomorrow. Currently it's at 14393. Now, Palanteer is about down about 2% here in the overnight session. Uh underneath its 50 and most importantly, it's underneath its 200 now. So, underneath its 200 Palunteer right here has lost this 150 area of support. This is the area right here which I was hopefully expecting a bounce, but unfortunately that did not follow through. We see a further breakdown here. And what's really really on the line now is with Palunteer's earnings that's happening postmarket. You have the estimated earnings per share is going to be at 23 cents normalized cori correlated with 1.34 billion in terms of revenue. One thing with Palanteer though is that they are priced for perfection which means that if for some reason people don't like Palanteer's earnings or they find any particular little reason to kind of further uh dramify this sell-off uh that could happen. It could be extended. Um, but one thing that's good for Palanteer is that historically it has always came out with some pretty slam dunk earnings. Um, so if they can try to justify the valuation, if they can bring some optimism back into the AI trade, especially on the software side of things, that could be bullish for Palanteer. Could we get a nice reversal here? And we have some other big key players that will be releasing earnings this week. We'll be talking about that in a few moments. So on a technical perspective, Palance here is just kind of furthering [clears throat] the break down here, you know, on this dip. These this could be smart money zones, you know, as we enter. However, it just depends with how extended the sell-off is going to uh fall down before we actually achieve a true bottom. Um right here, you see lots of money is also being thrown around with volatility playing on earnings. On Friday here, someone sold 6 million worth of Palanteer Palunteer puts, the 140 puts. So it's pretty crazy. Uh so we'll see what happens. Talking about the general market, talking about silver and gold, which also completely crashed and corrected. I don't know if you call it crash, but immense amount of profit taking was down like 30%. So we'll be talking about that. Uh futures are down right now. In terms of the actual SPY, it's currently at 686 down about 085%. This could open up here the S&P 500 in the mid the mid 6800s. Last time we kind of had this strong sell-off here or this big move down, we saw a nice support area and a bounce around literally right at that 6,800. So, we'll be looking at that for some support because over the last, you know, kind of few months here, that 6,800 has been a pretty strong support level for the actual index. So, we'll be looking at that as a possible relief area to see if we do get any actual relief. Uh, in terms of Bitcoin, let's talk about that. in crypto completely completely losing a lot of support. Bitcoin comes down here currently at 76,000 and looking at Ethereum right here to all those ETH bulls. They are just getting destroyed right now. The shorts have a strong handle at 2200. When I saw this down over 21% over the last week, I was like, \"Wow, this lost some insane support and sold off quite quickly.\" What does that mean for the BMR shareholders further paid? BMR now is at 2139. This is at a very interesting spot in terms of possibly going long. Like I said, who knows here? But back here last November, BMR had a reversal right here kind of in the low 20s right here at 24 basically, you know. So now it's going to be opening up here at 21. We'll see what happens. We'll be definitely keeping this on the radar. And how far is this cryptocurrency selloff going to take us? Uh, in terms of other things that are happening too, uh, we now have Wall Street turn it attention to Nvidia. I don't know if you saw clips about this, questioning over its kind of uh, investment with Open AI saying that there wasn't 100% certainty right here. Basically, this is what it is right here that Nvidia plans to pour 100 billion into open AI. Um basically Jensen expressed a little bit of doubt saying there was no certainty behind that actual deal. So that is another big thing. You also had a hotter inflationary report that came out. So all these things that are kind of piling on top of each other are some of these big key reasons on why we're continuing to see a lot of uncertainty and a sell-off that's occurring right now. Now big things that are also happening here this Friday. We're going to get the jobs report and we got key earnings throughout the whole week. The jobs report here is going to be looking at signs of the labor market. Now, we have been seeing some labor market relief, which has important uh but if we continue to see signs of weakening that could further uh raise the probability of interest rate cuts since they were just held steady this last uh week. Looking here, looking for strength, I think will also still just be important. Uh but big earnings that are going to be coming out. You have Monday Pale and Cheers earnings. We're talking about that. You got Disney. Uh in terms of Tuesday, you got AMD on Wednesday. You got Google. So some really really big names. You got the ADP employment report on Wednesday too. And then the US employment report for January that is going to be on Friday. So looking at some of these big key macroeconomic pieces of information, this could be another very very wild week. We will see what happens. Um, some of the individual names of course that I'm still very interested in long in in terms of the AI trade and I really like the industry behind this right now is looking at Cipher. I mean, Cipher is now at 1490 and there is some strong support here for Cipher over the last 3 months. This is back in November here after we had that last selloff too where Cipher here found some good support and relief kind of in the mid13s and a nice bounce at the 14s. We'll see if that holds because that could easily likely be tested. And you see I ran here that is back down to the $50 zone when this was just at 63. So a lot of these stocks especially these high beta names are going to be very volatile and if they break down they could fall faster than a lot of these other more mag 7 names or you know ETFs like the VU and stuff like that. Hood underneath 100 currently at 9479. You see SoFi at 22 right now also selling off at a very rapid pace. Now SoFi is very interesting because they actually had a really good earnings report. I believe I didn't listen or look at the full thing, but the headlines people are questioning on why SoFi is being sold off right here after a pretty strong earnings. Let me know what you think if you know anything down in the comments. I have to do some more research on it. But at 2219 right now, what you can see is SoFi is just getting a ton of disrespect. Uh in terms of Agentic AI, you got Zetta here now down at 18 and you got Path right here now down at 1236. So these of course could move down further, but these are going to be testing some key some key support areas right here. And you know if people are long on this and there's a nice bounce here in the near future, they could be getting in at some extremely attractive prices all depending on your position, your time frame, and how things will be looking out in terms of the economy. Why we're seeing a lot of also uncertainty here with the Fed pick is because typically with his previous Fed with the Fed with their involvement within the Fed industry is he is more of a promoter on kind of quantitative tightening and kind of letting the system do what it needs to do. And I I don't think intercepting with the system as much. And why the market does not like that is because I think they were were surprised. Number one, they were surprised that Trump was going to pick him. I think because they were looking for someone that was going to be cutting rates and listening to everything that he had to say. Even though the Fed is supposed to be non, you know, not political at all, not politically biased or persuaded. Um, that's just what they are. That's kind of what it's leading to right now, especially with this administration. So, it was a surprising pick and typically he's more of a not put more money into the system, cut money out. Um, and maybe that is what we need right now. Maybe we do need to go through that pain. uh to kind of get a reset here in the markets because they have been pretty well extended. We'll see what happens. But nonetheless, you know, that whole five to 10% breakdown in the S&P 500, I think it's on the table. It can definitely happen here in the short term. Of course, in the long term, I'm remaining bullish, but de-risking, taking away a lot of exposure to the upside here until we see some more confidence that gets back into the market or depending on what's going to happen tomorrow. I think tomorrow will be a really interesting way on how the tone is going to be set for the week. Uh cuz you got crazy things that are happening like with commodities and even like gold and silver that crashed about 30%. You know, what kind of a relief bounce are they going to get or is that going to further break down? So, let me know what you think down in the comments. We'll be keeping an eye on it. Feel so bad for these BMR holders now down at 2120. That is quite insane. Uh and even hood under 100. That's pretty crazy to see there. So, some of these recoveries could be awesome once we see the move, but it's just waiting to see when is that move actually going to happen. So, peace out. Take care. I'll catch you guys later."
    }
]