[
    {
        "video_id": "bEWTL5Ao3oI",
        "title": "Bitcoin Reversal Starting Now? How High Can Crypto Pump",
        "published_at": "2026-02-02T22:31:19Z",
        "sort_date": "2026-02-02",
        "url": "https://www.youtube.com/watch?v=bEWTL5Ao3oI",
        "transcript": "Okay, Bitcoins last stand. Bitcoin, will you do it? Will you do it to us? Let's get a few people in the chat here and then we will get going. Today we have a very, very special day because it's not often that you encounter one of the absolute biggest levels in all of Bitcoin's history. And that is exactly where we're at. We're essentially at the moment at the level that would confirm or deny whether this administration has added almost any value to Bitcoin and crypto as an asset class as measured in US dollars. And that is because we are at by far one of the most important levels we've ever gotten to, which is of course, as you know, the weekly support. And here you can see under this it gets pretty brutal. To be fair, to be fair to us, to be fair to the crypto folks, there's a lot of room under here. And there are a lot of levels and we're going to go through all of them here. But this is really important. We need to see this level hold. This is the most important level on the chart. And this one is likely to likely to give us some kind of mean reversion. And if it doesn't, I think it's a very very strong signal as to where we are as an industry. Now we have gone through a huge huge correction already. We have seen Bitcoin already come down almost almost to over 50 over 40% almost 41% or 42%. Which is not too far off from the 50% or so uh 2019 mean reversion that a lot of us are targeting or hoping for. But it's important that we realize that we must take this level by level. We must just be objective. We must understand that Bitcoin is actually functioning much the same as every other asset. We have gold, silver, Bitcoin, all the same. All the same charts today. Now, of course, they weren't the same over the last few months. That's a different story. But today, look at them. They are identical. Identical. So, there is a massive riskoff happening. Of course, S&P is still doing okay here, but there is a massive riskoff happening. And Bitcoin is a part of that. And so the question is why is this happening? And we're going to talk about that today because we've uh we've managed to put up some pretty pretty impressive numbers. Look at this. We have our new sacrifice. Our new sacrifice for 2026 is Mr. Tom Lee. We thank you for your sacrifice, Mr. Tom Lee. We thank you for your sacrifice. Every year we must sacrifice one of our best and brightest. And this time it is Tom Lee who has the single biggest draw down, maybe the single biggest draw down of any publicly traded vehicle in history. Um, we know that no, I guess Luna is technically more, but he's now up there. He's on the list. He's a top five uh effective uh he's one of the biggest losers, right? If you remember that show, the biggest loser, it's Tom Lee. Mr. Tom Lee, shout out to you. Uh, of course, I don't think that this will end this way. He's just gonna diamond hand. He's going to keep doubling down. If you know anything about Tom Lee, that's how he does things. He's just going to diamond hand and diamond hand and diamond hand. And if you were here in 2018, you would have had flashbacks because all of 2018, I remembered as Bitcoin was collapsing from 20K all the way down to its eventual target of 3K. Every day we'd have Tom Lee come on CNBC and say, \"I think the thing will rip to 100K any day. Any day.\" And so I was like very not a fan of Tom Lee for many years because of that because I ended up diamond handing to zero pretty much listening to him. But in the end, he won, right? Because if you diamond hand in markets that are measured against US dollars where they're going to print dollars and the markets will eventually go up, you'll eventually be proven right. And that's why the Moonboys and the delusional bulls win in the end. But the point is, I think we all we are all delusional bulls. That's the point. We are all mega bulls. We wouldn't be here. You wouldn't be here on Elio Trades smashing that like button like you're about to. One, two, three, smash. Please. Come on. There's only five of us left. Smash the like button. All five of us. So, I better see at least five likes on this video. I appreciate you guys. Okay, let's all get together. Let's make as much money as we can each and every day. Let's crush it. Let's buy the lows. Whether we're here or whether there are ultimate lows below this, no one can say. Obviously, doesn't look so good today, but let's make the most amount of money on the way down, on the way up. Let's run it back and let's stay objective. That's the game. I I told you guys on the last video, I have a new name. I have a new bio, Seeking Truth with Convexity. And this is the name of the game because just blind excitement for crypto taking over, it didn't work for us last cycle. So, we got to switch it up and we got to iterate. And that's what we're doing right now. Now, speaking of switching up and iterating, uh, I traded a lot of metals over the last month and it went really, really well. And we said on the last video we put up, hey, look, what happened here on gold and silver is either a broken parabola or this is a flush and we will see more legs in the future. And I said that I was going to be entering silver at 85 and cutting if it went below 85. What's funny is I was sitting there on my desk at 300 p.m. yesterday waiting to buy the open on silver at $85 and it it dumped so fast I couldn't even buy it. It dumped so fast here. Let me get Sorry, let me get my corner going. Sorry, I realize I'm not showing the whole screen. Silver dumped so fast I couldn't even buy it. It dumped down to uh all the way down to 70. So that wasn't a good sign. right at the open. It was just such ridiculous uh relentless selling. So, I know if I was waiting there and was trying to buy it, I know no one here on the channel could have bought it. So, in the end, that trade idea gets shelfd. But that's the whole thing. We're looking for very simple, high risk or high reward, very very measured risk trade setups in this environment, right? And we're looking to trade and use trend as our sanity check, right? I think as a sanity check here, it's worth knowing that essentially it's worth knowing that me go ahead and fix this. The chat is a little less cumbersome here. Maybe I could do it so that it's uh the font's a little smaller. Go ahead and drop that font down. Drop that font down. Bad boy. Yeah, let's put this at like 12. No, it's too small. Let's go 16. All right, that's good. Okay. Um Okay, so looking at gold, it looks bad, right? It looks bad and it looks like the parabola is definitely broken for a while, but I don't think this is it for gold, right? This is a a significant sell-off. But if you remember Bitcoin in 2017 or any kind of parabolic Bitcoin run, you get these washes, you get these leverage rinses, and then they can keep going. The thing is, we just need to wait. So, I've been flat on gold. I exited gold uh over 5,000 and I was waiting to re-enter but I haven't gotten the signal yet. So, we're going to see if we can build some nice structure here, but for now, flat on metals. Uh and Bitcoin, let's go ahead and get into it because this is like this is what's been going on on Bitcoin, right? Here is my here is my multi-time frame chart on Bitcoin. This is how I I I mostly look at it when I'm trading is I have the the 15-second, the 1 minute, and the 15-minute. And as you can see here, Bitcoin's been doing this thing where it'll kind of dump down. Um, it'll have this level, dump down, touch it again, and then completely collapse. Then it'll have some kind of intermediate level, touch it, and then collapse. Intermediate level, touch it, and then collapse. And then now we're seeing, hey, look, is this is it going to do it to us again? Is it going to do it to us again? We don't know. We got to find out. But that's been the it's been the pattern over the last few days. It's been one of the nastiest flushes. I think it feels a little different. It feels a little more resilient, and the 74K level is a little stronger. So, I'm not expecting it to just give up. I wouldn't be surprised if we drifted up towards, you know, even 80K at least, maybe even this uh this prior uh breakdown level, you know, but at some point there's going to be a vicious bare market rally. Like that's just how bare markets are because what happens is over time everyone gets so negative and so short that everyone starts to short and then there's a lot of money that's can be made in liquidating the shorts on the way up. So you just got to know if you're if you're just thinking you can flip short here and make a lot of money that the time to do that was was up here in the housekeeping zone, right? We made the housekeeping zone video up here while I was on vacation. If you wanted to sell, if you wanted to get short exposure, that was the time or before any of these like major sell-offs. Right now, the RNR is just a little bit kooky because these levels are actually kind of chewy. Um, if you look here, um, if you look here, Bitcoin actually has a lot of levels that it's that it's got supported under it right now. So, let me go ahead and show you because this is this is where you get the 73 or 73K high, right, from the initial runup from uh the ETFs that topped in March of 2024. Then we get these lower highs all the way down. Then we get the breakout level or or then we even get the 69K level from the prior cycle. So, we have a lot of these levels right under where we're at. And some of them, at least one of them, I'd imagine would have some spring to it, would give some significant buyer support. So, if we're not already there where essentially the risk for for shorting has been taken down, I think we're close to some chewiness where I don't think it's just going to be one of these just like straight straight shots down. That that would be absolutely insane. If that happens, like we need to have a real talk here because that's crazy and we need to really evaluate the state of crypto for now. We've had a selloff. We've had the knife has fallen and it would make sense that there would be some kind of mean reversion here. we we should see some kind of, you know, chop PVP at least at least. If not, it would be really nice to see Bitcoin start to reclaim some of these levels and at least maybe go and try to reclaim maybe try to push back up into the '9s or something like that. I'd be shocked if we just plummeted through. So, that's where I'm at. I think the money, the easy money shorting has been made and now we got to take it level by level. Um, I will say though, if we give up this 74k level, it's not nice. It's not pretty. We would have to regain it very quickly. we'd want to see, you know, a spring down and a regain pretty quickly. Um, and if we then regained it, that would be good, right? Because we could see some fake outs. Again, the market is just full of PVP leverage trading. So, these levels can get violated and and retaken very quickly. But, it's important to know that if we sustainably go under 74K and specifically under 69K here, it looks like this is the the the really big next level of support. Of course, you have the the 200E moving average. Again, uh that's that's where a lot of people are saying, \"Hey, we have to revisit that.\" But last bare market, if you remember, we actually went under the 200 week, right? We actually went down to to like under the prior cycle all-time high. So, these are there's no rules here. There's no rules. We just have to take it level by level. And now is not the time for, but it's not the time also for delusional um bear bare delusions because we've just gotten a nasty disgusting uh like collapse here. So, this is where we're at. You know, Bitcoin needs to make a stand. It needs to have its last stand. It needs to fight here and we need to see some buyers step in. The reason why things have gotten so bad in my opinion is this man. And let's talk about this because uh this guy got nominated and then everything just went straight down. Like straight down, right? Um and and that, my friends, is is a signal, right? It's a signal at the very least that the market does not know how to sort of underwrite this guy. The market doesn't know what this guy Kevin Walsh is going to do. Okay. So, I'm going to play some clips here and we're going to go through them because I think it's actually kind of important that you understand why the markets are freaking out and you understand that we will not have clarity on what this guy's actually going to do in his uh in his office or in his position for at least 5 months or so because he takes office in May and he probably won't have his first presser or FOMC I think until June and we won't really get a feel for what this guy wants to do. Now, it might be helpful if he comes out and he talks to the public and he does some kind of address. Trump will probably have him do that. We know that low interest rates are part of the deal, but we also you have to hear what he has to say because it does bring into a question a few things and I want to pull this apart, right? Because he likes Bitcoin, but I think people need to read through the lines. And I think these types of statements are what the like this is why the market's freaking out. Listen to this. I did a video actually about six months ago or three months ago on Kevin Walsh and why the market spazzed out when he took the lead in Poly Market um all those months ago. Let me see if I can bring that video uh that Poly Market up. Um uh okay. Yeah, market Kevin or Fed share. I guess that market is is done. Um, so yeah, but anyway, I did a video on this uh a few months ago. Anyway, so let's get back to it because this is actually no longer meaningful. Um, and we'll listen to this clip and then we'll go through it together. Okay. >> Um, you made reference to Bitcoin and I thought I heard a little bit of condescension that people are buying Bitcoin and these things. >> But doesn't it re Charlie Mer, this is two or three years before he died. Charlie Munger attacked Bitcoin. He called it evil in part because it would begin to undermine the Fed's ability to manage the economy >> or Yes. Okay. So, this is key, right? because he's about to say something super pro Bitcoin, but I want you to think about it not just on its first blush, not just the first impressions, but think about what he's saying, right? Listen to this. And remember, he's not the guy making the decisions at this moment. Okay, so listen to this. He says Charlie Munger says it's evil. What do you say? >> Or it could provide market discipline or it could tell the world that things need to be fixed. >> It could tell the world that things need to be fixed. It could it could provide market discipline. He's not saying Bitcoin's the savior. It's not here to fix everything. He's saying if Bitcoin effectively what he's saying is if Bitcoin's going up, it means that the Fed policy is wrong. Right? That's what he's saying. That's what he's saying. So that's what I think that people even though he's saying something positive about Bitcoin, he's also making a point that Bitcoin is actually calling the bluff of the Fed and saying actually you're doing it wrong. Actually, we're the cop on the beat. giving you a sense of reality of what the Fed's actual impact is. Think about what he's saying on a deeper level. >> Uh, Bitcoin does not make you nervous. >> Uh, Bitcoin does not make me nervous. I can hearken back to a uh a dinner I had here in 2011 um with a someone who is another guest on your show. I won't say his name. Um Um Okay. I just did Mark Andre who showed me the white paper. That was the original white paper. I wish I had understood as clearly as he did how transformative Bitcoin and this new technology would be. Uh Bitcoin doesn't trouble me. I think of it as an important asset that can help inform policy makers when they're doing things right and wrong. >> Okay, this is key. He's not troubled by Bitcoin because Bitcoin isn't doing anything. It's just reflecting the policy decisions. And he said when they're doing something right and wrong, right? Bitcoin wouldn't pump because they're doing something right. He's essentially saying, read between the lines, that Bitcoin is effectively going up if they're doing something wrong. Listen, >> um it is not a substitute to the dollar. I think it can often be a very good policeman for policy. And if I were to speak more broadly to what did Charlie Mer and others perhaps have in mind, um there is a proliferation of securities that go under all sorts of names. Many if not most of them are not worth what they're might be being traded for. So what did uh Charlie say and maybe his his pal Warren say? There's the innovators, the imitators, and the incompetence. they're real innovators that are happening in and around that new technology. And what I would try to impart towards um businesses and bankers is that the underlying technology that Mark showed me in that white paper or tried to show me in that white paper, it's just software. It's just the newest, coolest software that will provide us an ability to do things that we could never have done before. >> So there you get it. He gets the tech, right? He gets the tech wholeheartedly and he likes the tech, but he's not saying that he thinks Bitcoin is the answer. Right? This is a guy who's saying the Bitcoin is effectively reflecting policy errors at the Fed. And I think that's what the market is so spooked about is that effectively this guy saying that Bitcoin goes up in response to Fed policy errors, which is kind of what we talk about every single day on this channel. I mean it's the core thesis around Bitcoin is that the Fed is screwing up. In the Genesis block you have an article that says Chancellor on the brink of second bailout for the banks. This is 100% a technology designed in response to money printing and irresponsible management at central banks. There is no two ways about it. Now the flip side of this is that just cuz he talks a tough game doesn't mean that he can change the gravity of the situation. Right? He can't change the reality that effectively this is how it works. This is how the markets function, right? He can't change that just because he talks a tough game. You better believe Jerome Powell knew the same thing. So I think there you have the attitude and you have the overall statements being made effectively as a campaigner for the job. He's obviously a smart guy. Jerome Powell's a smart guy. But in the end, you can't change gravity. You can't make up down. You can't make blue red. And you can't make a system that is $ 38 trillion in debt all of a sudden magically a responsible fiscal spender. You can't make it so that the US spends less than it makes and then the trains keep running. You can't make everything just magically fix itself. So, will they still stimulate? Will they still effectively provide necessary liquidity to banks when they need to? Of course. Will they smash rates down to zero? Of course. Will they just crank on a free money machine glitch in the matrix? No, they won't do that. And Jerome Powell wasn't going to do that either. No one was going to do that. So, I think there's just a question of expectations right now. And then we just have this big bucket of unknowns. We don't know what this guy's going to do. And that's what's causing the markets to spaz and everything to sell off. And so, gold freaked out. It's where most of the profits and most of the excitement were over the last month. It sold off as soon as we heard about this guy. As soon as we heard about this guy, Bitcoin sold off. In the end, the market is just dealing with a lot of unknowns. And in a period where the market's dealing with a lot of unknowns, you have to take a more cautious stance, right? Have to take a cautious stance. Once we got this and and I told you guys for months we were going to come up, we're going to do our housekeeping in the housekeeping zone and if we failed to keep the housekeeping zone, it didn't look good. And we failed. That's just the reality. So now we take it level by level. But I will say there are some exciting things happening in the altcoin space. And it's worth understanding that at any moment it's easy to become overly bearish, to become overly cynical. But it's also easy to become uh to find the things that actually hold water and are actually significant throughout the bare market. And I believe that revenue generating protocols that hold their muster that manage to keep their stuff together throughout the bare market regardless of bull or bear conditions, those are going to be the ones that are valuable not just in the next bull run, but throughout the history of crypto. That's what we want to look at and we're going to be talking about some of those today. So, even though it's very tempting to look at all of this and just say we're throwing out the baby with the bathwater, it's very important to realize that bare markets are where you get rich. Bare markets are where you actually get rich because stuff becomes so distressed, so cheap, and you're able to see the teams that keep chugging, that keep providing value, and that are actually able to hold and grow during very tough conditions. A smooth sea does not make a good sailor. A smooth sea does not make a good sailor. Now, I did want to say here, uh, our markets are not the only ones. We also have coldblooded Schiller who host I'm hoping to get on the show soon. He's an absolute legend of trading. He said, \"Look, there's these large slowdowns happening in mainstream markets, but it's not in and of itself guarantee that things will sell off, but he's saying there's this sort of growing bearish divergence here on the S&P. Uh we've seen a lot of people calling for the S&P to correct. Uh that seems like it's probably not too far off in the distance. Everything seems like it's correcting. Typical four-year cycle stuff. Again, it's a little bit disappointing to see the four-year cycle governs everything. But it's also a little bit refreshing because we were saying, \"Hey, look, what might offset this is that we have all this new liquidity coming. We have zero interest rates coming.\" Well, guess what? They haven't come yet. They have not arrived yet. So, all the stuff we're excited about, again, those things will be reflected in the charts as soon as they start happening, which is why I'm pivoting my system to being extremely objective and extreme essentially reactive more than predictive because the charts will often reflect the most important news when it actually happens. And when we start seeing a rotation into a deeper liquidity environment, we will not miss it. We will be the first ones there. But it's important to realize that that liquidity has not come. I think there was a post here um by Ral Pal uh where he went through and he showed effectively um the updated the updated sort of uh super cycle macro liquidity cycle uh data, right? and he's showing here that the liquidity in the US is actually sunken into the start of 2026. Let me bring this up a little bigger. Um you can see here that the macro liquidity is actually not not growing right now. It's kind of tapering off. You can see that throughout 2025 it's been stagnant. Um and then you can also see that the uh ISM is still not above 50 durably, right? you you can see that I will say that these are the core drivers of the super cycle theory of the five-year cycle theory and if these things reacelerate we might see things pick up faster but we just haven't seen them yet and that's why I think going forward it just doesn't even make sense to factor stuff in in a predictive lens because in the end saying oh when liquidity speeds up we will have higher prices well you don't need to predict it you can just wait for liquidity to start gassing up and then react and so that's where I think that The most EV is going to happen on this channel with rebuilding our trading system. We'll still find the best narratives. We're going to talk about them today because there are some really compelling use cases and really compelling projects in crypto right now. And when the liquidity hits, they're going to go bananas. But during the bare market, they could be really good DCAs and accumulations. So, the goal is to maximize profitability DCA and accumulate the good stuff and make sure that when the market does eventually uh start to find its footing that we are well positioned in the good stuff. that's the same as it all as it ever was. But this time I think we have some really compelling stuff to look at. So um that's where I think hey we can predict uh we can try to predict things or we can try to react to things. And as you can see uh it might be happening right now. That's the thing is it might be happening right now. What we saw I think was a spasm like a spasm response to this guy Kevin Worsh but now we also have this look at this. We have Fou here macro GCR. Uh by far the like I think the best uh commentator on macro is Viao because he takes these kind of very disperate concepts and he makes them makes them easy to uh to nibble on. Uh they have a podcast as well called Forward Guidance which I cannot wait to uh see their next episode of. But this uh he shows that the ISM is actually accelerating and we're finally getting a a rating over 50 as of January 2026. So we've been predicting that the ISM would jump. We've been hoping. We've been praying. But now we're seeing as of this morning that the ISM is starting to show signs of acceleration and expansion. Now again, the good part about this is that these will be reflected in the charts. We do not have to predict how this affects Bitcoin, how this affects crypto. There's a lot of overhang right now in crypto. Stuff like this, I'm telling you, stuff like this, where's where is it? Uh stuff like this is bad for the industry. I'm just going to tell you straight up, the DAT thing, the uh Micro Strategy, uh Bitmine, all of these vehicles, they actually present centralization and overhang risk to crypto. If you take a step back, we were all like buzzing on a high when we saw that people were going to start buying our bags in mass. But really, that's not what crypto was all about. It was about giving the little guys access to decentralized networks that would take over the world. It wasn't about begging the government and begging big corporations to pump our bags. And it became that. And honestly, it became I don't want to swear, but it it became some absolutely the opposite of some alpha male stuff. Okay? You know what I'm saying? Opposite. Okay? That is not the point of crypto. The point of crypto is we made badass stuff and it took over and we got to buy early. Begging for this type of stuff is not it. It's just not it. Um Michael Sailor, I think, presents just as much risk to Bitcoin as as Benefit, right? Um maybe more. And so when you see things like as things get, you know, dicey like this, people are worried. are they gonna have to sell? So, that's just the reality. Now, with those removed and once we get a little bit past this shaky moment, oh, what's the Fed share going to do? What's Kevin Worsh's policies actually going to be? What is the liquidity environment going to be? There is a very decent case for 2026 shaping up to be bullish. But we just simply have to embrace the fact that the charts are screaming at us that it's just not bullish yet. And that's okay. That's that's just it's just okay. It's okay for things to not be bullish yet. But what we have to know is that we will be able to find out and and we'll be able to realize when they're bullish. We don't need to wait for stuff to go up here anymore. Like we don't need for it to go up here to know that it's a bull market, right? We don't need 120 $130,000 Bitcoin to say, \"Oh, wow. It's bullish.\" No, we don't need that. As soon as we start getting above key levels, we can start getting a lot more excited, right? We can start getting a lot more excited. Watch this. Very simple. We have here this this wick low from from the last cascade at about 80K, right? we get above that, that's a good sign. That's a good sign. And you could start punting knowing that if it gets below that again, you can just get out. You just need to be nimble with it. You need to have an if then way of investing. Or you just DCA and know that in 5 10 years it'll be higher. That's fine. But if you're here in the bare market, you're still grinding every single day like like those like smashers, those like button smashers that I know you're watching this right now. Smash the like, please. We need to we need to get the vibes going here. We're we're not just going to sulk the bare market. We're going to get ahead of this one. And there are ways to do it. I promise you that. Okay? Because there are trades that are still firing, right? There is money to be made. I'm in groups of people. We're making money every single day trying to trade the markets. You're not an active trader. That's fine. There's still altcoins going up. There's metals going up. There's ways to trade and make money. We're not going to we're not going to have a pity party. We're going to make money. We're going to get back on the horse. Okay? Uh and the way we do that is with an objective system. That's how we do that. Very simple objective system. If we get above this wick low, this this recent collapse of 80K, that's a good sign, right? That's at least a first level. If we get above this level, back into the housekeeping zone above 94K, right? That's a very, very good sign. Especially if we hold that, that would be very bullish, right? That would mean that we're trying back for 100. You know, that would be exciting. But again, if we then lose it, you just have to be real. That's a bad sign, right? So, you just got to take each signal as red light, green light. It's not going to be hard. Simplify it, but be objective. Okay? We will see the liquidity hit the tape. We will see it right here on the charts. We don't need to guess. We don't need to quantificate. What I will say is what's happening at Hyperlquid is the best story in crypto. It's the best story in all of crypto. And I showed this chart um I showed this chart here uh which is that you have the uh hyperlquid HIP3i. Essentially, this is the stocks, metals, uh commodities, private market deals. This is everything that's non-crypto HIPP3. There's some cryptos in here, but it's mostly the non-crypto stuff. You have um foreign exchange, you have uh equities, you have uh indices, you have metals, you have stuff that has nothing to do with Bitcoin. Bitcoin dumps, this stuff does not dump, right? That's like the translation. So, if you have a market where people are trading in USDC and they're trading against pairs that are non bitcoin, that are non-crypto and this is the way the chart looks, then you have a product that's growth curve has nothing to do and cannot be hurt by a cryptobar market. That's what's so exciting about this. You're looking at a proof of a crypto product that is a better financial experience, a better trading experience, and that's why people are flocking to it because you get leverage in huge quantities. You get no KYC, you get instant settlement, and you get 100% possession of your assets at all times. Those are all magnificent steps forward. So, this is why Hyperlid is so interesting in this bare market. It might have been, it might be the first asset that has cracked the Bitcoin bare market code of being able to say, \"Hey, we're able to provide value, rain or shine.\" And that's what's exciting about this. Again, it's worth being very skeptical because there's never been an altcoin that has survived and has thrived during a Bitcoin bare market. So, we need to keep that in mind that it's still the case. Still the case that we've never seen that. Um, however, if you're not following Flood, he's like the the captain of of uh bull posting uh for Hyperlid. So, definitely check him out. Now, uh, he posted this and this one really got me because Salana was the itcoin. It was the Ethereum killer, but it kind of has stumbled around trying to get ahead of this narrative that it's just a memecoin casino. And you see here that hype against Salana is starting to break out again and it is by far the stronger tokens, especially now. So I think that if you're going to look at which coin is the coin to really be focused on for the next period um undoubtedly this cycle the first year it was all about Salana after March of 2024 or really after March of 2024 if you pivoted into hyperl that would have been the smart move that that would have been the smarter move cuz Salana barely got above those March 2024 high it did but not not in a meaningful way and it would have been better to pivot to hyperlid right and hype is currently the zeitgeist of crypto and it's always important to know where the relative strength is. Okay, Hyperlquid is that thing. Now, Salana is still an amazing project. It is and I believe that it will be the one of the best all-purpose chains. However, it is still competing right now for an identity against an all-purpose blockchain. That said, it very clearly has like the best rails to serve consumer products to retail. And that's why all of the builders that are making the most uh high profitability the the highest profitability applications are on Salana. Speaking of that, uh Jupiter, which this is uh this channel is partnered with Jupiter. Shout out to Jupiter for supporting the channel during the bare market. They are actually pro like without a doubt in my mind this is like the most elite team on Salana. So it's really cool to be partnered with such elite builders. The token like all tokens has struggled. But I will say the way that they're shipping is very admirable. They just essentially brought Poly Market to Salana via Jupiter. They have so many products it's hard to keep up with. Check out this little uh this little pitch they have, this little um ad they have for Poly Market on Salana. Check them out. They are absolutely crushing it. I'm going to go ahead and bring the volume down so it doesn't kill the earphone listeners. But give us a >> Poly Market is building. It's Holly Market. The whole world is going to move to pin. Killer, boys. Killer. So, shout out to Jup. Um, as you can see here, there was a little clip from my uh podcast with Meow that we did uh right back here. You can see he was sitting right back here. Um, and uh I think I think we do good uh good quality pods here. I hope you guys like them. U but definitely check out Jup. So like as far as like all coins that I think are really serving a purpose as you know I'm big on the dexes supernova black hole those are going to continue to truck the the dexes on Salana Jupiter the biggest onchain product in the world you have the pump funds which I I hate what they did to the industry but they keep being the casino of choice but really hyperlid is just such a special project right so you have Jup and hype are like very very elite to get access to and to get exposure to even and during and throughout the bare market once we do start finding a floor I expect for these to be some of the better assets. Um, and look at hype. I I keep bringing this up, but look at this thing, right? It's pumping even today. Even today, it's pumping against pretty much the entire market, right? And I called this out. I put up a tweet. I called this out in my videos. Right as we were breaking $28, I said, \"Hey, look, this is like the key level. If it's able to get back above and hold above $28, this is a huge sign that this thing wants higher and higher and higher.\" As you can see, it couldn't get above it through that throughout this early period and then it went down. Once it did get above it, it took off. And so this is it. This is the key level, right? Um, let me go ahead and remove these drawings. Um, get back to this $28 level. Keep it clean. Keep it classy. Um, but yeah, I mean, look at look at this hype chart. It's just absolutely basing off 28 and it looks like it wants to go much higher, right? Uh, of course, if the if the bare market hits even harder, it'll probably get dragged down at least momentarily. But this HIPP3 stuff means that they're making fees in USD every single day. They can buy back their token and it is not governed by the same rules of gravity or at least it shouldn't be governed by the same rules of gravity as the rest of the market. If hype can pass the test, then it means that crypto has matured significantly and in my opinion it is a massive massive badge and and achievement for this industry. So that's why I think we should all be rooting for hype to blast off and really make new highs. Um that would be amazing. Um, I'm definitely going to start concentrating a bag even above 30 bucks. Feels crazy to be buying alts right now, but it feels crazy kind of not being in hype right now. So, that's kind of how I feel about it. Um, again, uh, all disclosures, most things will dump throughout the bare market. As you guys know, this is like gun to your head. Absolute insane risk. If you're going to buy altcoins, expect them to go to zero. We know the drill. Very risky stuff. Crypto is struggling right now. Has a narrative crisis, has a liquidity crisis. So, all those things being said, I'm still excited. I'm excited about what's going on with Hyperlid. And I'm also excited about what's going on with Canton. So for all the XRP normie lovers of of the Ripple token, the banker token, this token Canton is actually doing what I think a lot of what we hoped and what we'd expected uh for even things like Ethereum to do. And that's because these guys have now this this guy on the right here is the CEO. He's talking to Kathy Wood and he says DTCC who I forget what it stands for. Um but essentially this is like the the clearing corporation. These this is the corporation that holds tradable equities when people want to trade. If you want to trade your equities on a brokerage, you give up your slip to DTCC and that's where all the trading happens. And then when you want to like remove them for cold storage or something, they come out of DTCC. But they hold over a hundred trillion dollars in assets. Just for reference, that's 10 times bigger than Black Rockck. That's 20 times bigger or so than Fidelity. This is one of the biggest institutions in the world. And they've just tokenized a subsect a sub a subsection a sub whatever. They've tokenized some assets on Canton network and this is some some treasuries, but it's clearly just a test. It's clearly a test. So the question is, is this the blockchain that they're going to be tokenizing all of crypto on? And I know what you're thinking. Oh yeah, it doesn't matter. Who cares what they're doing? Who cares about it? Utility. But is it going to pump? Is it going to pump? Right. That's all I want to know. Is it going to pump? Well, you might surprise you to know. Yeah, it's actually pumping, guys. It's up. It's up. While everything else has been going to zero, this thing has been pumping straight up. It doesn't seem to be abiding by the laws of physics here. Now, I haven't looked into the vesting. I haven't looked into the tokconomics. I don't know if there's a bunch of supply that's about to get dropped on everyone's heads, but I will say um if you watch this interview, it's pretty insane. Uh he talks with Kathy Wood and he just sort of explains like what is DTCC and what have they done, but it's actually something that is worth paying attention to because this is absolutely insane. Um to see that there's a blockchain achieving the stuff that we talk about all the time. Like we want to see a blockchain that is so valuable that it doesn't have a bare market just because Bitcoin goes down. We want to see a uh a team that ships relentlessly that constantly expands to new product markets like Juping. We want to see a project like Canton network which is actually bridging traditional finance and onchain finance and has earned the support and has the proof in the pudding of getting hopefully trillions of dollars of assets on chain. We will see how the future shakes out. But I wanted you guys to have these projects on your on your just in your head on your road map because these are in my opinion the only place you should be focusing like the only place that's that's worth focusing right now. Um not as like all-in buys but just as a way to understand hey here's what's going on anyway. Um oh yeah this is just some some some of the island drama. I don't want to say his name. Mr. J. Um I don't know. I don't even know if we want to go into this. I was just a little I don't know. This is insane. If you guys have seen this of uh the Bill Gates in in the new documents uh slipping his wife antibiotics and then uh and then getting deffriended in the process. Insane insane stuff's going on in the world, guys. Insane stuff's going on in the world. Absolutely crazy. Absolutely crazy. Um do me a favor. If you guys are seeing this, please go and pump this up. Go give this a retweet. Uh we're going to give the vibes as much of a of a regurgitation of of a revitalization as we can. We're going to hop into the chat now for a little bit of Q&A. I hope you guys have enjoyed this stream. Uh I feel like it's been our best one yet. So, I don't know what the numbers are like, but hopefully we can get some some good streaming back and forth here. Um [sighs] [gasps] problem is the masses hate crypto because they hate Trump. Um yeah, I mean, look, the Trumpification of crypto, we will see. I don't think history will be super kind to it. We'll see what we'll see how the uh the cards fall. There's still years left of this administration. So, we need to see how things shake out. Sometimes things take time. I don't know. I don't know. I know that if we lose 74K, it's not pretty. It's not pretty. Um, I also heard something about HIPP4. Yeah, they're they're shipping uh they're shipping, if you see where Hyperlid is, they shipped essentially the ability to do prediction markets. Um what's what's really interesting and I saw a uh a stat about this is even if they shipped this prediction market which they're going to do essentially HIPP4 is going to allow for you know options and predictions markets but I saw in analysis that effectively even if they took all of Poly Market's volume it would only increase their daily fees by like 5%. So, as like fun as this is to to get excited about, it doesn't actually move the needle too much for them. Um, their business around uh their business around what is it called? Uh, uh, per is really where where the big money is and especially equity and and metals pers. So, um, that's where I think the big money is. So, anyway, it's it's a cool it's a cool thing, but it's not uh as much of a needle mover. Do I think AI generated gaming will help or hurt crypto gaming? No comment. I think gaming in general is just is so volatile. It's in such a transition phase. But I think it's difficult. I think it's makes it difficult on traditional developers because essentially the moat for developing games and the competition goes up, the moat goes lower. Um I think it's the same with software development in general. Soft any kind of software development effectively is um the moes have been challenged. And I think that you're looking at an era where uh there was there was an interview with Peter Teal recently where he talks about on Joe Rogan, we spent so long in this world of of bits of computers and we've accelerated progress so aggressively in the world of computing and computing wasn't even considered a real science in the 70s and 80s. It was they called it computer science and he joked that anything that had the word science after it like political science, computer science, blank science, he said you called it blank science because it wasn't really science. um and that the real sciences were like engineering, physics, uh biology, etc. Uh and so he said that we spent so long in the world of bits and that we spent actually very comparatively little time adjusting and accelerating the world of atoms, the physical world and that right now we're in a transition period to transitioning back to accelerating the world of atoms. Now I don't know if that's true. Sounds good. It's it's interesting to think about. Certainly I'm very long robotics. I'm very long uh right now. I think it's very interesting to betting on the commodities, the metals that power the solar powered future that you know AI requires, the robotics future. Uh that's obviously going to change the way for example anyone with elderly parents. Anyway, if you were able to have a humanoid robot in the house to make sure that they didn't trip, to make sure that there was someone there, if they did trip, to pick them up, to call the police, like there is an incredible amount of elderly care and just overall outcomes, cooking, cleaning, driving that will come from self-driving vehicles and humanoid robotics. I think that the physical world is getting a huge coat of new paint. Right? That being said, uh I don't know if this is true, but if it is true, I think it just makes life in general harder on uh software developers. And as you've seen with Cloud Code, if you guys are not cloud code maxing, if you're not getting your hands dirty with this new software, you are really missing out on one of the most incredible moments, I think, in human history. And it might be one of the last moments that you have to really get ahead. Uh where just by being intellectually curious, you can really get an incredible outcome. So, I highly encourage you to do that. I'm not going to make this a whole AI thing. We can we can talk more about that stuff, but it's it's an amazing time. And I am so fascinated and so obsessed with the systems I've built and the life I'm building that is a result of having AI automate and improve every one of the processes that I hate doing in my life. Building stuff to improve that, building products for myself. You you don't have to build a product for everyone else. You build a product for yourself, right? That you're like, \"Oh, wouldn't it be great if this, if that, if that.\" Just do it. Just ask the code and see if you can figure it out. Um, and that process will make you very, very lethal in the new economy. That's what I believe. thoughts on Zcash versus Monero? I mean, this stuff, the the bullcase for Zcash in my opinion and Monero is socialism, right? And it's just too soon. It's just too soon to be getting all excited about socialism. We don't know what's going to happen on the next election. We don't know what's going to happen. Um, we do know that effectively the the Dems will likely recapture the midterm uh house control and then nothing will probably then happen from there and it'll become like a like a li a lame duck or whatever they call it. But we don't know enough about what's going to happen in the future. But we know that if we get to a point where any major governments start beginning uh widespread asset seizures, meaning, hey, if your net worth is over blank, then you need to give us a chunk of it, like after taxes, after everything. That would cause, in my opinion, a a rush to assets that are very hard to seize. And Bitcoin is hard to seize, but it's not that hard to seize because it's very public and traceable. um whereas these privacy coins are very hard to seize and I would think that that would be where I'd see the real bold case. So the real bull case for something like Zcash and Monero is you buy some of it, you you tuck it away and you hope you never ever see it go to the moon because if it does go to the moon, it probably means something very very bad is happening. Uh, but I would say if you put a few thousand bucks into Zcash and Monero and uh put it into a dusty corner of your house, keep it offline, I would say that that would be um if if this stuff happens and asset seizures do start happening, that stuff would go to the moon. I mean, that would be worth millions or billions of dollar. Like, it would be astronomical upside. Um, but it's an edge case. It's a tail risk, meaning like it's a very unlikely outcome that if it's correct, you don't need to bet heavily on it. It would go crazy, right? It would just be one of those types of schmuck insurance funds for lack of a better word. Someone said, \"No, hold pal.\" Okay, pal. Maybe pal. Maybe pal. Now, if you guys remember my content throughout the entire bull run, I said, \"Hey, look, these AI coins are pretty much meme coins with an AI flavor. And some of them do stuff and maybe it's valuable, but none of them are actually being used heavily in the AI industry.\" And so calling them AI coins, while they maybe utilized or had some connection to AI, they were no different in my mind than sort of mimetic capturing the attention of the AI industry. I don't think we'll lose 74, at least not yet. I agree. I think look, I mean, we're back up at 78, right? We're back up at 78 here. Where are we at? Where are we at? Um, and I I be drawing too much on these charts. Get this out of here. Um, uh, yeah, it looks looks all right. Looks all right for now. Looks all right. Huh. Uh, let me get back here to see the corner overlay. Um, the 1 hour looks okay. Looks like we're forming. I mean, it looks like we're bouncing off of this uh micro support here at sort of 78. And if we can make it back up here, like that's the first step. First step into uh into healing. But again, I want to be clear like the And I moved this by accident was like 744 or something. Anyway, we didn't even quite hit this. We kind of front ran it. So, it's important to realize we didn't quite get all the way down there. But more importantly, let's go to a full view of Bitcoin here. Like I said before, if you missed that part, um there are so many levels here. Stop it, bro. Stop it. Okay, there's so many levels here. We have the um like yeah, this is just the micro support here of 78, but we have this the 73K which was or the 74K, right, which was the low from last year. It was the prior high from the ETF run. Then we have this lower prior high there at 72, right? All of that sort of indigestion that we hit these levels, you know, a lot of times here. Like these are all levels that have had just a ton of price action, a ton of trading. So they're going to be chewy. They're not just going to give they're going to give speculators a reason to buy at these various levels. So I wouldn't be surprised if even if we made its way down, it was quite messy. But in the end, losing this level, this is a major major pivot point 74. We don't want to lose it, right? Um the next major major like mustold level is really this one. So it's a big it's a big way down. I know a lot of people will say the 200 week I think that'll happen but if we lose this I would say that the 200 week is not necessarily a strong support I would look at to where traders have actually traded and transacted on Bitcoin and this one is is gargantuan right so that would be where I think we see um massive massive push but I don't even want to talk about that let's let's take it level by level peeps I know that I'm famous on this channel for making massive [clears throat] multi-year predictions and and I told you guys we're going to adjust the trading system so let's do that let's do that. Let's just take it level by level. Um, what's the next question here? Probably hit the 200 week SMA. If we lose 74, then probably yes. War stuff. Yeah, I'm not a big believer that the war stuff is as as important in the larger scheme of things. I think it's it's tricky, you know, tricky to say. Next good entry on Super. I can't talk about trading a project I started, but just know we're working on it. We're working on Super all the time. uh an amazing team and you know when when the market does flip onwards and upwards we hope to build the the future protocols that matter. Obviously crypto gaming has gotten absolutely slaughtered. It's been one of the heaviest hit narratives in 2025 and uh that has a lot to do with the fact that a lot of these games that were coming out didn't perform right. Super was a meta asset within gaming and a lot of the games didn't perform. So it's hard to be a meta asset in in an industry where the the games aren't performing. That's just the reality of why Super has performed poorly. But then again, I mean, it's been pretty much on par with the rest of the industry. I mean, most altcoins have just gotten absolutely slaughtered. So, um, so yeah, I I think the benefit here is that we have a very cautious, very long-term focused team. Um, to date, it's been almost six years. I've never sold any of my founders tokens. Um, which were multigenerational wealth at at many times. Um, but I just never felt like the project was really to the point where I wanted to take profits. So, I'm either the dumbest guy in the room or I'll be known as one of the best entrepreneurs ever to hit this industry. And I hope it's the latter. Working hard to make sure it's the latter. Um, let me go through the chat. Oh, I can actually bring up the chat window here. Socialism kills societies. Yeah, it does. So, any AI coin on ETH that is worth dcaing? I don't I don't know. We'll talk about AI coins another time. I still have massive bags of a lot of them, but I'm just going to let them go to zero if they go to zero. I've held super since 21. Someone needs to make a sticky game already. Oh, I agree, brother. I agree. There's news for the masses and news for the classes. We get the news for the masses. Ignore news. Right. Netherlands is in the process of taxing unrealized gains. Yeah. until everyone with money leaves. They can't stop them. They don't have a global tax regime like America. So, everyone will leave and then they'll realize they're stupid and they'll end up uh changing it. That's just that's just the nature of it, right? Is um people will eventually leave. If if you force capital like that, they will take off. So, that's just the nature of it. Uh you can't force people to to who have found a path to wealth to give it up unless you do it by force. But the Netherlands are, you know what I mean? They're not going to do that. Canton is eating everyone's lunch. Yeah, it is. Let's go. Imposters. Yep. I mean, Imposters will come out this year. You guys will get to play it. The world will get to see it. Worked really hard on it. Despite all the woes of crypto gaming, we're excited for what comes. All right, guys. We're coming up on 50 minutes here. Yo yo yo from Canada. Uh big love to all you guys. If you guys enjoyed the stream, please smash that like button, subscribe, uh, and make sure to go pump up that uh, tweet. We're going to keep the vibes going. I'm going to be doing hopefully my best work ever over the next few months. I've been working my longest hours, the longest days I've ever worked, waking up at 6:00 a.m., working often until 8 900 p.m. just enthusiastic about where we are as a society and how many changes are happening. As as tricky as it is to see crypto like this with AI, with robotics, with claude code, with the ability for you to transform your own skill set and your own marketability and also print money online by trading, by speculating, by understanding where the world is going, seek truth, seek answers. Don't get swallowed in this propaganda war, in the doomer pill stuff. Just focus on becoming the best version of yourself and together we will emerge from this bare market completely, completely different people and hopefully a lot richer. Hope you guys are doing well and I will see you very soon on the next",
        "summary_hu": "A Bitcoin jelenlegi helyzete kritikus szakaszhoz rkezett, mivel a heti tmogatsi szint krli mozgs meghatrozza az iparg jvjt. A mltban tapasztalt jelents korrekcik utn a Bitcoin jelenlegi 74 ezer dollros szinten tl kell lpnie ahhoz, hogy a befektetk bizalma helyrelljon. rdekes, hogy a Bitcoin s ms hagyomnyos eszkzk (pl. arany, ezst) kztti prhuzamok mg ersebb vltak az utbbi idben, ami az ltalnos kockzatvllalsi hajlandsg cskkensre utal. A Tom Lee-ra utal ironikus megjegyzs fnyt dert arra, hogy a befektetk hogyan szemllik a mrkkat s a piaci hangulatokat a legutbbi esemnyek fnyben. A legfontosabb, hogy a piac reakcija az j politikai kinevezsekre s a kzponti banki politikkra is hatssal van, s ez a bizonytalansg tovbbra is feszltt teszi a kriptovaluta szektort. Az alternatv kriptovalutk s a hatkony mkd protokollok jvbeli rtke kulcsszerepet jtszhat a piac helyrellsban.",
        "summary_en": "Bitcoin is at a critical juncture, with movement around the weekly support level determining the industry's future. After significant corrections in the past, Bitcoin must surpass the $74,000 mark for investor confidence to be restored. Notably, the parallels between Bitcoin and traditional assets (like gold and silver) have become stronger recently, indicating a decrease in overall risk appetite. The ironic mention of Tom Lee highlights how investors perceive brands and market sentiments in light of recent events. Importantly, the market's reaction to new political appointments and central bank policies continues to create tension within the cryptocurrency sector. The future value of alternative cryptocurrencies and effectively operating protocols may play a key role in the market's recovery.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 35,
        "key_points_hu": [
            "A Bitcoin jelenlegi heti tmogatsi szintje kritikus a jvje szempontjbl.",
            "A hagyomnyos eszkzk s a Bitcoin kztti prhuzamok ersdnek.",
            "A politikai esemnyek s a kzponti banki politikk hatssal vannak a kriptovalutk piaci helyzetre."
        ],
        "key_points_en": [
            "The current weekly support level for Bitcoin is critical for its future.",
            "Parallels between traditional assets and Bitcoin are strengthening.",
            "Political events and central bank policies affect the market stance of cryptocurrencies."
        ],
        "main_topics": [
            "Bitcoin's weekly support level",
            "Impact of political and monetary policies"
        ]
    }
]