[
    {
        "video_id": "-WhP6qhq-F4",
        "title": "Where the real Solana trade is #shorts",
        "published_at": "2026-02-02T19:00:01Z",
        "sort_date": "2026-02-02",
        "url": "https://www.youtube.com/watch?v=-WhP6qhq-F4",
        "transcript": "Sana I'm salivating heavily for buying it at 30. But guys, if it starts breaking here, it could be another I mean, shorting opportunity here also is good. Shorting opportunity here for uh for Soul is also good. But I the 10x opportunity though, you you can short it. The big long-term trade is going to is going to be buying it at 30. So, of course, you can have the cake and eat it too. can short and then you can",
        "summary_hu": "A Solana (SOL) árfolyamának 30 dolláros szintje kedvező vételi lehetőséget jelenthet. A piaci elemző kifejezi, hogy ha a kurzus ezen a szinten elindul lefelé, rövid távú eladási lehetőség is kínálkozik. Az elemző a 10x-es tőkeáttételes kereskedést is említi, de a hosszú távú stratégiát a vételre helyezi a hangsúlyt.",
        "summary_en": "The price level of Solana (SOL) around $30 presents a favorable buying opportunity. The market analyst indicates that if it begins to break down from this level, there will also be shorting opportunities. The analyst mentions a 10x leveraged trade but emphasizes a long-term strategy centered on buying.",
        "crypto_sentiment": "Bullish",
        "sentiment_score": 75,
        "key_points_hu": [
            "30 dollár alatt vételi lehetőség Solana esetében.",
            "Rövid távú eladási lehetőség is létezik.",
            "Hosszú távon a vásárlásra helyezi a hangsúlyt."
        ],
        "key_points_en": [
            "Buying opportunity for Solana below $30.",
            "There are shorting opportunities available.",
            "Emphasizes a long-term focus on buying."
        ],
        "main_topics": [
            "Solana (SOL) trading strategy",
            "Market sentiment analysis"
        ]
    },
    {
        "video_id": "OFWYkA9_7gI",
        "title": "Markets brace as Middle East risks escalate #shorts",
        "published_at": "2026-02-02T16:30:10Z",
        "sort_date": "2026-02-02",
        "url": "https://www.youtube.com/watch?v=OFWYkA9_7gI",
        "transcript": "We have potentially escalation in the Middle East like today, guys. Why? Because you know the Epstein files, Epstein, Epstein, how do you say? They're going they're going super wild. So like president of Serbia said, I expect a strike on Iran or other major events within the next 40 48 hours. Okay? Because they need to remove attention from them somehow. So if that happens, boop, market down.",
        "summary_hu": "A Közel-Keletben fokozódó feszültség várható, különösen Irán ellen, ami súlyosan hatással lehet a piacokra. A szerb elnök kijelentései alapján, a figyelmet el kell vonni a belpolitikai problémákról, így újabb konfliktusok robbanthatnak ki. Ha tényleg bekövetkezik egy támadás, a piacok drámaian csökkenhetnek.",
        "summary_en": "Escalation in the Middle East, particularly towards Iran, is anticipated, which could severely impact the markets. The Serbian president's statements suggest a diversion from domestic issues, indicating potential new conflicts. Should an attack occur, markets could experience significant downturns.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 35,
        "key_points_hu": [
            "Közel-Keleti feszültségek növekedése",
            "Szerb elnök kijelentései",
            "Piaci reakciók a lehetséges támadásokra"
        ],
        "key_points_en": [
            "Rising tensions in the Middle East",
            "Statements from the Serbian president",
            "Market reactions to potential attacks"
        ],
        "main_topics": [
            "Middle East tensions",
            "Market impact",
            "Geopolitical risks"
        ]
    },
    {
        "video_id": "bLiHfECZH3k",
        "title": "BITCOIN AND ETH: LAST CHANCE TO RECOVER!!!! 🚨🚨🚨 (MicroStrategy REKT)",
        "published_at": "2026-02-02T09:55:49Z",
        "sort_date": "2026-02-02",
        "url": "https://www.youtube.com/watch?v=bLiHfECZH3k",
        "transcript": "Welcome to another episode and as is right now Bitcoin is bouncing. Bitcoin currently is bouncing a bit on this very important resistance which is the 2025 lows which we hit here in April 2025 last year and now we're using it as support. It seems that Bitcoin at least wants to bounce for a bit for a bit. Now the problem is that we have now broken below the 100 week moving average and this normally means a flash towards the 200 week. So personally, I'm seeing this bounce more of a shortterm short-term bounce. And when you look at the whole situation, the trend is super super super super strong to the downside. When you break a consolidation like this that we had for months and months and months, you normally flash and that's exactly what we're seeing. Although for now, for now, we do have a bit of a support. And this is basically the last place for Bitcoin to bounce uh before we come to Papa, which is at the 200E moving average. And uh there there's basically nothing else that could uh that could give support. You could argue potentially I mean potentially here but it is already below. I mean what else you have? Maybe you can um if you pray if you pray maybe you can do like this. But at the end of the day the path of least resistance is down is exactly like we've been speaking about. But most importantly we have to see the fact that the micro strategy story seems to be failing right now. Why? Because sailor started to buy Bitcoin at 11K. He's currently holding 3.5% approximately of the entire entire Bitcoin circulation. However, here's the big big problem. He is underwater. Sailor from today is underwater. Okay, doesn't mean that Micro Strategy will collapse. I mean, they can they can still huddle a bit underwater. But this is the problem overall with having a super super aggressive strategy without looking at the trend without trying to figure out whether you get a good price or not because basically how many years he's been doing it I mean since 11K it's like seven years or six years and what do you get? You get a loss of 3.5%. Which is very bad considering the fact that you could have put money in a money market fund. I mean you know the so-called hyperinflating fiat that that yields like 3% per year on average just money market short-term treasury is nothing complex and that would be and that's per year for six years you understand that it compounds it compound I mean 3% per year maybe some of you guys can calculate how many it is for what is it for six years is around 20 so and here instead you have a loss you have a loss here okay so of course the story doesn't really make sense when you have a loss versus just you know holding fiat in a freaking short-term treasury. And this is where crypto is fantastic, but the same asset such as Bitcoin, which is great, can give you amazing performance if you know what you're doing. You're buying in early bull trends or it can ruin you. The same asset, the same fundamentals, the same greatness, the same news or it can ruin you if you keep blasting the top. Okay, it's very very important to understand. That's why it's really not about the fundamentals that people keep telling you. I you don't understand the fundamentals. You don't since October 8th when I we became B. You don't understand the fundamentals, the fundamentals, the fundamentals. Okay, listen. The same fundamentals can be the difference between life and death in the market depending on your timing and really if you bought buying at the at the top or early early bull trend. So that's number one. Now we have another guy as you know it's Tom Lee. Tom Lee said that 3K ETH is cheap but now he's sitting at a massive loss of 6 billion. And Tom Lee, the interesting thing is that he's going to be a record world record holder [laughter] for the biggest trading loss very soon. He's now um he's now somewhere here number five. I mean with the six billion loss, but it is going to go down more. If Bitcoin keeps falling, Ether is also going to keep falling. So he has actually a chance here to become the number one record world holder of the biggest loss in history if he gets above 10 billion. Now I think Tom Lee can do it. I believe in Tom Lee. I think Tom Lee is the perfect candidate for this. But he doesn't care. Why? Because he has gotten a nice compensation package in Bitine. He's set. He's set. And he really I mean his money is coming from the compensation from Bitman. Then you know what happens to the ETH? what happens to this and that. It's more of a publicity stunt. More of a publicity stunt which has been working very well for him. I mean look at his compensation in Bitmine and the fact that he is now heading Bitmine as a as a figure public figure. That was his goal. That was his goal. And people have confused Tom Lee's goal to get the compensation and all of that from Bitmine which is in the hundreds of millions. They have confused that that he's somehow working for their best interest. And listen, Tom Lee is he's fantastic in the bull. We I'm sure in the bull market we're going to be following Tom Lee. We're going to be cheering together for now though. He is this the cause of many many many many wreck portfolios like infinite amount. Absolutely infinite amount. You you see you see you see memes like this you know this gold watch or like gold what is a jewel jewelry thing that that happened the meme the meme. But now this is the bit mine subreddit. >> WHERE'S MY [ __ ] MONEY? [laughter] Where's my [ __ ] money? Have you seen this meme? It's some kind of jewelry. I don't know exactly, but it was some kind of jewelry guy claiming money back from the jeweler. He got scammed or something. But it is like that. It is like that with the Bitmine stock is very very bad. But also, I mean, Tom Lee himself is kind of in that position as well. I mean, this is the thing when he he said that 3K ETH is cheap. But then you remember the other day, yesterday or two days ago, we played the clip where he said that okay, definitely it's going to get a bounce at 2.4. He he said that it's going to go to 2.4, 4, but it's just going to touch. I mean, we played it here live. I told you not to listen to it, but he said, \"Listen, yeah, it's going to go to 2.4 and it's not going to be a breakdown.\" He said, \"I just going to touch like, you know, attach attach like like a pet. It's just going to pet 2.4 and then explode. What happened now? We're at freaking 2.2. We're at 2.2. We're at 2.2. So, you cannot confuse whatever the public media profiles are yapping. They yap yap yap yap yap so much the yap. Because at the end of the day, it's always the price and the trend that will decide, not the yapping, not the yapping. I mean, here, you understand? We're only looking on the price. Whatever yapping is happening in the media, we're not listening. We're not, we're uninterested because most often the fundamentals, the yapping, it's either too late or the same asset with the same yapping has great price performance if you buy it correctly or the worst price performance if you buy it incorrectly. You understand? No more listening to yapping. Only the trend. Only the what's happening in the price. That's it. That's it. That's it. That's it. So tomly wrecked. Michael Sailor wrecked. Everyone who is not respecting the chart absolutely destroyed and obliterated. Will they always be like that? I mean depends on how much you can huddle under underwater. One thing for sure guys, Bitcoin is now at the at the last bounce bounce area and I think it has a chance to close this gap. I mean, we see a massive CME gap here. I mean, as you can see, massive CME gap because we dumped during the weekend. So, having some kind of pump here to close it. I mean, let's say we go to the body, that would be 8% pump. And let's say we go here to the week, it's a 5% pump. So, let's see which one of this of this up. I mean, ideally, we go to the body to to to really close it. But all in all, there is a potential here. There's a potential for a bit of a counter trend rally. Maybe even come back to the range and then get rejected down. I mean something like that would would make perfect sense as well. So for shortterm trading use this to your advantage. If you are in Bulman you can apply the mechanical rules and the riches currently are in the in the shorting. In the shorting we have more gains from our community. This is from the last I would say like 12 hours or so. This guy baby doge short short short plus 36%. Pu pupero big big shout out to poopadero from our bullmania community. XRP guys XRP now is a gift that keeps giving. Big shout out to Pacin for applying mechanical rules that he learned in Bullmania and uh and absolutely killing it with the shorting with the shorting XRP I mean and also if it is a golden goose for shorters uh potentially it's only the beginning potentially just laying its first egg for the shorts. Now the average person they they don't really short. Why? Because they they're afraid. They don't understand. They have no rules. They they don't know how. Like they they click short, they get wrecked because it's counter trend rally. They get stopped out. But with mechanical rules, what I'm noticing is that people for the first time have the courage to take positions in the market they would never do. Why? Because they know the rules. They know how to enter, how to exit, when to exit, and so on so forth. So with XRP using the mechanical roots, it could be actually just, you know, the first golden egg that the goose has uh planted here. So if you think about uh XRP here as a goose. Is that how you draw it? I don't know. I was always the worst at drawing. [laughter] [clears throat] This is only the first egg that it popped out. Uh because as you can see, the breakdown is just starting. The breakdown for XRP is just starting. Now as we have another golden goose, which is great. I mean I'm eyeing it and salivating heavily and that's Sana. I'm salivating heavily for buying it at 30. But guys if it starts breaking here it could be another I mean shorting opportunity here also is good. Shorting opportunity here for uh for Soul is also good but I the 10X opportunity though you you can short it. I mean as you can see it's you can do it but this is more of a short-term trade. The big long-term trade is going to is going to be buying it at 30. So of course you can have the cake and eat it too. can short and then you can buy and you have the mechanical rules that stop you that stop you out in case the market just explodes to the upside which can always happen. I mean we live in in an uncertain market is always I'm sorry market is uncertain. We don't know what's going to happen. We're just playing where the the the pos the probability is in our favor. The cards are stacked in our favor. But you have to keep in mind when we're sharing the gains it's not that every trade is a game. No, no, no. But when there is a mistake, when the trade goes against us, mechanical rules stop us out and and small problems don't turn into big disasters like for most people. For most people, small the smallest problem they keep holding it becomes a big disaster. So, it's all about the the law of large numbers and ensuring that over time we're super profitable. And Mooncat, big shout to Mooncat always posting the the gains or also shorting the the also getting, you know, a bit of the egg, a bit of the golden egg right here, shorting SRP now. So, so that's with the that's with the situation with Sana with XRP. Let's speak about precious metals because one of the things which has been pretty important is that we really called the the danger with precious metals. This was already on January 27th, 28th, 29th. And I was saying be careful, be careful, be careful. You can you can go to bullmay.com/van. You can see all these different posts for for uh for track record. But let's let's see what's happening now because maybe people are wondering Ian what's going to happen will it keep going down I can tell you something guys and that's that the current week is now in bare trend the week has not closed theoretically maybe it closes above but I mean it seems that the trend has shifted and our de-risking from gold that started last week is in full effect I mean it's it's just confirmation it's just confirmation so yeah uh on the weekly gold likely heading to big papa here in in the moving average uh currently at 3.6 six uh and maybe even lower. I mean sometimes it just it goes even lower to this other moving average 200 week. So at least the 50 week I expect from gold and then from silver uh let's see if moving average is slowed here also boom new bear trend if we close the week below 84 which I mean seems very likely but yeah let's see uh and we already start to drisk uh last last week basically I made a post saying that we're shifting we're going to new pastures we're going to new pastures let's see where where the tweet is either this one let's let's see where it is now this is this was the warning and maybe I need to add it uh yeah Here, here. Gold and silver flip bearish after a full year of bull trend in our um beloved precious metals. Uh our beloved precious metals are entering a bare trend on the daily. And so basically said, thank you. Thank you silver. Thank you gold. One plus year of relationship. Great collaboration, but we're moving to something else. This was on January 30th. So it's still still in full effect, guys. Still in full effect. Of course, as you guessed, you can make money shorting gold and silver. You can make money shorting shortterm. These are short-term moves and how you do it where you short you can go to exchanges I use in the description or go to booming.com/partners you can do it on pionex you can long and short gold easily with leverage you can do it on buy bit on bit unix and you get big nice signup bonuses in all of these exchanges okay so that's the that's the platforms for tradfi shorting even silver and and gold and so on so overall that's that's the bet currently uh looking at um Dixie if we are to zoom out. It did enter technically bare trend, but it's I mean it's been in bear for a long time. This bull was kind of a fake out trend. So all in all, I think that Dixie has a good chance to go bull again uh very soon here and dollar is likely to come back with with strength now because the new Fed chair is kind of hawk and uh there has been just you know overexuberance that dollar is going to hyperinflate with gold going to highs. I mean it's it's so low it's so low uh uh sentiment on gold that it wouldn't surprise me at all we're going in bull in bull run now on the Dixie but yeah let's see what's happening and also remember Dixie it's it's not even comparing to gold it's comparing to other currencies which are even worse than the dollar I mean yes dollar is is fiat it goes to zero it's it has all the problems of fiat but name another fiat currency which is in some some way better there is none there is none that that's why it's world reserve currency So anyway, let's see what's going to happen. But um if this thing goes up, guys, stons may struggle a bit. Okay, stocks may struggle a bit. And that's probably the, you know, the biggest crack we need to keep in mind because I'm not a fan guys of S&P going to this fake alltime high. I'm not a fan. It could easily come back here, just retest the bull uh bull trend. So yeah, let's see what's going to happen. But also here uh just from a downside perspective, if S&P goes now lower, Bitcoin is going to come to papa even faster. Okay, it's going to come to papa so fast you cannot even blink. It's already at papa. Okay, it's going to come to 200 week. So if if S&P just goes here, you know, a a drop, how much? Yeah, like 3% drop just to test this blip level, man, Bitcoin is not going to like it. Bitcoin will will not like it. Okay, so uh that that's the thing. Bitcoin has been dropping even though stones have been doing quite okay. They've been holding up quite okay. But if the dollar is now gonna go to the upside, the bis how to say small bitcoins the the the coin the coins the corns the bitcoins boop they're going to get flushed. So and that's great guys that's great and I also want sana flash to 30. I keep repeating it maybe you know you know law of attraction saying things out loud. Sena to 30. Can you guys say it with me? Because I'm gonna be so excited if it happens, guys. Let's say together. Sana to 30. I believe in Sana to 30. I believe in the chart of 30 Solana. Let's attract Salana 30 to our life, [laughter] guys. Let's manifest because guys, that's I mean that's going to be such deep value. It's going to be such deep value. It's crazy, man. It's crazy. I don't think if Sana goes to 30, I cannot think of anything else like deeper value. Deeper value than that. Okay. Very important. So, Sana to 30. Sana to 30. Let's go. Let's go. And exactly. And then we go to a,000 afterwards because since October 8th, we're bearish Sana. We don't have any Sana, but the fundamentals for us to go to 1,000, they're still there. But first to 30. Let's go. Let's go. Uh it will. And guys, if you hold Solana, you also should be praying that it goes to 30 because then you can buy more cheap. You can get your average price down and then it's still going to recover at the end of the day. So don't fight it. Instead, join us in the manifestation. 230. Join us. Join us. Join us. Don't don't resist, guys. Don't resist. Instead, let's go coma together. 2:30. Now, will it happen? Will it not? Let's see, guys. Let's see. Let's see. [laughter] Maybe maybe not. But I I I just have it in my mind, you know. I see it so clearly. I mean some things when you see a goal in life so clearly it just makes it easier for you to achieve it. I don't know maybe it's a bit of woo woo is kind of like you know respect the pump that you attract the pump in your life but here it's instead attracting the dump. Okay so I'm respecting that. Now moving on guys moving on we have potentially escalation in the Middle East like today guys. Okay like today maybe even very soon or some kind of other escalation. Why? Because you know the Epstein files, Epstein, Epstein, how do you say? Epstein, Epstein. Uh ah they're going they're going they're going wild. They're going wild. They're going they're going super wild. So like president of Serbia said, I expect a strike on Iran or other major events within the next 40 48 hours. Okay? Because they need to remove attention from them somehow. So if that happens, boop, market down. boop market to 200 book moving average. Uh maybe slow down to 30. Okay. So these files the so-called files they they may actually push the line to 30. Okay. Uh now what is interesting guys just on this you know we've been speaking that uh why would Trump select a hawk for Fed chair? Why why would he do it? He selected Kevin Walsh. Worsh what's his last name? Worsh Walsh. I keep forgetting Worsh or Walsh. L or R. Anyway, Kevin, he's hawk and Trump wants lower rates. So, he must have some strategy to ensure that Kevin listens. Okay, with Powell, they did not have any strategy. With Powell, they had no leverage. And it is seen also in the files because Steve Bannon was writing, he was writing to Jeffrey basically asking, can you get rid of Powell? Okay. [laughter] Can you get do I mean probably meaning do you have something that that can help in that endeavor and obviously nothing happened. So he did not have anything. Could it be? I don't know. I mean I'm not saying anything. I'm just we're just speculating a bit. We're just speculating a bit. Maybe maybe yes, maybe no. Let's see. Now guys, also Pompiano Pompiano is in the files. You can check. Apparently he's some informat for Iran. Uh I don't haven't dug too much into it. Pompiano is denying everything. He's saying that that email was a fishing email that you know he did not send it. It was a fishing email. Okay. But he was demanding 10K from Jeffrey uh Pompiano. He was demanding 10K otherwise he would like go to and expose something. I don't if you can check it yourself. [clears throat] And this was all during the weekend. Okay. Oh, also Sailor is in the files, but kind of in a good way because everyone just says that Sailor is weird and kind of a zombie on drugs and uh that he is unsocial. The autism level is very high. So, no one really jelled at the party with Sailor. No. Rubbing shoulders, jelling with other people. Sailor is not too good for that. He was too too autistic. He was just repeating that he has a yacht. He was just repeating channel he has a yacht that he's going to take to s send bars or something. [laughter] Oh, also guys, Bill Gates, Bill Gates uh heavily in the files. He got some STD from um so-called Russian girls and then he tried figuring out how to give Melinda Gates antibiotics without her knowing [laughter] what's happening. Guys, what's happening? I mean, turns out the so-called world leaders, the world elite is like high school, guys. It's like high school, you know? It's the same. It's the same. In this files, the founder and CEO of LinkedIn, Reed Hoffman, is called the Fatty by the founder of a VC fund in UK called Heo Sophia. [laughter] It's like high school. Isn't Isn't that crazy? Isn't that crazy? You can have all the money in the world and still be referred as fat at LinkedIn. Crazy. Oh. Oh my god. I don't know what's happening. I don't know what's happening. But I I think that we may see escalation somewhere in the world to remove the attention from this because it's too much attention. It's too much attention in this. And guys, on this note, let's go to Q&A questions, answers, debates. Big shout out to who? To dab for time stamping us this morning. While you are thinking about great questions, uh again go to bullmania.com if you want to get the tools, if you want to get the money scanner, see for example, was flipping bearish on the daily basis. Uh be part of our community, be part of uh I mean everything here I'm sharing with the gains. It's part of the discord. It's part of the discord where people are applying the mechanical rules they learned and then they share the the wins. So yeah, go to booming.com in description. You see right here, watch the free video and go to booming.com/partners or it says exchanges I use in the description and you know get get pionex for bots uh buy bit for going long going short bit is going long going short with leverage and you get nice bonuses in all of them in all of them and if you have one get another one so you have spread out platforms you cannot trust one platform too much maybe one has too much KYC another has less and also check out hyperlquid which is a dex which is a dex and maybe we'll trade on deck there you go Nice. Let's go. Let's go. Let's go. Let's go. Let's go. As soon as possible. High school never ends. That's true. That's true. You have all the money in the world. You still want of a bit of that raspberry. Do you say raspberry in um in English? Uh in Russian, you say raspberry when it comes, you know, all of this 18 plus stuff. You still want it in one way or another. And uh you need to call Jeffrey. He's organizing the party. You have to come to St. parts or like the the islands close to that is the same. [laughter] Oh yeah. Yeah. Ian, how are you so confident that Solana will have a bull market? We could I mean I'm not confident. It's not like I'm I think it's good riskreward. I think it's good riskreward. But if it doesn't uh let's say let's say it goes to 30, we buy 30, it goes to it keeps going down. I mean we're gonna exit. We're going to cut it. So [snorts] I'm not confident, but I think it has the the best chance based on my experience as a user. I don't use ADA. I don't use Atom. I don't use polka dot. Uh and uh so for me just it's it's super nice fair value which is you know going back to the lows from way way back in the past. The other chains you mentioned they just they have no usage like no one cares about them. And so for me it would be a nice nice uh cheap price to buy something that I use and it's a bet. I mean it's a bet like any other and if it goes against us we will not let small mistakes turn into big disasters. So it's it's a bet like any bet, but it's a bet I'm excited about. So if Sana goes to 30, man, I'm it's going to be very exciting. It's going to be fantastic. It's going to be holy crap. It's going to be So yeah, that's that. Where do you use Sana for I mean everything from stable coins from payments uh receiving stables, sending st trading, uh any shitcoin, best trade experience on Salana, no bridging, no nothing onboarding. I just see you know people enter into crypto. If I'm to onboard someone into crypto, what do I tell them? I tell them to get Phantom wallet so they can trade the most things and it's going to be the greatest and you have to bridge and have to like figure stuff out and uh obviously meme some of the biggest uh volume creators. So it really shows that the blockchain works. The only thing that's missing is the perex although you can uh already now in in Phantom wallet they do have that you can go long and short but it's not as big as hyperlquid. So I mean they have like the full stack. They have the full stack. Uh but again I have no Solana now since October. Why? because bare trend so we we don't touch it now and uh yeah if it comes to the 30 bad it's going to be great but again this is a bet everything is a bet if it goes against us cut it cut it out never let small mistakes turn into big disasters uh does that yeah Powell did keep his what it's called when you play hockey and you have this protection uh on your between your legs what what's called so Powell kept it on basically and it has protected his position as head of the Fed uh amid amid all of the turbulence with the fiscal policy with the monetary policy with the pressure from the White House and so on but he has a Powell he has this cup exactly that hockey players use on his uh [ __ ] so he's immune moon against all of the raspberries, so to speak. And that's what kept him in place. I mean, you understand that what is called ladies, leverage, liquor. Those are the three things that can ruin a man. And Powell did have great protection for for the ladies part. But I love that all of this, you know, billionaire gigs, they fly to to get some of the [laughter] Yeah. Yeah. It's crazy. It's high school. I say, you see, and then people say, \"Oh, you know, someone runs the Listen, this is what this is how how it happens. This is how it happens. They they they get in situations they're ashamed of.\" And and that's how, you know, someone could run the world, quote unquote. But these guys, I mean, most of them, they're they're lost. I mean, they're just tech geeks, you know, they're just tech geeks. They're bum bum bum bum bum writing code, get invited to a party to get some of, you know, what uh get recorded. Mad crazy. [laughter] I mean, it's it's it's my biggest uh you know, that that's that's the biggest lesson from all of this and that's that it's like a freaking high school. Even the billionaire guy, he he he has he he has this issue. [laughter] It's like freaking high school. Geek in high school, you're going to be geeky in as a billionaire also. It's that's why I mean at the end of the day, you as a person like your net worth is not going to change anything. you as a person if you don't have uh confidence in yourself, you you don't you haven't developed your own personality, you're not comfortable with yourself, like doesn't matter if you have $10 or $10 billion is the same, man. Is the same is the same. So, it kind of puts everything into perspective. Uh and uh kind of also puts, you know, in these times when many people have heavy losses. I mean, understand money is just money. You can make it back. Also, if you have a lot of it, it doesn't really solve too much. Uh or it's very nice to have. I mean, obviously, it's very nice to have, but keep it in perspective. Keep it in perspective. Don't get too depressed. Uh, make it back in the next cycle. Go to booming.com. That's it. Balagi said the inconvenient possible truth. They're coming for your digital gold. Let's see. I I haven't seen it. Bali. Well, I mean, he did. I did see that he said that we have a Fed al Bitcoin align Fed. Maybe you mean that. there's going to be some, you know, like gold confiscation when when Fed is Bitcoin. Uh, where did he say that? U Constance converted to Christianity, Fed will convert to Bitcoin. Is that what you mean? I I haven't seen anything where he says they're going to conver this. Bitcoin's value position is the reasons to explain what it means. Think through the mechanics of physical gold is great, but if you can buy it, transport it, secure it, and sell it safely. But it's much easier to do that. So yeah, maybe they're going to seize your gold if you don't don't have it in private key. They're going to seize your Bitcoin digital gold if you don't have in private keys. Exactly. Uh man, he writes so long. What is the conclusion? Let me ask Groman. I don't have time to read it. It's uh this is the thing. Let me ask Grock like what's physical gold price you Grock doesn't say anything that they Oh yeah he actually says it. He actually says it through self cassity urging not your keys not your coins for crisis. Yeah 100%. If there's a crisis they may seize Bitcoin. Exactly. That's true. That's true. They may seize Bitcoin and they may use it for uh for yeah reserves or whatever like they seize gold back in the day 100 years ago. Money is just money. The time the time to get it back won't give back. Your time is lost forever. Uh you mean time to but what's the point of getting it's a journey by like everything is a journey. It's not like you know now you're going to get back the money. So that's like you know life lost. I mean that's a very sad way of viewing it. It's a journey. It's a journey. I mean net worth goes up and down. I shared on Twitter, you know, if you I think last week or a week before that, you know, my biggest loss in in crypto since 2013 was in high seven figures. Like it's below 10 million, but very very close to that. So, you know, did I lose years getting you lose years, it was just, you know, part of the journey. It's, you know, it's you get to a hopefully you get to a higher low in your net worth, but even if you get to a lower lower low, which s some people do is it's just a journey, man. It's just a journey. Okay. And then you you know, okay, so in your mind, you waste years getting it back. And so when you got it back, what's going to happen? You know, something's going to unlock for you. Nothing's going to unlock for it's a journey, man. I see it as a journey. You get it back, you're going to see some something else that that you want to strive for and then it's it's another journey anyway. Like it's another struggle anyway. So like it never ends. It never ends, but never ends. So just enjoy the journey. I mean that's that. Be become better. I mean money is obviously super important. I'm not saying it's not important. It's super important. It solves many issues but uh there are also many issues it doesn't solve. So yeah, just a journey man. Uh I got average price on ADA. Am I crazy for holding 0.38? I mean crazy. I think you're you you're maybe uneducated uneducated ple which is fine by the way. I mean big shout out. We've all been there. Go to bullmillion.com to educate. Um, what I mean by that is that it has been in bare trend since 0.6. So you bought it at what what you bought? 0.38. So it's you bought in bare trend. So it's not too great. Um, things that look like a discount can be discounted even more. I mean personally the again in such case where you are already at loss there's no great answer. Slana has all the sorry Cardano has all these different support levels. It's very sharp down. Um, yeah. What can I tell you? I mean, personally, what I would be doing is that I would be taking a part of that money and then putting it in bullish assets. And there's a whole like strategy behind it that we talk about uh that you should check uh uh in bull.com. But all in all, it's all about taking it one step at a time and uh trying to move it to to bullish assets. Okay. Uh am I crazy for why do you hold it? Why why do you hold it? What's the point? Do you really believe in it or you thought you would make money and now you don't and now you just try to like recoup it? Because you can be holding it for years. I mean look at dot poll people are holding it for many years like why you hold it? Why you hold it? Look look look at for example when I speak about Slana 30 I'm telling you if it goes against me I will cut cut it. Don't don't hold something that goes down. Don't hold it. You can cut it then you you maybe come back in the future. Uh let's say Slana goes to 30 it's and then keeps going lower. We cut it. Let's say it goes to let's say for for sake of discussion we put stop loss at 27. It goes to 30 then keeps going to 20. Okay, cut it man. Cut it. And then we have re-entry. We have re-entry rule. Maybe we try again at 20. Maybe if you know we cut we start cutting at 27 which will never be it will never be you know just one button to sell everything. It's going to be lading out. Let's say that suddenly starts mooning. Okay, we're going to be lading back back in maybe at 30, maybe 32. So all in all the small mistake cannot turn into big disaster but we're not going to miss it either way. you know if you're if you are cutting your loss it doesn't mean that you are forever banned from the asset. So anyway it's really is a big big topic this but you more in bull.com watch the video there otherwise uh that that's my answer for now. Do you think banks will build on a centralized chain like Sana when they can have a centralized chain when they can have a centralized chain? You mean will they build on a decentralized or centralized? Well, at the end of the day, it's all about giving access to assets. So, if most interesting assets are on Solana or ETH, then banks will build on that and give their uh clients access to that. And I have no doubt that the most interesting assets with the uh biggest performers are going to be on the public chains uh permissionless chains like Solana, like yeast and other such chains. uh on a closed chain. I mean, you can give access to what is already in the brokerage. Like, you know, you can tokenize stock. Congrats. But it's like, who cares? You you already could buy the stock in the in the bank anyway. So, uh that's why I don't think it's really a competition. It's not the same thing. And you know, banks building on blockchain, it doesn't I mean to blockchain, it doesn't really add too much value. I mean, at the end of the day, they are consumers of it. I see them more as uh consumers of uh blockchain where they allow access to their clients to blockchain assets. I mean that's how I see it. So I don't care what they try, what they experiment with. It's all about where the assets are. I mean if I'm a client in a bank, I want to trade. I want I want my portfolio to grow. I just want access. And if bank cannot give me that access, they they keep putting me into their centralized chain crap, I'm going to go to another one. So understand the relationship here. We create I mean this industry we created blockchain, we created Bitcoin, we created coins. Banks they don't create anything. They just give access. They give access. They can try to you know capture or something but that's a different topic. Um to your question will will ETH or Sana or or other chains be more interesting than private chains by banker 100%. And that means that they will have to open it up. Otherwise, what's going to happen? Everyone's going to download a wallet MetaMask or Phantom just straight directly without the bankers. So yeah, it's and also you don't allow you build on your private chain, your competitor will another bank in another country will give access to the public chains and so then it's competition. Anyway, that's that. Ivan does not understand cyber funk. You mean cyber punk? Because you misspelled it, but I guess you understand it better. [laughter] But first, please learn spelling it. Cyber punk. If you speak about the, you know, the the ideological foundations of crypto, it's not cyber punk. It's cyber punk. I guess you're the expert, man. [laughter] Big shout [clears throat] out. Big shout out. And I literally just said that the the decentralized chains are more interesting as cannot compete with uh with whatever bankers are going to do. But you're the expert like always. I mean we have so many experts. Ian, you're wrong. You're wrong. But the confidence people have I mean it's it amazes me. It amazes me. It amazes me. [snorts] Miami big shout out some question about uh how can we jail the fat man Richard man I mean listen it's I I'm not even that interested in the in the saga I I see some pulse guy asked me some pulse guy asked me I can you please comment on pulse I don't know guys I have no I have nothing more to say I mean we we already we already said everything we wanted it's what do you Yeah, that's it. That's it. You're on your own. You're on your own. [laughter] You're on your own. Do do what you want. It's just other things happening now. Like, no. Why speak about that uh when you have so many other things happening? So, that's that. Um Pan daily candle onada. This run got me tricked. Yeah, that's a problem. That's a problem. People buy big candle like with gold, like you did with other use it as a lesson. Use it as a lesson. I mean, what do you think about Epstein created Bitcoin? Yeah, I mean there are many connections to Bitcoin, but it seems to be that know they are discussing Bitcoin. They're discussing uh how, you know, how how they can be involved. I mean that's my impression how they can be involved in uh in crypto. Uh also it seems that they funded Blockstream early on or some somehow connected entity to these files uh uh funded it Blockstream but you know Blockstream I I'm not sure I like Blockstream and they they push their products sometimes I feel they crippled the Bitcoin network for example instead of scaling uh Bitcoin they pushed a lot their uh liquid network like something some crap. Yeah, I there's too much conflict of interest there uh with them. So yeah, all in all, my impression is that yes, the Jeffrey and his uh bros tried to get involved, tried to uh to be somehow playing a role. Um but yeah, that's it basically. That's where it stopped. And they they got involved after like uh years after like 2013 from what I saw 2014 after conscration thoughts on mold book AI is crazy. Yeah, I'm not buying it guys. I'm not buying that AI is writing what everyone is saying that it's writing on this mold book social media because we've been here before guys in crypto. You remember a year ago everyone said that AI is creating memecoins. You remember the truth terminal. Turns out it was a dude writing it all along. So when it comes to moldbook I think it's a smart engagement play where they uh you can easily prompt your AI to write whatever you want on the uh on the social network. You can say listen here is a connection to social network. Your job is to make crazy posts that will get engagement on Twitter. So I mean uh to me it's clear because we've been through it with the crypto coins where AI apparently created the coin. Man, AI created zero coins in crypto. Zero. It was just dudes in a basement click click click click click creating coins. So the same thing is with um is with mold book likely. Now nowadays AI I mean it could I mean theoretically you could have AI writing all of that and most of the content there is probably created by AI but most of the content is boring and doesn't get shared on Twitter. So I'm not saying that everything there is fake that that's the whole 99% of stuff on moldbook is likely uh actually created by AI. I mean actually all of these different AIs that have installed that where people have installed this connection to moldbook I'm sure that it's real but what's shared on uh Twitter I'm very certain that it's not real. I'm very certain that it's not real. It's it's too good man. It's too good. It's too good. And the payoff for mold book creators for I mean growing audience on Twitter it's too big not to do it. You know, sometimes you think about like, you know, the payout, the reward is so big to for them not to do an easy thing just to prompt AI to write a bit crazy stuff. Man, the reward is too big for them not to do it. [laughter] Okay, it's too big, man. It's too big. I'm just looking at it practically and that's it. Yeah, let's see what's going to happen. Can we integrate your gut feeling in the mechanical rules? Uh I mean mechanical rules are all about removing gut feeling to be fair and most people get raped by gut feeling. So mechanical rules allow anyone to start uh you know taking bets they they normally wouldn't and you don't need gut feeling for that. I mean these guys this is this from yesterday I sh but kajoro shorting su shorting XLM shorting the crap I mean a lot of people from what I've seen they would never have even tried shorting without mechanical rules. And the reason why they can try now and they I mean really successfully is because they have exact stop-loss. They know how the law of large number works and you don't need my gut feeling for that. You don't need my gut feeling for that. Uh that being said, we are working on more updates to our money scanner uh to basically add an intelligence AI level on top of it which it's not going to be that you know it's gut feeling but it's just that you know there are there are still things where you have to click a bit to find you know you can see the trends you can see all the stocks you can see everything. Um but it would be cool if there was an AI layer here that uh would surface a bit of this for you. So that that we're working on. Um so yeah, that's uh that's going to come for all the members very soon. [snorts] Yo yo Guzman, RCME gaps still a thing? I thought CME started trading 24/7 or uh I don't know. It's not it's not not on the chart. It's not it's not 24/7 on the chart. I mean you see yourself it's uh it's a there's a gap here. [laughter] So So it's not 24/7. uh go to BTC one exclamation mark on uh trading view and you're going to see I mean there is a gap I don't know what you heard it's not 24/7 otherwise there would be no gap so it wouldn't surprise me at all guys if we pump back to just close the gap doesn't have to be this week can be next week can be in the coming weeks but from a short-term perspective the gaps normally get filled um Ian will we get all the milestone songs on the way down Wish milestone. So don't don't recognize lose. What what's happening? Evan, I'm glad to be losing money with friends. I mean, that's what crypto is all about to some extent. Just kidding. Follow me rules, but all honesty, good to have you around for this D. Yeah, I mean, and listen guys, thanks to you. I mean, it's actually thanks to you. I said it yesterday as well. It is thanks to you uh that uh that we do it because uh you guys are watching it. We have good engagement. We have many likes. Uh you guys are smashing. Uh so by the way in short to smash now you guys are commenting as long as there is engagement. I mean obviously I'm excited to to to do output if there is more engagement. By the way this guy big shout out clown world kind of highlighted the importance of mechanical rules yet again because he just said like a second ago shorts are dangerous right now because there are lots of bullish divergences. Yes, exactly. But that's why we have the mechanical rules in place where small mistakes never turn into big disasters. just go to booming.com and watch it. And this is exactly the mindset that prohibits most people for even trying to take a bet in the market for even trying let's say to short because they're so scared. They're so scared. What if what if what if what if [ __ ] versus what if what there's so many different know what if what if what if but you don't have to be worried if you have the mechanical rules that cap your loss and the law of big numbers say that you're going to win over time if you keep u if you keep uh keep at it. And the same thing, by the way, is to the upside. When we get to 200 week moving average, people are gonna say, \"Ivan, you're wrong. You're wrong. You're wrong. You're so wrong. You're so wrong.\" And u uh they're going to miss the upside also. So, it's a actually a good comment because it's kind of like at the core of uh of why we need mechanical rules. Yes, anything can happen. There can be bull, there can be counter trend rally. Maybe we go back to 50. Like, who else knows what's going to happen? We don't know. But we know the probabilities. Highest probability down. uh if you have a break of support in XRP and then there is no support until like 80% down it is a golden goose maybe instead of a golden egg you're going to get kaka from the golden goose but then you cut the trade and that's it that's it [clears throat] so great question from tgto which day did you start the risk [laughter] that's the perfect one to And uh to end it, as you know guys, we did start the risk on October 8th. If you go to bullmayer.com/ivan, you can see right here everything that happened right here what happened next. Right here what happened next. Right here what happened next. And now we're waiting for our next big move when it comes to crypto when it comes to silver. And for for crypto it is either this or this. And uh silver gold is when it come to moving averages. So guys thanks a lot for being here. Thanks a lot for contributing to the stream. Smash up the like as soon as possible. Subscribe. Check the links below. Big shout out to Dub for timestamping us. Enjoy your Monday new week ahead. Probably going to be crazy week ahead if they try to hide the current, you know, situation with the files. H. Yeah. Let's see what's going to happen, guys. Let's see what's going to happen. We're going to be covering it live right here. to subscribe and goodbye.",
        "summary_hu": "A Bitcoin jelenlegi helyzete kritikus, mivel a 2025-ös mélypontok körül ingadozik, de a trend egyértelműen lefelé mutat. Michael Saylor és Tom Lee esetében hatalmas veszteségek tapasztalhatóak, amelyeket a túl agresszív stratégiák vezéreltek. A jövőbeni árfolyamok a piaci trendek és a fundamentális adatok szoros figyelését igénylik.",
        "summary_en": "Bitcoin is currently at a critical junction, bouncing around the 2025 lows while the downward trend remains strong. Both Michael Saylor and Tom Lee are facing significant losses due to overly aggressive strategies. Future price movements will depend on closely monitoring market trends and fundamental data.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 25,
        "key_points_hu": [
            "A Bitcoin jelenlegi támasz a 2025-ös mélypontoknál van, de az előrejelzések lefelé mutatnak.",
            "Michael Saylor és Tom Lee nagy veszteségekkel néznek szembe a túl agresszív vásárlások miatt.",
            "A krautási stratégiák és a piaci trendek figyelése elengedhetetlen a jövőbeli árfolyamok előrejelzéséhez."
        ],
        "key_points_en": [
            "Bitcoin's current support is at the 2025 lows, but projections point downward.",
            "Michael Saylor and Tom Lee face significant losses due to overly aggressive buying strategies.",
            "Monitoring trading strategies and market trends is essential for predicting future prices."
        ],
        "main_topics": [
            "Bitcoin Analysis",
            "Market Trends and Strategies"
        ]
    }
]