[
    {
        "video_id": "7i4jnYtTcqM",
        "title": "One Interface for All Your Crypto! Infinex Beginner’s Walkthrough",
        "published_at": "2026-01-29T10:46:00Z",
        "sort_date": "2026-01-29",
        "url": "https://www.youtube.com/watch?v=7i4jnYtTcqM",
        "transcript": "If you've been around crypto for a while, you already know how scattered everything [music] feels sometimes. You trade on one exchange, you keep assets spread across a [music] few different wallets, bridge every time you switch chains, and maybe open per somewhere else [music] entirely. Infinex is an attempt to pull all of that together into one interface while still keeping your keys in your hands. And they sponsored this video so that we can show you how their app tries to clean up the mess. Infinex is basically a crypto super app where you can do most of your onchain activities without jumping between multiple different apps. You can hold your assets, move them across more than 20 networks, trade per, check your NFTs and meme coins, and still connect to outside [music] DAPs when you need to, and your assets stay in your wallet. Infinex just handles the routing, [music] the bridge choices, and the gas headaches in the background so that you don't have to think about which [music] chain you're on every time that you want to do something. So, it is built by Cain Warwick. He launched Synthetics back in 2017, one of the first big DeFi protocols on Ethereum. A few years later, the incentives around it helped kick off the entire yield farming wave, which is how he ended up with the nickname the father of modern agriculture. After watching people deal with clunky interfaces for almost a decade, he came up with Infinex to attempt to solve crypto's UX problems. So to build it, Infinex raised roughly $68 million through the sale of its patron NFTts. That round included funds like Founders Fund, Wintermute, and Solana Ventures along with angels such as Vitalic Bdderin, Anatoli Yakovveneno, and Stani Kulichov. Now let's get into the product itself. Infinex starts trying to simplify things right from the moment that you sign up. When you go to infinex.xyz and create an account, there's actually no seed phrase to write down. Instead, you secure your account using a pass key. It's the same kind of tech behind modern passwordless login. Your account is tied to your devices secure hardware. So, you open Infinex with Face ID, Touch ID, or your device PIN. And you can set up multiple pass keys so that your phone, your laptop, or even a hardware key can all access the same account. And you also don't have to worry about fishing the same way that you do with seed phrases. Pass keys are domainbound, so they only work on the real infinex.xyz. So even if [music] you do end up on a fake site, there is nothing for it to steal. So once you're in, everything is in one portfolio. You can connect wallets. you already use like MetaMask or Phantom and nothing about ownership changes. You still control the same addresses. Infinex just lets you see and use everything from one place. And those imported wallets use the same pass key sign in too, so you don't have to juggle browser extensions and passwords just to check different wallets. And those imported wallets also benefit from Infinex's gas abstraction feature. So instead of holding ETH, Soul, or other gas tokens on every chain, Infinex uses a separate gas balance that can be funded with any token. The app tops up your balance automatically and shows you when it happens so that you never have to think about which gas token you're missing when transacting across different chains or trying new ecosystems. Another core feature of Infinex is Switch, short for swap and [music] bridge. It's the routing layer that handles swaps and bridges across the app, and you tell it what asset you're moving, where it's coming from, and where it needs to end up. Switch then looks across more than 20 networks along with different dexes and bridge routes and figures out the most [music] efficient path. You can also use Switch to move into yield earning positions that might be ETH, soul, stable coins, or other assets. And the app shows you the APY and your earnings directly. And you don't have to bounce [music] between different protocols to get there. And if you do want to step outside Infinex, there is also a browser extension. It lets you use your Infinex account as a wallet to cross third party DAPs. So to the DAP, it looks like a normal wallet connection. And for you, it's still the same Pasi login and the same gas abstraction experience that you get from Infinex. Now for more advanced traders, Infinex integrates Hyperliquid to handle onchain perpetual futures trading. You use the Infinex [music] interface, but the actual per trading, order books, matching, liquidations runs on Hyperliquids engine underneath. [music] So that means that you can trade onchain perks across 100 plus markets with leverage up to around 40x directly from your Infinex account. You simply [music] post margin using any token you already hold and Infinex routes and converts it in the [music] background. And Hyperlquid isn't meant to be the only option long term. Infinex has said that it plans to plug in other onchain per venues like lighter and synthetics [music] as well so that you can access multiple per systems through the same interface [music] and account instead of jumping between platforms. Now, layered on top of all of this is Crate Run, Infinex's incentive system. It rewards users for activities like trading perks, using Switch, or holding a patron [music] NFT. And those activities earn crates. And each crate contains a reward that [music] could be a USDC payout, an NFT, or a voucher linked directly to the upcoming INX token launch. Up to 10% of the INX supply is set aside for these vouchers, and each one gives the holder the option to buy INX [music] after the token goes live at a preset valuation tier. Now, those tiers range from 1 million to 1 billion fully diluted valuation with the lowest tiers being the most limited. The vouchers become usable once INX launches in January and they expire [music] after a year. The token will also be tied directly to how much the product gets used. Fees from things like per trading, switch swaps, bridging, and future features flow into [music] the Infinex treasury. From there, a portion of that revenue will be used to buy INX on the market over [music] time. Well, those are some of the core features in Infinex today, along with a sense of how it's trying to smooth out the onchain experience without taking custody [music] away from you. If you do end up checking it out, let us know which part stood out to you. [music]"
    }
]