[
    {
        "video_id": "obI-Yn0jbac",
        "title": "â I Called Gold 2 Years Ago. This is Next.",
        "published_at": "2026-01-29T15:34:51Z",
        "sort_date": "2026-01-29",
        "url": "https://www.youtube.com/watch?v=obI-Yn0jbac",
        "transcript": "Gold hit 5,598. Silver 117 and hit 120. Thank you. So, what's next? Recap first. 3 years ago, uranium and gold found him. 2 years ago, retire on gold. Gold to 4,000. One year ago, better than crypto launching commodities in launch line pro. 10 months ago, buy gold exclamation mark. the exact system to win in a crash. That was when we added the commodities pro portfolio and large 9 pro that Mark Coops is managing for us. 5 months ago, better than crypto. I have something better for you on site with Mark Coupoops. 3 months ago, gold to 4,100 by the dip. Silver was at $49. And Mark said this, >> I remain very bullish on gold. I remain very bullish on silver. And just for the record, we covered the generational breakout in gold perfectly when it happened to all members in the Friday tier report in March 2024. That was a clean breakout with gold. Silver clean inverse head and shoulders breakout with gold. So, congrats everyone who has been following along. I'm extremely happy and satisfied that I could serve you all this on a silver platter. $116 per ounce silver platter. If you're still not subscribed to the channel yet, guys, I don't know what to tell you anymore. Today, let's call Mark and have a golden silver update and look at the next commodities opportunities. Hello, Mark. Congrats to the gold and silver. Thank you so much, CTO Larson. Yes, we made the right predictions, I'm happy to say, and I'm looking forward to diving more into the details. Silver's performance the last couple of weeks and months has been absolutely stellar. We are close to $120 per silver ounce. And what I'd like to do is talk about the supply and demand fundamentals with which I'd like to come to a conclusion if the silver price will continue to move up or maybe crash significantly like we have seen in all the previous bull markets. >> This video is education not financial advice. For financial advice, seek out a licensed financial advisor in your jurisdiction who can take your personal situation into account. >> So, let's first look at the supply fundamentals. If we look at silver, about 70 to 75% of silver is a byproduct mined as part of zinc, lead, copper or gold mines. Lead and zinc mines typically produce about 30% each, copper 15% and gold about 10%. And that means essentially that the production of silver is very static and doesn't increase significantly as a result of a price increase. After all, if you are a lead, zinc, copper or gold mine, the increase in silver price will not drive you to produce more copper, lead, zinc or gold. If we look at the total silver production the last couple of years, we see significant deficits. Typically we produce around 800 million ounces per year and we get another roughly 200 million ounces of silver out of recycling existing electronics and other areas where silver has been used. The demand however is close to about 1.2 billion ounces. And so we see an ongoing and structural deficit in silver production which is between 140 which was 2024's deficit to 250 million ounces per year. 250 million was in 2022. In terms of growth, we see growth in terms of production in the singledigit percentages. And last but not least, if we look at new silver projects which can increase the actual production of silver, we see first very few projects which can increase production. And second of all, we need to look at the time frame in which projects can be taken from discovery to production, which typically takes seven to 10 years. And so if we look at that, there are essentially three companies which have mines coming or increasing production. Visla silver with their Panuko mine in Mexico. They target about 20 million ounces of silver ramping after 2027. We see a gold in silver with the zagandar expansion in Morocco. They want to increase from about 5 million ounces to close to 7 million ounces. And we see America's gold and silver with the crescent silver mine which is being integrated into the Galena complex with a ramp up into 2028 of about 5 million ounces of silver. Those are the three large mines which are going to produce and bring additional production online. But that's all. If we look at the demand, we see industrial demand at about 700 million ounces. That is across electronics and electricals like EVs, grid, AI, hardware of about 500 million ounces. And we see solar photovoltaics at about 200 million ounces. Jewelry demand also represents about 200 million ounces. Silver wear about 50 millions and then we see another 200 million ounces in the physical investment like the bars and coins which many people buy. The biggest growth we see in photovalttaics. Photovalttaics grew three times in the last 10 years since 2015 and we see a potential increase of 30 to 40% over the next 3 to four years in photovalttaic silver demand. We also see a significant increase in the electronics, semiconductors, data centers and AI hardware demand. And last but not least in the automotive, EV and charging infrastructure. So the question is silver is now close to $120. Will this persist? Let's look at it from this side. Investment demand is very cyclical. So the paper ETFs can dump silver at any point in time. We see that investors can dump their silver even while factories still need it. We see micro and liquidity shocks. In a panic, people will always sell what they can sell and what is liquid, not what they want to sell. We see a lot of futures and derivatives positioning, right? Paper market positioning often dominates the shortterm price like we see many times when the markets in the west come online. There is a possible option for substitution in terms of technological uses of silver. Although these will take time and have a limited impact on silver use and we may see a recycling response based on the demand of silver. In other words, an increase in the recycling which will return additional silver to the market for which higher prices are required. But bottom line is that the main bearish forces in my view as it relates to silver are very cyclical in nature. Whereas the bullish forces are structural. We see a structural increase of demand. We see a structural drive of about a 10% higher price for a silver ounce in the east. In the Chinese market compared to the west, we see a very bullish momentum in gold, which over the last couple of days has again increased to about $5,500 per ounce. And silver is rapidly following. And as such, spikes aside, I expect that silver over the next couple of years will continue with a very bullish momentum. >> So what I'm hearing then is that if we get significant corrections or dips, it could be another buying opportunity. >> Yes, that is correct. What we have seen in the past is that even dips of about 50% in gold are not uncommon. And if we see a 50% correction in gold, we could see even a larger correction in the price of silver. Now if silver corrects let's say 60% the silver stocks could correct even a lot more. And so there is a tremendous amount of downside and a tremendous amount of volatility. At the same time, if I look at the pricing of silver stocks currently, they are not priced based on a silver price of let's say $1,110 $120. They are priced based on essentially a cost of production which is close to 20 maybe $25 and an actual price of about $ 35 to $40. And as a result of that, we can safely say that a tremendous amount of margin which the silver producers are currently making and will continue to make as long as the silver price stays at this or even a bit lower levels will result in tremendous margins, tremendous cash flow and thereby a tremendous rerating of the silver companies over time. Again, that is aside from spikes downwards. Yeah, Mark, you told me something very interesting about oil. >> Yes, let's dive into oil. I'm not going like I just did for silver going to explain all the supply and demand fundamentals. Although on the supply and demand side, we see chronic underinvestments and depletion in existing oil fields. But instead of going into all the numbers and details, I'd like to highlight a technical model which was developed by Tom Mleen of the Mlean Financial Publications. And essentially his model, as you are showing, suggests that gold tends to lead crude oil prices by about 19 to 20 months. In other words, the broader gold price trends are often reflected in the oil market roughly a year and a half, year, eight months later. And that's what we can see also in the chart here. Over the last couple of weeks, even months, we have seen that while the crude oil price has continued to essentially trend downwards, oil companies, the best of the best like the Exxons of this world, have already seen decent price appreciations of around 20%. And as such, my expectation is that this will continue that we will see oil catching up between quotes with gold over time. And so if people are uncomfortable with the current silver and or gold price and are wondering is this the right time to step in, I suggest that they look at the price and the potential of an increase of the oil price and the related commodities. Oil has been hated for a long time. We have seen as I mentioned significant underinvestments and as a result I expect the all price to go up massively over the coming period and over the next couple of years. >> Amazing as always and we will make uh more videos together. >> Thank you Tuck. In terms of offering, as you know, commodities are fully supported in Line Pro on the same level as tech stocks and crypto. And the difference versus many others is that I added it before the pump. That's on citrarson.com. And Mark does the commodities pro portfolio for us in the tool. Very grateful for that. He does that for free. For more indepth commodities specific service, definitely check out Mark Coups, the real coups dedicated service on the realcoups.com. He has a special deal for CTO Larsson members. It's not an affiliate link. I don't have a kickback. Mark is just great. Thank you. Tuck CT out."
    }
]