[
    {
        "video_id": "oKJRFtji4uE",
        "title": "BITCOIN AND ETH: EMERGENCY MARKET COLLASE!!!!! 🚨🚨🚨",
        "published_at": "2026-01-29T17:35:25Z",
        "sort_date": "2026-01-29",
        "url": "https://www.youtube.com/watch?v=oKJRFtji4uE",
        "transcript": "episode and as you can see right now Bitcoin is getting flashed back to approximately 60K if we get all the way down to the 200E moving average. As you know, we have been saying that this range here that we have between 86 and 93 is super super important. And if we get flashed to the downside, if it is a toilet flush, I mean literally to the downside, we are coming to papa in one way or another, we're going to get magnetized like a magnet here to the 200E moving average. And we have been preaching about this. I mean, basically since October 8th when we started to derisk, we said that we have two buy signals. either 200 week or 50 week. And now it seems that we are breaking down and the target here would be 50 week [clears throat] 200 week. If if if the week still recaptures 86, we're back into no man's land. Basically, the week still has three days to go. The weekly candle is not closed. It can still recapture all of it and get back into the range. But I would say if you wait for the weekly close and we close like this, it is flash button getting pressed with a big fat finger. The bell the bears have a big fat finger on the flash button and they're going to click it. If it is the case that we close the week like this guys, this is the scenario. This is what's happening. This is what's playing out. And as you know on this channel, we've been anticipating it forever basically because we are in a bare trend. Now what's interesting is here uh we have all kinds of assets dumping. I mean you see gold even gold dumping a bit. Silver silver also dumping a bit. Everything is dumping a bit. S&P a bit down today also not too much but a bit. Uh NASDAQ a bit down today also. So all kinds of assets are down. It is return of the dollar. You remember a few days ago I told you that don't get too excited with the dollar going to uh to zero too fast because it is just back in this range where it's uh normally at. And as you can see, this wick is now recovering quite fast. And nothing too spectacular has happened with dollar weakness. I mean, it's not super weak when you when you look at where we are in the dollar strength index is basically where it was 2015, 2016, 2017. I mean, all the way up until today, basically. So, we're at quite a significant uh position here within a known big range for dollar strength index. and the strength that dollar had here in 2022 and also here in 2025, early 2025. That is the anomaly that we had. We had an anomaly. It was super strong here. And now we're kind of back to this range where dollar has always been. So it seems that dollar now is taking back a bit of ground here. Recapturing some ground while all other assets are falling a bit. Good morning everyone in the US. Guys, what happened? You woke up. Maybe you clicked the flash button because something happened when you woke up. [laughter] when the stock market opened then stocks started to go down a bit and gold started to go down a bit. It seems that that was kind of the trigger for Bitcoin to also break down because it's basically when the stock market open that everything started to collapse. I mean you see yourself if you look here in the sidebar everything down everything down you have Avox you're down a lot [laughter] poor Avox man poor Avox is it still above alltime low or not? I remember we checked it. See? Okay. Still still it's still above all time low, but it's going to test it soon. Everything is down. Everything down. But here's the good thing, guys. It is better if we fall to 200 week faster rather than we bleed out for months and months and months and quarters, quarters and quarters. For the bulls, the best scenario would actually be to just go here quite fast, get the flush and have this fantastic opportunity to buy. Also the question is when should you start buying because waiting for the exact 200 week it it may just not happen. It may get the front run. So basically within 10% I would say if you want to start buying within 10% of the 200 week moving average is quite a good uh buy zone. Okay, it's it's going to be very nice even though we're likely going to be in uh bare trend still when we get here just from a historic riskreward perspective around 10% uh here uh basically is fantastic fantastic just in case we get front run and we don't actually touch 200 week because there are many eyes on 200 week but here historically it's so nice it's so so nice we have the simulation as you know oh by the way this is how crypto looks today man Bloodbath, bloodbath, bloodbath. All of the cryptos down, down, down, bum, bum, bum, bum, bum. Red light therapy. Red light therapy in real time. Now, uh, here's the thing. If you buy within 5% of 200E moving average, we have the simulation here. You see the results. The results are very nice. One month, 6 month, one year into the future, very, very nice results. So, just historically, statistically, this is the buy zone. And as you can see, we're not that far off, guys. People say, \"Ivan, you're so bearish. You're so bearish. I don't know what you're speaking about. I think I'm brilliant. [laughter] I'm very humble. Very humble. But I think we've been brilliant, guys. I mean, what what else can I tell you? Like, who else has consistently been telling you to be riskoff since October? I don't know too many people. I mean, most people are yelling buy the dip or ISM or some other other thing. [laughter] Okay. And uh I'm not a bear. Well, why why do you say I'm a bear? Because we have a clear re-entry. We have clear re-entry on Bitcoin both when it comes to the bullish scenario and the bearish scenario and we've been risk off. So all in all look here um it's not even that far. I mean we need to fall like 25% more for Bitcoin is not a lot like it can easily do it in a week. [laughter] Okay the bed within few weeks here it did it did that in three weeks. Okay from this peak here acceleration boop it did like 35% in three weeks. So literally literally we can be here maybe even in February for bulls. The best thing would be just to rip off the bandit. Let's go to freaking 200 week already in February. Let's go to papa. Papa is calling. We're going to get here. If the bear bears bare thesis play plays out and if a bear thesis does not play out then we're going to get back in here. I think many people they don't understand that you don't have to be corner. We're risk off since October but we're going to be risk if Bitcoin shows strength. We're not corner. This is why I don't understand people like Ivan Ivan you're your bearer. What do you mean? [laughter] We're not cornered into anything. If Bitcoin shows strength, great. We're going to see it above 50 week or Bitcoin shows shows deep value. Deep undervalue undervalument like there is no tomorrow best riskreward. Mama mia. Personally, if I had to choose, I mean we have the plan either or but the 200 week is just a better riskreward where you can go big time. You can deploy big time at 200 week just from a riskreward perspective. You can be more ballsy. You can be more confident in your move versus if Bitcoin goes up here again to above 50 week because here it's not this you know big dump to fair value. It's a fast recovery. It would be show a strength. Yes. So it would be a signal to become bullish. But I would not be as bully as down here because obviously this is such a discount. So, you know, in terms of what is best riskreward, the best riskreward is always buying at 200 week. And again, we're not even that far off. We're not even that far off. So, if gold and silver continue to correct, which is kind of time for them to correct. Let's see how, you know, how this is going to close this week. But, uh, I told you don't get too hyped on gold and silver at this stage. It's too late. You should have been hyping it. and uh be being bullish when um uh when they flip bullish on the money line which was uh long time ago. Now the time is to see where we see deep value in them as well. A good way to enter as you know we discussed this morning is if gold goes back to the 50WE or 200 week silver is the same. Silver is the same. Uh both of them they're so far off their 50 week and it's a signal that they're overextended. The further off you are from the 50 week, the more uh the more room you have to fall just to touch it and revisit it. And you know this is not new for us. All assets at some point they come back and they touch. For example, you see how far Zcash went above the 50 and now it's kind of working its way back to the 50. Many people said here as well Zcash will never get back to I said I told you it's working against gravity. You can be bullish until the bare trend but it's working against gravity because Bitcoin is in a bare trend. People say I no what do you speak you don't understand zikash fundamentals you don't understand zikash fundamentals you don't understand you don't look at zikash man listen it's going to come to its own papa and 50 week in this situation where you have an asset that pumps like a mfer the crazy thing or for mega bulls that buy the top is that they can get wrecked 80% because look here if zcash goes to 50 uh 50 week from this stop it is basically 80% crash. But here's the problem. If you form in, if it goes to 50 week and it bounces, it's still bullish structure because if you're above the 50 week, you're in a bull market. So Zcash can still be fully bullish. All of this fundamental I mean you don't understand fundamental. I mean you are right. I mean fundamentals are great. It goes back to 50 week it gets b it gets a bounce. 50 week is where normally things bounce if they are in a bull trend. So you can have a bull trend with crazy volatility where things pump like hell like Zcash now bam then go back to 50 week and then continue even higher and imagine being here especially if you use le I mean you're going to get cooked you're going to get cooked alive your your mental your mentality is going to get tested your brain is going to be really really pressured so the same thing applies to gold to silver uh there is nothing new under the sun this time is not different they're going to come back to their 50 weeks If they come back to their 50 week, you understand what's going to happen to Bitcoin, it's going to also go go down a lot. It's going to go to 200 week because there is no uh rotation. There's no rotation from gold into Bitcoin now or from silver into Bitcoin now. Okay? There is no rotation. Instead, gold dumps, Bitcoin dumps. This is how it is right now. I'm not saying it's going to be like that forever, but right now looking at what we're dealing with, gold dumps, Bitcoin dumps more. Stocks dump, Bitcoin dumps more. Like this is this is why why why if you have been listening, you know that we are in a bare trend. So you have a curse in the bare trend where basically everything is is interpreted against you. Meaning that your peers pump, gold pumps, you don't pump. Your peers dump, gold dumps, you dump. Okay, this is this is the curse in bull market. When we're in a bull trend, we have vice versa. We pump no matter what. Like the stocks go down, everything goes down, bitcoins up anyway. And also, oh man, I love the the panic. Like there is something about this, you know, the final hope disappearing from the eyes of the hopeful diamond hands diamonding down 80%. There's something very reassuring about that because it's it's what needs to happen for us to bottom out guys. I mean you need you need the final diamond hander to say bare market is here and that's when bare market is over because there are no more sellers no more sellers. You have the diamond hander hodddle hodddle hodddle hodddle hodddle and you see each and every day some of them the hope disappears and they sell. The hope disappears and they sell. And when they sell, we we keep going lower. They provide sell pressure. When the last diamond hander, the last, you know, roll Paul ISM believer, business cycle, what the hell they believe? When the last says, \"Holy crap, it's bare market. They're the last seller.\" Kind of the last samurai. You've seen the movie. Who is it? Tom Cruz, Tom Hanks. Who is it? Last samurai. the last holder with the last diamond hander, the last other holder. [laughter] When they say, \"Guys, Fenito, I'm wrecked.\" They let go of their bag and the rocket comes. We're going to have the rocket man is going to be at 200 week because normally I mean that that's kind of normally where it falls here when everyone has has given up. Okay, who is the last samurai in the comment section? Let me know if you if you're if you're still hopeful. Now you see I'm also holding 30% of my portfolio is still deployed but I'm not selling it like see it's I'm I'm not counting myself as this as this diamond hunter who is going to you know lose hope because for me like I'm not emotional I mean you see yourself actually I ideally we want to go to 200 week because that's where the best riskreward the best ever riskreward to redeploy with big fat size and you are quite certain is going to be very very nice just within a year is going to be very nice there there's no other thing that can there's No other other gift I can wish for for that in terms of riskreward. We also going to be bullish here but just risk risk rewards riskreward is just less and just less is Bitcoin is still like it's still expensive here but it's it's showing signs of strength and we need to participate in strength. That's it. We don't discriminate. It's showing strength. We're going to be participating. So guys that's that in terms of Bitcoin. What can I tell you? kind of goblin town kind of not kind of sideways kind of and listen eth is just um it's just you know bitcoins b i tc I mean you understand it's uh is bitcoins uh yeah bitcoin is the papa in this case so eth I don't know people want me to say something special about eth like it's going to go if bitcoin goes down it's going to go down more that's it that's it that's it that's it the same the same guys but here you have to be careful because if we lose this uh 90 support right here. The next support is very low. It's at 30. So be careful here. Just be careful. If gold goes to papa 50 week, silver goes to papa 50 week, it's quite a big fold there for gold and silver. Bitcoin goes to papa 200 week still 35%. Yeah, sana it it it may lose this supports. And I'm I'm not this is not my opinion or anything. I'm just telling you what the chart is saying. There's a support here and there's there's no support until here. So just keep it in mind. And uh what did I want to show you? Oh yeah, we do have very very good updates from our community. Mooncat is trading copper. Very very nice return. And here's the thing. Why are mechanical rules so important? I keep telling you about is because when you see an opportunity, you don't get lost in overanalysis. This is an example of overanalysis. I just saw it before before we went live. Like I I posted that you know Bitcoin is breaking down this and that and this guy what if it goes up instead? What if you know this this constant this constant what if what if what if it I buy now and it goes down what if I sell now it goes up what if what if what if what if you become paralyzed don't understand anything meanwhile within bulmania with mechanical rules you have a strategy you can take any trade you can take any trade copper 25% easy easy easy you don't have to marry copper you just trade without emotion in boom out entry exit very good system then Supreme Governor yet again. Uh 40 like this guy's crazy. This guy [laughter] he he's posing good good wins quite a lot following the mechanical rules using our system. Entry price 87 85 out out tight stop- loss good risk management. This guy uh oh yeah this guy commented on the stocks he found. So he he he's now trading uh miners gold miners up 35%. So when you have a system such as mechanical rules, you don't have this constant. Maybe this, maybe that. Oh, Ivan, but how do you know? How do you know, Ivan? How do you know, Ivan? You say we're going to go to 200, but how do you know how? Listen, no one knows. We just position accordingly. We position. And if the thing goes against us, we change our mind to the whatever is the whatever the market tells us. Okay? And that that's so important. So go to buller.com if you want to join us. If you want to break free from this plebber prison, what if? What if? What if? What if? What if I buy it goes down? What if I What if? How can I be sure? If you recognize, you really need bullman.com because even in this, you know, maybe boring time, you see, money is made. Money is absolutely made. Um, now what else, guys? Let's go to Q&A, I guess. I mean, I'm not sure what else to show here. It's Yeah. Oh, yeah. Guys, guys, look here. Manipulation. Manipulation. It's manipulation. Raise your hand if you think today's crash is a pure market manipulation. It's manipulate, MAN. [laughter] It's manipulation. What? What? What do you mean? What? H how? How manipul? It's in bare trend. We're breaking a range. How? How is manipulation? How manipulation? [laughter] This guy needs bull mania. This I don't know trending. He needs to get bull mania very fast. Big shout out to Miles. Uh but yeah I also this you know dear Bitcoin you're supposed to be [ __ ] mothering gold digital gold please start acting please please please manipulation. Oh yeah. Yeah. Emily said the the blue menu is needed. Look here. This dump was completely unex How do you mean unex it was completely expected? How do you mean unexpected guys? Like how how how it's unexpected. It's exactly what we Yeah. Anyway, completely unexpected. I've been studying technical analysis and there were zero signs. Maybe he's joking. I mean I guess he's joking. If anyone saw this coming, you're a genius. I guess I'm a genius because it WAS PURE MARKET MANIPULATION. Impossible to predict. [laughter] I don't know. I mean, it's a If you recognize yourself, you need to go to boom.com. If you want nice trading platforms, go to bullming.com/partners or exchanges I use in the comment section. You have big fat signup bonuses on all of them. You can go long, you can go short, whether it's Bionex, Buybit, Bit Unix, Hyperlquid Dex, like click here, you support the channel, you get big signup bonus and we'll go to Q&A. Let's discuss, guys. Let's discuss. But I LOVE IT. MANIPULATION WAS BUT IVAN, how how how do you know for sure? How how what if it goes up? What if it goes up? What if it goes down? We need some calmness. Brain massage or Q&A. Exactly, Taco. Exactly. Watching the the world burn. [laughter] Exactly. Yes. But listen, it can still recover. It can recover still. But let's see. The week, the week has three days, man. This is music. This is music. I I don't know why, you know, this this this Drake Beyonce crap. H how is that big? This should be big. Shaikovski, you know Chaikovski? You don't know. Wow. Very nice. Okay. Yeah. Yeah. Let's go, guys. Let's go guys. I excited as he left market. Wouldn't be as excited if it was a 150k. Well, we would be very excited because see I mean another guy. We're not cornered guys. We're not cornered above 50 week. We're back in. So here would be the buy zone. And by the way, our average sell price from the October peaks is between 105 and 110. So here would basically get back in the same price but we avoided everything down like if it continues down. So our in the bull scenario our strategy is flawless as well because basically we got free insurance against 80% dump and we get back at the same price but it would be it would be a bit better. It would be a bit better if we go to 200 just risk reward is better there. I mean for everyone for you it's also better for you it's also better if we go to 200 week it reminds me of the game Loom. Exactly. Swan Lake. Swan Lake. Exactly. Swan Lake. You can tell who was overexposed. Exactly. Exactly. That's very very true. It's very very true. Uh I'm officially the biggest bag holder of AOS. Yeah. Yeah. Be be careful. Bear trend is very serious. As soon as bare trend, you're out. Ian, you called the top. You can afford. Sometimes we have bigger, sometimes we have smaller. It's This one's very nice. This one is very nice and it includes a compliment. How you say complimentary? This small uh how you say plate. What's called? Does this have a name? It has a small plate. It's very very nice. [snorts] Down. Um Ivan, in my opinion, you have to change your tone or we will count. Listen, if you watch, you want to watch, you don't want to watch, it's up to you. I don't want to change any tone because we see that it hits it hits the nail in on the head. Exact. Exact. And everyone who has a brain knows that I say everything with love. When I say someone asked me a question, I say this is a plebbe question. Everyone who has a few brain cell and has a bit of gray matter. They quickly understand Ivan is giving us a lesson with great love and with great care. You understand? [laughter] You understand? If you want someone telling you, \"We're going to go up. We're going to go up. Start X.\" Like Alex Becker. Start X is going to be Star CX. 30X. Okay. Go go go go go. Turn off. Turn off. I'm going to turn off for you. If you If you don't turn off, we will turn off for you. We will turn you off from coming this. We will turn you off before you turn us off. YOU UNDERSTAND? >> [laughter] >> YEAH, YEAH, YEAH. I mean, you're not interested. I'm very much not interested in micro strategy. Exactly. Exactly. I'm very much not interested in micro strategy. Why? Because I've been speaking about this before, but I simply don't understand the full risk. The full risk. I don't like the way Sailor speaks about it with uh you know it's it's going from a serious enterprise to uh to like a religion cope hope also he issued so many different debt instruments with uh STRK I mean so many different ones I just don't understand this like just buy Bitcoin buy bitcoin at 200 week is going to be way way better way better way better now if you really believe in sailor you love him this and Let's actually see the price. Let's see the the how it looks. It goes below 200 week moving average. Um last cycle it also went below by quite a lot. Um last time it went 50% below. So yeah, I mean somewhere soon is going to be a bottom here. Maybe if it I mean you can just see uh it's not going to bottom out before Bitcoin bottoms out. But you know now it is at 70. Maybe it goes sorry it's 140. Maybe it goes to like yeah 80 70 maybe somewhere here you could uh you could start looking into it but I don't like it. I mean personally it's not it's not for me. It's not for me. I do believe I mean if I'm to bet uh who is going to be the next season's villain. Maybe it's going to be Sailor. Who the hell knows? We had Mashinsky. We had like I don't know. Maybe it's going to be Sailor. Who the hell knows? It just we always have some kind of villain in each season of crypto. And uh if you think about the big players who potentially can have a bit of problem, it's basically sailor and yeah, I mean who else? Uh yeah, let me know who you think it is. But uh but potentially potentially I mean who knows listen with probably it's okay. It's just from my riskreward. I don't like it. From my riskreward, I like Bitcoin more. A 200 week if you if you can get Bitcoin 200 week from riskreward is the best best the best the best better [snorts] than a sailor better than anything. And if you want more volatility, why do you complicate it with like sailor stuff? You can go to buybit uh bullming.com boom.com/partners exchanges. I use you click there, you get big signup bonus. You can use leverage with with stop loss with leverage. Like if you want to amplify your gain, why go to things like micro strategy where you simply don't control anything. I I don't know what seller is going to do. He's going to issue more debt. He's going to sell stock. He's going to devalue the stock. Like I don't understand fully how it works. I don't know what he's going to do, what kind of idea he will have. It seems that he's making it up as he goes along because again, he's like creating new debts, new this and that. And um why do that when if you want more risk? Because if you want more return, you need to take more risk. So you can go to sailor, you can buy his stock or you can go to buy bit, you can do leverage. It's going to be more risk, but at least you control it. At least you understand what the hell you're doing. At least you understand your liquidation price. So to me, it makes more sense. Uh because then at least I know what the hell is happen. I'm in full control. With sale man, I don't know. Maybe something happens. Maybe I mean it's a company. It's a company. Ivan, I like your tone very much. There you go. There you go. See? See that's uh but I I know that it's it's appreciate. I mean I mean I see in the stats guys listen if it would not be appreciated that we would see in the stats but thanks for saying it out as well. But I know myself also like I would rather see this is why I I I know that the my delivery works very well because uh I I was a a professional swimmer. Many guys you don't know but I was a professional swimmer in the past and the type of trainer the type of coach I like the most is the coach that didn't sugar wrap that didn't say anything and that didn't say say like anything indirectly who was super direct said exactly what he thought and that's where I felt okay let's work like here we can have work you know I I understand what you're saying uh I respected that coach more because we we had a few ones like we had another like softy he was like I don't know but I don't understand anything I was trying to get him to give me like feedback on the technique okay on the technique I don't understand anything so I I I myself I know that in sports and in you know in general also in education I appreciate when someone is very upfront what is going on and uh I liked it so there you go Ivan in my five years you made me understand charts in a new way I never knew you about uh the moving averages/gravity. Thank you. There you go. Cryptoco pilots, thank you very much for your generous donation and it's very very nice to hear. Big shout. This is the best version of Fort English. Exactly. We have our own. English is also something we have our own. Hey Ivan um uh this is first crack at crypto and approach have been uh basically at back to zero. Any advice going into next cycle? Well, when it comes to next cycle, you have to be buying at a good moment. If we go to 200 week for Bitcoin, it's a very good moment. Uh, that's number one. Number two, if we go into bare trend, you have to be out. I mean, it is what it is. Doesn't mean in this in one day, if you look at our de-risking, it's not like, you know, one day and everything is out because that's impossible. Um, and it's a very bad strategy. Instead, uh, yeah, you have to take it one step at a time. So here October was the first signal. Then we derisk more when we went below 50 week and then we drisk more when money line flipped. So here is one example of how we've been derisking in a smart way where in case you see we start drisking October 8th because it was fake alltime high. Let's say that we were wrong like it just continues to the upside. We correct this mistake in a millisecond and and become super bull again. So this this would be easy to correct and that's how you want to think. You don't want to do something where you're 100% certain like there's no certainty in the market. Whatever you do, it needs to be easy to correct in case it's wrong. So this is what we did. Uh if this would be wrong, it would be super easy to correct. Boom. We got more confidence when we drop below 50 week. If this was wrong, also super easy to correct. And uh then we would see if it would go back to alltime high or not. And then finally bare flip. It was the final nail in the coffin so to speak. So you never want big uh small mistakes become big disasters. in whatever you do. So the same thing is in case we go to towards 200 week moving average, you can deploy a bit. You can split up your capital maybe in five chunks. Start deploying a bit. So in case it goes against you, it's easy to correct. Uh and let's say we have a nice bull market the coming years. Uh you have to be ready to take profits and uh and cut and so on so forth. All in all, it's it really is a deep rabbit hole. You should go to booming.com and watch the video here at booming.com about the mechanical rules because I mean that's what it's all about at the end of the day. [snorts] Uh and uh it's yeah it's it's fantastic. It's fantastic. It's uh it's there there are two alternatives. Either we go to 200 week that's like a no-brainer or we go back to 50 week and we kind of have like some kind of super cycle you know this continues into another leg up. It will be bullish but I don't think it's gonna back up basically because then it's kind of you know this cycle is done like super long and who knows maybe we pump it. You see when you go deep you know that the pump is going to be long. If we now go up let's say bulls recapture the initiative here and we go back up to above 50 moving average. I mean it is bullish. It is very very strong sign from Bitcoin and we will have to be bullish. I mean that's that's the whole strategy here. But the thing is we it's just unknown like how long it's going to continue because when you have a bare trend and it didn't go down to significant levels like 200 week and then bull tren starts again it is just less certainty how long it could be just no six months and then a real big fat bear starts. We don't want that. Instead we want a proper reset. Everyone is wrecked anyway. So you you guys who didn't risk is actually also in your best interest to cheer for a fall towards 200 week. Why? because you wrecked anyway for you if you're down minus 85 or - 95. Listen, for you potato potato, you wrecked anyway. Okay, you wrecked anyway. Like it's just dust anyway. So don't don't get angry when I say that. We're going to go it's good to go to 200 week you wrecked anyway. Your portfolio, you know, if it's goes down a bit more like who the hell cares you. So, but then actually for us to come back and have real life changing gains, the the probability just goes up. So, that that's that's my message. That's my message. Uh so, everyone should actually be cheering for the for the flash. We need to flash. Um, Ivan, your tone is what made you famous. Don't listen to the I know. I know. But thanks. Thanks, Dr. Talk. But I know, I know, I know. [snorts] Will you make a new song? Bitcoin goes to Papa, man. Maybe we should if we go to 200 week, maybe we're going to release Bitcoin goes to Papa. [laughter] Oh, yes. Oh, yes. Rip up the But guys, let's let's keep it quite short. 30 minutes is good length. Um, I think I communicated everything. We had a a longer stream this morning. Go and rewatch that one if you want all the news. We had all kinds of news this morning. Thanks a lot for being here yet again. Thanks a lot for contribution to the stream yet again. Fantastic having you all here. Hope you like this. Smash up the like, subscribe, and see you all tomorrow. Have a good day and goodbye guys. Goodbye. Goodbye. Bye."
    },
    {
        "video_id": "Vx14StIlHWM",
        "title": "New dutch tax rules change everything #shorts",
        "published_at": "2026-01-29T16:34:53Z",
        "sort_date": "2026-01-29",
        "url": "https://www.youtube.com/watch?v=Vx14StIlHWM",
        "transcript": "If you're in Netherlands, you should actually leave. According to Dash Parliament, the narrow spoon introduce a new tax system called the wet workment box three. Starting January 1st, 2028. Under the system, investor will be taxed each year based on actual change in the value of their assets. Even if those assets are not sold, the tax will apply to Bitcoin, other cryptocurrencies, stocks, bonds, and similar investments. I know many people are watching from Netherlands, but number one, you're not in a correct place. Number two, you should figure something out. Instead of using estimated returns, the government will calculate tax by comparing the value of assets at the beginning of the year plus any income earned during that year. I I don't understand, guys. I mean, to me, well, I do understand. I I don't want to get too political because I'm kind of burned out on all of this politics. Uh but it's phenito."
    },
    {
        "video_id": "JKph-gX1Uyk",
        "title": "BITCOIN AND ETH: THE FED PAUSED RATE CUTS!!!! (no way...)",
        "published_at": "2026-01-29T10:16:34Z",
        "sort_date": "2026-01-29",
        "url": "https://www.youtube.com/watch?v=JKph-gX1Uyk",
        "transcript": "Welcome to yet another episode. And as you can see right now, Bacon is still at 87 88 is kind of here flapping around with clipped wings because we are, as you remember, in a bare trend. In a bare trend. We have clipped wings. But guys, we may have had Jerome Powell take out the big fat scissors and cut the wings of Bitcoin even more. Why? Because he's saying they're not decreasing rates more. They're not going to decrease more. Listen to this. While job gains have remained low, the unemployment rate has shown some signs of stabilization and inflation remains somewhat elevated. In support of our goals, today the Federal Open Market Committee decided to leave our policy rate unchanged. Having lowered our policy rate by 75 basis points over the course of our previous three meetings, we see the current stance of monetary policy as appropriate to promote progress toward both our maximum employment and 2% inflation goals. So for now guys, no rate cut. No rate cut. Obviously, everyone who is in risk on assets wants rate cuts. It is what fuels the markets. It is really what gives us ability to pump. Trump wants rate cuts. As you know, Trump is really now criminally potentially persecuting Jerome Powell for not decreasing rate cuts, but incre decreasing rate by having rate cuts. Of course, he's saying that it's because of the Fed building renovation or whatever it was, [laughter] but there's a lot of pressure on the Fed to cut rates, but they're saying not today. Not today. So, in one way, you can really see this as Jerome Powell saying that we are coming to Papa when it comes to Bitcoin at 200E moving average. That's the target. If we don't break out from this from this uh uh range to the upside, the downside target is 200E moving average which is at around 60K now and it is increasing. So let's see when when we meet it. But all in all for Bitcoin the story is unchanged. Our story is unchanged. In fact the the next decision point is still either we go to 200 week or 50 week. And I would say that the path of least resistance is still that we go towards 200 week. But I have to also tell you that I'm more excited for Bitcoin than ever before. We're not buying yet because it needs to figure itself out either 200 week or 50 week. But each and every day I'm more and more excited about Bitcoin because the amount of pump that gold has had is is magnificent. I mean it's crazy. Every day new alltime high. Yesterday was new alltime high. Today probably new alltime high. Everything is just alltime high after alltime high after alltime high. And while we did a video yesterday saying that you should keep your cool if you don't have gold, if you did not buy gold when the money line flip bullish, which was seven months ago or so. And if you're just chasing this, you should really keep your cool. You look at commodities when we flip bullish on the weekly for gold. You see it was one year, it was over a year ago already. Time flies. Silver was seven months ago. But so the idea here is not to chase gold. If you don't have it, wait for it to go back to some kind of moving average like the 50WE or the 200 week and then you can start adding to your long-term huddle. It's going to be the best riskreward scenario because currently everyone's just chasing chasing chasing chasing. This parabola will cool off at some point. So if you want a good riskreward plan here, it is to wait for some kind of moving average touch. And it always happens. I mean you you look at any time through market when you have a big pump, it always comes back. Like a good example is in 2020 massive pump. Everyone thought we're going to go to 10K or whatever, then book back to 50 week. So whenever you have a big pump, it will cool down. Don't sell if you have gold. That's another side of the story. Not saying to sell gold. You could take profit if you are in a nice profit since the money line flipped. But don't sell your winners. The winners can keep rising. But listen, gold pumps a lot. It is very good for Bitcoin. Why? Because it increases the target market for Bitcoin. Because Bitcoin is coming for gold's market. It is digital gold. It is alternative for gold. So obviously if gold now is way bigger, the amount of pump that Bitcoin will have has also now increased a lot. I mean when you look at the global asset ranking here and you see what's happening. Gold is currently at 38 trillion which is crazy. It's absolutely crazy. Silver is at 6 trillion. And when you look at Bitcoin, we are at 1.7. So if you think about it, this is the best thing that could have happened to Bitcoin ever because all assets are valued relative to their peers. When you have let's say Apple go to 3 trillion, everyone now compares Microsoft, Amazon and their peers to Apple. I mean if Apple is this valuation and they have this and this and this revenue and this and this and this growth and so on so forth, why shouldn't Microsoft who is maybe the same or better be also at whatever trillions Apple is? So all assets are valued based on their peers. The same thing with your house. Let's say your neighbor sells his house for good profit. Maybe he 2xed. He bought it super cheap. He 2xed. [laughter] There's a lot of u there's there's a lot of stimulation that central banks have been putting into the real estate market over the last uh 10 years, especially between 2010 and 2020. So many people got very very rich just by having real estate. But so when your neighbor sells his house for a big profit, now your house also went up because everyone now compares. Uh so all in all very important to see gold as very positive thing for Bitcoin. The fact that gold is pumping is exactly exactly exactly what we want to see and uh you don't have to chase it. You should have bought it when the money line flipped when we did see here the flip seven months ago for silver platinum. But now is not the time to chase it. Instead see the big picture. see what the market is missing and the market is missing the fact that Bitcoin is digital gold. I mean that's the last thing people are saying now the market is really missing that and the time to buy Bitcoin is either here or here. That's going to be the best riskreward situations for Bitcoin and uh we're going to keep sticking to our plan. Our plan has been working fantastically well and uh we're just going to keep following it. Now Jerome Powell was actually asked what he thinks about gold pumping. It's a very interesting answer he had. basically said he doesn't care. But uh listen to this. If I go here, I zoom in. Boop. And let's play. >> Significant price increases we've seen for precious metals. >> Don't don't take much message macroeconomically. Um the argument can be made. It's you know that we're losing credibility or something. It's simply not the case. If you look if you look at where inflation expectations are, our credibility is right where it needs to be. So we look at those things. We don't we don't get spun up over particular asset price changes. We do we do monitor them of course. >> So the Fed is saying they they know that gold is pumping. They don't really care too much. And the reason why he's saying so is if you look at number one S&P 500, there's no selloff in stocks. Stocks just don't pump too much. But they kind of went to alltime high the other day also. But there's no selloff. So it's not like everyone is just selling US stocks to go into gold as soon as possible. So that's number one. But number two, maybe even more important, it is looking at the yield. Looking at the long-term yield, the 30-year yield, you see, for example, it's not really going up a lot. Recently, last weeks, when gold has been pumping, it's basically where it was back in 2023. And when the yield is going up, it means that people are dumping, they are dumping bonds. In this case, 30-year Treasury. If you have 30-year Treasury yield going up a lot, it means that everyone is afraid. They're dumping the bonds and they they're buying gold, for example. In this case, it's not really what's happening. You don't see the 30-year yield go up a lot. Is the same as it was in 2023. The same thing with 20-year yield. Let's check. It's also not really going up a lot. It's it's like it was back in also 2023. So, there is no sign of panic that the world has lost confidence in the US dollar. Looking at exact numbers, specific numbers such as, for example, are they buying or selling long-term treasuries. If you think that the US is going to hyperinflate, you need to dump US treasuries very quickly because they they pay out in dollars. Okay? [laughter] So to see the confidence of the world in the US dollar, the best thing is to look at the 30-year and the 20-year yield. If they go up a lot, it means people are dumping. People are dumping the treasuries. When treasuries are ging sold, the yield goes up. There's an inverse relationship. Uh currently, we're not seeing that and is also kind of what Jerome Powell is saying. However, however, it is true that someone is buying a lot of gold. I mean, someone is buying a boatload, a boatload of gold. People are speculating that potentially it is China before they prepare to take a specific island. You know, they want some one specific island and then maybe they're afraid of sanctions or whatever. They just accumulate as much gold as possible so no one can sanction them because you cannot really sanction gold in the same way you can sanction a bank account or some kind of reserve they have in in the international banking system. Could be. could be also it is true that the investors are hedging the tail risk of US dollar hyperinflation. It's a very low risk but potentially it's higher than it's been during the last few years. So instead of having let's say 1% gold allocation maybe now more and more people go 5%. Just like Ray Dalio has been preaching for decades and decades and decades that the US dollar is going to collapse. You should have at least 5 to 10% gold. So maybe that's that's what's happening. I in my mind that's more reasonable explanation here. does that the the gold is not something that's really collapsing the US dollar but people are seeing man the debt is high the debt is high and someone now also on top of that aggressively aggressively buying like there is no tomorrow uh maybe China preparing for something here is Ray Dalo saying that it's venito is venito now the I love Ray Dalo but the problem is he's been saying that for 10 plus years so basing trades just on this long-term analysis that he does is not really viable we need to place trades based on trends Just like gold went bullish a year ago, that was the time to be bullish gold. Not when Ray Dal was speaking about, you know, forever because it also went from 2K to like 1K and then it went to 5K. So, you need to capture the trend because even if analysis is correct, your portfolio will still get wrecked if you mistime it. Okay? Instead, you want to be sure you are in the correct trend. But anyway, here's what he says about the longer term view for the dollar. Obviously, super bearish, but also probably true. I mean, at some point, it's going to be true. Listen to this. It's the beginning of the end of um the monetary system as we know it. It's not just the US dollar, it's the fiat monetary currencies. So the UK, the euro, Japan, China all have similar debt problems and so on and are dealing with the same inter relationships which is the reason you're seeing gold being chosen by the central banks. They want a a currency. Gold has always been the main currency and it's the only non fiat currency. In other words, not the currency that can't be printed that they want. And so that's why you're seeing central banks move and sovereign wealth funds move to gold. And that's the nature of the shift of the monetary system. It >> and and just like you guys are saying in the comment section, which I fully agree with. I actually have a tweet here about this specific thing. You need to see gold for what it is. Like we said, it is a very good thing for Bitcoin that it pumps. And if you just have a few% to rotate into Bitcoin, we will be flying. We're going to be flying. We're just going to be at 200K before you can blink. Bob Lucas is saying gold added Bitcoin's entire market cap today. This what people are saying on Twitter. And Bob Luc is saying, who cares? The buyers moving tons of gold certainly don't. These narratives are cyclical. It's all about the timing, not cheerleading someone else's party out of hope. What does it show? What it does show is that when Bitcoin turn bitcoins turns come turn comes is going to be big fat pump. The path to truly silly and out numbers is no longer a fantasy. So people have seen gold run from 2, three, 4K all the way to five soon maybe 6K. Obviously, as soon bit as soon as Bitcoin puts a candle, let's say above 110, above 105, it's gonna get crazy because people will remember what gold did and of course they're going to be applying the same logic to Bitcoin now that Bitcoin is showing strength. Uh, by the way, currently Bitcoin is not showing strength, but as soon as it does, we will have to react and we will have to react very, very, very rapidly. Currently, if we'll look at how things look, you have the uh 50WE moving average at uh 100. Uh if we really get above it and start closing, it's a very bullish sign, guys. Here's going to be very bullish sign. And then if we get above the moneyline flip, which is currently at um 111 uh 112 approximately, it goes up and down a bit because the the prices go up and down, but somewhere here um it's going to be a mega mega signal. mega mega signal. Uh we're not there yet. Obviously, we have to look at the midterm progress. If we look at the performance by year by year, as you know, we are in the midterm year. It's not too great for Bitcoin normally. We're following the midterm trajectory kind of exact. So, we're not front running this. Very important. We're not front running that Bitcoin is going to repeat what gold is doing because it can still take six months, eight months and still be correct. People that are saying that this is going to repeat and they're buying now. Um they the risk is not too good. It they may be correct. It may it may happen. But if it it just takes extra six months or eight months, which it can easily do with these assets, they're going to be not in a too good place because then we're going to be coming to Papa at 200 week. Okay? We're going to be coming to 200 week. [laughter] So, you may still be correct just I I don't want to do something that is not a good riskreward. The the only thing that makes sense from a riskreward is to have like 30% of Bitcoin like I have. I I'm not uh I haven't sold everything, but I have the risk heavily since October 8th, but that makes sense to me. like in case we wake up and you know everything is just up only. So that's that. Next you have Peter Shift coming out saying that Powell basically said that the recent jump in gold is irrelevant to Fed policy the video we listen to. But when Greenspan was chair he said that he watched gold closely as it was the best indicator of whether interest rates were too low or too high. How can a once critical metric no longer be relevant? Uh yeah, I mean listen things um things can be seen in different from different lenses. Uh you can definitely say that gold is a signal that fiat is going to zero but it's not a USP specific signal. I I guess that's the problem. It's not a USP specific signal. It's a world signal. U a bit like Ray Dal is saying Swiss Frank is also going down against gold a lot. Gold is pumping against Swiss Frank. I mean it's pumping against all currencies. So when you look at the confidence in the dollar, the yield is the the better signal. Uh now obviously Greenspan previous chair of the US Fed uh had it as a had it as an input to his model. Uh you you could have it as an input but neither is fully right or fully wrong. There are many different ways to see it but I do understand what Powell means when he says that there is no sign of people losing any kind of confidence in the Fed when you look at uh uh the 30-year or or 20 year or any of these yields. They are basically the same as they were back in the day. So guys, that's that. [clears throat] Uh, moving on, moving on, moving on. We have Tether. Tether has been playing it super interestingly. They have been buying gold like there is no tomorrow. Tether have been diversifying into gold. They're buying $1 billion worth of gold per month. So, if it really is the case that we are going towards a goldbased world order, they're going to be a big fat player. They're going to be on the on the level of, you know, JP Morgan. They're going to be on the level of uh the big banks of today, but in the world denominated in in a gold denominated world. So, uh gold just added four trillion of market cap. It is the 2x entire Bitcoin market. You see how small we are. You see still how small Bitcoin is. And you can of course argue that Bitcoin is way better. You guys know all of these arguments. I don't think we have too many new people joining crypto now. So, I don't have to repeat all the basics to you. But Bitcoin, you can store it. You can have it. You can you don't need to transport it in a truck. You have it in your brain potentially if you want. You you can have a seed phrase that stores your your funds and I mean Bitcoin is a winner when it comes to use case. No doubt about that. Does not negate the fact that we are in a bare trend. And some people they don't understand why we're in a why Bitcoin goes down. Like Miles, I love Miles. But he's saying if you had told me a year ago that in 2026 we would have a lower dollar, lower interest rates, a new Fed chair, uh rapidly increasing global liquidity and so on so forth, I would assume Bitcoin would be at at least 150K. Either the market is mispricing or something has gone terribly wrong. So again, I love Miles, but uh I I don't follow this mindset as you know, we should have this. If you told me that this would happen, I would tell you this. This is unfair because what it screams to me is that it's unfair. It's unfair. Why? Why are we not higher? Why are we not higher? Why are we not higher? But it's simple, man. It's simple. It's a bare trend. You don't don't worry too much, man. Don't worry too much. See, this is the problem when you worry too much about fundamental or whatever you have. It's uh you over complicate it. We're in a bare trend. It is what it is. Okay. Uh most people who click buy and sell buttons, they look at the trend. If the trend is bare, they just don't buy as much. And people who uh are in a asset which is in a bare trend when there is a pump they sell. It's the curse of the bare trend the bare trend will stop. But um I there's nothing surprising. I mean there's nothing surprising but I see many people like that that oh no it's unfair. That's why I told you people were telling me Ian the ISM chart ro Paul is saying ISM. I told you ISM doesn't matter. Maybe maybe it will affect but from a trading perspective it does not matter. The only thing that matters from a trading perspective investing perspective is the trend. uh again because even if ISM is right even if roll is right but he's six months off timing wise you are wrecked your allins are minus 90%. So, we're practical. We're practical. All analysis is correct. All analysis is correct. The question is if they're badly timed or you act on them in a bad time, it it doesn't help you. In fact, it wrecks you. So, uh yeah, just want to come tonight because I see many people complaining. Many people complaining. It's unfair. It's unfair. I don't know. Oh, also guys, I love Alex Becker, but uh you know, 30X is coming. All season is coming. It has wrecked so many people. It's it's quite insane. you know, all season old season. Alex Becker successfully predicted 42 of the last two old season [laughter] old season 30x 40x I think now if you look at when he started to say 30x 40x uh I mean everything went down like 90 plus%. So to get back to original level, you need like a 30X. [laughter] [gasps] Guys, follow the trend. Follow the trend. How many times can I say it there? Just follow the damn trend. That's it. It's so simple. It really is so simple. Now guys, we have more news ahead. Then we're going to go to Q&A. I want to welcome everyone who's watching live. Big shout out to Dab who is timeing us today. Smash up the like, subscribe to the channel. uh go to bullmayer.com if you want to learn trading for real. I teach you there and um also you don't have to really bet big in terms of direction. Now you can you can bet quite small but if you use leverage in a smart way and this is something of course that we teach in our uh in our programs. Check check. Guys, I believe we're back. I believe we're back. We had a bit of connection. We had a bit of connection. You know, it's crazy, man. We're what? We're We're uh live. It's live television. Anyway, we're back. We're back. We're back. Check. Check. Check. Check. Check. Confirm that you hear me. That confirm that you see me. So, I don't know where I where I got cut off. But I was just telling you, you don't have to like bet big. You don't have to bet big on big moves. You can bet small and still make a lot of money if you know how to apply leverage in a smart way because things are flipping bullish every day. On the short term, you can play it very, very nicely. And you don't even have to do crypto. I mean, for example, you have Supreme Governor inside our Discord in Bullmania. He's applying the money line and mechanical rules and he just did a a small snipe here that resulted in 140% just intraday from gold from 5.2K to 5.5 closed the trade. That's it. That's it. That's it. From a risk perspective, very nice. And then also when it comes to stocks, Raziel from our discord as well has sniped SanDisk in a very nice way. Uh, fantastic. Fantastic. And all in all, even in this bearish time in crypto, if you know how to apply the mechanical rules, if you know how to trade based on trends, even on a smaller time frame, intraday for example, it can be very very nice. So that's why I'm telling you go to bullming.com, watch the free video to learn and and to join. All instructions are there. And go to bullming.com/partners or it's also if if you see below, it's uh exchanges I use. The link is called exchanges I use. Sign up on Pionex. You can trade go long or short. You can trade gold, stocks, whatever. And here you can also do the bots. You can trade on Bit Ununix, buy bit and all of them. So you can go long or short. So even if you have a small opportunity here, let's say 5%, 10%. If you know how to apply leverage correctly, not just, you know, use it as a gambling. Most people don't know how to use leverage correctly. I teach you that in bullmayan.com. Go and watch. It's very nice. I mean, it's it's very nice. You don't have to be too married. You don't have to be too attached. You see a bull trend, you act on it. Very important. Next, this is interesting news, guys. From where? From EU. We have more information why they're suing uh Elon Musk and X. Apparently, as part of their, you know, investigation, as part of their lawsuit, as part of their discovery, as part of their discovery, they have now submitted the evidence. Okay? and um you know that they are suing Elon Musk because they don't like how the check marks look. Basically, they're suing Elon Musk saying that when he took over Twitter, he made the verified check mark very dece deceiving. You don't know who is real, who is correct, like who is a real person, who is not a real person. And as an example of that, they use this Donald Duck picture and they say, \"Listen, this account is verified, so Europeans will be tricked. That is the real Donald Duck. [laughter] Look here. Example of the textual and visual interface design granted to experience subscribers. The identification line is only grant to those who go through additional verification process.\" So this you have the ID is verified and [laughter] I mean poor Europeans guys poor Europeans because it says ID is verified they have a check mark so that's why guys when people are saying that US dollar is going to go to zero why because everyone is losing trust in the dollar there is nowhere to go where you going to go you're going to go to euro where you going to go with your with your money Where where where where you you got to go to Europe? They are not competitive. They they are they they are you know they're bureaucratic. Their brain is bureaucratic. They cannot get out of their brain. They are very conservative. They're very riskoff. They hate entrepreneurs. You have insane taxes in for example Netherlands where they're going to tax unrealized. Let me actually get this unrealized. Unrealized. Okay. unrealized crypto gains. It's coming. It's coming. It's coming. It's coming in a big way. Like 40% unrealized crypto tax. Look here. In 2028, you're going to have this uh this happen. Be super careful. If you're Netherlands, you should actually leave. According to Dash Parliament, the narrow spoon introduced a new tax system called the wet work box three starting January 1st, 2028. Under the system, investors will be taxed each year based on actual change in the value of their assets even if those assets are not sold. The tax will apply to Bitcoin, other cryptocurrencies, stocks, bonds, and similar investments. Now, big shout out to Netherlands. I I know a lot of you guys from Netherlands are Guzman. What's going to happen to Guzman? Exactly. Guzman, what's going to happen to you? I I love you guys. I love you guys. I mean, if you are from Netherlands, big shout. I know many people are watching from Netherlands. But uh number one, you're not in the correct place. Number two, you should figure something out. Guzman, I don't know what's going to happen to Guzman. He he's going to be grilled. He's gonna he's [clears throat] going to grill him. Instead of using estimate returns, the government will calculate a tax by comparing the value of assets at the beginning of the year plus any income earned during that year. I I don't understand. I mean to me, well, I do understand. I I don't want to get too political because I'm kind of burned out on all of this politics. U but it's phenito. It's phenito. It's phento. It's phenito. So euro will not compete with the dollar. It's it cannot guys. It cannot. So at the end of the day, US dollar is not going to go to zero. Uh as a lot of people are saying online, it's not going to be know this boop, it goes to zero. Instead, it's just going to be the slow grind to zero which has been going on for decades. Bitcoin is going to be the winner. Gold is going to be the winner. And uh the EU, it's it's not in the same league, guys. Like it's not it's not it really is not. They pride themselves regulating. They pride themselves being backwards. They they think they're smarter. Okay? They have very bad GDP growth. They have very bad uh safety. Very bad safety. Highest taxes in the world. Anyway, you guys know all of that. Uh ju just my point here is that it's not a it's not a comparison to US dollar. Okay? It's not even close. Now, Charles Hoskinson Charles Hoskinson is saying that February is going to get crazy. Listen to this. >> February is going to be a very crazy month. We got some stuff going on. Can't talk about it now, but you're gonna see. It's gonna be fun. February is going to be a [laughter] >> announcement of announcement. I love that. Let me play it to you again. >> February is going to be a very crazy month. >> Got some stuff going on. Can't talk about it now, but you're going to see. It's going to be fun. Crazy crazy crazy guys. Let's see. Is it pair reviewed papers? Well, what's the song? Uh, papers papers per maybe we get another one. Let's see next. Some drama in the US. US press deputy AG Blanch on alleged crypto conflicts of interest. So, apparently they found this deputy attorney general Todd Bloun demanding details regarding alleged conflict of interest in his decision to scale back the DOJ's cryptocurrency enforcement. The letter alleges that Blanch held substantial amounts of crypto when he shut down the DOJ's national cryptocurrency enforcement team. The Democrats, they they're out for blood, guys. They're out for blood. I mean, in one way, like we discussed yesterday, it would be nice if there were more checks on Donald El Trumpo, the el president, so to speak, because it's wild, man. It's wild. We We need a bit calmer. We need a bit calmer. Maybe not sleepy Joe, but we need a bit calmer. At the same time, I mean, the problem is Dems are going to come for crypto because Trump is crypto. Trump has net worth in crypto. So yeah, it's it's kind of a weird situation where Trump is not pro peace, not pro business with high tax with tariff and uh all of the roaming on the world stage. I it wasn't the the idea, but at least wasn't the marketing. These guys, they're gonna come for crypto. They're going to come for crypto. So it's a lose-lose kind of scenario here. Okay. Um the best thing I think is gridlock. We need gridlock. We need that they no one agrees on. They just freaking gridlock. Okay, get damps in the House and Senate or whatever just they gridlock this, you know, taking over of Canada and Greenland. But they cannot ban crypto either. They cannot do anything to to create. So guys, my official stance now is we need gridlock. Nothing happens. It's so calm, so nice. Uh, and maybe like four years of gridlock would be fantastic because money likes quiet, money likes predictability, money likes that listen, nothing happens great, we can invest. I mean, something like that would be amazing, amazing at this at this point. Uh, but yeah, if guys, if Democrats win, the crypto in the US may have a problem. And if they don't pass the Clarity Act, uh, a lot of the things that Trump has been doing, they can be reversed. They're going to put back that enforcement. they're going to maybe be even even more harsh in the future. So, we really need some kind of law that uh that enshrines the pro crypto stance. The problem with the Clarity Act is that it's not even that pro crypto anymore. It's pro bank. It basically means that banks can do anything and um and uh cryptos cannot do too much. They cannot do yield and stuff like that. Uh now in terms of stable coins if you are in the UAE there is a new alternative now USDU which is US backed US dollar backed stable coin for UAE. Uh again we we're speaking a lot about where to have dry powder. If you are in UAE now you have another alternative. And guys on big picture I think that's it. That's it. Let's go to Q&A questions answers debates. While you're thinking about that let me just quickly see the overall uh market. Let me refresh here. We have something very interesting with u uh the overall trend now in um uh in uh uh hype. So hype is one of the short-term short-term trades. Uh then also [clears throat] you have um um let's see XMR has collapsed. So be careful with that. And it's kind of like what we said it is working against gravity. Okay. Everything that works, everything that is in all coin and pumps like Monero has been doing, it is working against gravity. So don't like buy into the hype. Don't uh yeah, don't don't don't drink the Kool-Aid. Basically, don't don't drink Kool-Aid. Uh if Bitcoin is in a bare trend, all of this alts, they're not going to go anywhere. Their their wings are really clipped. Think talking about clipped wings, it's really really clipped. Um so yeah, there you go. Um, let's see. Today we have this world coin up a bit, but yeah, not nothing too much on the weekly. It is it is hype. Uh, let's check fear and greed. Where are we currently? Where are we currently? In fear. In fear. We go from super fear to a bit less fear. Greed here for a moment. Um, let's see what else we want to check. Oh yeah, let's see what's happening with the inflow outflow. Another outflow yesterday. Not too big. Uh let's look at long versus shorts. Uh the same picture. The same picture. The giga chads bearish. Big brains slightly bearish. Dent pro slightly bearish. And uh Lily bullish other holders bullish. Wrecked plebby very bullish. So yeah, nothing changes. Let's go to Q&A guys. Let's go to Q&A. If you want to trade, go to exchanges I use in the description. It says exchanges I use. You have Ponx, you have Bybit, you can long or short. And go to bullming.com to learn trading for real. Uh get the tools to get the money line on money scanner. Q&A guys. Anyone shorting silver or gold? It's u uh so I wouldn't really recommend it because it's still in a super long bull trend. Super super long-term bull trend and it's not stopping. uh shorting would make sense in case it goes to bare trend here 4.8 eight shorting. Now, I I know many people try to short it. I I don't think it's smart. It's not smart to FOMO in here, but short is also not smart. The only thing that's smart to do is to uh keep money in the trade. If you have uh if you have bought it uh when my line flipped or before, uh you could take a bit of profit, but you just let it ride. Or another smart thing is to wait for it to come to a moving average like the 50 and uh build for the long term long-term position. It could, by the way, still go down to 200. And if you want to short, at least wait for the bare flip. Um, it will happen at some point. At some point, it will happen. Um, can still take a long time, but uh, if you look here, at the end of the day, it did happen here. Oops. Got to move it back organized here. Um, we just go to 50 week later on. We didn't even go to 200 week. doesn't mean that we have to go to where it is now 200 week or 50 week because they do go up but at some point it's so from it's all about risk reward where you want the best riskreward for long-term bidd of portfolio if you have a zero uh wait for that touch short not smart now I think it's smart uh wait for for bare trend then you can short and for silver it's not even that far off I mean it's at 97 now I think a good comparison is Monero if you go to Monero everyone was screaming about Monero. We said it has clipped wing and uh indeed it has clipped wing. It did pump all the way to 800 then collapse into bear and uh yeah let's see if it gets support here maybe at 50 week I mean long term see this is the problem when you're so far above the 50WE because longterm being above 50 week is still kind of bullish. So this is the problem. People form in here at 800. Even if it goes back to the 50 week which goes like this. Let's imagine we you know we we touch it at some point. You can still bounce and be bullish. Okay. But your portfolio is not doing too well. This is the problem. This is the problem. You know these things they always 50 week is kind of the gravity is the gravity. Even in a bull trend is kind of the gravity. So that's why I'm saying all assets sooner or later they're going to touch 50 week. Um, doesn't mean that they're going to touch at this price, but at some price they're going to touch. Uh, so that's that. Hey, I see people talking about copper being in the the next metal that is about to go parabolic. So, first and foremost, we need to check the trend. The trend is, as far as I know, bullish on copper. But let's just double check commodities. Uh, let's check on the weekly what's happening. copper bullish since two months ago is 23% up. Um copper is very tied to the economy. So if we go into recession, this thing is not going to fly too much. It's not a monetary asset. That's why we have precious metals here as separate because they are kind of money. People see them as kind of money, you know, hodddle, store of store of store of value and so on. The other ones, the other commodities, they are more tied to industry, tied to the economy. So, as long as the economy is doing well, uh aluminum or aluminum, how you say it, and copper, for example, they're going to do well. And it's in a recent new bull trend. So, you can absolutely take bets here. Absolutely 100%. I believe you can do it on Bybit. If you go to bullnia.com/partners, you're going to see bybit link with nice signup bonus. But yeah, you can you can definitely trade it. Is it like long-term hodddle? I wouldn't hold it like long-term huddle in portfolio because economy goes bad, this thing boop gonna also go bad because if no one is building, no one is using it. It's it's too much tied to economy. So it's not like a money like uh you know gold and silver and so on. But let's actually see what what has been happening here long term. Longterm I mean to be fair it has a quite nice trend here. It still dump a lot uh here. You see by the way another example with 200 week being the gravity here it went down 40% and then just bounce at 200 and continued. So all assets even when they pump a lot at some point they're going to touch 50 week or 200. Yeah I mean all in all it's kind of mega bull long term. See boop boop boop boop boop boop. There you go. So this is going to crash hard in case in case economy stalls but super super mega long term. Actually it does look quite um quite okay. See everyone who is in crypto going from digen dog with hat to sophisticated commodity investors a bit of copper a bit of gold. [laughter] But yeah you see here uh bull trend that's that's all you need to know basically. U and then it's more for you like which one you like more. you like trades in copper or aluminium or uranium everything that's in bull trend you can you can you can bet bullish on but you know is going to be exactly copper I mean potentially uh it's hard to say like is is copper going to pump more than aluminum potentially yes because it has pumped more in a shorter amount of time so that's something but uh if you have seen any kind of analysis with fundamentals this and that just just look at what's happening here if it goes to bear be careful now if you've heard some bullish fundamental and now you also see it's in a bull trend. You could take a position. Why? Because then you are excited because you heard some fundamental but most importantly you now have the the bull trend that allows you to act on that and you have a quite okay riskreward. Uh so this is you know this may be the value of the infotainment where you have nice chart you have nice trend and you heard some infotainment. So yeah, like extra extra third grade confirmation that that that's a bit of value in this, you know, news, a bit of infotainment here and there. Who is in orange juice, guys? No one is in orange juice because this thing since two weeks ago on the weekly is up 10%. And on the daily, let's see, up 42% in the last month. [laughter] There you go. Uh, let's see. Let's see. Let's see. Let's see. You have O. Cocoa not doing well. Cocoa down. Cacao, how you say? Cocoa. Caka down like hell. Uh, so yeah, that's that. Is there any way to verify a Bulman employee or am I being scammed? So, email hello bullmania.com to verify. There are many scammers. When people join Bulmania, we actually have in the agreement that it's your responsibility to not get scammed because the amount of scammers, impersonators, AI and so on so forth, it's crazy. So, always verify. Email hello@bulling.com. Don't answer DMs. Don't answer Twitter. Don't answer anything. Don't answer emails even. You yourself need to email out because an email can get spoofed. I can send you an email from any address. I can it can look like it comes from Google or whatever like it comes from bank. So spoofing email Google it. So don't the only thing that is like bulletproof more or less is that you send an email and someone replies to it. Okay? Because that you cannot do with spoofing. You cannot reply to an email that was sent because you cannot rece if you spoof someone's email. You cannot you're not you're not going to see the the receiving. So normally the scammers what they do is that they spoof an email. Let's say that they pretend to be like your bank. If you reply to that email, they're not going to get it. But that's why they put reply to and that's their scam email and they hope you don't notice. So a real email arrives, it says, you know, yourbank.com or whatever. But then when you click reply, reply to is set to like the scam separate one that may look like the domain is very similar to. So yeah, anyway, look at the email spoofing. So be careful with emails also. But if you sent an email and someone replies to that email, then it's different. Then it's uh I mean I don't want to say bulletproof but it's uh yeah it's legit now. Telegram, Discord, everyone is a scammer. I assume everyone is a scammer. Okay. I need to start roaming around in our neighborhoods to ask for silver and copper trash. I see people. Oh yeah, they just answered that. Uh some guy donated something about pal. I mean, guys, it's uh What do you want me to say? There's no I don't I don't know. I don't know. It's alltime low or something. What do you want me to say? I think we said everything. It's uh you're on your own basic. I mean, what what do you want? We said everything. Good luck. Have fun. Uh everyone who listen everyone who did not listen did not listen. That's it. That's it. I don't know. There there are some things that I just like gold and crypto circular some things I don't find um interesting anymore like you know last year we commented a lot of this like politics this and that I don't know what happened 26 I just don't care I kind of feel like bit this burnout you know being the same thing is with P like I don't know what it is it's just like we said everything how much can you laugh at the same joke it's still the same it's still down still going to all time another alltime low another alltime low still the you know Everyone is um in fake cult. So yeah, good luck. Good luck. Good luck. Good luck. I mean, imagine if Trump suddenly asks you to audit for NOX and the gold is not there. I don't think that that will be public anyway. What is more likely to happen is that they will repric repric the gold. I think currently they use for accounting purposes uh $40 per ounce or something like that when they value their gold reserves. So I what I have seen is that potentially they're going to revalue their gold and then somehow offset the debt with the with this re revaluing of the of the gold. So yeah, that's that Linhog. Exactly. Linhog, where's where where's Linhog? There, there, there. Since two weeks ago. See these things, they're not too volatile. Uh because it is based on supply demand and I guess the production of Linhog is super stable. So supply and demand meet. Exactly. Cocoa I guess they have cacao how you pronounce they have overproduced. They have over produced. They dump. Coffee also super stable. There we go. I mean, is there a chart to shows? Yeah, there is a chart that shows how much it cost to mine Bitcoin. Let's see. Cost of mining Bitcoin. Let me see. I have definitely seen charts about that. Yeah, we should actually copy it into the Bulmania charts. I might see I have this is the problem. Yeah, I have to subscribe to some email or whatever to see it. Let's see. And this I mean this these numbers are mainly an approximation. Oh yeah, maybe that block has mining revenue per terash second. Let's see. Yeah. Yeah. Here, here. The block. The block. The block. Let's see if they have the free data. But that's revenue. It's not It's not profit. Uh yeah, we probably need to look deeper here where let's see number number where is profit profit you see it's it's a bit of approximation also because profit is different depending on where you are what kind of electricity you have cost of that there is no see we should add it to our website I don't see exactly exact easy way to just Google it Um but I mean if you have revenue per terahash you can see how many terraash there is now and uh then you can approximate worldwide electricity cost where miners are and you can get the profit. We we will look into that. We need a nice chart there. Ivan, what if countries just cut out USD of their trade and just bartered with goods and services? This what bricks do with each other. See, this is a bit of a false u u narrative because and the the problem is that it's not fully false, but it's a mega false. Look, for example, see the bricks, it's kind of a mirage. Like, if I'm being fully upfront with you, yes, they do trade a bit with their own currency, this and that, but look at for example, how much they actually back each other. It's not a lot. And I say that as someone if you, you know, ask me like two years ago, I would say bricks is going to take over. Bricks, bricks, bricks, bricks, bricks. Okay, look at uh Russia and China. Can Russian companies open bank accounts in China? Can they trade easily with China? No, it's super sanctioned. China is enforcing is super worried what you know US is going to do. So when it comes to trade, it's not smooth like you know chi Russia China trade. You think it's smooth? It's it's super unsmooth. [laughter] Is China supporting Russia economically in this hard time of sanction? I mean not really. Of course they they they still accept cheap oil if it somehow gets smuggled in. They still use the situation to their advantage but it's more you know using the situation to their advantage than being like an economic block as equals or as you know. So uh do does some of it happen? It happens but the scale is uh super small like it's uh it is chipping away slowly and maybe if more and more countries join it's going to chip away even more but uh yeah and then uh you you see this fast their ally is gone they don't even help what happened to Venezuela where is Russia China on Venezuela where is Russia China Russia they kind of entered the agreement with Venezuela to protect them US comes boop gone So there you go guys. There you go. Trade between bricks is um they are integrating a bit more but yeah at this rate it's uh it's not foreseeable future. It's not a foreseeable future. So anyway that's that. Um but by the way I mean all reserve currency dies. I'm not saying that US dollar will live forever. It's just that it's not this, you know, sudden sudden. If you look back how long they've been speaking about the common currency, it's it's too long. And you know, the biggest economic interest China still has is the US. [laughter] Where they going to go, man? It's uh again, I'm not saying that it's going to be like that forever. It is dollar is going to zero, but slowly but slowly. So, yeah. Uh I mean what do you think will be the sign significant um uh factor driving market inflow? Well, we we we need the Bitcoin strength. Don't worry too too much about uh you know some uh catalyst. Uh the catalyst is going to be if we go above the 50 week, let's say, or if we go to 200 week. Why is it a catalyst? Because if it goes to 200 week, Bitcoin man is too cheap. You you don't need any catalyst. It's just that Bitcoin is nice as is. And then people just need to feel that it's cheap enough. So most people see it as a no-brainer to buy. That's going to happen at 200 week. You don't need any catalyst. Like the catalyst is that it's super cheap and people see it as a no-brainer. Okay? So that's going to be at 200 week. And then another catalyst is that uh okay there is uh someone is accumulating it in a big way and now we're pumping above 50 week and you don't want to miss the uh the the beginning of a new bull trend. So I mean those are the catalysts. I worry about that. I don't worry too much about the uh about the yeah anything else in terms of something happens this and that. I mean you need something really and the reason is because you need something really big for for news to be catalyst. There needs to be something really insane. Why? Because we already had most catalysts. We had the ETF. We had the US president supporting. We had like what catalyst can you have? Maybe if US does a Bitcoin reserve and they start buying Bitcoin. I mean we you see this is the scale of things that need to happen now. Uh that you they do reserve but even if they do reserve and they say oh but it's we're just not going to sell Bitcoin which they kind of said. I don't know if how much is that going to pump because that's kind of already what we've been discussing. it's just going to make something official that was already kind of priced in. But if they say actually we're going to be buying as well, then maybe it can work as a catalyst as news. But you don't need that for Bitcoin to enter new bull market. You don't need that. You just need everyone who wanted to sell to sell is going to be at 200 week. Everyone is convinced that it's super bare. We go to 200 week. Great. And just like just when everyone is convinced, that's when the pump starts at 200 week. For example, for example, le let's actually ask see here what Claude says about this China Russia thing. So, Chinese banks have become significantly more cautious about handling Russian business since 2002. While China hasn't joined Western sanctions, most major banks including big state, all of them have restricted or refused transactions with Russian entity. There we go. I mean, which bricks guys? Which bricks? Bricks is uh the all of them. I mean all of the bricks they need US. If you think about it like do you want to trade look at all of them. China do you want to trade with Russia or the US? Okay. Brazil. Brazil get here. Bricks you're the bean bricks. Who you want? Who you want? China or you want us? India come here. We're shutting you off. Go bagg on your knee. I mean, [laughter] Trump is doing it in a in in a he's kind of I mean, what Trump is doing, maybe what's a bit smart is that he's really pushing it exposed. Okay, you really want to lose us or no or no? Or no, because we're going to have secondary sanction if you keep buying too much Russian stuff. [laughter] So, what's actually working? Let's see. Some small regional banks, particularly those with limited international exposure, have have more have been more willing to process banks. So yeah, they need to use this you know pleb some you know provincial stuff. So is it possible to somehow make business work? It's possible but you know it's not this you know we are a family. It's not like that. [laughter] Not like that. Instead it's more oh crap Russia is weak. Chinese see it as a way to profit but they cannot upset the big daddy US. They cannot man. They cannot. the upset the big dad is is going to be too bad. Too bad. So anyway, I mean that's that's if you look beyond all of the announcements and I'm telling you as some as kind of a bricks fanatic maybe for like since two years ago I'm not. So until two years ago [laughter] when I kind of was like I mean come on how many times you going to say that you're going to do like you're going to crush dollar you're going to do your own like how many times you gonna say how many times you gonna you're going to make statement okay what's happening nothing in fact everyone knows the hierarchy and it's pretty clear and maybe it's going to change who knows I know that all of the rich people in China they want to go from China to Hong Kong first and then potentially the west so if we put things in perspective that's how they look like okay so the conclusion is I don't think anything is going to happen drastically long-term yes all reserve currencies go to zero and get replaced so Bitcoin gold keeping long term doesn't make sense that once the US cuts interest rates significantly enough large crypto holders will sell their holdings to reposition back into tread stocks sell off before a runup I mean stocks are at alltime high. I mean if anything is going to be vice versa that stocks are are all at alltime high. They let's say they cut rates. Let's I mean imagine I have a bunch of stocks. I see holy crap now they cut even more. Stocks have been doing well and I want to be part of a new adventure new trade. Bitcoin is super especially if Bitcoin is at 200 week it's super attractive. Uh but also this analysis I I see that you are you're in a mental prison like you try to analyze uh don't do it man go to booming.com watch the free training about the mechanical rules like don't try to analyze this because I see you're trying to analyze if they do this before they did this this that no I also love I love Benjamin C but you know sometimes people that watch too much you know what NASDAQ did in 1990 and you know rates were cut there this happened to NASDAQ when that last time blah blah might just keep it simple le don't try to analyze too much what's going to like no one knows what's going to happen you know just when a trend starts you can you can ride okay that's it [laughter] that's it that's it that's it um yeah hope hope it makes sense but uh when I when I see people doing like what you are asking I I just know man you're you you probably are not too too sure about what hell you're doing because trying to see okay they're going to Right? Then this guy then this guy is bum bum bum. There are so many assumptions in are have you gone to university? Let me confirm in the university if you if you know the scientific method. Have you gone to university or no? Or you're uneducated pleber. I'm sorry. I mean I say it with love. I mean I went to university uh also but I I didn't finish the degree. So I'm also uneducated pleber. But tell me have you gone to university? Because then you know the scientific method assumptions yada yada yada. So imagine trying to build some kind of strategy based on these assumptions that this going to happen then this guy's going to do this then this guy's going to do then this is and then they're going to leave this market. They're going to go into that man. What are you doing? How are you going to trade this? Where's your entry? How where's your stop loss? What you do with so many assumptions? What what the hell are you doing? you get you lose all all your money. Yeah. So, bullmay.com mechanical rules, that's what you need. Uh based on your question, my answer is who the hell knows if I have to pull an answer out of my donut, out of my back end, so to speak, I would probably say it's vice versa because uh stocks are alltime high anyway. So you could imagine that that it's seen as a you know signal to start a new journey with Bitcoin. But Bitcoin used to be in a bull trend for that. Uh either it's super cheap at 200 week so it's uh crazy cheap or new bull trend. [snorts] Anyway, hope that makes sense. Have you ever been degraded by AI? Uh, not I mean not really. I just um well I asked it one time what what's dumb about my portfolio and then it says yeah the dumbest thing is this and this and this which I didn't really expect it to do. I mean I didn't it was claude I didn't expect it to analyze my my portfolio. Yes, I did ask what's what's dumb about it. But you know, at the end of the at the end of the text, it was kind of a Yeah, I mean, you know what the dumbest thing is? This uh well, I did ask for the dumbest thing, but if I asked Chip PC, it would be um it would be PC politically correct. Okay. But uh Claude was like, \"Yeah, you want the dumbest thing. The most dumb thing is this. [laughter] M fun fact 95% of traders lose this true because they don't know anything. I mean they you know they like read news they try to follow I don't know what they do they uh they have no uh they have no strategy when it comes to entry exit mechanical rules take profit stop-loss etc etc. Now can you even call them trader? I mean that that's the big question because it's not true that 95% of people who are actually traders lose. That's not true. I mean it would be interesting to to do some analysis on that but you know normally you have this warning on many trady exchanges know 95% of people lose when they trade but the thing is it's the average plebe who signs up for a brokerage and then clicks button he's like a monkey with a machine gun he doesn't understand anything he's like uh uh news news news rate cut I heard rate cut 100 years ago can you call that person a trader so I don't think he's a trader I think he is uh more of a kind of machine gun monkey like he he has a tool he he can go long or short you know [laughter] so I I I don't know if you can call him a trader you know people say 99% of pump fun traders lose like are they traders I don't know you you need to have here's if you are a trader let me define a trader for you like a real trader someone who understands risk management someone that uh sees different scenarios and adapt the portfolio to them. So when people are asking me Ivan so are you bullish are you bearish I explain to them this is what this is my plan if this happens this is my plan when that happens so I'm prepared for both scenarios they don't like you see in the brain they're like disappointed they want me to say like baba vanga exactly what's going to happen but here Ivan tells like two different scenarios and I see they're like man but then I I see also that they are a bit of a pleba and they don't understand anything but so they're definitely not traders or investors so a trader knows risk management uh has entry an exit strategy, not just go all in, all out. No, exit and they know uh the mechanical rules, they know stop-loss and so on so forth. So that's the trader. Uh is it 95% uh that lose? I mean, I would be surprised if it's 95% that uh that lose. I think over general population, yes. uh but uh if you have um if you have risk management I don't see how you would be at the loss rate which is uh which is too much higher than 50% like in the worst worst worst worst worst worst worst worst cases. Okay? Because even let's say you have a like actually real monkey and they just do random you know this this boop boop bullish bear just you know randomly a monkey just selects randomly as long as you have a stop-loss and risk management and you're going to be profitable 50% of the times if if uh if you just you know do bum bum bum just just on random but the the problem is that most people are worse than that because they don't cut their loss. I mean look at people wanted to have a comment about hexo and pulse. But well, that's an example where they don't understand that they're in a super bear trend. Some of them they listen to the messiah that keeps them, you know, in the in the in the cult and they out they underperform even, you know, random clicking of the button. How can you do that? Well, you can. You can. Anyway guys, hope that makes sense. Smash the like, subscribe, enjoy your Thursday. Enjoy Thursday. Uh, thanks a lot to DAB for time stamping us. Gooman, big shout out. Let's see if he gets back with the big fat tax. He's unre he's going to be taxed on his unrealized gains. Guzman, we're with you. You're not here today. Maybe you're doing your tax report because it's going to be big bill. They're going to send you a big bill. [laughter] Guys, enjoy. Smash up the like. Hope you liked it. Was always a pleasure uh to be with you. I appreciate a lot that we have such a nice audience. Every day I come here, I turn on button. We have a fantastic chat. Fantastic guys. Thanks a lot. See you tomorrow and goodbye guys. Goodbye. Goodbye."
    }
]