[
    {
        "video_id": "snCBpMvvvsQ",
        "title": "Bitcoin Levels Are Shifting. Here’s the Plan. #shorts",
        "published_at": "2026-01-27T18:34:12Z",
        "sort_date": "2026-01-27",
        "url": "https://www.youtube.com/watch?v=snCBpMvvvsQ",
        "transcript": "What is interesting also is that the bull flip now is going to happen at 110k. So it is moving down very quickly. Uh just a week ago it was at 114 and before that was at 115 and before that back in December it was at 120. Now it is coming back very rapidly uh to the downside. Now the bull flip would be at 110. If it is the case that Bitcoin goes to the upside again, we're going to start buying here and then this is going to be the super mega signal to to be super bullish. uh our average price is also going to be like the same but we got insurance and uh if Bitcoin continues to 200 week we're going to get a massive discount and we're not going to be part of this massive minus 50%"
    },
    {
        "video_id": "6RFmrRBWzXQ",
        "title": "Why FOMOing Into Silver Can End Badly #shorts",
        "published_at": "2026-01-27T16:09:44Z",
        "sort_date": "2026-01-27",
        "url": "https://www.youtube.com/watch?v=6RFmrRBWzXQ",
        "transcript": "I see many people now following into silver and listen probably it's going to go up still because it's bull trend we always respect bull trend but the mistake here is to give up on everything else and go super super all in on an asset which is currently in a big fat parabola and yes although it will probably keep going up you just never know when it ends and in silver normally when the parabola ends it is quite brutal there is never a period a period where silver just goes up without coming to some kind of moving average. So if you are fully outside of silver, now is not really the time to be super following. I mean, yes, likely it will continue to go, but let's look at something like the monthly. Um, and if you zoom out and you see through time always when you had this crazy parabolic runs like here, for example, in 2011, it does come back to the moving average. But"
    },
    {
        "video_id": "aKaFXbZkTnM",
        "title": "BITCOIN AND ETH: SILVER CATCHUP RALLY WILL BE INSANE!!!!",
        "published_at": "2026-01-27T10:23:19Z",
        "sort_date": "2026-01-27",
        "url": "https://www.youtube.com/watch?v=aKaFXbZkTnM",
        "transcript": "We're going live. Oh yes. Oh yes. Oh yes. Oh yes. Guys, welcome to another episode. And as you can see right now, we do have a very interesting situation with Bitcoin where Bitcoin currently is at 88K. But the big action and the big uh moves are happening in silver as you know. In fact, the move in silver right now is so large is basically not even comparable to previous moves. Last time we had such moves. You see we had in 2011 when it went to $50. This is the chart right here. Then we had in the 70s, we had in the 2000s, we had now in 2020s, and we're currently experiencing still this peak in in the 2020s. And we've never seen so fast and so high rise ever, ever, ever in silver. And of course, many people are speaking about hyperinflation. Is it the time of the death of fiat? What's happening? Is the dollar going to zero? Let's talk about it. But mo most importantly we need to discuss how Bitcoin will react to all of this because of course Bitcoin is hard asset. Of course, Bitcoin is in the same category as silver when it comes to being a uh a limited supply asset which is not connected to the central banks where they can just print it like with fiat as you know. And so what's important to realize here is that there are more and more uh signs that the US is losing its position as the global financial center. For example, Germany is considering moving all uh gold from the US back to back to Germany. Also, you have this guy. It's an AI, by the way. You should follow this guy, Asian guy, AJ Asian guy. It is an AI, but he's been spot on speaking about silver and the pump in silver. And his recent videos that silver is going to go to four to $500 and he he really goes in depth here. It's a really interesting rise of AI influencers, AI influencers. But so guys for us the important thing is to keep the strategy. I see many people now following into silver and listen probably it's going to go up still because it's bull trend. We always respect bull trend but the mistake here is to give up on everything else and go super super all in on an asset which is currently in a big fat parabola. And yes although it will probably keep going up you just never know when it ends. And in silver normally when the parabola ends it is quite brutal. There is never a period um a period where silver just goes up without coming to some kind of moving average. So if you are fully outside of silver now is not really the time to be super following. I mean yes likely it will continue to go but let's look at something like the monthly um and if you zoom out and you see through time always when you had this crazy parabolic runs like here for example in 2011 it does come back to the moving average whether it is the 50 moving average or in this case actually 50 month because we're on the monthly whether it is the 50-month moving average which is the yellow one or the 200 month moving average it it always comes back. Now the thing is they moved to the upside. So the rally started here in 2004 and continued all the way to here uh 2011. And so the moving averages they obviously increase but at some point silver will uh touch the moving averages either this one or or that one. From the peak here it took u how long it took here uh like two years of dumping. Okay. 24 months of straight down just to go to the 50 um uh 50 month moving average and then it took another uh two to three years to go to the 200 moving average uh on the monthly. So all in all it will go to moving averages eventually. Okay, eventually moving averages are likely going to be higher than they are now because they are moving up. For example, now you see it's just a rocket. The moving average is like a rocket to the upside. And so let's say within the coming months if it continues maybe the moving average is somewhere here at 40s and 50s and with highest likelihood we will have a pullback in silver towards the moving average. The question is of course when you never know that but I just see so much formal let's say the moving average goes something like this uh depending on when we touch it uh it's going to be somewhere here uh somewhere here at the 50 50 month say 50 month not 50 it's 50 month moving average. So this is the uh important message to everyone who is fully out of silver. Let's say you you're not in silver at all. Do you follow him now or do you wait for some kind of fair value moment to happen? The most smart thing to do is to uh be uh very calm. See for what it is. It is a problem. It may continue. You could uh DCA a bit now, but again you're buying at such highs at 100 at 110. Instead, if you want a long-term portfolio, you're really thinking long-term and you you feel, man, I should have had silver in my long-term portfolio. Well, wait for some kind of pullback to the moving average. Okay, some kind of pullback to to the moving average. It will happen at some point in the history of silver. It's never been that it never goes and touches uh the 50 month in this case or or the 200 month. It always comes back. It will touch it at some point. It's no no guarantee where the moving average is going to be here. For example, you see this 200 month moving average. It increased from $1. This is back in the 70s and then we touched it at $5. So, it did increase fivefold before we came back and uh uh and touched it. But then it was used as support for the next rally. And in the following dump, we actually went below it. Uh and here silver peaked out at crazy amounts. Basically 50 bucks. Okay, 50 bucks. Many people were following in here. uh the better decision would be to just wait and see until it returns back. And the interesting thing is this is not the first time silver has this kind of mega pump. It has happened before. I mean as you see in the 70s as you see in the 2000s also if you look at the log chart it's way more visible if you look at the log chart. And whenever you have such a parabola vertical parabola you know what happens next? Some kind of reset some kind of move back to the moving average. doesn't mean that it has to go down for a long time could just revisit moving average and continue to the upside. But this is a very important message for everyone in crypto because you know we in crypto we're very impatient. I know many people in crypto they're impatient. They look at their old they look at their their Bitcoin and they see silver they go all in all in you have to really be careful here because yes likely it's going to continue up but most people don't have risk management. Most people have no idea how to enter a trade properly and they get so wrecked so quickly. Now the bigger question now that we understand the the silver situation and um that likely it's going to come back to moving averages at some point and it's not the first time where it pumps parabolic like this and it always comes back to moving averages afterwards even though I mean also you see longterm it is it is an upward uh uh trajectory for silver long long long term okay so there is no doubt that silver is mooning against the dollar on the long term but each and every parabola often comes back to moving averages at some coin and you know with Bitcoin the prime example we should be the best in the world the most experienced traders in the world uh that should know all about parabas and how parabas crash and how parabas move to moving averages sooner or later Bitcoin is the best at that Bitcoin pumped a lot then went to the to the 50 week now we're back on the weekly and now uh likely if it breaks down here it's going to go to a 200 week which is going to be insane insane deep value zone on and you know our plan our plan is to buy heavily at around 200 week or at uh above the 50 week and if it is the case that we go uh bullish on the money line that's going to be another confirmation to be super super bullish here and um the same thing is if we go to the 200 week is going to be the first signal to buy and then when we go bullish on the money line somewhere here u at the lower levels it's just another confirmation. Either we buy at deep value around 200 or we buy when the strength is confirmed and that the bulls really confirm that they are in control because currently it is no man's land. Currently it's just trading sideways. Chop chop chop chop chop and uh if silver and gold have some kind of correction in Q2 uh or end of Q1 even uh they could take Bitcoin with it. Okay, this is the curse of being in a bare trend. You don't pump when your peers pump such as gold, silver, I mean even stock market is testing alltime high. Um but because Bitcoin is in bare trend, it is cursed for now and that curse is going to go away when we are in bull trend or when we are at uh deep value zone for example the 200 week. What is interesting also is that the bull flip now is going to happen at 110k. So it is moving down very quickly. uh just a week ago it was at 114 and before that was at 115 and before that back in December it was at 120. So now it is coming back very rapidly uh to the downside. Now the bull flip would be at 110 and since October 8 when we start to do risk at around 125 um our average sell price here for 70% of the stack is around uh 105 to 110 on average. Okay, very important. >> [snorts] >> So if it is the case that Bitcoin goes to the upside again, we're going to start buying here and then this is going to be the super mega signal to to be super bullish. Uh our average price is also going to be like the same but we got insurance and uh if Bitcoin continues to a 200 week we're going to get a massive discount and we're not going to be part of this massive minus 50% move. So I think we've played it pretty well and I intend to continue playing it pretty well and the next signal again is either at 200 or above the 50 week. And listen uh the rotation will happen. The hard asset narrative is not going to go anywhere even if silver comes back to a big moving average whether it is you know 50 month or 200 month or let's check on the weekly. If we zoom in a bit let's check on the weekly where the 200 week and 50 week which is something we're more accustomed to uh when it comes to crypto. Crypto is perfect on the weekly. silver. It may be too uh too small of a time frame for it, but I think it's it's going to work pretty pretty well here. So, on the weekly now, we just look on the weekly. Uh a way smaller time frame for silver, but here the 50 moving average now is at 50 and the 200 week is at 30. Um so, I expect this to be touched at some point. And when it is touched, that's a good sign to start building your long-term silver huddle. I don't recommend to trade the pumps like all coins, but for long-term silver huddle to derisk against the dolorization, hyperinflation and all of that. Uh if you want a nice fair value entry, 50 week is the first signal and then 200 week is the second signal and uh they're going to be touched at some point. Um again they may be higher than now. Um as you can see they they they rise rapidly but but from a risk reward perspective if you want good entries it is it is those two and at 50 if we go to 50 week for silver it could continue down to 200. So you should know that that you buy here okay but uh there there's still room to downside because normally it touches both the 50WE and the two at some point it's going to touch both. So that's that for uh for silver. uh does that also for Bitcoin. As soon as Bitcoin shows strength uh or shows deep value, it's not the time to think that now silver has killed Bitcoin, which many people do now. Many people have kind of erased Bitcoin from their brains. They kind of forgot that Bitcoin exists and that Bitcoin is a very important asset. I see so much negativity versus Bitcoin online. It's quite insane and it makes me interested. I mean, I'm very excited for Bitcoin now. I I told you that yesterday also, but I want to repeat. I'm very excited for Bitcoin now. I think Bitcoin is going to be at such a nice uh undervaluation if we go to 200 week. It's already now kind of seen in the sentiment. People really hate crypto. They really hate Bitcoin and it's very good. I it's very very very good. Uh and uh now the the only thing we need is the price to wake up and show us something. But that's that's a very important thing to keep in mind guys. I mean Bitcoin is going to be here. ETH and everything else is also going to come back at in one way or another. But Bitcoin especially. Now looking at the bubbles, you have uh pump and hype and pump. So pump fun and hype are leading the the alls today. Looking at the weekly, we have river and hype leading. Then you have also up 23%. On the monthly, let's see what's happening. It is a river as well. And how do you catch river? you use the uh scanner because here in the scanner if you look on the daily river has been one of the or let's see when was was it not is it on the weekly that I saw yeah here on the weekly has been one of the uh highest pumpers uh since four weeks ago so you would have caught it u easily easily you would have gotten real time alert also so that's that also looking at the daily let's see what's happening there you have fight you have adi you have bit castle what it is I don't know I also don't care but from a risk perspective when you have a bull flip it is a good tradable entry and both adi bit castle yol dog game what the hell it is I don't know but it was bullish three months ago from a riskreward perspective it was a good trade and we are reaping the rewards right now if you are trading this uh also home still doing well since three weeks ago the defy uh defy app where you trade and do all of the stuff we mentioned way back you know when uh altcoins were were pumping it was pumping very very nicely now it has a very nice trend as well three weeks ago since three weeks ago you have oasis oh the privacy the privacy solution three weeks ago 50%. Uh I would still say that most of this is just the shortterm trends that uh you have to be very careful with. Uh look at Pan, look at Axel. I mean it's quite good nice short-term trends. Axel since two days ago 32% up. There you go. Even when something just flipped recently, you have nice opportunity. But still be careful guys because Bitcoin could be flushed down at any moment. We are prepared for that scenario uh in a in a big way and uh we are yeah we're not going to get wrecked in alts here. Most of these alts although they pump a lot a lot of them are around the alltime mega mega loss. Okay. So don't get it twisted. See it for what it is. Nothing wrong with trading the short-term pumps. And if you want access to Bullmania to get the money scanner and all of that, go to bullmania.com. Now guys, we have a lot of news there. There's a lot of news going on. One of the biggest trends now is really that there is a bit of fatigue with the dawn, the Donald, the orange man. I mean, yeah, I I feel that there is it's so much fatigue now. Like we need we need sleepy Joe back. We need someone who doesn't do too much when it comes to capital markets, when it comes to uh when it comes to money like it it's nice when it's quiet and nothing happens. Okay? I mean for you see yourself look at Bitcoin, Joe Biden, Trump. Uh Trump was supposed to be pro peace and pro business. Uh now it is uh chaos. It's chaos as a service. It's uh not too good. I mean for Bitcoin you see you see as well it's it's it's not too good. And now a new tariff another day, another tariff. South Korea is now going to get a higher tariff because they don't want to pass the trade deal in time. Although they agreed on a trade deal, South Korea's legislature is not giving up the deal with the United States. So guys, my point here, by the way, my point here is that if midterms happen and Democrats get the power, the House, the Senate or either one of them, I think actually for Mark is going to be very good. for Mark is going to be super super good because the current situation where Trump is roaming like a wild boar or how you say chi chi in the China shop a bull in the China shop money doesn't like it money really doesn't like it and it was I mean what what you say is not really what uh we discussed previously with the pro peace you know no wars pro business it's totally different now so when it comes to this we have to really monitor the situation with the midterms and just like this account is saying listen it's you know it's baffling how many people don't understand that the prosperity of the US is of the US is propped on the dollar plus trust in their system okay system needs to be trusted German investment in the US dropped 45% to nearly 12 billion in Trump's first year back in office while exports also fell sharply so all of this is going to be adding up I don't think that it's in any way going to hyperinflate the dollar in the short term because there's simply no other alternative. You look at the world, who is better? I mean, US is still the best. Is it the EU? No, EU is not better than the US when it comes to a potential reserve currency or potential global global trading hub or potential global financial hub. In fact, the market share of EU uh GDP percent GDP of the world GDP EU is alltime low. What else you have? China. China is not going to be reserve currency. Why? Because they have capital controls. They have no transparency. Uh in comparison to the west, it has basically no rule of law. And obviously many people say west has no rule of law. Listen, it's a spectrum. It's a spectrum. And I mean ask yourself which one you want. You want the Chinese one or you want western one? if if you are in some kind of process. So it's not an attractive proposition either. Capital is fleeing China like there's no tomorrow. It's the very tight capital control. So it's not like China is going to be the world reserve currency. Russia obviously not super weak economy. I mean everything's super weak. Uh obviously the the conflict. So who else? South America is not going to be world reserve. What else? What else? You have bricks. I mean bricks is all of this um kind of friendships kind of not kind of [laughter] not kind of united kind of not um are they going to be a a trusted uh a trusted alternative where the you know the black rocks of the world the big money the trillions are going to flow into into bricks run world financial system I I doubt it guys I doubt it I doubt it I doubt it uh Singapore I mean potentially Singapore is super small it's I Singapore is a niche. It's niche. It's very good. It's like Switzerland. It's a niche financial hubs. It's not going to be world financial hub. Uh look at the Singapore stock market. Look at Swiss Swiss stock market. They're very small. They're very good for I mean for wealthy people. Very nice regulation, very nice tax, fantastic rules, fantastic banking, but it's not I mean it's not in the same level. It's not in the same league. Very different. Very very different. So uh that's why yes, all of this chaos is happening. Um Trump needs to get uh some counter counterbalance. Uh it's going to be very bullish for the markets I think if uh we get counterbalance in the midterms. Uh for crypto for crypto Trump has been very good. Um but we just need to keep that. I mean that's the thing. We need to keep that. We need to keep it being good so that when the next president comes that it doesn't just change overnight. Let's see guys what's going to happen. But all in all, I'm looking forward to the midterms. I think that it will mark a bottom in Bitcoin and uh potentially in in other assets as well uh that that are trending down. Uh why? Because there's going to be more certainty that the US is still kind of US and uh the alternative to there's no alternative to to the US anyway. Now when you look at global there there is no the only alternative is gold is Bitcoin and silver and that's it. Um so yeah let's see what's going to happen there. But uh just uh important to realize with the the the the investment environment we're in and there's a lot of pressure that will be released if there is checks and balances which hopefully will happen in after midterms. Guys, look at this. Uh Binance listed gold and silver and as you know when Binance lists something it's down only. [laughter] Okay, boomer's going to find out what the Binance listing is. As soon as Binance listed silver and gold, it started to dump. [laughter] Obviously a joke, obviously a meme, but man, it is it was exact. It was exact. Now it's recovered a bit, but it's crazy, guys. I mean, with Binance, a lot of these altcoins, at least on Binance, it's is down only. So, Boomer is going to really now find out what it what a Binance listing really means. Uh also to set the record straight, yes, when it comes to u crypto, it's been in a downward trend. We're wasting it for either to either show strength or to be cheap enough for us to buy anyway at 200 week. But look here, if you zoom out, this is where R Paul and I actually fully agree. If you zoom out, obviously gold is not really a competition to Bitcoin. When you zoom out, you look a few years, just 10 years, gold is not outperforming Bitcoin. That's important to remember. Yes, short-term outperforms. Long-term it doesn't u outperform at all. So that's number one. Uh also you look here um sailor uh the same thing. Historically Bitcoin has outperformed gold over every holding period of four years or longer. Uh so just keep in mind Bitcoin is going to come back bigly, very very bigly. Here's another uh post comparing gold to Bitcoin. If you just zoom out a bit, you see that Bitcoin is wildly wildly outperforming gold. Like it's not even close. Not even close. Obviously, if you zoom out or zoom in on like 2025 or Q4 2024 uh uh Q4 2025 to now uh 2026, it's going to look different. But if you look on the big picture, Bitcoin, there is no second best. And uh just like Anum was saying, either you believe Bitcoin is eternally topped or this is an incredibly deep value spot that will be erased with a few months of uptrend. Uh could be could be um uh but it's not either or. It's not, you know, eternally topped or this is incredibly deep value versus gold. Bitcoin does look u very cheap. [snorts] I mean yourself. The problem is that uh if gold uh drops and has a correction uh then it's it's not it's not going to be really what you expect. I mean versus gold yes it it is uh uh very good. Uh let's actually see if it is at 200 or maybe versus gold is already like below 200 week but the problem is let's say let's say gold has a correction which it easily could have uh then it's not really going to be what people expect where their you know USD stack gets bigger. Most people they don't track their wealth in gold. And maybe they should, that's another argument, but most people track their their their wealth in USD. So if you act on a gold chart, I mean now we're we're far below the 200 week. So you could make the argument here that yeah, I mean in gold, Bitcoin is super cheap. It's below the 200 week. It is time to uh to buy. Uh and I I would agree with you if you track your net worth in gold. And listen, maybe we all should be doing that. Uh the problem is that if you act on this and then you switch to USD valuation, what's going to happen? You're gonna you're you're gonna get thrown off plan. You're going to get thrown off the horse. You're going to start messing with your own strategy where if you measure in gold, then yes, we're below 200 week. This is deep deep value versus gold. The problem is gold can go down 20 30% still be very bullish and what happens to Bitcoin and um and what happens to your USD valations? Okay, ju just remember that. Yes, versus gold it looks very good. If you're measuring in gold, we're below 200 week. It's uh yeah, it's quite attractive. Uh not versus USD versus USD and most people measure in in USD. It is um is still not there. So, uh all in all, I think Bitcoin for sure is going to come back. In terms of the timeline, I think we will bottom out somewhere around the the midterms, probably connected to how we always do it. Look here on the performance, yearly performance. You look at the midterm year, Bitcoin is tracking it exactly. We check it every day, but it's because yeah, I mean, it's tracking it exactly. The green line is 2026. Uh until that changes, until we see big big convincing change. There is yeah there's no reason for us to uh to to change our mind every day and to and and and to not look at the the clear picture which is insane insane correlation with previous midterm years. Uh guys, before we go to Q&A, look here. This guy from from Black Rockck, uh Rick Reer, Ryder, Reer, how you pronounce Rick Reer, he said that Bitcoin will likely replace gold over time. And this guy, this guy is potentially the new Fed chair that Trump will be electing. As you know, Trump will probably change his mind a million times before before he decides. Uh but if it is this guy, this is what he said about Bitcoin in the past. >> Um before you go, you you had alluded to the the distinction between what's happened with the price of gold and Bitcoin and and you said that you think it's moving towards Bitcoin. Is that a a long-term trend? Does that mean you're a a Bitcoin bull? I asked because we had talked to Jamie Diamond earlier this week who despite JP Morgan supporting crypto in a very big way and actually Bitcoin to some degree um on Bitcoin itself. He seemed to think it's still very possible if it ever really reaches escape velocity and maybe it's getting closer as it it it passes $18,000 uh per Bitcoin that the government actually would try to regulate it. So Andrew, I mean I think listen I think cryptocurrency is here to stay and I think it is a durable and you've seen the central banks that have talked about digital currencies. I think digital currency and the receptivity particularly millennials receptivity of uh of technology and cryptocurrency is real. Digital payment systems is real. So I think Bitcoin is here to stay. I think you know do am I am I a Bitcoin bull? I mean I don't do a lot of it orally any of it in my portfolios. my uh my corporate portfolios, my business portfolios. But do I think it is probably I you know it's hard to say is it worth the price it's trading at today. But do I think it's a durable mechanism that that you know do I think will take the place of gold to a large extent? Yeah, I do because it's so much more functional than than passing a bar of gold. >> So this was years and years and years ago and this guy if he gets the position as Fed share the Bitcoin reserve is seeming more and more likely and like he's saying Bitcoin is better. You can store it, you can transport it, you can divide it. You for sure know how many bitcoins there are. You don't know how much gold there there is. There could be an asteroid with infinite amount of gold. And also more gold can be produced. More more gold can be extracted from the earth when the price is high. And that's by the way what's going to happen over the coming weeks and months. You will have an increase of supply of gold and silver on the market. Why? Because the price have has increased so much. So if you are a minor now you can go and mine in places which were unprofitable before. I mean for you to drill in some kind of you know god knows God god knows where open new mine get the gold out. Previously maybe you didn't have the funding and it didn't make it economic sense. The gold you get from the from the ground probably didn't pay for itself. Now with prices this high maybe it does. So the supply of gold is connected to the price of gold. Bitcoin obviously not the same. If Bitcoin pumps, there's no way to mine more of it. The inflation schedule is fixed. And that's a very important property of Bitcoin that many people forget, especially in these times when everyone's focusing on gold and uh it's uh you know, one one thing only, one thing, you know, tunnel focus. Tunnel how you say is do you say tunnel focus? Tunnel uh tunnel vision. Tunnel vision. Tunnel vision. Exactly. Tunnel vision. Tunnel vision. Uh Black Rockck also is adding a Bitcoin premium income ETF. Uh this is going to be interesting. They're going to generate they're going to use Bitcoin to generate income. I guess via lending. I guess via options or something. Let's going to see what's going to happen. But this is going to be a comp competitor. It's going to be a bit of competition to micro strategy because Black Rockck obviously has a different name. It has a different weight. It has a different uh gravitas so to speak, the micro strategy. So if you want to invest in Bitcoin and you want to do it via Wall Street and you want that bitcoin to generate some kind of yield although bitcoin has no yield you have to take risk uh you have two options micro strategy or black rockck and yes micro strategy is big it's been one of their biggest modes black rock is bigger so when it comes to micro strategy guys it's uh it's very important to realize the risks I see many people kind of see it as a replacement for a bitcoin bag don't see it as replacement for a bitcoin bag it's a company A company by definition is way more risky than an asset class. And then with Micros you have a risky company also with a environment compensive environment that is changing fast. From a trading perspective it could make sense to long it if it goes above here 225 on the weekly. Why? Because then it means that it actually used the 200 week moving average as support. It bounced high enough for this support to be confirmed. And you can try to speculate here that yeah potentially is going to go to new alltime highs. Um from a risk perspective doing something like this is quite low risk. Um I mean with micro strategy I don't know if you can say that anything is low risk [laughter] but from a riskreward perspective doing something like this is one of the lowest risk strategies you could do. Let's check on the daily how it's doing. On the daily it is in a new bull trend although very weak. I mean, all of these uh bull trends, they they're very weak in micro strategy currently. And although you could squeeze some small profit, uh I would wait for the weekly. I would I would wait for the weekly to turn bullish because then I mean at least then you know that it did use the 200 moving average as support and it's coming up quite quickly. And this thing by the way is going to drop quite fast this uh bull flip. So within the coming weeks it may be even at 200. So uh that that's how I would play it. But I would not really have it as a long-term, you know, like retirement plan. And I know many people in crypto, they do. I mean, it may sound surprising, but many people see Micro Strategy as kind of part of their retirement plan. Uh, I find it crazy. [laughter] Find it crazy. I find it crazy. It's insane. Is it good for trading? Uh, it could be good for trades. Is it retirement plan? Absolutely not. Absolutely not. Guys, let's go to Q&A. Questions, answers, debates. Big shout out to uh to Guzman who is time stamping us. It's Guzman, right? Guzman. Guzman. I believe I saw Guzman. Where's Guzman? There he is. There he is. Big shout out to Guzman. As always, check out the links below. Number one is bulmia.com if you want to get our tools, our training, and so forth. Number two is is bulmania.com/partners. It is exchanges I use. You can also find the link below. And here you can check Pionex. On Pinex we have our bots for example with silver and um and other uh stocks and the cryptos and so forth. Silver has been doing so well for us. You can copy bot by clicking here. Uh also if you scroll below on the page you see buy bit you can go long you can go short. You can make money in crypto pumps or dumps with leverage um easily and also stocks and gold and precious metals are on by bit and it is on bit uniqu and on weeks. So whatever exchange you want, you get big fat signup bonus on all of them. Buy on eggs, buy bitunix weeks. You have all assets. You can go long or short is the best. And you support the channel. And yes, Guzman is time us. That's fantastic. That's fantastic. So guys, let's go to Q&A. While we're thinking about questions, let me just do a few quick ones. Will Trump be impeached during his term? This thing is rising fast. I think everyone is I mean kind of even Republicans kind of agreeing that we need some man we need some calmness you know we need some we need some calmness here we need some calmness we need we need to be anti-war and pro business like we get get back to the get get back to the originals um also another interesting trend is the EU defense industry you have this German one Ryan metal uh getting all kinds of contracts getting all kinds of uh orders for I mean all kinds of hardware. Also, they're going to build some kind of Starlink alternative for the German military. And if you go to stocks in Bulmania scanner and you go to defense and army, you can see here uh some of this European uh stocks. So, you have this German one obviously since a month ago up 11%. You have this French one, you have British one, you have Israeli one, uh you have uh uh let's see, Italian one, you have Yeah. And then every everything else is US. But both the US and EU are investing a lot in in defense. A lot a lot a lot a lot. Especially now with uh decoupling from the US uh is going to be important for them. We will be adding more stocks here as well. to our uh to our scanner for this um for this uh category. Um and also we're going to be adding way more markets. So now let's see how many stocks we track now overall. Uh if you look at all categories, we currently track 6,000 6,000 stocks. Probably we're going to take it to 10,000 within the coming months. Uh as we're going to add way more markets. Uh we're building a system that can handle all of this. So it tracks all of the flips in real time and so on so forth, but it's going to be great. It's going to be amazing. Over 100 trillion in market cap are all the stocks that we track. So keep an eye on that. What is Claudebot? Yeah. So Cloudbot, it's quite interesting. It's basically a wrapper around your uh uh cloud subscription. So you know, you can use OpenAI for all you guys who don't know. And by the way, most people in the world, let me before I answer, let me just show you what I just saw before the stream. Most people in the world don't use AI. They have no clue what's happening. And what's interesting is that young people have no clue what's happening. They don't use JGP. They don't use Claude. They just use, you know, Instagram, Facebook, like all of this brain fry, brain fried. They get their brain fried in all of these apps. And meanwhile it is basically 35 plus that use CH GPC and none of none of the um groups here use cloud to a big extent as no cloud is better. You have to pay for it but it's is better. The limits are way tighter so you need to upgrade the scription quite but cloud is better. So cloud you can think of it as kind of chat GPT but u uh I think it's way better. Why is it way better? Because Chad GPT their business model is to focus on the average Plebber, average retail user. Okay, which means that they optimize not efficiency, they optimize engagement. Um, so it's not always that uh they tell you the truth. They just want you to chat and use it as much as possible and maybe you're going to upgrade or maybe they're going to show you ads. You remember they just showed they just said that they're going to do ads in CHP. So, JBT is like plebe mass market AI that optimizes engagement and obviously it's very bad because you want truth, you want efficiency, you want true answers and soon they're going to uh also do ads which is going to deviate from truth even more. So, don't use GPT. Instead, use claude. You have to pay for it. I mean to use it in some kind of big capacity. But if you have the money, you should really use claude. Why? Because Claude's business model is selling efficiency, going to businesses, being a business uh focused company, a corporate focused company, but they also have the self-s served plans with the same philosophy because they cost money. So, Cloud is kind of the gold standard now. Everyone is using Cloud. Uh Gemini, I mean, I guess it's good. It's okay. I guess it's okay. I haven't used Gemini too much. I'm using Cloud. Uh but I I hear good things about Gemini also from Google. But anyway, so cloud is started really as an alternative to chat GPC. Uh recently they have done cloud code which everyone is using for vibe coding. It's very good. Now I also use cloud code because I found a use case where if I want something that is not a website let's say it's a desktop app or it's a bot like telegram bot or some kind of you know assistant bot. Cloud code obviously is better than something like lovable. Lovable is the best for full stack because it has front end back end like everything database built in. fantastic, super fast to build. But cloud code is very nice if you want something that is uh not necessarily a full stack application. So that's cloud code. Then recently they also have cloud uh work which is that it can take over your computer and do stuff and like uh for example I was looking into Google Analytics. For all of you who work with Google Analytics, you know that the website of Google Analytics is very complex and very hard to use. So I just told clude hey do give me this report this report and just you know it clicked around they did all of the reports all the audiences it was very nice and uh there are some of this use cases that are good for cloud work main but mainly cloud work sucks a bit guys I mean it's so slow I tried using it for accounting like to to find the receipts oh my it was very bad it didn't do it was very [laughter] bad just yesterday they they pushed an upgrade to cloud network where you integrate a bunch of stuff into the actual chat instead of having it take over your computer because I tried using this, you know, cloud cloud work takes over your computer. It was bad, guys. It was bad. Now, they also did this. It's kind of like, you know, you can have Figma and stuff inside cloud chat. So, it's uh it doesn't it doesn't need to take over your machine because that sucked so bad. And so, you asked about claude bot. So now we discuss cloud cloud code cloud work. So cloud bot it's kind of a wrapper around cloud and cloud code and so on and so forth where it adds long-term memory. So they have a system of how to feed memory uh and how to store everything that you write to it. Uh, and yeah, it should be able to write emails and do all kinds of things, integrate with all kinds of apps, and it's kind of a open-source third party wrapper around Claude. Uh, everyone is saying it's amazing. I haven't tried it myself. Um, everyone says it's amazing. Maybe it's amazing. Uh, who the hell knows? [laughter] I I'll still need to try it. But if you try it guys, very important, if you try cloudbot, you have to put it in its own machine because they don't really do any like security there. You need to put it in its own machine. You need to ensure that it has its own accounts in Gmail or Telegram that like don't let it use your account because it can do anything like it can f you up very [laughter] bad. Okay. So uh the way I'm planning to test it is that it's like an employee you know employee with its own email its own telegram like its own everything and maybe it can be effective. Uh let's see maybe there's a good use case for that. I'm going to try it. But now also they have this you know new expansion to cloud work where yeah where it should be super nice. Also I think they need so all of these tools they're moving super fast. I think the need for cloudbot is going to disappear as they built it into cloud work because cloudbot you know it's third party it's like open source it's like a wrapper around cloud but they just gonna I think they're just going to add all of these features inside cloud work very soon so I will but I will test cloud bot and let let you know exactly install cloudbot on separate computer very very important and let notice if you are Yeah, I mean you should. You really should. It's crazy, man. It's crazy. I mean, I use it for so much. I mean, everything from uh writing, you know, before back in the day, if I wanted to write something, I would like click click click click click click click, you know, I'm I'm my English is not my first language. Uh some people say the my grammar is not too great. Maybe it's great, maybe it's not. But, you know, now the way I write now is that I turn on the mic. I just talk like I do now to you, but I talk to Claude. It writes it for me. [laughter] It writes a good English for me. So I can just, you know, mumbo jumbo. I look at, you know, let's say I want to write something. I just, you know, I speak like this. No, I like, \"Hey, Cloud, you know, like ah, you can sound like a [ __ ] Yeah. But uh by the way, by the way, uh uh uh uh and Yeah. And then this and that and then Oh, by the way, yeah, I forgot this and then uh and and it just writes a nice freaking looking text. It's the best, you know, before trying to formulate. It's such a mental load trying to formulate yourself. And you can argue that we're all going to be dum dums because you don't need to formulate yourself anymore. You can just like soon it's gonna be like [laughter] soon instead of formulating into the mic and then cloud code is going to write like nice text. [laughter] That's how I feel. That's how I feel writing nowadays. You just turn on the mic, you say some um retardio things and and it gives you nice text. Let's see how it's going to progress with the future. before I had to use my brain like it was so hard grammar proofread why why none of that so that's is just one example um obviously coding is very nice like all of these charts I did with uh AI like everything here from bubbles to this to this to pure and grid like everything here I did with AI it's crazy guys crazy you know it's crazy all of This is with AI. Let's see if ISM it loads the Fed balance. [ __ ] Yeah, everything. A fun fans. So, yeah. There you go. Super nice. Super nice. Super nice. I I I'm trying to like find more ways to use AI. That's why I want to try cloud cloudbot. I mean, let's see if I can put it in its own machine. It has its own email. I can pretend it's like an assistant. So, maybe it can schedule things for me. Maybe but uh there is also an element of overhype guys like for example cloud work I felt it was a bit overhyped like it's not bad it's not bad like I had a good use case for cloud work for example to do stuff in Google Analytics which is the worst website of all it figures it out but you know it's so slow man it's so it's like okay connecting to Chrome you wait okay let me find button 10 seconds. Oh, I found I found. Okay, there there's the button. I click button. I did not click. H Oh, there's another but I click button. I did not click man. Like you're one minute trying to click this button. Like I I I lose my mind on on cloud work when it takes over browser. It's so bad. So bad. It's the worst, man. It's the worst. When it takes over the browser, it's very bad. Do do you have other experience or no? Like I I really tried it was not good this taking over browser thing. It was very slow, bad, inefficient. And then again I tried using it for accounting. I I thought okay it can use the browser. It can go to email. It can find the receipts. Maybe it's going to BE GOOD. OH MY GOD. Holy crap. It tried like Yeah, it tried understanding how to download receipt from in Crazy, man. It was bad. It was very bad. Now, likely in a year, it's going to be very good. So, you need to So, now I I I I have AI in my brain. All of the pathways there. I tried it sucks. Some Some things is good, some things is very bad. But now I know. So, in the future when it's good enough, it's going to be instantly part of my workflow. So, that's also the reason to test AI now. even if it's bad because uh yeah you just understand what what is there so it's easy for you to adopt later on did you fire all the devs we I mean we have very few devs now in comparison to the past uh like the output now is uh because you know for most things for most things you don't need now too many I remember like just two years ago to have a front end man we had like front two front had three front end guys, designer, product manager. They had many disagreements about how to structure code, best practice, anti-attern. They had so many patterns. This is they say antiattern this. Oh, we need two weeks refactor time. Like what the f are you speaking about two weeks refactor time? What? Like in this day and age, I don't think it's like a like two week refactor like what do you speak? What? What do you mean? What do you mean two weeks refactor? We need the refactor sprint. We in the refactor. We need to focus on tech debt, man. For front end, I'm not sure it's a thing anymore. I'm not sure if for front end is a thing. Let me know guys. I mean, if you are front I mean if you're okay. No, if you're a front end deaf, you're biased. Let me know if you are, you know, shipper like an entrepreneur or something [laughter] because I'm not sure refactoring like front end is a thing anymore. like spending two weeks refactor man I don't know if it's a thing anymore for back end I can still understand because some things in the back end it's it's a bit different because there you need efficiency you need like global scale you may have like a million users hammering your database uh it's uh there I can understand that you need like real like you know professionals to ensure that everything is smooth as hell but as an example yes let me show you as an example something that would take like weeks uh before to restructure uh this website from the beginning it was a desktop app then I told it to do it as a website it like converted so fast from like electron to uh to web that's number one number two also here in the URL structure it was different URL structure before it uses it just uses used like a hashtag it was chart hashtag blah blah blah I don't know like before to restructure like all the routes restructure everything everything into slash slash instead of hashtag. I just have a feeling that you know the the front end devs they would like refactor this for like at least a week at least like at least a few days. This here I just told, hey bro, no more hashtag. I want slashchart slashchart name. Go, go, go, go, go. Build, build, build. 10 minutes. It works before. Before how it was before. Let's say we want to add search engine optimization. Okay, I need to do sprint planning. Sprint planning. Let's add the search engine optimization. How it should be here and there. Here are the the components. Blah blah blah pro one week at least. Maybe five weeks, maybe two. Like, who the hell knows here? I tell it, man. Add SE make a plan for bulletproof SEO. It does bulletproof SEO. Bum bum bum bum bum bum bum bum bum SEO. Bulletproof. I I didn't ask it. Are you sure it's bulletproof SEO? It says, \"Oh, actually I need this Jason D or what? I I I didn't know what what is it did all of the normal SEO?\" Then I asked it is it is this for sure all have you follow best practice? Tell me. [laughter] He said, \"Oh, sorry. I forgot like J like I I never heard about all of you SEO guys maybe know he says oh oh actually I I forgot this okay it has a plan for search engine I said build bum bum bum bum bum bum bum bum it has it works man it works now listen I have a simple app here but still this took like a few days to build all of this with search engine with you know all of the route there look look look look real time real time search real Real time search bubble realtime search I I don't know I just feel this would be like a nightmare to build with with like traditional devs is it for all use cases it's not for all use cases but most front-end devs they do stuff like this okay I mean most devs they don't do anything complex if you look at 99% of websites or use cases like simple stuff they do the simple stuff so uh that's why I don't remember what the question was But vibe coding, man, it it it is really changing the landscape a lot. I think front end is grilled uh primarily. Uh if you're a front- end dev, you need to use AI like you have to figure stuff out because I I'm not sure exactly where you fit in. Uh because the back end is where you still need like engineers for front end. My man, I think you're cooked in one way or another if you don't reinvent yourself and AI is just going to get better. It's just going to get better as a problem. So guys, if you're a front- end dev, you're cooked. You're cook. You're cook. COOK BIG time and for a good reason because listen, I love all the devs, but sometimes these things in my experience running dev team scenes, they have taken so long for so much debate. I like this pattern. I like this. Oh, we should build our own UI kit. Oh no, this is antiattern. Shut up. Shut up. AI can do it very nice. I don't give a f what kind of antiattern or pattern or front end because it's freaking front end. It is downloaded to the user machine. It runs one user at a time and we as engineers we should focus on solving big problems. That's why backends guys if you're a backend dev you still have a place in the world because there it's it's a real engineering where you need to figure out how the hell a million users going to access some database at in real time and everything. That's computer science. Anyway guys anyway guys sorry it's a bit emotional maybe but uh I've had enough of two week front end uh refactor. It's not it's not happening in my life again. [snorts] It's not happening. It's not happening. [laughter] Everyone who is not a developer has tuned tuned out. Let's see, guys. Let's see, guys. Some some guys have uh uh dropped some uh freebies. Ivan, you're too bearish. Majority guys are bearish on YouTube, too. Uh I'm not bearish, man. I mean, I told you yesterday I'm not bearish. I mean, do I have to repeat again? Uh we have And again, I give you track record. You give me opinion. I give you track record. There's no opinion. Like some people they compare themselves to me without I mean, I give you track. We started to risk on October 8th. This is solid track record. Drisk more on in November and November 15th. So we have solid track record. Okay. And we have two signals we're waiting for. Either 200 week or 50 week. If it goes above 50 week confidently, we're going to be bullish is the bullish scenario. Or if it goes to 200 week, I don't like the label bullish bearish because it is retardio pleb thinking which gets you wrecked and uh it's not a plan. is not a strategy. You know, Ivan, you're too bearish. Like, he's like this monkey. Bing bing bing bing in the brain. Bearish bearish. I'm all in or Ivan. Are you all in or all out? Are you all in or or all out? Like, what are you? What are are you are you fully like guys? I I thanks for for a freebie, but uh I just discussed it yesterday. That's why I have little patience. I have little patience for it's like how can I educate you? How can I You need to understand that it's all about positioning. It's not about cornering yourself. You are why you corner yourself? Because when you're asking like that, I know you're cornered probably wrecked like never before. You hope it's going to pump and listen, maybe it will. If it will, we're going to jump in above 50 week. Why? Why do you corner yourself? And then people want me to be cornered also. They're like, \"Oh, no, no, but what do you mean? You're not bullish.\" Okay, then you're bearish. Like they're like, \"Why are you Ivan? Why are you not cornered? Why are you not a wrecked pleb like I am? I'm cornered. I'm hoping and praying. Why are you not cornered? Why? [laughter] Big shout out. Big shout. Big shout. Big shout out, bro. Big shout out. We're not cornered. Like we're we're not cornered in any way. But people get angry. I Why? Anyway, go to bull.com. Watch mechanical rules. We understand that. If you feel cornered, you you really need to go to bullmay.com. But yeah, I mean I that's why I do these streams every day. Yes. I feel that our education is really needed. Every day I get the same question which means that the message is still not getting to all the people to all the plebas of the world and listen we I've been a pleb also there it's not an insult it's kind of a compliment because plebbe is on the way on the journey to enlightenment and we take him by the hand and we bring him enlightenment because we've all been there we've all been wrecked bigly and uh there is nothing wrong with being pl it's a compliment means that you are on the journey Okay, most people have checked out. They're not on the journey anymore, but you are on a journey big time. That's good. That's good. That's good. Okay. Uh, is it worth to become a smart contract developer or should I stick to front end? Definitely don't stick to front end, guys. I just told you to not stick to front end. Should I stick to front end? You should not stick to front end. You should absolutely if you stick to front end, you should use AI for front end. I don't think front- end development is a thing guys anymore. You can query most of it and because see here's the thing with front end. It is not a like a computer science uh problem. Okay? You don't need like engineers to engineer. Do you understand what I mean? Like with it's kind of what I alluded to before. You're not fighting physics. Okay. With front end you deliver the app to the user. It's one user at a time uses the front end because it gets downloaded to the browser. User clicks and it's one user back end. You are an engineer because you are fighting physics. Okay, you need to figure out ways to fight physics. Better algorithms. Um you have 10,000 users. They're hammering the database in real time. Okay, it's you're fighting physics. They need to you have a database. It's maybe it's in cloud but still you need to scale it. You need to make it cost efficient. yada yada it is engineering. You're fighting physics and this is computer science. Front end it is solved. I think front end is solved. I can declare it's solved. I think it's solved guys. Uh and for and god rhythms it's solved. I think it's solved guys. Exactly. Like front end guy he cannot even center div. Okay. [laughter] Anyway, obviously we're over exaggerating a bit, but price in the fact that AI is just going to get better. So, definitely don't focus on uh on the front end. I think smart contract is worth focusing on because I mean it's mission critical. It could lose money. So, probably good if a person checks it. Um so, yeah, that's that. Yo, Shray, Shay, all season is on. Okay, [laughter] good luck. Uh and yeah, let me know if you are from the dev and you want to plead your case, your reason for existing, plead it, [laughter] man. And I I just happy that we can do like I can tell you another thing. In the past uh let me show like you know you see this menu here it is side menu when I started building this app the menu was up here. It was like just a because I just had like three charts. So it was in the in the beginning was just like three buttons up here. I remember in the past like to change the navigation structure from being like a top navigation to side navigation man it's it's at least a few days if it's a complex app with complex routing blah blah blah like it could take even longer like especially if you want to change the logic a bit like you want to change the structure how it is like uh organized which routes are inside which sub menus like you know it's a I remember for front end dev it was not like a super easy oh yes I just change CSS and it's done now I don't know how AI did it. But I just told it, man, I don't want this to be top navigation. I want to be cyborg navigation. Literally in 10 seconds, it changed it. It changed it. And I told it, I don't want hashtag URLs. I want SL URLs. In 10 seconds, it changed it. So 99% of use case of front end dev is doing stuff like that. It's solved. It's solved. Thank god, man. No more two week refactor, guys. No more. No more Ivan We have tech that. We need to remove tech that like GTFO man with the [laughter] tech. You became what you hated the most on your early old developer journey. What do you mean? [laughter] What do you mean? Uh I I don't think I hated anything. It's it's just that I learned a lot. I learned a lot. Uh, and yeah, I see the world clearly. When I control your mind, it doesn't matter. You can look at laser wall. It's solve. Yeah, there you go. Oh, guys, we're at 59 minutes. Let's cut this before it goes to 1 hour. Thanks a lot for being here. Big shout out to Guzman for time snapping us. Smash up the like, subscribe, enjoy your uh choose. It's Tuesday today. Yeah, Tuesday. Tuesday. Tuesday. Tuesday. Tuesday. It's Tuesday. Good. Enjoy Tuesday. Have a good day and goodbye, guys. Goodbye. Goodbye."
    }
]