[
    {
        "video_id": "LMVOPY_B9Y0",
        "title": "State of Crypto Markets in 2026 | CoinGecko Virtual Meetup #33",
        "published_at": "2026-02-06T02:36:52Z",
        "sort_date": "2026-02-06",
        "url": "https://www.youtube.com/watch?v=LMVOPY_B9Y0",
        "transcript": "Heat. Heat. Unc. and pump. Thank you. Hi. >> Hi. >> GMG GM >> GM GM. Good morning, good afternoon, good evening everyone. I think we just have one more guest uh coming in to join us. But uh yeah, welcome everyone. Uh this is Coin Gecko's 33rd meetup. Uh I was hoping we could do this in better situation but you know here we are and you know we just got to go and continue. It's been a while since we met everyone. So hope everyone is doing okay. Uh the theme for today's meetup is the state of crypto markets in 2026. I think very timely for us to talk about this. My name is Zong. I'm the head of research here at Coin Gecko and I'll be the moderator for you today. Um, before we begin, I I think I just want to thank today's sponsor, uh, Maxi. Uh, you know, one of the largest exchanges out there. So, thank you, Maxi, for making this happen and and for us to continue to host this meetup. Um, yeah, I I think, you know, I just want to make sure we uh I just want to make sure we we introduce our guests today. I think with me today I have uh you know three important guests. I'm hoping the third one will will join us. So we have Vuka Usi who's the COO from Maxi. Welcome Vuga. >> Thank you very much. Thanks for having us here and of course I'm very glad that we are supporting such a great initiative and making sure this meetup is going on and more and more people are joining us. >> No thanks. Thank you so much. Uh and we also have Ollie from Probable. Probable is one of the newer prediction markets that's out there. So, one one of the very happening spaces in in crypto today. >> Hello everyone. This is Ollie. Yeah, I'm one of the builders at Probable. So, super glad to be here today. >> All right. I I think you know while while we wait for for for Chris to join us, I think you know that we can we can sort of begin and you know talk a bit about you know how how everyone is sort of feeling right now. Uh I know it's it's not a not a good time. So, so if if if you've just woken up uh and had a glance at at Coin Gecko or you know, you you'll see that the price of Bitcoin is at about 69,000, right? And you know that that's after hitting a very staggering high of 126,000 in October, just in October 2025. So, not even that long ago, but yet here we are. And then you know um just wondering you know I guess to to Vuga and to Ollie you know how are you guys feeling? Where do you think the market is right now? What what what is your read sort of of of of the mood right now? And maybe Vuga can start. Yeah >> sure. I think from an someone who represents an exchange I always say that as long as there's a market movement people who are smart enough they know how to earn whether it's the shorting whether it's longing whether you are doing a leverage trade but as a person myself I'm a very deep Bitcoin maximalist in in my heart definitely dollar cost averaging like thinking a long term is a one important strategy that I've been advocate for so long but for the people who know me from Bitkate times or even being crypto times. I've worked in media, I've worked in other exchanges and one thing I used to always say that there's always a good opportunity to buy and a great opportunity to sell. Uh looking in your benefit, making sure that you take profit is a very important lesson. And I think we've been learning it from the cycle to cycle. I think the smartest people out there ones are not only just getting rich on paper when it's all-time high or getting poor on paper when the market is down, but actually if you're able to kind of lock in your profits, take some profits and go do some fun things for yourself, whether you have to travel or whether you want to invest in really interesting projects or do something else like investing in gold and diversifying. I think this is the one of the most important lessons we can learn from the cycles of the market that there's always an opportunity a good opportunity where to enter the market and exit the market. Therefore, we shouldn't be kind of being pessimistic where the market stands today. Think about where the market is going. >> Yeah, thanks thanks Va for that. I think that's that's sort of sound advice for for everyone, right? which is you you need to sort of know when when when when you know to sort of take profit and sort of put that to good use, right? In in in in your real life. >> And let's not forget like if after like a three weeks Bitcoin goes to 100K, the same people who bought today at 69, they'll go out and brag. But if Bitcoin goes to 40, it will be the same people who going to go and cry. And therefore, like we don't know where the market goes, but wherever it goes, like it was the same, right? the people who bought it at 17 18K when it was 120 everyone was bragging and showing their fill order screenshots. Maybe today's the day where you take that screenshot and keep it and if the market goes to the top again in two, three, four months, you'll be the smartest person who made the right decision. >> Yeah, I I I think probably good to take a screenshot now. Ollie, what what what about from from your end from from the probable side? What what are you guys seeing on on your end? Well, I think like we're also a part of the industry, right? So, we're also pretty much seeing the same thing. Um, price is really depressing. I I actually stopped looking at prices entirely starting from from a few months ago, but um but this time it feels like a little bit different because it's not just about prices, but it's also about mind share as well as also about talent in general, right? I haven't heard that many friends telling me that, hey, I'm leaving crypto. I'm going into things like AI or robotics. So, I think there's definitely something that is going on out there. But this kind of like reminds me of what happened last cycle when Bitcoin was at like 20K or 25K. Like it just got so boring. Everybody stopped looking at the charts like everybody just got so depressed. But as long as you kind of endure the entire process, you you DCA gradually just like Var mentioned, I think the the the future is just going to be more promising down the line. and and with things like like regulatory clarity, we have more interesting interesting protocols coming into the industry, I think it's just going to be getting better and better. So, yeah, just that's just my take. Yeah. >> Yeah. And and I guess you know from from the prediction market and you know do do you do do you see a lot of excitement and interest in in in this sector given it's it's really one of the hot and interesting things right now. >> Absolutely. And I think like people are not just betting about things like crypto, right? like they of course a hero market for us is people betting on things like whether Bitcoin will go to a certain price or or what is going to happen but um in general we're seeing a lot of also interest in things like financial news we also are seeing a lot of things like in in sports even for things that like I'm not personally uh like very familiar with like crickets with like bmintons and even for for for boxing right so these are some of the things that a lot of people are starting to to get interested in and and and the prediction market is the perfect instrument for them to express their opinions or express the conviction to, right? So, I think that's kind of like something that that's very interesting that is happening right now. >> Yeah, I think I think Super Bowl's coming up. So, there's definitely a big slate of of sports that's that's going to come and that that's going to going to be interesting. I'm just checking if you know Chris, are you able to hear us? Can you Yeah. And and have you been able to join us because we see you on screen. Okay, maybe maybe not yet and maybe Chris Chris will be able to join us. He's he's the CEO and co-founder of Plume, right? And and I think, you know, we really do want him to also chime in with with his perspectives because Oh, you can hear us. Uh maybe you can try to say something and and you know, we'll see if we can hear you. Yeah. But yeah, I I think Chris uh you know, we we'll get somebody to reach out to you, but you know, we're we're just gonna continue on. I I think you know, VU VGA and and and Ollie, um you know, we regardless of of where the price is and stuff like that and and I think you know, Ollie hinted at this for a bit, you know, when when we're talking to like you know, a lot has happened in 2025 as well, right? to you know um and you know we we we saw I think you know lots of regulation being passed we we saw uh the industry make you know seemingly a lot of progress but at the same time you know there there were not so nice things that that sort of happened as well I'm just wondering I think from from your perspective do you think you know 20 we will look back at 2025 uh and reflect on it as sort of like you know this is you know a year where the the industry you know fundamentally grew or fundamentally changed or you know this this was just I I think you know uh someone was saying actually 25 was like a bear but it was just masked by all this like you know institutional flows and and you know we we sort of should have should have already gotten a dump earlier. So curious to hear what you think. Yeah. >> Yeah. Maybe I can start first here. So yeah, despite all the DATs and stuff, right, I still think overall it's a win in the sense that there are a few like very interesting things that even for myself as a builder, I feel very personally like one of them is definitely like uh Prepex's like hyperlquid or lighter. Like I feel like the technology has gone so good that it that it even feels even better than Trafi. Like imagine that you can just do like a 50x or 60x on on assets like Bitcoin. It's something that is totally unheard of before, right? So um that's something that I feel like it's getting part of market fit. And the second part of market fit I feel like it's kind of getting more solidified is like stable coins and especially when we see institutions or even players like YC like Y compator they started to pay their their startups that they invested in with stable coins. I think these are some of the very exciting things that like shows that like stable coin has finally gone beyond from just a toy into something that they can really rely on as a financial infrastructure. Um but then of course like I'm biased because I'm building on on a on a prediction market. So I also feel like prediction market is getting something that is going mainstream right now. Like last year it started to catch some attention started to catch some engagement there. But this year, despite despite the price actually going down, we are seeing a lot more actions going on. So I think that's also a sign that this is finally going to be a real thing. >> Yeah, thanks. Thanks for that, Ollie. And and thanks for highlighting some some of the larger developments in in 25. Vuga, what about you? What what what what do you think is it's sort of uh you know, do do you think it's it's been a fundamental shift in in 25? I love how Ollie like covered more of like a crypton native crypto head aspect of the like a trading. For me there are like two key developments that I think were like a big wins for the industry. First and foremost, the way I think crypto was first time started taken serious whether it is by the regulator and legislators in a global stage or candidates winning the presidential elections both Argentina in US and many other places with the crypto narrative and actually financial institutions embracing the crypto as a real tool whether it's a wall street using it for hedging whether it's banks issuing their own stable coins and large giants like a PayPal and uh others like getting on board with the whole idea of putting things on chain. Second aspect from the crypto in itself like cryptonative companies mainly exchanges. We saw a huge shift that is kind of a shift also in a narrative where more and more we start not only addressing and talking crypto to crypto people but we actually kind of start enlarging the pie whether it is through tokenized assets it's a real world assets coming in place with stocks with gold with silver more opportunities. Uh and for me the biggest win of the 2025 was first time we start using crypto as a retail tool not to trade but to actually spend money. Almost all large exchanges came up with your pay files, QR code payment systems, crypto cards that is kind of for me is the last uh chain to build this full life cycle where you can live on chain. you can have your money, you can invest, you can do savings and if you want to buy a coffee or you know order a food for yourself, you can definitely tap your crypto card or scan QR code and be able to pay with that. And I think that is two major wins of 2025 that uh will be continuing the whole momentum in 2026 especially with all the large exchanges from Mexi to Bitkate from OKX to everyone else becoming trade everything platform where we try to become a true uh challenger of the status quo and making sure that we can directly compete with your neo bank with your banks but also with the tools like zero fee we try to compete with the dexes and all the decentralized tools where kind of we just become this blurred mess in between connecting thread fire with a D5. >> Nice. I think I think you mentioned tokenized assets and I'm very happy for that Chris is able to join us. So welcome Chris. Chris is the founder and CEO of Plume. Uh and Plume Network is obviously one of one of the larger RWA platforms RWA chains out there. Um yeah, we we were just talking about you know 2025 and you know looking back at at the year um you know and whether you know you you notice some fundamental shifts within the industry or you know certainly like I feel like a lot of shifts happened outside the industry that that eventually affected affected it. >> Totally. Yeah. I mean 2025 was an insane year and sorry for being a little bit late. My machine was kind of acting up. Um but um thanks for having me and excited to talk about everything. Yeah, look 2025 big year for for crypto and also one of the worst years you know in a long time right like I think everybody was expecting and myself included right an insane year for price action we had a lot of things things behind us right we had sort of rate cuts you have uh you know we have um a very friendly administration the whole country and the whole world is kind of turning in our favor right for crypto yet the sort of sentiment and price action is going to be worse right and so is all of that but I think really look at the end of the day I'm going to look back at 2025 um as the year that I think I think a lot of what uh what Var was saying was correct like I think it's the year the crypto became sort of too big to fail right um in the sense that you know a lot of the things that we've been talking about for a long time began to breach beyond sort of cryptonative right you know so I think 24 you're looking at a lot of like meme coins are looking at like sort it's very insular crypto activity and it's more of shifting narrative to narrative right classic sort of crypto hot ball of money stuff or moving around from one idea to the next but the sort of net dollars in is not growing right um and 25 was the did that changed right and you see this happening across many dimensions right I think like everybody said prediction markets obviously with poly market and culian you know many others as well right um coming in excuse me and becoming a a sort of like you know a bridge beyond crypto right um and I think that's really the it's a year of growth for the industry for us right where you're being people from like non-crypto native industries actually coming in and talking about this thing and abstracting the crypto element away right I think payments and really stable coins as the underlying factor behind driving this right stable coins um and you know really what that leads into is um the second half of stable coins where we play a lot was tokenized assets right um you know stable coins are just another form of tokenized asset is the most successful one by far right and the and the strongest one but you know you see as a result you know we had the tokenized treasury you know come a long way we have all kinds of things right now like equities you know um all kinds of different even other wrapped assets right like I consider Athena a tokenized like a sort of like classic RWA right it's just tokenizing a hedge fun tokenizing a trade but there's that as well right you see Maple grown really well. You know, for us, we had a good year, too. So, there's a lot of these types of things, right? Where you're sort of growing and changing beyond what um everyone's considering a sort of cryptonative asset, right? Um and of course, I think like you said, every exchange, both um centralized, decentralized, everybody now is doing this sort of like, you know, tokeniz everything exchange, right, is going down that fashion and everyone embedding payments and earning, right? So, I think just having a few of these narratives, a few even even privacy came back, right? We're talking about ZK again gang, we're talking about, you know, we're talking about ZK, you know, talking about Zcash, like, you know, all these things are sort of happening that we've been talking about for years began to become a thing, right? Regulation and all the things kind of bundled together. And so I think it is the core where you sort of cross from crypto is a thing. Um, and it's unclear where it's going to crypto is inevitable right now. You know, all the different ideas behind it begin to really spring off in a different way. And I think it's still some time before really takes off. I think you know stable coins to me is the only dominant story that continues to be um unanimously accepted but uh these other these other areas you know tokenized assets I think you look at you you look at prediction markets look at payments you look at all these other aspects are really starting to shine as well. So um very very important year for us even if uh you know price and and sentiment could not be worse. Yeah. And and I I think on that note, it's it's it's also important to talk about I guess things that may perhaps we thought was going to happen or perhaps, you know, we we were hoping were not going to happen also, you know, some of it came came to fruition. I was just wondering I I guess for for for people on our panel, like you know, what were some of the low lightss as well of 2025? Uh and you know, uh for for for you guys and and maybe Chris, you can just continue on. >> Yeah. Yeah. Totally. Totally. Look, I mean, so so at least for us for Plume, like um you know, we took we took the token out uh in January of last year. Um and so like I remember uh this year very very clearly across every dimension for the low lightss uh and all the negative things that have happened. Um I mean man, it was an insane year. It's just hard to it's hard to articulate how insane it was. It started off in January, right? Um with a bang with um with the president of the free world um you know deciding to launch a shitcoin and not just one but two of them, right? And so like that's never happened and that was an insane moment as well, right? So that's I mean like I think it was both very both a highlight but then followed immediately by a down by by sort of a low light where liquidity is all sucked out of sexes right it goes into a bunch of these projects and sort of like you know it's one of the last in my opinion moments um for for memes right uh in a meaningful way um and it just really goes to after that so from a memes perspective right and the trenches or like trenching for whatever it becomes really really uh problematic after that and like you know liquidity just kind of dries up that's number one Right. Number two, low lightss. Again, again, I remember these moments because I can look at the chart. I remember exactly what these exact. Number two, I think you look at something like Bybit, right? And and the and the largest hack ever, right? Um and uh that was a definitely a low light, right? Now, I think by did an insane did an amazing job, right, coming back and and like we don't even remember it at this point, right, for the most part, which I think is a testament to how they both handled it. Um and also everyone else coming to support them as well. Um and so I think it was just a huge moment of positive moments but still like obviously just a crazy moment right for for that entire situation um to happen and the way it happened um you know even involving safe and all these things you know it starts to you know it really brings into question all the things that are happening right that someone like Bobby can still get hacked um is is very scary so I think that's the second thing um you know I think the third very clear thing is um is uh is 1010 obviously right um and and everything that happens there right I think the effects. I mean, I think everyone's seen that tweet now where you look at the price of sort of BT uh sorry, BTC, equities, um gold and blah blah blah bunch of things and we're all tracking similarly, right, on it happens and and crypto just deviates from, right? So, like it's impossible to talk about that with the biggest liquidation event ever, you know, everyone learns these three words ADL, right? Everyone begins to talk about ADL and all kinds of nonsense, right? And so like that moment was a huge defining moment as well. You know, again, you know, sort of like sort of many uh many firsts of and the biggest of uh that happened to the downside um as well. So, so, so just an insane year from that perspective. You know, we also saw things, you know, I would say a little light, you know, simple things. Um the last one I'll say is um you know, we've been talking about the rate cut literally the entire year, right? And it happens in in in uh in September and uh nothing happens really. we have the the slightest like the smallest price action the smallest bit of price action from there not what people expect and and then immediately after whether it's related or not unclear but right after 10 10 happens as well and just sets it off and so you know I would I won't say they're related but just like you know just timing wise it was just it was just notable that we were all sort of preparing for that right I remember people were on you know we're on Singapore and that token everyone's you know excited we get the news great nothing happens and then a couple weeks later biggest liquidation event in crypto history and like you know just sideways and downwards after that so I think all these things are sort of like to me the three major like low lightss of the year um and things that might have happened even it happened you know you know we didn't expect we knew Trump was going to come in place God bless didn't realize that it would tank the markets um and all these things that happening you know and so that I think that's like the sort of like in my opinion the low lightss of the year and also things you know sort of like exact same thing on the upside from the upside but this way to the downside. >> Yeah. Yeah. I I think you hit on some some of the the largest I guess sort of negative events of of of the year. just just wondering like you know Ollie or or Vuga you guys want to chime in as well. Yeah Ollie. >> Yeah maybe I can offer from a kind of crypton native point of view right. Um a few things that I realized didn't work out as expected. One of them was some of the social apps that were promising to we're promised to bring in mass adoption like and and people and most of the approach for these crypto apps are just uh you have an app on iOS or Android and then you do gas abraction and then you also do um things like fiat on ramp and you kind of expect people to come to download your app and and and trade from there, right? But turns out like there just wasn't the adoption that they expected because simply people just didn't have the reason to trade those things. So I think that's the first learning that the industry kind of learned uh they need to have a reason to trade. And the second thing that I can think of was um things like social like in the past like a lot of social companies that raise hundreds of millions of dollars and and it just didn't work out because the the industry or the the kind of like the crypto circle as a whole was just too small that it wasn't simply enough to kind of have that network effect uh for for these for these products to take off. So um I think the I think there's a saying in in in a circle that like uh people underestimate the depth of crypto but they overestimate the breadth of crypto. I think there's also some kind of truth in there. So yeah that's my take. >> Thanks. Thanks Ollie. Yeah I think sociali and I guess the the other one that that I think we we sort of had to say goodbye to is infoi as well uh after after sort of turned off uh that avenue. Um Va what about you? I think Oola and Chris like covered everything bad that happened and I think there's only one thing left to mention today that everyone was expecting it to happen and because it didn't happen it's the like I think the low light of the year and I think that was an alt season because I believe everyone trading and watching online was waiting and giving million reason why al season should happen and unfortunately it didn't happen and I don't believe it will happen ever again but still for everyone watching I especially If you're holding bags and it's too low, I hope alism does happen in 2026 and you back some profits. But I think that is the one thing that we are kind of not being able to see anymore in terms of this cyclic or manic just everything going up. uh rather like as Ollie mentioned like for example with ZK we realize that actually when you are able to put a good product in even after a couple of years the prices do can go up but uh that manic hypy price up and downs are no more that we will be seeing and I think it fuels mainly because today if you look at any large exchange whether Binance or by bit or bitkit like 80% of their trading volume does come from the institutions that buy and sell and definitely institutions are not interested neither in alcoins nor in the small meme coins that is out there while uh exchanges like Mexi when more than 90% of our 40 million users are or trading volume does come from the retail end and it's a very different story but we shall accept the fact that it is becoming more and more the institutions game or big players game who dominate the market and therefore probably altism is one thing that we might say buy in couple of is >> let let's let's let's sort of like dive into that a bit because because I think you you touch on you know we got one of the big themes which is institutionalization right so more and more institutions are sort of getting into the game uh participating actively in crypto now so they're not just trading but they're also you know building products they're launching you know tokens some of them and you know if if they're not thinking about if if they weren't thinking about it in 25 they're definitely thinking about it now I'm just wondering ing I think you know perhaps you can talk about it from from your perspective and what you're seeing definitely in the sex in the centralized exchange space right um you know how that has shifted the market for you and and I think you alluded to that a bit but just hoping you could elaborate a bit more yeah >> there are two important aspects like first we have to understand the mindset of a retail user is much different than an institution right retail usually come to an exchange or trading platform to capture the best out of the profits. Probably they'll be going to very high margin trades and all this is with the incentive to making more money. While you're in an institution, you are not chasing 10x or 20x because usually you are there to do much better than inflation rate. You want to hedge against the stock market and the trading techniques you use is much much different and your goals are very different than the entire market. You play try to play it as safe as the industry gets. Secondly, I think what makes institutions robust is the amount of investment they can do. Whether it is building the right trading tools, whether to have this uh algorithmic trading infrastructure that definitely the retail user is lacking. It's not possible to do even with implementation AI that it's not going there. And lastly, let's not forget uh again retail user is always there with a lesser knowledge is there with a much slower speed until we go to I don't know crypto twitter or any any other source where we get our information try to make the best outcome in there while uh I think like o can enlighten us more on this this year we saw how an insider was able to conduct so many profitable unmistakable trades right uh I know that's like the last time they liquidated in their full portfolio. uh there was even speculation that it can be the President Trump's son but anyways like I think last year we saw more and more institutions and people who have an insider knowledge were able to conduct a much smarter trade rather than a retail user which makes an unfair advantage and I think that was one of the key reasons why we see so many liquidations because the entire crypto market went from three trill trillions to 2.5 trillion last year it means industry in itself got very small but also we saw much increase in the number of the whales or the bags that whales sold especially when we look at bitcoin it's becoming like more and more consolidated on the hands of people who have much wealth people who have enough money to manipulate the market in itself I think that is becoming a one of the core issues where institutions they don't only act as a single party who trades but they also have enough resources to actually liquidate or do maneuvers. We have seen several also the scandals happening in with between large exchanges and the market makers who were able to uh manipulate the market. We had seen so many projects getting delisted exactly for this reason where the users were liquidated unfairly because the insiders had too much information >> and and do you think that that that that is you know sort of a turnoff for retail or you know it sort of makes the the the market a much more difficult or or challenging place or or just less fun I guess in in general. I can give you two answers like an answer from Wugar as a person and then as a exchange representative in my personal opinion I think the overall like we are all happy for institutions but the idea of Satoshi's white paper was about the peer-to-peer uh transfers payments it was about cutting the middleman and today we celebrate middleman coming and if we literally zoom in with all these institutions coming except the fact that things now are on chain nothing much change right the same market makers that did the stock market making they try to get exposed here same banks try to offer you exactly same remittance but now on blockchain it is cheaper for the bank but is still the same cost for the user in my opinion there isn't any advancement from an exchange perspective I definitely believe like it's much better to have institutions because it brings a lot of money it brings a lot of opportunities but uh downside I think in a couple of years we will be seeing that where there are platforms like where the retail is through the action point where the retail is majority and then there will be large platforms where institutions dominate and there the retail is becoming kind of a just background and I don't know like if it's appropriate to tell it here or not for the my friends who love going out and partying it kind of reminds me this clubs where you have rich people with a tables and opening unlimited bottles and then you have a lot of like a GA people who are there just to make the party fun. >> Okay. Interesting analogy there. I I think Chris, I mean, you deal a lot with institutions, I'm sure, and you know, it's it's it's a core part of of your business and and what Plume does. So, you know, maybe talk talk a bit about it from from your perspective, you know, how are they, you know, sort of coming to this market and and approaching this blockchain and crypto thing finally? >> Yep. Totally. No, I I think I I I I I echo a lot of what uh what was just said about institutions. Um from the from the Plume side, look, maybe just to get some context, right? Plume, you know, we build a network and and an ecosystem um around RWAs and tokenization, right? We're the largest uh you know, largest sort of user base, largest uh sort of diversity of assets uh you know, for tokenization um in crypto right now across everything from things like tuk tuks and durian farms down to funds like Apollo and global, you know, Apollo and and um you know, Wisdom Tree or or Black Rock and all these things, right? So that's the idea and and what we do. So we deal a lot with institutional side of things, right? Um both from institutional crypto, right? Um and then non non-institutional and not non-crypto institutions and I would say you know looking looking at the year and kind of where things are um it was a big shift in uh 25 around the mentality of it really it kickstarted from one moment right um it was around this time last year maybe uh maybe a one or two weeks ago um last year when Larry Frink was the first time he got on TV um and said uh you know tokenization is going to eat everything right and that's probably the seminal moment in everything um and that spawned all the activities and the follow on work today that's happening around tokenization um and around sort of institutional adoption of crypto right because that was said black rockck is largest uh one of the largest asset matters in the world right um with multiple you know I think it's 12 or 13 trillion dollars right um so black rockck in itself is uh you know multiple you know is larger than all of crypto from aum perspective right so when that guy says you know we're all going to tokenize everything and everything's going on chain right everyone else listens and so as that was a single moment right and you sort of sort of saw their their money market fund, right, often through securityize directly, offer through on these types of things, right? Come on chain um and begin to suck in a bunch of TVL, right? Now, it's still relatively small comparatively speaking to a lot of other things, right? I think it's, you know, topped out maybe three or four billion right now, right? So, not bad, right? Um but as a result, every other major frame solution in the world began to act, right? Um now, it took a whole year, right? I remember, you know, in the beginning, it went from nobody cared to Larry Fin cares. And because Larry Finn cares within about a quarter or two, everyone begins to talk about it, right? Um and so you have most the large financial institutions in the world primarily on the asset issuing side, right? Basically trying to bring their funds on chain, right? For them, it's a path that that they um you know, they're keeping it very simple. It turns out I remember I was very very surprised. I remember talking to uh to both Black Rockck, I remember talking to to Apollo um talking to a few of the large funds out there and I remember thinking you these are large classic um American uh western asset issuers, right? trying to bring their assets to um to another geography or another place. And I remember thinking, okay, I've talked to them a lot thinking about compliance, thinking about things like um thinking about things like AML, thinking about things like sort of user, all this is going to be a big important thing and an important topic for them, right? Um, and I remember getting on the phone with them and I remember heard they say, you know, uh, you know, tr Chris, the truth is like we don't give a you know, at the end of the day, you know, if there's if there's a I remember thinking like if there's if there's at least 20 million on the other side, they were willing to play, you know, and I remember thinking, okay, so they they really are like institutions are here. And I remember thinking, oh, in the way that you'd imagine they're here, right? They they're also here just with money, you know, and there's really nothing there's nothing uh there's nothing else to it yet. Um, and so that's kind of how it shifted in the first half of the year. And then as the second half of the year as the initial deployments sort of came and came and went right and you saw the rise of maybe Apollo's ACred fund the private credit fund begin to take a lot of a steam behind it which is you know sort of a continuation of biddish 5% APY uh fund that really began as sort of the backbone right of a lot of it now shifting a little bit further up to seven eight nine right percent APY uh as people searching for yield in higher places and they get more comfortable with tokenized assets and and and RWAS you um and people deploying that and begin to figure out what you can do with it. And at that point, the institutions are sort of like change. Okay, got okay. So, it's not just, you know, now they're think about bridging, now we're thinking about custody. We have to think about these types of things. And so, as they begin to think about expanding and growing beyond just an EVM chain where they're just deploying and have a few a few foundations that buy the assets, right? And they want people to actually use and engage with product through retail and through other channels, right? And through, you know, things like today, you know, you know, you can do things on us with morpho, you can do things with sort of what you see oiler do a lot of stuff. You see chamino and like all these other products, right? begin to be able to take these assets and loop against them and buy them, make decisions. Nest, our product today is one of the biggest out there as well. So, as people actually engage on these products now, right? Um now these institutions are realizing how to um how to think about growing their AUM um or for them TVL right on chain. Um and that's changing a lot of the dynamics for now where you're seeing now, oh maybe I should spin on my own stable coin, right? Or oh, maybe I should spin on my own uh my own chain. You're seeing a lot of that right now, right? Most of them to be honest, most are nonsense and most go zero, but they're trying at least, right? Um and the thing about bridging a lot right thinking about things like that right thinking about and the sort of ecosystem around it right so um the institutional side right so maybe you're talking about like an S&P right or a Moody's you're talking about now rating these assets and bringing them on chain and so our sophistication around it both traditional side as well as crypton native things to support the institutional adoption is really beginning to come into play now so the first half of last year was very much let's that people are talking and beginning to think about it from an institution angle the second half of last year was okay now let's begin to like really get into it and try to use these assets and As a result when someone starts to bring in you know we had simple example you know grove came in and bought the AC credit fund is just a you know single customer they they they did 50 million into into a credit on plume right and you see them doing 50 mil into other things into a galaxy CLO on this they did a billion dollars into CLLO on e mainet right so the the money really comes that way so I think the the dollars in is still very crypto unfortunately right I don't think we've seen like new inflows right from the institutional angle yet um but you're seeing new assets and supply come in which at least is elevating what can happen within crypto and then as a result you should see a reflexive side where it goes back to the uh back to the institution side and that should bring in more supply um and more demand on the asset side as well. So so that's kind of where we're going right now. It should be a big year in front of us as well for this now. Um but we're still very much in the growing phase of it you know where we you know I think about inflows at the end of the day right and I don't think that has happened too much yet but uh but it should be around the corner. >> Nice. And and do do you think that's just a fact of like you know you have the issuers who sort of got comfortable with I guess the tech and stuff like that but you you also need the investors to to sort of get comfortable as well custody arrangements and things like that. >> That's right. Exactly. I mean it's really two things right at the end of the day you have to think about the motivation for the institution. At the end of the day the institution does not care about any of this is the real answer right as much as we'd like to think they care about the technology and everything they do not care. They are very simple creatures. They want to grow aum. That's it. Right. And for them, this is a new channel, a new path to do this, a new way to reach new members of the world, new audiences, and they're thinking about how to do that today. The numbers are nominal. That's why, right? At the end of the day, right, if Black Rockck is if Black Rockck's a 12 trillion AUM uh asset manager, right, a $2 billion money market fund on chains for them, which is Bill, the most successful one out there, is not a thing. They do not care, right? Um, and it's not even remotely worth the time yet, right? And so it's a bit of a push and pull where they first have to and it's a thing that we've we've talked about at Plume for a long time. You know, what they need to do is bring the asset on chain in a way that shows some meaningful traction that allows them to go back and say now let's bring more of our money in, right? And bring our customers more relationship and it's not only and so it's really it's both sides. It it is interesting because you have to both bring in the cash from the cryptonative aspect because that's who's here today to show that it's worth something. But once it's worth something, it'll be then about adopting the technology and showcasing that to them to bring their customers in. Right? That's why privacy becoming a thing. That's why all these these narratives and stories are becoming more thing. That's why the sort of like payment story is becoming a thing and settlement and and crossber payments and you know all the things we've talked about around tokenization from a techn around crypto from a technology standpoint are becoming a thing, right? But it's the interplay of those that will then allow them to bring in their asset um and bring excuse me allow them to bring in their customers funds and bring a net influence of dollars, right? And it's up to us in crypto to sort of make sure that we shape this in the right way for the user within crypto and the retail user within crypto. Otherwise, I think just like you said earlier, right, we are just going to replicate all the nonsense we had last time on chain. It's the same right? To say we're trying to eliminate the middleman last time, right? And now you say now we're welcoming the it was a great point, right? Now we're welcoming them in and we're very excited, right? I think there's a whole conversation about DTCC and all these things, right? I think two nobody knew what DTC was, right? And now we're like sort of DDTC and crypto great is going to tokenize everything blah blah blah, right? Where they very literally are out the middleman. I'm not saying good or bad, right? Because I actually think it's an opportunity regardless. But I think the important thing for crypto to remember native remember is that if we um you know right now it is still very much on us. We are the demand side of the equation. Meaning the ball is we have ball control, right? uh sort of in this relationship as we bring more of more of the world on chain, right? And if we cave too much and sort of allow the sort of trades to come in and shape crypto, right, the way they want it to be shaped and sort of be lured into a false promise, everyone thinks when the institutions are coming, it means money is coming. Right? Now, it's not true. It's still our money. It's the same thing. They're just bringing their assets in, right? Um, and so if we allow that to shape the the assets and shape how we're doing things in crypto, it's a huge missed opportunity for us, right? And it will allow us to sort of it it will force us back into where we are today where we're still sort of like middlemen up. We don't have ball control and the promise of crypto where retail drives adoption, right? And you have this fervor and this manic energy, right? Which is the beauty of crypto, right? incredibly incredible speed uh velocity of cash the liquidity all these things are the great elements in the 247 nature the global aspect all these benefits of crypto right we need to retain that aspect so we can help take these instruments and shape them in this way that will not only make it more successful so they'll want to bring more in but but number two it'll stay true to sort of our philosophy so I think it's the right move go to marketwise for us um and structurally for us as well as philosophically so you know I think that's a really important piece that we're sort of like teetering on right now we'll see where we land um you know uh in in the next year or so but um I you know I'm hopeful for for us uh that crypto will do it right. >> Thanks. Thanks so much. That's that's a great perspective. I I wanted to come to you Ollie because you know you're you're more cryptonative you know and wondering h how you think about you know these institutions coming into play and whether you s start to see a bit of that on on the prediction market side as well. So, I think as a crypto native perspective, right, I definitely want the the the Trackfire to buy my bag. I think that's the the the first thing I do want. And uh um but I but I feel like the the outcome isn't really as what we expected, right? We we're hoping for $1 million Bitcoin, but what we have right now is like 70K or less. So, pretty devastated. But then um on the second thing which is whether or not like I'm seeing institutional adoption for for the industry that I operate in which is uh prediction market. I honestly feel like it's still a little bit too early in a sense that the the capital efficiency of of the protocol designs the way um even for for for some of the like topics to settle right whether or not the Fed will will increase uh hike the rates hike the rates for for 25 bips or something like that. It's still a little bit like a toy right now if I'm going to be honest. Right. So I think um if the in institutions were to come in like they want to kind of invest like 250k I I think it's it is still going to be a stretch even for the biggest players like a poly market. So uh in this case I think there would be probably like maybe one or two years ahead of what we need still need to kind of build more in order for us to kind of capture institutional um demand for when it comes to prediction market. But I do see some appeal when it comes to these institutions to come over to kind of uh participate in prediction market is it just gives them a lot more flexibility or a lot more variety of ways for them to express their opinion other than just expressing on price alone right and I think like you can bet on things like uh whether this news is going to happen or not you can bet on uh whether the the rates are going to hike or not all those things basically if you have an edge then you potentially can can can bet on it and I think that's kind of the ability of uh of prediction All right. Thanks. Thanks for that. So, so perhaps still early days, but but maybe we'll we'll see a lot of progress this year or or in the near future as well. Um let's let's you know switch switch a bit. I think talk about you know what's what's dominating the news these days at least from an asset class perspective which is gold and silver. I never thought I'll be sitting here talking about this. Certainly in 24 and 25 I think you know when when gold started rallying none of us cared right because because Bitcoin was doing way better and and now you know we all have have all all are looking around and seeing like oh where do we get gold and and you know everyone is sort of launching some sort of gold product. So, so maybe you know wanted to talk a bit about you know you know precious metals or commodities uh now back in vogue and like you know how how is that affecting you guys you know as as products how how do you guys think about this and you know sort of maybe you know if you have a perspective of you know why why sort of bitcoin has fallen behind a bit I guess on on on these things and and oi maybe you can you can go first. Yeah. >> Yeah. So, so for for probable we still see most of the activity is still happening in Bitcoin because apparently our our user base our crowd is mostly crypton natives as well, right? But then we also are seeing people emerge like people like some topics starting to emerge. One of them definitely is things like commodities like uh whether or not gold price is going to a certain dollar or silver or even things like uh uranium. So people just want something to kind of bet on it, right? So uh we're seeing some action starting to take off in these type of commodities and and and and the intersection of of this and also uh with with uh these commodities is actually financial news which is also something that we we see a lot of activities are going on with like a Fed decisions with uh even even for even for Feds in in Japan those decisions are something that people would actually bet on. So I think these are the kind of like the very adjacent categories that we see a lot of actions and I definitely see like this is definitely going to be something that will continue um as as uh production market gets more developed. >> Thanks thanks for that Va what about you guys? I mean you know gold gold is making a comeback and you know >> I think I before to answer this question we need to kind of draw a clear line what is betting and what's actually trading right if you are going to do a prediction on any live event even the price action it is definitely a betting but what actually having a real world assets or tokenized synthetic commodities on the platform uh from the platform perspective it gives a upper hand both for the platform and the user For user the upper hand is that user first and foremost can make a fast decision can decide to diversify the portfolio or whenever gold goes up or bitcoins goes down they can move their money within the same platform. Especially at Mexi we offer zero fees. It means user can get exposure to tokenized stocks and gold and silver with zero fees. Similarly to our entire spot market making sure that they can with the help of one click they can trade or let's say technically swap between the assets making a user uh to do the most smartest decision at that particular market uh movement or particular market moment. From the platform perspective, this allows us to maximize the user lifetime value because especially when you operate in a such centralized way where acquiring a customers is really expensive and it's not only about the marketing cost, it's about cost that we put on the compliance KYCs everything literally adds up very quickly. And once you invest so much to on board the user, you definitely want to maximize the lifetime value. We come back to the same kind of a narrative of the super apps. The same way our you know app that started to order a taxi today we can order food from there almost get our prescriptions filled and many other things. Similarly I think we are becoming to this like a unified platform super approach where it is your investment super app. You can do everything from buying selling and investing. When it comes to gold and silver I think it helped to most of the trade five platforms. uh the same way they were able to offer Bitcoin or crypto assets right your revolute your monzo or your any neo bank today we are able to go back or like kind of heat back telling that okay now we can also offer the stocks here we can offer the tokenized real world assets we can offer you synthetic commodities and precious metals and lastly from our users perspective uh I think we came to realization even though you are the native crypto head right you came into investing with crypto, bitcoin or any digital asset was your first investment opportunity. Today you don't much care about the asset itself. You care about the market movement and how you can maximize on that. Uh for an average user it doesn't matter if they're trading gold or bitcoin. There isn't much conviction in a short term. There is a aspect how can I make more money? How can I make more money now? And that's why we saw the raise of any sort of an asset. That's why I believe we see the raise of the prediction market. That's why we see huge demand on very high margin trades. There are people uh trading with 100, 200. At maxi we offer up to 500 times leverage uh because users mainly cryptoheads are very hungry in terms of doing 100x, 10x, 20x. I remember three four years ago if you go to any conference people will talk about next 100x. 10x was you know like a loser kind of a return on investment. Uh and on the other end if you came from a traditional market you know that like S&P 500 goes around 5 10% for you like an uh I don't know 20 30% return is already great and I think we are kind of in a convergence of these two aspects what is a good return on investment and how we can still maximize what is coming from the market and lastly what it gives to the stock market. And I think give it gives the stock market to opportunity on exposure to the Gen Z and young people that never touched the stocks. They never knew that, you know, they could call your bank and have a broker or they could invest in the stocks. Now they can do it with the blink of an eye. And I think that is kind of win-win situation for everyone. And at the end of the day, especially when the market is down, people don't much care where the money is coming from as long as that money comes from. They don't care if it is the gold or bitcoin. It is just a ticker that they are trading. Uh because we are not talking today especially on the tokenized assets aspect. We don't think about you know long-term conviction that these people truly believe that gold will go I don't know or they are dollar cost averaging gold for next five years. I don't think that that's even happening and I believe there are still people who are very bullish on Bitcoin in the long term and I believe in couple of years when we zoom back we will see still see that you know Bitcoin is again doing much better than gold and real estate than any other asset class but in today's kind of a last two months last two weeks kind of a frame we see that people don't much care about the asset itself they care where the price is going and how they can maximize >> yeah and and you know I I I think that's a fair comment and and certainly I think you know we've been getting a sense of that as well. You know the the attention span is shortening and so is the conviction like you said uh but you know certainly I think you know perhaps these are just phases and you know we we live in certainly uncertain times. Uh coming to you Chris I think you know with gold and silvers you know uh you know how how is that affecting you guys? Do do you guys have to you know rip up the plans now and everyone's got to try to crystal gold now. So fortunately for us like it's all happening and tracking exactly the plan. We're one of the first to sort of like you know x with go with with tether's gold is pro is is not probably it's the biggest gold product out there. Um you know but we have uh you know we have the matrix for aum. We're one of the biggest um you know biggest sort of like users of matrix for um you know gold uh on in crypto right now. And so you know we've had gold for a long time. We've had we've had uranium we've had silver. We've had these things. And so you know it's sort of tracking right along to now. Um did I think that it would go this way? No. can't pretend that I sort of knew we were heading in this direction. So, sort of a axom of history, but um it is all tracked in a plan for us thankfully on the RWA side. You know, at the end of the day, we've always said that, you know, one click to be able to own anything in the world, right? Um and use cryptography to to understand and know that you're actually holding that asset um is an amazing thing, right? Um and even for us, you know, I think personally it's been great. I hold a bunch of like tokenized gold, right, through this. Um and and so it's been good for me. Um but um but but yeah like I think uh you know I think to to to the point that I mentioned earlier I I think it is the point where it's like the truth is most people don't give a about the asset you know it really is crypto was a venue where you could without thinking without knowing much about doing anything you know hit the 100x right and that was the promise and and so you know that used to be alts right um rip I guess uh you know and then we rotated to memes, right? Because that's where entrenching and that's where that where it was. And then now wrote it into you know what like it turns out, you know, 100x uh you know is not it doesn't really matter if there's no liquidity and you can't actually pull anything out, right? So like let's go to where there is anything. And so what you're seeing now is combining deeper pockets of liquidity. Where is the real money? And then at the same time adding PERPS on top, you know, it like per you know had a big year obviously with Hyperlid. I think probably one of the moments I didn't talk about but like hyperlquid was a was sort of a seminal moment for for for crypto in general where you know one first go real airdrop in a while god bless um and number two is um is just seeing the adoption and the usage across that and sort of decentralized first and really seeing a dex for the first time right a dex quotequote I guess still you know relatively speaking more decentralized in Binance right and sex is like really compete with sex right um and have you know really high volumes as well right and so I think you look at that and the combination of things you know the the uh the downstream effect of of hyperlquid was um everyone's throwing per everything right um which you know again was something we talked about a lot at plume as well which is you know sort of being able to take leverage uh across many things and express ideas in different ways that's ultimately what this is right um and to me leverage is just you know it's a it's a number for conviction right um and so if you you're a very strong blue asset being able to lever up in a very very simple way and a very capital efficient way is is a incredible I think prediction market is another way is another way to to sort of express ideas right and so I crypto largely is the ability to express an idea in very very simple ways um and through through a single click um whether it's a tokeniz tokenized hedge fund through things like Athena right whether it's through prediction markets opening up Adams new ways whether you're you know doing it because you're actually losing something or your earnings are trading whatever it might be but there's there's something there right um and then third obviously um you know through through deeper pockets of liquidity that's why the trad asset has become a thing right and so that's kind of in my opinion it's the confluence of all these ideas coming together there and I think it really I've been writing this post where sort of like you know um basically everything is crypto now except crypto right meaning like the the AI markets right are going in an insane way right you're sort of seeing how you know even subtle things where even fundraising and all kinds of stuff like you know it's sort of taking shape you know you're doing these cards you know the very classic crypto fundraising cards are sort of everywhere in AI now right you're doing a lot of launch for everything it's a lot of hype and narrative and nonsense right as well in the sort of trem crypto is becoming very like payi payments and stables and all kinds of you know we're talking about regulation and things like that and so I think you're seeing the confluence of those types of babies come together and That's why you have trad, you have sort of traditional assets like gold, silver, and you've got per kind of enter the mix of prediction markets all over the place. So, and stable coins. So, the commerce of these things is really really coming together in some in a crazy way. >> Yeah. And I think I think, you know, with with more per coming into the picture, that's also I think why we're seeing more liquidation events as well because, you know, people tend to want to lever up to to you know, go for that 100x. I think I just wanted to to ask some some more specific questions to to each of our speakers. I think, you know, Ollie, let's start with you. I think you know prediction markets still still new uh on the block but you know definitely last year was was major growth four times I think to about 63 billion in in in you know notional trading volume. I'm just curious. I I I know we talked a lot about the retail investor and you know sort of the crypto native you know just not caring about the ticker just looking for for a place to you know sort of bat and you know what do do you think that's what's driving you know this shift to prediction markets or you know what what do you think is sort of the factors that's that's going to drive you know the growth in in predation markets this year? >> Yeah. So I think the the prim one of the primary reasons that why like prediction market has a kind of like appeal immediately to a lot of like crypto folks if not like even the general masses is because it's it's a really horizontal and it's a really kind of like a generic product for people to express their opinions or express their bullishness on and and like I said like if previously if you if you want to convince someone to be trading crypto you need to first teach him what is crypto right and you need to teach him like uh why you need to be bullish about crypto and then here's an instrument for you to trade. But uh the the beauty of like a a prediction market is basically it's very tied into someone's normal life. Like you watch a you watch a sports game, you um look look at you watch a news, you you you go you just live your life and then you must have something that you have an opinion on already. if not you have something that you have conviction on and and and prediction market just gives them a very efficient tool if not a really interesting tool to allow them to kind of express these opinions right so um but then like I feel like right now the if if I'm going to be like my take is that I feel like prediction market is still a little bit nent right now like we just started I think right now if I can do an analogy correctly it feels like an openc moment right now for as as an NFT open moment that is compared to what we're having right now for prediction market. A lot of people just launched and they're still trying to find a niche. They're trying to find an edge and and and right now the market is still exploring on different types of ideas. But I think sooner or later there will be some players like Blur that is coming into uh into the market and and and they kind of disrupt the entire space by just offering a much more superior product, a much more seamless experience to to the users that really care about the product, right? So, I think that's something that we we as ourselves are probably we're looking forward to and we we're trying to kind of lead lead this change. But I but I sense that the market is definitely going to be heading towards more type of um specialization in terms of uh the the types of markets that they're going to bet on because right now like if if I'm being honest like poly market is just a little bit too generic, right? Like the offers everything but then they are kind of like a master of none. So, um I think the the the the way to win is definitely for other players to kind of join in and then to offer a much more superior experience like a 10x experience on betting on a specific product and that can be on financial news that can be on crypto that can be on sports. So, yeah. So, that's what I'm picking up right now. >> And maybe Ollie really quickly just curious just because you know this better than I do on the prediction market side. I mean my sort of understanding prediction markets is is like a tremendous amount of the volume is just crypto still meaning it's just short-term like basically you know we don't have basically like we don't make money like you can't you if you're holding BDC of which I'm you know a proud like you know holder as well like you just lost money right and so like the only way people are sort of able to monetize crypto now is sort of the shortterm like these short-term markets um around like you know sort of like the you know the classic I think that was like the 15-minute market is BTC going up or down, right? And so like that's what people are betting on for a lot of the prediction markets and the vast majority of these markets have zero like not zero but like they're not real markets in so many words. Sure, you can there's a market for everything. There's no real action there. You couldn't do anything with size. The pricing is all off and so really it's still an extension of crypto when it comes to volume. Um uh but I could be totally wrong. So I mean you you you tell me. I'm just curious if that's >> I think that's a great question. So in it turns out that the like each of these market players they probably have something that they're really good at. Like for example for for poly market they are definitely really strong in terms of live sports. So NBA NHL NFL anything basically any type of sports they're probably the strongest at. And then for Koshi right they they're they're most likely going to be news driven. they're more even even they have a really strong uh presence in terms of crypto stuff and and and and one of the things that perhaps like some of the niches that the other other players have been trying to kind of get a foothold is like things like PTG markets for example like what's the what's the token price once uh once something drop air drops right so a lot of these type of topics and and I realize that most of these different players out there they probably have their own edge in terms of their product if not um when it comes to content sourcing they are a lot more experienced than in something someone else. So I think that that's already starting to kind of play out and and surprisingly for for us because we are kind of operating as a crypto native exchange, right? So crypto is definitely something that we are um we are the strongest at, but we're also seeing kind of adoptions in terms of like overlapping areas like uh crypto news for example. So um I think that right now it's still a little bit too early to conclude like who's winning a certain category, but then I I think the trend is actually forming there. Yeah. All right. >> Thanks. Thanks. Thanks for that. I I guess you know um Chris, you know, I think with with RWAs, I think one of the big things that happened last year was, you know, tokenized equities, right? And that was supposed to be, you know, big launch, a lot of partners, but you know, I think if we look at the volume, it's it's not really there yet. Um, you know, what what do you think is the lessons we can we can sort of take from this? and you know what's your take on you know the the most exciting RWA sector we should be watching for this this year in 26 >> totally look we've um so plume I think if you go back and look at it we were probably one of the first to tokenize equities um and uh you know in all forms right and these are partners of ours through backed through swarm through things like that we did tokenize directly ourselves um and um you know honestly I've been saying this for a while and um you know I don't want to be too too like aggressive about it although I probably will be but You know, I've always thought tokeniz like super forced narrative, you know, to be honest. Um and uh and I I was never a believer of it. I'm still not a believer of it to be honest. Um not in a negative way, right? I think it will happen. And I think it's one of those things where sort of like is fake is so fake it becomes real, you know? Um that's like it's probably how this probably how I would describe it. Um where you it's so obvious the volume is fake. It's so obvious the uh you know the um the adoption is not real, right? it's incredibly obvious that like there's really no usage around it, right? Um and uh you know, you can just tell on the flows, right? Now, I I can't say on the sex side, right? Um it's unclear to me and it's very possible that it's actually very strong there. So, I would just like take that entire part of the market off of my my thoughts, but like if you look on chain today, you look at the charts here, you can see the adoption for every tokenized asset growing at the exact same rate, you know, and like that's just not a thing, you know? That's just not how the market if you look at any the growth of any other asset. not how it works. You know, you don't have every equity going up at the exact same ownership rate over time, right? Um through the same wallets, through the same, it's just like very very clear what's going on. So, I've always thought it was an incredibly forced narrative because I just don't think that the classic world has a lot of a sort of like again we're here to chase alpha. That's 99% of what crypto is, right? Nobody really cares about these things, right? And so, you know, I've never been a super strong believer in it, right? Especially you're talking about super low liquidity, right? You're talking about these like that's not people are here for, right? Now on the other side you are beginning to see it it might actually become a thing though because basically as the rest of the market degrades for crypto right and people are looking for more venue for for sort of more venues to gamble right um and more venues to sort of like chase alpha when you combine deeper pools of liquidity right in the tread markets with leverage on purpose right and you may actually have something that comes together in a in a sort of pretty nice way right um and the ability to just again I think Vugar mentioned it like you're just chasing price action And right now that happens to be in metals right now. Now now that you know it seems like at this point the minute that the crypto bros pile into metals we all start to dump. You know everything starts to you know because you know I think you know the minute crypto touches it you know we ruin it all. So like it seems like that's like what's going on. Regardless, you know, I do think it's becoming a thing, right? But even then today, it's more ways to express the same ideas, right? If you look at tokenized equities, the vast majority of it is um you know, a big part of it was just you know, lever dats, you know, that was like a big introduction of it, right? People were just trading Bitcoin in in more esoteric ways, right? Um and it was just DATs unfortunately, right? And then you begin to go and and diversify into things like, you know, you're doing a little bit of technology stocks. I think Coin was a big one, right? your Tesla's a big one, QQ, you know, you know, simple things. S&P is another one that's sort of going there. So, like it's sort of like so forced and so not real that it becomes enough, it becomes a thing. And I think the combination the timing of this with just the cryp I mean we're at 69 right now, right? Um I think I haven't, you know, I try not to look. I think you like I try not to look either because otherwise, you know, does uh you know, send a wave of a depression through me. But um you know, if you don't if you don't look if you like look at that income, like what else are you going to do? you know, um, you know, trenching is trenching is is like is Um, you know, the sort of like even the majors are at this point, right? Um, and it's very clear that liquidity is not even there for the majors. Where else is it going to go, right? Um, and so, you know, you could see it happening where, you know, it was never real. It's still, in my opinion, not very real, but it is uh I do I that that I sort of, you know, hold both ideas. I'm actually still very bullish and I think it it will turn uh, you know, and I think it will happen. Um, and it's happening in front of our eyes at a fundamental level. So, um, I think you look for it. It's going to be a real thing right now. You know, I'd be careful. Some of these assets are just like very illquid. They're just not very useful, you know, like you know, I think it's very hard. I I I used all of them, right? I think it's they're actually very hard to use for most of them, you know? Um, and but um, you know, fast forward, it's inevitable that like around the corner, and I'm not talking years out, I think, you know, I think we're like right there. This is actually become very very usable. And I can completely see the volume and the attention actually dominating crypto completely um with with the tokenous assets. >> Yep. and and Vuga, I think I think coming to you, you know, uh 205 was very interesting for for centralized exchanges, right? So, obviously, you know, we we touched a lot a bit about, you know, some of the things that happened, you know, by bit got hacked. Uh, you know, there were a lot of onchain competitors, right? So, you know, Chris mentioned Hyperlquid and and a bunch of perexes also popped up. You you mentioned, you know, a lot of them going zero fee. Um you know obviously the 10 10 happened as well and you know a lot of the you know a lot of things a lot of people worried about you know sex doing risk management. Um but actually Maxi actually had a pretty good year right like you know for all accounts you know the the the numbers and the volume looked stacked up pretty well um and you were taking market share away from your competitors. Um you know what would you say are some of the things that you know you guys did right and and what were some of the lessons that that that you learned from 25? I think when we talk about buy bit there were like so many great lessons to draw uh and conclusions. First and foremost, first time we realized that uh even though crypto is kind of an underdog, it became a national security warfare moment where uh there was accusation that probably the North Koreans were involved in that hack and it was more of an security intelligence point rather than a single standing corporation. Secondly, at that time I was chief operating officer at BitKet. We jumped in and helped by bit with by lending Ethereum. So did Galaxy Binance and many others. This was a first unprecedented issue matter in the finance industry because usually if the bank goes down what happened central bank kind of bails them out or another bank is kind of takes them over. It was the first time uh that we already knew what happened with FDX and we didn't want BB to go down. Therefore entire industry came together to save BY. today by is as strong as ever and they're they kept growing and acquiring more licenses and I think that was a great learning experience in there that first time industry understood that we don't have anyone else to bail us out we have to help each other uh and lastly I want to give a huge shout out to my colleague my dear friend Ben for uh handling the matter in a very professional way making sure that everyone had a clear communication there wasn't much fud going around there wasn't much speculation because he was online he was telling what's happening and the crisis communication is one big learning lesson for entire industry and myself as a professional. Coming back to uh Mexi as a platform and our growth, I think I I I only took over the Mexi two months ago and the one of the key reasons I decided to join Mexi uh because I was uh so much surprised to see that there's this great exchange that people choose because it is not your first choice, right? No one wakes up one day, hears that Bitcoin is alltime high and comes to Mex to buy a Bitcoin because Mex never spend much money on big sponsorships. there isn't that kind of sentimental connection but usually the people who come to Mexi like the way I discovered Mexi myself was that I wanted to trade certain token that wasn't listed in any any uh big exchange exchange where I worked or like a binance and buy bits and I discovered Mexi then I opened the doors of the zero fee trading and for people who are either you're like a very small trader or very huge whale that the trading fee definitely makes a big difference in your life and you come to Mexico because as the product is really good and it is kind of you're on your way of the evolution on your way to understanding the crypto better the since I joined uh also the coin gecko put an great report recently out about how much we attracted both trading volume user numbers and also we are one of the domin dominating players in the tokenized gold and silver tokenized metal aspect and I think what makes us very robust is that like people who choose us they know why they are They're not here because we sponsor Formula 1 or any football team, which I definitely want to do in coming future. But today, 40 million users who choose Mexico, they choose because they clearly know what they're seeking for. But you also mentioned the rise of the decentralized world. I believe last year they captured more than 10% of the market share in the trading volume and they're increasing because uh demand is definitely there. Still I believe the barrier of an entry is very very high. It is for much sophisticated, much educated user. And when we can put like a all the players from like a centralized exchanges like a giants like Binance as like a your first entry point and then on the way you go towards your hyperlquids or any decentralized platform to discover more gems to be more free or to trade on your own risk like Mexicit in a very sweet spot between where we have more than 3,000 project listed. It's very easy to come on board. We support the new developers and projects and founders to issue their tokens. We don't charge arm and leg for listing like any other platform. We don't act on a black box, right? Still we have a very good liquidity. There's an opportunity is there. We have $100 million guardian fund that if something goes wrong, we will be there for you. And we are the one of the very few exchanges that never actually suffered any hack or security breach. Making us an really nice place to trade for the people who already know why they are here. They want to enjoy zero trading fee. They want to discover new gems but also they want to do it within the safety and security of an trading centralized exchange and they're maybe yet not ready to on board with your you know decentralized journey and I think that is where we also come in place as an education platform. you might have been coming you know to your Binances or OKXs as your first entry point then you evolve through the Mexi and then this is where you kind of embark to the next part of your journey whether you want to stay here or move but also uh let's not lie to ourselves right today we all have so many apps and so many browsers on our devices and for us changing from platform to another is a matter of two three clicks and it's always about chasing the opportunity and I think This years coming years will be much tougher about the consolidation about fighting for the user attention and user money. Let's not forget in financial industry people don't choose you because you are shining your nice. People actually choose you by putting their money and it is a very very expensive journey for everyone. Making sure that someone actually trusts in you and puts their money is the for me this actual sign of the success. It's not about how many users are there. It's about the trading volumes. It's about the platforms where you open. You clearly see who is doing well and I think that makes us one of the robust players. And lastly, what makes us much different than anywhere else as I mentioned in the beginning of my talk that we have around 40 million users, more than 90% of them are the individuals retail longtail customers who trade which makes us much and fairer ground to trade and play rather than uh large exchanges where 80% of the trading volume comes from the institutions and retail doesn't have much to say. >> Yeah, I think I think we actually when when went, you know, over. So, so we're at at at, you know, 50 minutes over. So, I just wanted to make sure, you know, thank all of you guys again. You know, Vuga, Ollie, Chris, you know, thank you again for joining us. Uh, I just want to open up, you know, the floor last chance for you guys, you know, talk about your own projects, maybe what's coming in 26 and, you know, we'll try to wrap up on on, you know, a more positive note, I think, you know, and not look at the number too much. >> Chris. Yeah. >> Yeah, totally. Um Bls for thanks for having us and of course I actually love to hear the coin gecko perspective because you guys see everything of course and you know I use co you know all the time and so you guys must have a good view on everything and you guys are putting a lot of content too. love to hear to hear your thoughts on like where things are going and also um but big picture look um the short story is this you know for plume we're we're one of the largest sort of networks and ecosystems around rwas right so we do tokenized assets and that means anything and everything we've always been very sort of crypto first in this way where you know our view has always been that rwas for crypton natives is the path forward whereas too many of these traditional assets that are coming on chain look and feel like traditional assets right um and meaning that it's hard to use they're maybe gated, there's no liquidity, uh or they're not composable or whatever, right? Most assets today for RWAS, you know, the truth is you people like people like me and you or like the retailers does not hold them, right? If you look for if you look at Bidd or you look at these big funds today and again, I'm not saying these things. It's great. It's still but still early. That's all we're saying. You know, uh Bidd has about a hundred holders today, right? And we know a 100 holders in crypto is probably 10 users, right? Um and so uh so and I think that's being pretty generous, right? And so that's that's like the reality of tokenized assets today, right? And so at Plume, we've always been very fixated on this simple idea, right? Which is I'm still very aligned with the crypto first and cryptonative approach, which is it needs to be crypto first. It means permissionless, composable, and liquid, right? Those are the defining characteristic of a cryptonative asset. and transforming trad assets uh into that feeling into that UX I think is the piece that unlocks utility and unlocks the market and keeps crypto in the driver's seat and have bulk control over these markets going forward and the retail user which I think is a really important part and a defining aspect right of crypto and more importantly moving a technology medium right when we went to the iPhone right the you know we sort of became you know the thing that took off was something that took advantage of the the sort of architecture of the phone right use the accelerometer of location that gave rise to Uber, right? That's what drove things. So if you look at the sort of native architecture of crypto and dynamics of this, it is this sort of 24/7 global permissionless liquid composable asset that matters. So I think if we take advantage of that, that's actually the best path for these assets to grow and for crypto state and for to stay philosophical line to where we want to go, right? And so going forward is this, you know, plume today especially one of our protocols nest is the easiest place as a result to go and get access to any RW in the world, right? So you go there, you you take your stable coins and you can deposit anywhere, right? It's on our chain, it's on ETH mainet, it's on other places. We just launched on Swan not long ago, right? You can go and you push a button and immediately get access to the best funds and the best products in the world. Everything from a sort of a you know the Black Rockck build fund. We the Janus Henderson fund, right? Um we've got a superstate assets on there. We have everything from Apollo private equity funds. We've got wisdom tree. We have different payi assets. All these things. So if you want to click buttons, right, and interact with the real world primarily from a yield aspect, right, Plume and Nest is the best place to do it today. So you we've got that's why we have you know the you know one of the largest user bases in crypto when it comes to RWAS uh in the world is sort of the broadest diversity of assets again like I said earlier get everything from sort of tuk tuks right and rentals on that side to durian farms right we have camel farms all the way to the best assets in the world from some of the biggest asset managers right so you know you want to click buttons interact with the real world plume is a place to go do that in a way that feels and looks and smells like crypto still bridge over in a way that you already know today push buttons deposit take those things put into morpho loop against them lever up do whatever you got to do right um then That's how how we sort of think about we want to sort of abstract away the real world and make it usable to the crypto native. Um so you know again really excited I think the next year with tokenized assets I think it's very clear a tremendous amount is coming positive in this way right um and all the things that we want to happen institutional flows right we want them to buy our bags we want Bitcoin to go up all all these things are around the corner still right I I remain an optimist uh unfortunately for my uh my financial um status um but um I remain an optimist for all these things um and you know I'm I'm very much believer that like you know it it's very uh rocky in the short term as always right um but I think if you zoom out Right? And not even that far, right? DeFi has been around for four years, right? 5 years. It's not even that far, right? But if you zoom out even the slightest amount, which we are unable to, and myself included, you know, um it could not be more up only for us, you know, and it could not be more positive across the world. And so, you know, I'm incredibly bullish on, you know, everything that's happening here. I think sexists have done an incredible amount for us across there's a lot more to come, right? I think prediction markets are very clearly like going nuclear, right? And they're going to continue to go nuclear. Um I think stable coins and tokenization you know it's just it it could not be more clear every major country in the world is doing tokenization right and talking about every major company in the world is doing tokenization right and so the amount of flows the amount of money and the amount of things that will happen right if and this is the same idea with with a sort of clue when we started if um if all of crypto grows then then all of crypto grows right meaning as long as we bring things onchain everybody in crypto will benefit in one way it may not be how we believe it to be and how we think it will happen but we will all benefit in some way. So if we focus on that idea right we could not be tracking towards a better place. Um so still very positive silver bulge for the future. >> Thanks. Thanks so much Chris. Uh Ollie. Yeah, and at probable our vision is very similar to what uh Chris just mentioned, right? We want to build a product for crypto for the crypton native crowd, right? And and there are a few things that we're trying to do and the outcome of what we're trying to do is basically become a 10x better product than what the other competitors have been doing when it comes to providing products for these cryptocreative crowds. And and I think I can definitely think of a few dimensions to kind of think this through, right? First of course is the content or the events that they can kind of uh predict on. Um it's just not just on on crypto prices because if you imagine like if people all offer is just people betting on crypto prices then there are much better instruments for them to do that like imagine they can probably do it in in per they can even do it in spots then why do they have to bet on using it use a use a prediction market for it. So I think the answer to it is definitely going to be providing more variety of things that people care of when it comes to crypto. It's not just about prices, but it's also about um metrics like TVL. I think metrics like TBS, all those all those things that are related to uh crypto that allows people to express more opinion into into a project, but not just on price. And and the second dimension I think of is how we can push our infrastructure to the limits, right? It's like right now the market is only offering a 15-minute crypto prices on prediction up and down, right? Can we actually push our infrastructure further that can that we can offer like a five minute if if not even like a one minute type of prediction right so I think these are type of the modules or type of the experiences that are meaningfully better than than what we can provide right now and and right now definitely it's it's just not enough and the third one is as as we are kind of our DNA is more building for the crypto crowd right we want our product to be also composable in a D5 stack so imagine like if we can actually allow users to kind use our positions and then to lend it in in some of the protocols like Ave and then to kind of borrow USDT from there and and and and earn yield. I think those are the type of things that we want to work on and we're actually actively working on those um to kind of increase our uh usability or actually you allowing ourselves to be more composable in the entire DeFi stack. So I think these are some of the very interesting things that are happening on probable but um and I think like definitely we are we're riding on the right trend. we are building on a product that is getting product market fit. So I think that's kind of like the the really good thing that is happening right now. >> Yeah, I thanks thanks for that Ollie. I think it would be remiss if you know you you said you wanted faster crypto prices if if you know I don't mention that you know talk to us about our API and and let's see whether whether we can solve that for you. >> Definitely. >> Yeah. Uh I I think last word to Vugar. I think until Ole figures out how to build the shortest times on predictions still you can trade real time crypto on Mexi for a zero fee and that is what is our conviction and we want to double down what we do the best to build the easiest access for the user and make sure that our platform become becomes a gateway to internet opportunities whether it's discovering new gems whether it is uh trading assets that we are very familiar with real world assets definitely synthetic and tokenized assets is that what we are trying to build for but also in this year we'll be uh testing a lot of products in terms of the retail longtail whether it is the payments in Latin America or card product that we are co-aunching with iter five with a lot of uh spending benefits rather than earning benefits and I think that is one of the beauty of the industry where we are moving at the moment it is we are becoming too mainstream and yes a day maybe an average user conducts a couple of trad trades, but definitely they do uh tens or even dozens of transactions buying coffee, ordering commute and more. And that's what we want to build a full life onchain kind of a product that is truly zero fee and make sure that users especially the retail users enjoys it the most. But I'll be investing a lot also for making sure that the platform is running smoothly. It is safe and secure for everyone. And I'm planning to increase our guardian fund around half a billion dollar making it one of the largest three guardian funds there that all our users have peace of mind when they come and invest their money on our platform. Therefore, if you haven't done so, I doubt you haven't. Go check Mexi out. And today we have complete zero fee to all our spot market more than 200 pairs in derivatives and also for gold, silver and tokenized US stocks. you are able to trade with a zero fee and I think that is the beauty of it. You can just save on your fees on other platform and come and explore new opportunities on Mexico. >> Yeah. And I think with that I think I think this is a good place to wrap up and we're going to talk about peace of mind and hopefully we we'll get some of those uh as as as we proceed through throughout. Um, thank you so much again to our speakers, you know, Vuga, Ollie, Chris. Thank you to our sponsor, Maxi again for for letting us make this happen and thank you all to to to our audience. I know a lot of you are still uh, you know, listening in even though we have gone over time. Uh, you know, for for paying attention. Uh, you know, I definitely learned a lot. I think this has been really interesting chat and, you know, hopefully you guys also got something out of it. Thanks everyone and we'll take care and we'll catch up again the next time. >> Thank you. Thank you for >> Thank you. Thanks. See you guys.",
        "summary_hu": "A kriptovaluta piacok llapota 2026-ig vegyes rzelmekkel s kihvsokkal teli. A rendezvny rsztvevi a piac ciklikussgrl s a kritikus technolgiai fejlesztsekrl beszltek, mikzben figyelmeztettek az intzmnyi kereskeds fokozdsra s a retail kereskedk helyzetre. Vuga kiemelte a profit realizls jelentsgt, mg Ollie a jvbeli lehetsgeket hangslyozta, pldul a szablyozsi tisztasg s j protokollok megjelenst.",
        "summary_en": "The state of the cryptocurrency markets leading into 2026 is marked by mixed emotions and challenges. Participants discussed the cyclical nature of the market and critical technological advancements, while warning about increasing institutional trading and its impact on retail traders. Vuga emphasized the importance of realizing profits, while Ollie highlighted future opportunities such as regulatory clarity and the emergence of new protocols.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 55,
        "key_points_hu": [
            "A profit realizls s a hossz tv gondolkods kulcsfontossg stratgik.",
            "Az intzmnyi befektetk szerepe egyre hangslyosabb vlik, ami kihvst jelent a retail kereskedk szmra.",
            "A 2025-s v fontos technolgiai fejldseket hozott, mint pldul a tokenizlt eszkzk s stabil rmk bevezetst."
        ],
        "key_points_en": [
            "Profit realization and long-term thinking are crucial strategies.",
            "The role of institutional investors is becoming more prominent, which poses challenges for retail traders.",
            "The year 2025 brought significant technological advancements such as the introduction of tokenized assets and stablecoins."
        ],
        "main_topics": [
            "Market Sentiment",
            "Institutional Trading"
        ]
    }
]