[
    {
        "video_id": "nJ7YN2OWoiw",
        "title": "You Don’t Want to Regret This",
        "published_at": "2026-02-06T10:24:07Z",
        "sort_date": "2026-02-06",
        "url": "https://www.youtube.com/watch?v=nJ7YN2OWoiw",
        "transcript": "Bitcoin emergency update and emergency announcement. Bear cap was out at 120K plus Line flipped blue here at 1810K. Someone complained last year that the color here wasn't clear enough. So I ordered thousand of these blue and yellow caps and started wearing them in every video here last year. So to that guy, I hope it was clear enough this time. Then boom, hit $60,0001 today. That's over 50% drop even with a recovery. Now that's $49%. Meanwhile, people are posting that none of these indicators work. So this was all useless. Hit or not, not not not. Well, there was one that did. And I just realized it's actually now for the ninth year in a row. 2018, 2019, 2020, 21, 22, 23, 24, 25, 2026. It's easy to come up with something after the fact that would have worked, not so easy before the fact. Tom Lee's Bitine is now down 8 billion on Ethereum. Even the simplest loan line use would have not only avoided this 8 billion loss, but turned his whole Ethereum adventure into profit. And even more so if he did it correctly and traded the ETH BTC chart separately and the BTC USD chart separately. Michael Sailor's strategy I haven't fact checked but this report estimates 31 billion in unrealized losses from Q4 until today. While here we sit with blue cap on largely unscratched. This is fantastic. I have basically my entire capital intact. I think within 1% mostly due to fiat currency fluctuations. And now thanks to much lower prices, I have the chance to make much more money this coming cycle. This video is education, not financial advice. For financial advice, seek out a licensed financial adviser in your jurisdiction who can take your personal situation into account. Remember how everyone said that there will be no more crazy dumps. volatility will drop because institutions are here now. While in fact so far this cycle is playing out exactly as the previous ones and like every other previous time everyone starts saying that oh it's never coming back. The trust in Bitcoin and crypto is hurt now and so on and so forth like every other time. Then when the last person who will sell has sold. What is that by definition? When the last optimist has given up and pressed the sell button, peak depression. What is that? That my friends is the bottom. That's the turnaround. A dump like this in a quality asset where we could sidestep. It is great. That's what we want. There is no doubt in my mind that this will turn around. Digital money on the internet in the AI era. Hoard digital money in an era of government debt recklessness. Where the United States government debt on the log scale looks like this. On the linear scale it looks like this. Where gold is going parabolic as a reaction to that. Guys, Bitcoin as a concept is not going anywhere. These are price movements. 50% drop in Bitcoin. 60 70 80 90 99% drop in the altcoins. Not to mention the 10 October liquidation dump in great many crypto assets. If I had done this differently, I could easily have gambled away my entire net worth here. If I had listened to the M2 money supply guys, then when that didn't work, they switched to ISM PMI index, which by the way flashed bullish last week just before this dump. Or I could have believed that you can predict the future. Remember that video I did about Plan B, who was again predicting higher prices late last year, and I showed reactive versus predictive results. How did that go? All that stuff, the M2, the ISM, the S2F, predicting the future in a crystal ball, it doesn't work, guys. What actually works is the same thing that has worked for a hundred years, which is looking at the price action, which is the result of what the market participants are actually doing, not what they are saying based on narratives. Sometimes the big players leave trails in the sand and sometimes we can spot them. That's what TA is about. Not predicting the future. That's what happened here in October. Lion line is not some magic line. There were trails in the sand. They were clear and we reacted to that. Now four months too late yesterday evening. People were writing to me from all over the world here at 60K asking if they should sell now after hodling all the way down from 120 110k all the way down to 60. Should I sell now? Lan, what should I do? No. The action to take is to put on your hodel sucks socks. take the freaking course in store lotion online with alerts from Lion Line Pro and be better next time. I bought at 62K instead yesterday. Now price is 65k and I can move those stops into profit today. And I did that while I have readiness for much much much larger positions when not if we have bottom pattern in the chart line gold and or much lower prices. There is no doubt in my mind that we will have yet one more epic cycle ahead of us just as every other cycle before that. And there is really no need to be stressed. Bitcoin is not going to go to a million dollars with a trend down. If we zoom out, so far the cycle dynamics look exactly the same as every other time before this. Institutions haven't changed anything. Just look at Bit Mine. Didn't Tom Lee sit just two days ago and say that it will go up? And look at the ETF flows. When price goes up, they put in money. When price goes down, they take it out. They're even worse than your average guy. Okay, announcement. Today is the day you can take action if you haven't already. Emergency discount on Lion Line Pro. Instead of regular price 5K per year, we do 2380. And note that is not only for Lion Line. In fact, I like to see it that the indicator is included free with the rest. You're getting all this stuff. course launch line indicator loss line pro unlimited alerts discord community portfolios pro portfolios coin stocks commodities my Friday TA pro report and my commitment is that new stuff will be included there will be no pro plus or pro max or pro ultra something everything will be included and you keep your discount upon renewal so right now your task is to look at your own crypto portfolio if it dropped more than 2380 from October. Well, then you have the evidence in front of you and then you haven't even looked at the epic success we had in gold, silver, uranium, tech stocks, which is also included here. And we have payment service providers where you can pay with crypto if you want, as well as traditional card payment. There is no excuse. So, if you have a wrecked wallet, whip out some USDC or some Ethereum or some Bitcoin, and you can even pay with Solana Pay. The best investment is in yourself, in your own timeless education, timeless tools, and a good community of good people around you. And I wish you freaking do it. Action matters, not intention. If you put it off for 8 years, now is the time. You probably have the evidence in your own portfolio in front of your eyes. And for institutional pricing, instead of losing 8 billion, I give Tom Lee Loine at the bargain price of only 7 billion. And to Sailor, great news. Instead of 31 billion loss, I'm giving the price of only 30 billion. I'm joking, of course. In all seriousness, I will not have institutions on this. They would destroy liquidity for me, for us competing for the same entries and exits. Secondly, Sailor actually couldn't do a strategy like this. He would crash the market every time he tried to exit due to his volume versus the liquidity on the market. Then he would be unable to re-enter because he would singlehandedly drive up the price maybe 100% hundreds of percent every time he tried to re-enter plus the symbol value. So he has to do it the way he does. He has to buy and hold. But just because Sailor has to do that, you and I don't have to. We random guys and girls are not limited by liquidity in these kinds of assets. We can do it. So everyone who has followed along this stretch, I hope you're happy. I hope the color on the screen was clear this time. We largely preserve the capital. Prices are much lower. This is fantastic. I'm personally in a better position than ever to take advantage of what the future will bring in Bitcoin. hard digital money on the internet will remain useful. If you regret not joining earlier, I'm giving you another chance now. Freaking take it. Go to ctoarsson.com and press the button. Education tools community will remain useful too. Thank you, Tak City Larsson."
    }
]