[
    {
        "video_id": "KH71ZhC2_VY",
        "title": "BITCOIN CRASH OVER? Urgent Crypto Market Update",
        "published_at": "2026-02-06T23:37:06Z",
        "sort_date": "2026-02-06",
        "url": "https://www.youtube.com/watch?v=KH71ZhC2_VY",
        "transcript": "Yo, what's going on everybody? Are you guys here? You guys with me? You guys with me? Are we in the building right now? What's up everybody? What is going on? Okay, we are live. Uh, believe it or not, I've actually been streaming. I have this new software. I've been streaming for almost an hour. So, um, I did not realize that it wasn't live. I just went, you know, I pretty much blacked out here and started streaming. Uh, new software. I have no idea why it's doing this, but I'll make sure that we don't run into this project uh problem in the future. But let's get right into it, which is is the Bitcoin bottom in? And forgive me, but I've really been I've been playing it down. I wonder why the chat wasn't really responding all this because I've been going crazy here. I've been going crazy in this this stream. So, I hope you guys are having a decent day here. I hope you guys are surviving. It's an absolutely brutal market out there. And if yesterday if you lost some money, just know it's okay and you should see it not as uh as a loss, but just as an opportunity to re-evaluate what you're doing here in crypto, learn, get better. Um, and obviously uh for me uh my goal is just to be the best trader I can. And I've made that very, very clear over the last few weeks. And I'm just going to get right into it because a lot of people are wondering if this was it. And we saw an absolutely staggering staggering low put in here, right? We've seen the uh the bottom here of 60K and we've seen now what is an absolutely wonderful almost $12,000 pump here out of Bitcoin. And right now, Bitcoin is trying to do something very, very difficult, which is get back above the point at which it broke down from, which was this 72K uh support. As you can see, the big big line here is also at 74K. We have two mega bosses that we have to get over before we can truly say that we're out of the woods yet. So, the question is, are we going to make it? Is Bitcoin going to uh come through here and reverse this into a mega bull? And the question is something that we're going to answer today. Now, I made an absolute commitment to you guys. I made a I made a commitment uh a few weeks ago. And that commitment is that we are not going to be doing pure speculation anymore on this channel. We are going to be doing objective objective analysis of crypto. And so in getting to this objective analysis of crypto, we're going to be looking at the charts first and foremost because that is the most objective truth we can find in the market. Red candle means there were more sellers than buyers and a green candle means there was more buyers than sellers. This is the closest we can get to an objective truth in a world of spin and propaganda and noise. Believe you me, we will be talking about the you know who files because those have everything to do with some of the uncertainty around this industry. Believe it or not, there is no corner spared in this Bitcoin uh crashopalypse crash crash apocalypse, right? We are dragged into every single bit of drama in the world. But I want to say this. I want to say this. There's something that I believe strongly, which is that it's 2026. And in 2026, your job is to protect your aura right now. Okay? I've been doing this myself. And I had, bless, blessed be, one of the most profitable trading days I've ever had over the last uh sort of 48 hours. And I'm not saying that to rub it in anyone's faces. I know that everyone had a really rough day yesterday. But it's important that you realize that you can just be more objective. And by being more objective, by focusing on yourself, by being by by essentially removing yourself from other people's expectations and drama, by not getting dragged into other people's world of emotions, you can succeed. And I believe that's the goal of 2026. Don't let anyone co-opt you. Don't let anyone drag you into their BS because they will try and ruin your progress. Okay? Focus on yourself. The world is yours. That is the point of 2026. Okay? Now, getting into this, let's be completely objective. This is the truth, which is the charts below 72K. Objectively, objectively, this isn't good, right? This is bad. If we're under 72K, this is not good. Okay? We're going to have Mr. Mr. Shocked face, Mr. Scared Face. You know what? Because you don't want to be under here. Okay? If we go up here and we tap 72K and then we reject, that my friends, objectively, is bad. It's a bad look on the charts. Okay? We're going to be talking right after this about why I think the charts have been behaving this way because there are actually five or six different core pieces of the narrative that are working to create the situation we're seeing here. Okay, first and foremost, charting wise, not good under 72K. Okay, we don't want to be here. Um, if we go up and we we reject here, like if we do that, bad. Just know it's bad. Okay, prepare yourself emotionally for it to be bad. Okay. And if you haven't sold anything and we do start rejecting there, that might be an opportunity for you, right? Okay. Now, it is quite possible that we go and we make our way up above 74K, which as you know was this major major low. It was the major low of 2025. This was the bottom of the tariff Palooa of back in April of 2024. This was the ultimate weekly low that effectively led to once we got the first taco where he said, \"Okay, we're actually not going to do the tariffs.\" We went straight up, right? Straight up. So, this is a major major level. Um, and let me just get this guy's This guy's way too big now. Okay, chill out, bro. Okay. And then we have uh this it was originally the high pretty much of when we first got the ETF approved. So, pretty much the 73 to 74k level. This was all like this first run up to the ETFs and then the uh ultimate low of the first uh part of the Trump admin. Okay, so that level is by far the biggest first boss. It's the biggest first boss. But I want to be clear that the real breakdown the real breakdown started uh unabatedly uh up here around 80k. This is where we saw this the real careening ball started dropping. So until we get durably above 80K uh this is where I think things start to look really nice. Okay, this is where I'm personally I've been I've been doing futures trading. This is where I would be longing personally, right? And this is what I'm going to wait for. Okay, and this is what my quant says as well. The quant says 82k is the point of control. So, what I want to what I want to reinforce here is that in in this zone in this zone, you kind of have a question mark. It could be good and it could also be some kind of like we could spend some time up here. We could make our way up here and then kind of roll over, right? That actually wouldn't even surprise me to see us make our way up here into the mid70s and then start to roll over. But if we do make our way durably above here and start really moving, that's that's super super bullish. If we're just going to be the most objective possible, that is the most bullish way to look at this. Okay. Okay. Right. I don't know. I I'm trying to I'm trying to jump in to the chat here. Look, in the end, you don't have to buy anything. Okay? You don't have to do anything. The point is that you want to understand and I think very simply, you want to understand what the charts are telling you very, very simply. And the more that you just sober yourself in what is the chart telling me, let me see the chart. It'll be the news. That's how you can see, okay, in October of 2026, this was pretty bad. This was pretty bad. And we if we were just being chartis and we had no emotional attachment to the bull run, this would have been the signal to GTFO. The truth is the truth is that the real rug for us happened all the way back here. It happened right here when we were expecting the crypto presidency and in fact instead we got a crushing bare market and most alts never recovered from that bare market. So for a lot of us we were just waiting on that part of the market to become fulfilling. But if we were just looking at the charts, we would have identified that the weakness began right back. Really, the weakness began here. And obviously, some charts made another high here, like Salana and Bitcoin. But most alts didn't. Most alts just kind of bounced down from that point. And I could show you infinite examples of that. So, going forward, we're going to be objective. We're just going to look at the charts. And the charts are going to show us the guide. Now, we're not just going to look at the charts because that's freaking boring because there's so much happening in the world right now. Like for example, this is something that's happening right now, which is that the economy is reacelerating for the first time in what feels like forever. In fact, it's the first time in four years that the ISM has been over 50, which is the measurement of an expanding economy. And that really has been something that we've been looking forward to on this channel to reacelerate crypto prices. So why is it how is it that ISM pumps and crypto dumps? Why is that the case? This is something that I've been wondering because ISM has been one of these holy grail markers that we've been looking forward to. Well, there's an interesting uh explanation by the forward guidance uh crew over here. I'm going to play it for you. And essentially, it's this back to that point of market structure and just this air pocket that's happening with tech is that yes, in a few years this big bet on AI data centers could turn into the next big free cash flow machine, but that's a five-year bet. In the interim, what's happening is that we're removing buybacks at a time when everybody is long those stocks. And you >> so the biggest stocks in the world, some of the biggest members of the S&P 500 and the Mag 7, Google, Meta, and some others are going to stop doing buybacks. They're going to stop buying their own stock, right? We also know that we've gotten a new Fed share in Kevin Walsh, who we've talked about extensively. And this guy hates big balance sheets. he will probably not be buying any kind of stock or asset that will support markets. In fact, there's a lot of fear that he will try to reduce the balance sheet even further. Even though many believe it's at rock bottom and can't go any lower, there is significant fear uh fear, uncertainty, and doubt around Kevin Walsh. He is by far the biggest source of FUD in all markets. And now we're seeing that AI Capex is going to start coming out of the buybacks. So these big stocks are going to stop having tens of billions of dollars of buybacks and instead they're going to be financing the next five years of their AI buildout which again might pay out dividends in a few years but it won't pay pay out dividends this month. So as ISM is accelerating, we're having major forces that are creating uncertainty in markets. Right? The other thing I want to bring up here is this. This is a an article that was brought up by uh Evan here and he said uh that Ducken Miller, one of the greatest investors of all time says that a booming economy, which again uh ISM is a sign of an increasingly booming economy, an expanding economy. He said, 'Hey, look, a booming economy. Draenmiller, Draen Miller's words, as you can see, this is on paper. This is a paper book. This is an ancient text of wisdom, right? We must pay homage and respect these ancient texts of wisdom. Okay? In market wizards, he says the only reason the reason is quite simple that he says a booming economy isn't good for stock markets because essentially the Fed is no longer supporting the market. When the market is really struggling, the Fed is there to make sure it doesn't fall apart. But as the market starts to do, as the economy starts to do well, the Fed starts worrying instead about inflation. They worry about inflation getting too hot. And that means that they're actually actively trying to cool the market off. This is what we saw happen in 2021. There's also the fact that companies and corporations now need to build inventory. This is exactly what we're seeing happen with this AI capex. they're now investing in the future of that business and the future of these revenue models instead of investing into the asset prices. Right? So you see here that uh the inventory buildout happens and then you see if things get really heated, companies start engaging in capital spending. So effectively what you have here is that the actual forces that might expand asset markets start to in a contrary to what is obvious of of an effect, it starts to potentially create weakness in markets. Now add this to the effect that we have um significant significant um uncertainty from Kevin Worsh. Mind you, when Kevin Worsh was announced as the uh Fed chair, we pretty much have been straight down. Straight down, right? And we did a video on Kevin Worsh. I'm sure you guys have seen about this guy, but he believes that inflation is the number one biggest worry of the Fed and that they should be controlling inflation at all costs. And essentially, a lot of people are worried that when this guy gets into office that that's all he's going to do is focus on inflation. So that would be net negative for our bags. Just being straight up. We're not doing the hopium thing right now. We're trying to understand. We're trying to understand the psychology of the market. And again, I'm outlining what I think is the reason there's been indiscriminate selling in crypto. Now, of course, there's the conspiracy, right? There's the conspiracy that there has been some pretty big forced sellers here. So, as Parker says, he believes that effectively because we've seen the highest volumes ever on IBIT that he thinks that there are single asset funds that were only buying IBIT. And the reason why they're single asset hedge funds is because they were keeping those segregated in case those funds blow up that they wouldn't hurt the larger portfolio. He believes that there are Asian traders or Asian funds specifically in Hong Kong based ones, right, that were heavily involved in the metals trade and as things started to go sour and as the extreme volatility entered into the silver and gold trade that they had to start selling indiscriminately their crypto holdings, right? And this was causing a major one-sided exit, right? I was tweeting this all last week that we that there is a massive player that effectively has been exiting the space, right? A massive player. If you were watching the charts throughout the last week or so, it was very obvious that there was relentless minute after minute, scarcely a one minute time period where the chart could even go up uh or even make a new high on the one minute time frame. It was relentless. Minute over minute, someone was GTFO, get me the f out of this bag. And that was what was happening on Bitcoin. And that was causing all kinds of leverage to be triggered because a lot of people a lot of people didn't think they never thought that this 74k level would be violated. They thought that this thing under here was safu. They thought there's no way we'll definitely at least bounce here. We'll have some time to get through it. But when there's this big indiscriminate selling, we went through 74k like tissue, like Kleenex. It's not even visible here. The bounce, right? It is so unbelievably pitiful. And that really triggered this whole leverage cascade down here. And now you see us, we're recouping a lot of that because it was a leverage cascade under 74. Again, that's what's happening. That's the emotion of why it's happening. We have uncertainty. Uncertainty around Kevin Walsh, which is the number one thing. We don't know what this guy's going to do. And believe me when I say we won't know for a while. Kevin Walsh, unless he takes the stand and starts uh sort of forecasting his moves, which would be uh I don't know if it's illegal, but it certainly would be improper for him to do that. Kevin Worsh, we don't know what he's going to do. He c he takes office in May and we probably won't h see a press conference, I think, until June. And who knows, he might not actually unveil his big strategies until maybe later. Maybe he won't unveil that until later in the year. So, it could be several months here of an air pocket with lack of guidance as to what the Fed's going to be doing. That uncertainty is leading a lot of folks to look for some kind of comfort here. And now we know uh that the big AI companies are going to be pulling their capital expenditures and they're going to be spending their capex from their buyback budget where they were buying back their stock. They're now going to be spending on their buildout. So you have one less force buying. You now have uncertainty at the Fed. you have quite frankly and I'll bring this up and I don't mean this as FUD but it's important that we come and we deal with the fact that we did as a community trade quick gains for a significant amount of ethos in crypto right we embraced digital asset treasuries we idolized someone selling a dollar of Bitcoin for $150 to retail Micro Strategy right there was this fantasy as to why Micro Strategy should have a premium to the Bitcoin it holds when in fact Bitcoin is the reason why that company was had any value at all. Um, we embrace we embraced crazy hyper Bitcoinization ideas. We denied obvious realities like the fact that stablecoin stole the medium of exchange crown from Bitcoin. This one is very interesting because if you know the you know who documents, which I'm sure we've all been watching and learning about this week, we know that you know who Voldemort was, and I'm going to say that because I don't want this video to get flagged, but Voldemort was heavily involved with funding Bitcoin. Okay? He was heavily involved from the early days of Bitcoin. Okay, so you know who Voldemort gets involved with Bitcoin in the early days, starts essentially controlling the narrative around what Bitcoin can be and is heavily involved with the founder of Tether, Brock Pierce. So now we know that there is a an attempt to prop up the thing that has taken away the reason that we use Bitcoin for transactions as well as the development layer that instead of going down the path of treating Bitcoin as a medium of exchange, a currency and scaling it so that the transactions were fast and cheap, it kept it slow, brittle, old, almost impossible to actually use for daily actually impossible to use for daily transactions. So this is very interesting, right? This is a whole rabbit hole in and of itself, but you have essentially the the neutering of Bitcoin as a medium of exchange and uh there's just never been any real ability to scale it, right? So, this is the reality is that we traded a lot of the actual ethos of crypto and this is the downside is when we bring on institutions and we say pump up your bags by buying Bitcoin and then all of a sudden it stops working, the the magic trick stops working, they start selling. they've come to collect their liquidity and they become indiscriminate sellers, right? And so that's the double-edged sword of hoping that big institutions come and save us instead of just letting the Bitcoin and crypto movement sort of percolate and grow at the pace that it grows. Uh we wanted to force it over the line and this is what happens on the other side of that. So that's what I feel like is happening. Again, um we will hopefully see a recovery very very soon. But that's my take on sort of how things got to be so brutal over the last couple of weeks is we're seeing the uncertainty from Worsh. We're seeing the sort of other end of this DAT overhang, this digital asset treasury thing, which you know, in a lot of ways doesn't make any sense. Like why not just buy Bitcoin? Like why do we have to buy a company that buys Bitcoin for us? Why not just buy Bitcoin? Um and then we see that the the politicization of Bitcoin, I think, is going to become a football over the next election. I don't think that's good. I think a lot of smart people are saying, \"Hey, if the Dems win the house again, this doesn't bode well for the crypto bros and it probably doesn't, right? That's just the reality. We're hoping we could get a lot more done over these uh few years.\" And to be fair, we haven't gotten enough done. We need that market structure bill. We need the Clarity Act. We need something that is tangible that protects this industry, and it's still not there. So, those are the the clouds in the sky. That's why it's dumping. Um, and it doesn't really matter to go into any more of this. Oh, yeah. And then we have the air pocket. We have the air pocket of capex spend from these big tech companies and the big tech companies have been the thing fueling the stock market run. So that is those are all the clouds in the sky. Now what I will say is this. If Bitcoin can can muster itself a bounce up into this zone. This is where we get a very interesting zone. This is where we go from okay we're in a bearish posturing. We're prepared for more downside. Obviously we we prepared for more downside right up here in the housekeeping zone. when we lost this zone, we came out and we said this was just objectively horrible, right? I said it was horrible if we lost that zone like throughout, but it's objectively horrible. And then as we started to lose level after level, it just got, you know, objectively bearish, right? So the question is how do we reverse this? The way we reverse this is in my opinion it is getting above the actual source of the recent breakdown which feels like it got um more significantly accelerated here uh very significantly so around this uh 80 81k level this this yellow line. If we're able to like really hold here and start growing with bullish market structure I'm going to be bullish and I'm going to be longing. Okay. If we fail, if we if we fail to get above 74 or 72, um that's just we just got to be real with ourselves. That's not good, right? It's just not good. Just going to tell you honestly. And I would be expecting us, if we fail to do that, to come down and at least revisit this 60K at least, if not most likely start to look at other numbers, right? We don't have to talk about those yet. But as you know, you know, like the the biggest high time frame level uh after that is is lower than that. I don't even want to talk about that. Let's not talk about that. just say I'd be looking if we fail to get over 72, I would be looking to add to shorts. If we're in this 74 to 82K range, it's kind of like let's evaluate. Let's see what happens. Let's see which way the market wants to go. Wind could blow either way. Um and if we get above 82, it's really it's really good. It's really bullish. I'd flip I'd flip bull. It's really simple that then we would have shown that, you know, this might have just been, you know, shaking shaking out the unfaithful, shaking out the FUD and and, you know, letting people who are faithful get great buys. Again, I'm not doing the faith thing this year. The faith thing didn't work out for me last year. So maybe maybe it's just timing, but as soon as we show bullet mark bullish market structure, I'll be bullish. Right now, we're showing bearish market structure, and we still have not flipped uh this level. Uh the first level of which is 72K. So, this is the first big test. Let's see what happens here. This is where like the the the collapse really accelerated from. As you can see, uh we weren't really dumping that hard. We were kind of grinding down in these little fits and starts. Uh it was doing these little uh these little, you know, these little uh ping pongy dumps, right? And then when we hit 72K, just went straight down. So, that's the big first test, right? Getting above this is has got to happen. If we don't do that, I would be just very honest with you. I'd be controlling your risk, controlling your exposure. and making sure you have something to buy at the lows. If you have not done any housekeeping, um this is kind of like that next this this area is your next big test. If we fail that test, that's where I'd be um preparing and emotionally or mentally prepared for more downside. Okay. Uh and again, getting back to this, I do think that in the end, like as soon as this violence plays out, we will find a low. There's also a major amount of spending that will likely happen at some point this year. I don't know if Worsh is on board for it or if it's going to happen from Bessin or what the deal is, but the midterms are looking like they'll get recaptured by the Democrats if there's not a huge amount of public favor being being garnered by Trump and Co. So, usually the easy way to do that is to spend money and we'll see. We'll see if they're spending money. Um, again, I think all of this I think this sort of air pocket thing is temporary. AI is in fact um it is definitely a a matter of national defense. You cannot let other countries develop AI at a a faster pace. So in the end, this is this is continuing to go forward. If you've been using Claude, if you've been using Claudebot, if you've been using Opus 4.6 now, it is incredibly powerful. This is not a this is not just a, you know, a fancy version of Google Search anymore. This is a seriously powerful tool that you can give complex tasks to and it gives you high quality work. And if you're using Cloudbot and that type of stuff, you can see this is the equivalent of a of an employee. not a great employee yet, but they're a pretty good employee. Um certainly like a middle level, if not higher employee and soon to be probably a high level employee. So the AI thing is not going away. It's going to accelerate. Uh and the question is at what point does that meaningfully grow the economy and um so all this is temporary. That's what I mean to say. All this is temporary. Assets will go up. Uh, and the main part is that you don't lose your shirt too much or that you understand that even though things look bad right now and that the bias is to the downside, there's always a way for things to flip and start growing again. I do think uh we need to just be honest with ourselves that crypto did trade sugar high, a short-term gain for quite a bit of pain. And this is the pain part is we wanted the short-term gain. We didn't really get it. We got a little bit of it. We didn't really get what we asked for. And that's what I think is happening right now. Um, and as these things normalize, the dats unwind and things like this, there will be awesome opportunities to buy for the long term. And remember, we are mostly, I think most crypto people are sort of like 20 to 40 range in age, which is incredibly young. And we will most likely all live to be ripe and old uh with the medical technology we have. And so these down markets are the real opportunity to build wealth, to build positions and assets that will grow and compound for decades. And so, as scary as they are, having a smart way and learning how to make money throughout this process is, in my opinion, a life-changing uh point of leverage. So, if you're able to take advantage of this down period, and you're able to understand that being extremely vigilant, being extremely objective and being able to capitalize on the market in any period you're in, that is that is a superpower that will allow you to build powerful powerful holdings of assets that are most likely to compound for the rest of your life. because down markets in the S&P, we haven't gotten there yet, but it look it looks a little wobbly over there. And if the big companies stop buying back their stock and the government's not going to buy anything, there's a huge opportunity for S&P and S&P 500 to correct here. And that would most likely drag down Bitcoin and crypto probably to their ultimate lows and then you'd have a chance to buy cheap stocks and cheap crypto. And the point is that you're trying to have a rational approach to understand how likely it's going to be to happen and to hopefully have cash to buy at those lows. And that's why we talked about the housekeeping zone. That's why we're talking about the potential for a short play here even at 72K because you want to make money. You want to make money on the way down. You want to end up with some cash to buy those lows because those assets at those prices will be what transforms uh your life, I think. Um at any rate, I hope you guys enjoyed this one. I'm going to hop into some comments now. um bottom is nowhere near maybe uh again I'm not here to speculate I'm telling you there's very simple ways to view the chart we failed to get to 72 we will definitely go down or we'll most likely go down and touch 60 and 60 is not a super strong support so it's unlikely to hold right VVV bottom baby time for a trade buy maybe maybe I sold all crypto right before Trump announced the new Fed share yep that was a good play housekeeping zone I believe in Scandinavia Okay, I believe in Santa Claus. Supernova, baby. Oh, yeah. Update on Supernova. Uh, the team wants to go forward with it. Again, right now the market's collapsing, but the team wants to go forward. We had a a team vote in the midst of the the crash, the calamity of this week, and the team is gung-ho. They believe that uh they have an opportunity to take a foothold on Ethereum uh which is the biggest and most meaningful chain by TVL. And so, uh the team will be going forward even in the tough times. the team wants to go forward and launch this project. It will be a free gift to uh the super stakers if you're holding your VBlack. It's a free gift to Vblack holders. Um so the super stakers got Vlack. If you're still holding that Vlack, you'll get the VOVA. And again, I know that the the market's horrible. So we're not expecting anyone to speculate on it for it to pump like crazy. So that's not the point of this token. The point of the token is it's a bleeding edge DEX. There's not a DEX like it on Ethereum. the team believes that there's an opportunity to take market share and they want to go hard at it. And so um again hopefully at the very least it's a nice gift to the uh community here. And again I'm not going to do I'm not going to promote it aggressively because it's just a tough time for tokens. But in the end I just want you guys to know that the team is aggressively pushing and wants to deliver. And so they want to launch this thing at some point hopefully when the market you know stops you know being literally in freefall. uh hopefully in a period of calm at least uh we're not expecting it to be a rampaging bull market but you know some of the best dexes have launched unis swap aer drrome uh they have launched in very very bad conditions and so it is possible to launch in bad conditions and to grow with the market and um and so yeah it's going forward right uh the superverse continues to grow no funds raised uh it will be a free airdrop for the holders no gaming the system just if you've been supporting the projects you're going to get If there's further downside, where can Ethereum go? Let's take a look. Let's take a we look at old Papa E. Check it out. Okay. Let's look at the weekly. Okay. So, very simple view here. We have this major sort of governor of the bullish period above 2100. Here um we have the ultimate low of last bare market of 890. You have a prior low here of 1370. Look, we're down we're down um we're down below this key like we're down below this key level, right? So, as we're below this level, until we reclaim it, right? You want to see it reclaim, but until we reclaim it, if it does something like that, then you'd assume we'd at least go test this major low at 1300. And if it doesn't hold, then we'd be going down and potentially testing near, you know, near a,000 or so. I don't know. I would say that this is your range. This is this is your range of possibilities. Again, I don't I don't I don't pretend to know the future. I know that ETH has a bit of a narrative crisis itself, right? With Hyperlid doing so well, essentially taking uh taking a lot of the expectations that people had for uh I guess general purpose blockchains like Ethereum and Salana, Hyperliquid's doing a lot of stuff. Um very impressive project. Uh not as decentralized, not the kind of trustlessness that you'd want for something like Ethereum or something like massive operations. Uh, but I think Ethereum has a narrative crisis that it's working through and I think if it scales the L1 like Vitalic wants, then it could become a much more meaningful chain. That's why I think that they finally have it right. Vitalic actually nuked, I don't know if you guys saw this, but Vitalic uh uh Vitalic nuked the L2 ecosystem recently. Let's see. Uh, yeah, he pretty much said um like L2s, I'm going to summarize this for you. He said L2s are useless and we don't need them pretty much. He said get out of here L2s. He said the vision's changed. And which is crazy because for the last 10 years Vitalic and all the Ethereum community have been talking about how we won't scale the L1. We'll only scale on L2. And now he's realizing that that was a that was a not a good decision. So that's what's happening right now is the L2 vision is completely getting canned. They're trying to make Ethereum much faster and cheaper. Who would have thought that fast, cheap, and good to use is like an ideal uh set of, you know, characteristics for a blockchain. And gosh, who would have thought that? Um, but at the same time, here we are finally updating the thought process. And, um, maybe it'll be a great time for Ethereum. Certainly, this is the vision that Ethereum needs to go to. A lot of turmoil. Uh, so I wouldn't be surprised to see during this period of, you know, rebirth and and I guess change. It's okay in a in a bearish market where the Bitcoin charts look bearish and the narrative is bearish and apparently Voldemort funded a lot of Bitcoin development and that's a topic that nobody really wants any connection to right now. And you have on top of it, you know, the issues around uncertainty around Kevin Wars. You have you have uncertainty around what the AI companies are going to do. You're having rumors that the Saudis and all these other sovereigns are tapped out that they own too many assets. They there's just nothing else that they want to buy or they don't want to have any more assets on their balance sheet. I think you have a a moment where it makes sense that we see a cooling off. Now, this is a strong opinion loosely held. As soon as we see bullish market structure, I'm going to be bullish. I don't care. I don't care what the narratives are. The narratives could be bad and if the market structure looks good, if the chart looks good, I'm buying because the narratives were really good over the last year and the chart looked scary and we still held and that was a mistake. So, I'm not going to make that mistake in reverse. Right? [clears throat] If the charts start to look good and the narrative stay bad, then we buy chart. Good. Buy coin. Yeah, we're going to be Of course we're going to be all right. Of course, we're going to be all right. We're always going to be all right. The question is what's going to happen in the short term. No one cares what's going to happen in the long term. In the long term, Bitcoin goes to a million. You know, everything is perfect. Who cares what happens in 20 years? People don't want to wait 20 years. They don't want to get wrecked, right? They want to have a profitable year each year. And that's the goal. Again, remember the point of this channel, and I've said this a few times, but the point of this channel is now very clear. Get this up here. Seeking truth with convexity. That means we're trying to find what's true today. We're trying to find that truth in the charts and we're trying to bet on it with convex outcomes, which means when we're right and we actually find the truth, we make a lot of money. And if we're wrong, we lose a very little amount of money. We're trying to lose small, win big, and we're trying to do that repeatedly. And we're not just going to wait on alt alt season. We're going to win money each and every time. I will say, I've started to deploy this mentality. I had an amazing trading day during the crash because I was short because I recognized the loss of support and I wasn't being emotional about it. I just recognized it, bet on it, sought the truth, found the truth, and I had a convex outcome. And I want to bring that strategy to you all which is why is why we're looking at this which is you know just like Bitcoin if ETH fails to reclaim this 2100 right this is a big level right this is a big level let me see get this up there's a huge level here if ETH fails to reclaim this 2100 this is bad right and we should absolutely expect that if it goes like this that it will at least come down maybe to this one but you know the real support here is at maybe maybe lower, right? I don't I don't want to be a gigab bear here, but I'm just saying seek truth. We're going to seek truth. We're going to have convex outcomes. We're going to make the most money possible. And I hope 2026 is our year. I hope 2026 we just literally mog and clown on everyone. We're going to stay out of other people's business. That's another thing. Everybody's trying to be up in your business. I don't know if you feel this, and I've talked about this earlier in the episode. I I brought this tweet up. Everyone tries to be in everybody's business. Everyone's trying to be in my business. And I feel that pressure. Like, why is everyone trying to be in my business? They want you to be a part of their business. Okay? You have your own business to attend to. Focus on your health. Okay? Vibe Code, please play around with AI, play around with Claude, play around with Opus 4.6. Learn this stuff cuz you're either going to become a cyborg and you're going to become superhuman or you're going to get left behind. So, don't do that. Get jacked. Learn to vibe code. Learn to trade. And learn to be objective. And let's just crush it this year. Let's do it together. If you guys enjoyed this, please smash that like button. The the algo has been very punishing to us crypto folks. So, please, if you could smash the like button, I really appreciate it. I'm going to be putting my heart and soul into these streams. As you can see, we've had two streams, two longs that have gone out this week, this week alone, the most content. And mind you, this was the week that I woke up out of my coma. Where was it? I was in a coma this week. Okay, literally in a coma. I woke up expecting a million- dollar Bitcoin and I instead got this. Okay, I actually woke up out of a coma and had one of my biggest P&L days ever. So, let's do this. Let's come together. Let's work together. Let's become profitable. Smash the like button. Please subscribe. And of course, if you guys want to go and hype up this tweet right here so that we get a bit more of love on the stream. I'd appreciate that, but I'm going to be doing my best for you. Again, big shout out to um partners of the channel. I wanted to shout out JUP uh because they are supporting the channel during this uh during this tough time, right? uh Jupiter are supporting the channel. I'm a partner there. Obviously, we're not expecting any altcoins to do well during this time period, but these guys have been crushing it. They've shipped so many products. I'm actually very very envious of their ability to ship. Uh Meow and Co are absolutely the truth and I expect for when the market does heal and when Salana does recover for Jup to recover with it. Uh their Jupand, Jupusd, uh they just recently shipped um what is the recent thing they just shipped? It was actually crazy. It was the Oh, prediction markets. they they brought Poly Market onto Salana via Jupiter. So, they're crushing it every single time with amazing updates. So, shout out to them. Uh and if you guys want to uh support them, go ahead and follow them over at Jupiter Exchange. Once again, if you guys enjoyed this, smash the like button",
        "summary_hu": "A Bitcoin jelenlegi piaci helyzete aggasztó, mivel a 72K szint alá esett, amit a kriptovaluták piaci struktúrájára gyakorolt hatások is befolyásolnak. A tranzakciók számos tényező, például a Fed új elnökének bizonytalansága és a nagy tech vállalatok tőkeinjekcióinak csökkenése miatt gyengültek. A múlt héten tapasztalt árfolyamcsökkenés egy nagy piaci szereplő kényszereladása következményeként alakult ki, ami tovább fokozta az árnyomást. Ha a Bitcoin nem tudja megverni az 72K és 74K szinteket, nagy valószínűséggel a 60K-ra történő visszaesés elkerülhetetlenné válik. A jövőbeli árak növekedése érdekében a befektetőknek vigyázniuk kell a kockázatkezelésre és ügyelniük a piaci mozgásokra.",
        "summary_en": "The current market situation for Bitcoin is troubling, having fallen below the crucial 72K level, influenced by various factors including uncertainty surrounding the new Fed chair and reduced capital infusions from major tech companies. The price drop experienced last week resulted from the forced selling by a major market player, exacerbating the pressure on prices. If Bitcoin fails to surpass the 72K and 74K thresholds, a drop to 60K becomes highly likely. Investors need to manage risk carefully and be attentive to market movements in anticipation of future price increases. Maintaining an objective perspective is critical for success during this volatile period.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 25,
        "key_points_hu": [
            "Bitcoin jelenleg 72K alatt van, amit rossznak értékelnek.",
            "A piaci bizonytalanságok, különösen a Fed új elnöke körüli félelmek, nyomást gyakorolnak az árfolyamra.",
            "Készletezési kérdések és technológiai befektetések megváltozása is hozzájárulhat a piaci gyengüléshez."
        ],
        "key_points_en": [
            "Bitcoin is currently below 72K, which is viewed negatively.",
            "Market uncertainties, particularly fears surrounding the new Fed chair, are putting pressure on prices.",
            "Inventory concerns and changes in tech investment dynamics may also contribute to market weakening."
        ],
        "main_topics": [
            "Bitcoin Price Levels",
            "Market Uncertainty and Selling Pressure"
        ]
    },
    {
        "video_id": "fSgVZBlcU2w",
        "title": "Move Your Crypto OFF Exchanges",
        "published_at": "2026-02-06T16:28:45Z",
        "sort_date": "2026-02-06",
        "url": "https://www.youtube.com/watch?v=fSgVZBlcU2w",
        "transcript": "this is the time for you to be extra vigilant. And I hope that maybe this is overly cautionary that there is actually not a reason to have to do this and that we do not see another iteration of Mount Gox, of Bitconnect, of Celsius, of FTX. But sadly, there are just too many examples of centralized players getting wiped off the board in times like this. So, please be vigilant and make sure that you do not become a victim of a potential exchange or centralized exchange failure that tend to happen when prices plummet like This",
        "summary_hu": "A videó figyelmeztet arra, hogy a kriptovaluta piac jelenlegi helyzete miatt különösen óvatosnak kell lennünk. Az elmúlt időszakban számos központosított szereplő, mint például a Mount Gox, Bitconnect, Celsius és FTX, összeomlott, ami rámutat arra, hogy a felhasználóknak vigyázniuk kell a tőzsdék használatával. Az árfolyamok zuhanásakor a központosított tőzsdék kockázata megnő, és a felhasználók könnyen áldozatul eshetnek egy esetleges bukásnak. Javasolt tehát, hogy a kriptovalutákat tartsák biztonságosabb helyeken, mint például saját tárcákban.",
        "summary_en": "The video warns that given the current state of the cryptocurrency market, heightened vigilance is necessary. Numerous centralized players, such as Mount Gox, Bitconnect, Celsius, and FTX, have collapsed in the past, highlighting the risks associated with using exchanges. The probability of exchange failures increases when prices decline, which could lead to users becoming victims of potential losses. It is advisable to move cryptocurrencies to safer locations, such as personal wallets.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 30,
        "key_points_hu": [
            "Óvatosság szükséges a kriptovaluta tőzsdén való kereskedés során.",
            "Központosított tőzsdék összeomlásának számos példa áll rendelkezésre.",
            "A kriptopiac árcsökkenése fokozhatja a tőzsdék kockázatát."
        ],
        "key_points_en": [
            "Vigilance is necessary when trading on cryptocurrency exchanges.",
            "There are numerous examples of centralized exchanges collapsing.",
            "Market downturns can increase the risks associated with exchanges."
        ],
        "main_topics": [
            "Cryptocurrency market risks",
            "Importance of personal wallet security"
        ]
    }
]