[
    {
        "video_id": "-rdtLIy-Xa4",
        "title": "10% Gold &amp; Silver: Portfolio Insurance for Hyperinflation #shorts",
        "published_at": "2026-02-06T18:59:28Z",
        "sort_date": "2026-02-06",
        "url": "https://www.youtube.com/watch?v=-rdtLIy-Xa4",
        "transcript": "I will add a position to my long-term portfolio. 10% precious metals, gold and silver. That's it. It is just as a insurance against some kind of you know hyperinflation. Not only do I want to grow portfolio, I also want to preserve I want to preserve wealth. So for me to have 10% of of gold at nice moving averages is very important just for peace of mind in case we see like redefinition of what the dollar is or something crazy happens or some global conflict the wealth is going to flow from tradi into gold and silver which means that if you just have 10% like the capital migration is going to make it so that just those 10% can save your entire portfolio."
    },
    {
        "video_id": "7tNyOKWtWw8",
        "title": "Bitcoin Buy Zone Hit: Historic Opportunity for Smart Investors #shorts",
        "published_at": "2026-02-06T15:54:24Z",
        "sort_date": "2026-02-06",
        "url": "https://www.youtube.com/watch?v=7tNyOKWtWw8",
        "transcript": "Bitcoin has hit the buy zone, but it jumped instantly above it. I did get a small small small order in here. Very, very small. And you don't have to hurry here. There's going to be no V-shaped recovery. I saw someone asking, \"Hey, Ivan, do you think we're just going to boop and now, you know, we hit the buy zone. So, now we just go to alltime high.\" Absolutely not. I think it's a very, very low chance that we just pump from here. We could still, you know, go here and get rejected. We can go even we can maybe go here and get rejected. But all in all, it takes approximately a year for us to find the bottom. If you look here in the last bare market from the top to the bottom it was a"
    },
    {
        "video_id": "dCdYw9E8Yhg",
        "title": "BITCOIN AND ETH: MAX PAIN SCENARIO UNFOLDING!!!!!  🚨🚨 (most will not make it)",
        "published_at": "2026-02-06T09:48:02Z",
        "sort_date": "2026-02-06",
        "url": "https://www.youtube.com/watch?v=dCdYw9E8Yhg",
        "transcript": "We're going live. We're clicking the button. Oh yes. Oh yes. Oh yes. Yes. Guys, welcome to another episode. And as you can see right now, Bitcoin actually hit our buy zone. This is historic guys. This is historic. And as you know, we have a very very big privilege in this community to have been euphoric here at the top. And then risk off since October 8th. And also now I see many in our community being euphoric here because now because we risked off since October we have a lot of dry powder to deploy at this very very very cheap levels. I want to congratulate everyone. I was just chatting here in the chat before we went live. It's imposs like it's almost impossible to have a community like we have. The energy we had at the top because we rode the bull market and then exited in October start to derisk and the energy we have now in the community is crazy guys. It's crazy. is crazy crazy. So guys, Bitcoin has hit the buy zone, but it jumped instantly above it. I did get a small small small order in here. Very very small. And you don't have to hurry here. There's going to be no V-shaped recovery. I saw someone asking, \"Hey, Ivan, do you think we're just going to boop and now, you know, we hit the buy zone. So now we just go to alltime high.\" Absolutely not. I think it's a very, very low chance that we just pump from here. We could still, you know, go here and get rejected. We can go even we can maybe go here and get rejected but all in all it takes approximately a year for us to find the bottom. If you look here in the last um in the last uh uh bare market from the top to the bottom it was a year and then we hit here in June the buy zone basically what would be the buy zone but it still took um I mean basically it took 30 30 weeks 35 weeks 30 37 38 weeks approximately to to go up significantly and to enter the bull trend it took 31 week so don't get surprised if we chop here for like half a year okay [laughter] don't get surprised if we chop here for half a year. I still think it's smart to deploy a bit already now in this in this buy zone. Why? Because there's always a chance that we just go to Valhalla and there it's not a big chance but it's a nonzero chance. So to have a bit here, you know, to to start to buy a bit here, I think it's smart, but be prepared that we may go uh like 30% below the 200 week as well. But it's part of our plan. I mean, if we go down 30%, it will go to like 40. Okay. Uh but it's part of our plan. Like part of our plan is to buy here around 200 week and then starting to DCA here and DCA if it goes lower it goes lower slower. Uh but historically we know it's a great price like around 200 week it's a great price here last cycle for example you see it did go how many% below let's say you started to enter here at the 200 week it would go minus 30%. Exactly. So last time it it went minus 30%. But doesn't matter in the big scheme of things guys it doesn't matter but you can don't go all in. Don't go all in. It's not about going all in at the 200. It's about starting to enter a bit. You know, nibble, nibble. You have a cookie, you nibble a bit, nibble a bit. It may still dump another 30%. And it may still have uh 25 weeks, 30 weeks before we enter the bull trend on the money line. And now the bull trend is going to happen if we go to 99. But you see how fast it falls within the coming weeks. This is basically going to be like at 7 in the 70s. And then if we go sideways for a few months, it's yeah, basically going to be here somewhere like 60. Okay. So let's see what's going to happen. But in general this is very good price. If we can come back into the buy zone. Don't buy now. I mean see now it's above again. But you can set orders here at like you know 60 50 58. The 200 week now is at 58. So around 58 around 60. It's good. It's good. But nibble nibble nibble nibble like on a small tiny cookie. You nibble a bit here. Uh and be prepared that it goes below 30% and that you chop around for a year not for a year. uh a year from the top from this top to the bottom that's going to be in October. So now how many months we have like six six months or so then yeah we're going to be here derping like six seven months and then something like this and the people that are eating big in this market are of course the shorters. The shorters the shorters I have a lot to share today in terms of the wins in our community because the last 24 hours they were insane I mean I I I I will not go through each and every one but you can just look at the picture here. It was insane last 24 month. Uh, sorry, 24 hours. Did I say month? 24 hours. 24 hours. 24 hours in our community. They were insane. I just screenshotted a bunch of stuff. And that's why I'm telling you in Bulmania, it's very rare that you have a community that both can be euphoric at the at the peak OF TOP AND EUPHORIC at the peak of bottom because with the recent time and now we have all of the money in the world to act on the opportunities to buy, but also to short the crap uh when when it is shorting season. And now is a very very big shorting season. Let me zoom in on a few of them that have a lot of stuff like this. For example, unlike a defi wolf x unlike some of you dig animals my balls are not of steel. So he just does short you know 1x 2x it's fine. I mean even with uh with less leverage you can still make it work here also geio harvesting season 1x short 1x short 5x short here on red. So you have you don't have to use like mega leverage. You don't have to use mega leverage of course. I mean some of the people here in our community with risk management they're deploying strategies at 30x at 20x it's also possible and it's fully valid because with mechanical rules if you join bulmania you learn mechanical rules your losses are always capped okay your losses are always capped that's why we have this uh picture here example of losses that you can have you can have losses I mean like with anything you learn anything you're gonna have losses but it's they're capped mechanical rules never allow you to lose big because that's the whole idea you never you never lose big. Never let small mistakes turn into big disasters. And that's what most people do wrong. Okay? Most people do wrong. So it's really not about whether you have losses or not. It's about how big the losses are when they happen and how big the wins are when they happen. So that's what we optimize for. So go to bullming.com, watch the free training if you want to join us. Some people have been saying, \"Oh, but I I will wait until bull market to join. I mean, what do you mean wait? What do you mean?\" I mean, you see, some people wait, some people don't wait. I mean, it's better to take action because the moment you join, the moment the opportunities open up for you. So go to bulling.com right now if you haven't joined yet and congrats and thanks everyone for sharing the games also. I mean I love when when you guys share the games because it it gives me energy. It gives me energy when I see that hey we're doing something. It works. People work. People are euphoric at the freaking mega mega max pain time when most of the people in this industry sadly have a very bad time. They have a very very painful time and we need to be respectful to that. So when you see someone that is struggling be respectful. You don't have to share this gains. The first thing you do you don't have to open up this you don't have to open up this you can be a bit you can you know you can listen out you can say I'm sorry I'm [laughter] okay I'm sorry but maybe we have to acknowledge that many people are struggling a lot many people are struggling like there's no tomorrow and it's it's sad because uh they they don't learn or they they didn't know or this and that but u they have to learn I mean they either you're on the the hardware or the the easy way so anyway that's that look looking at the other assets let's look at soul guys soul you know, it's coming to papa to $30. It's It wants to go there. It went It went to 67, guys. Uh yesterday, I think it's going to keep falling towards 30. It It has hit the flash button. I mean, the market is hitting the flash button currently on soul. It's taking the elevator down to Papa towards 30. Uh again, will it come to exact 30.00? I don't know if it's going to go to 3000, but if it goes to let's say 40, you can already now start to nibble a bit. Uh be prepared though also with soul that the bottom may take six months. Uh let's say whether it goes to 30 or 40 like we don't know but in either case a V-shaped recovery is highly unlikely. It can happen that's why we nibble a bit already but it's highly unlikely. Uh most likely scenario is that it finds a bottom then it chops around and that's that's also why we don't really enter uh heavily heavily heavily until the bull trend on soul. So you can nibble now, you can nibble at 30, you can nibble, you know, it's it's cheap price, but it's it's likely going to keep falling, guys. So you need to know that. And ideally with soul, you wait for the bull trend. You enter a bit now, you know, you nibble at these cheap prices, but then uh the the big allocation uh should be deployed when we go on a bull trend. And uh yeah, I mean like here for example, you know, it went down a lot. Uh then it find found some uh you know, some uh some bottom here and then it lost the bottom again in literally in the last like few months in the last like in literally the last month of the of its cycle and then it went sideways and did the real bottom for another like what is it uh 6 months or something. So we saw it's hard to say exactly where we could be here. We could be here. So you know nibbling here wouldn't make sense. It would make sense. I mean just nibble here a bit. We still went down a lot more. So the the most ultimate riskreward is when we go into a bull trend but uh I mean when when price is cheap and you love the asset you could nibble a bit already now. Um the mo the most important thing is to avoid like most of this uh most of this collapse. So personally I'm not buying now. I mean to be clear what I'm doing I'm not buying now. I would be waiting for it to come closer to 30. when it's close to 30, maybe at 45, maybe at 40, I will nibble a bit and then the big allocation I'll save for the bull trend when the bull trend happens because as long as we're in bare trend, still it's risky. You have to be more careful. And this flip level is now at 136, but it's falling very quickly. Within the coming weeks, it's going to be like yeah like 50 60 something like that. So, we're keeping an eye on soul. That's the analysis for soul. For ETH, guys, it's coming to 1,000. Uh we said here like weeks ago, it was like 2 3k. We said it's going to go to range low. It is 1,00 and I mean guess what? We're kind of now approaching it in one way or another. The range here is I mean the the bottom range it's quite uh it's quite wide. [laughter] Okay. But somewhere here it's likely it's going to find a bottom. I think it's going to be towards the lower end here. 1.1 1.2. Uh let's see. I mean as long as Bitcoin is bearish there's no way this thing goes anywhere. So uh so far so good. Uh buying at around 1K for ETH uh would make sense. And of course, especially if it goes into bull trend, which is currently at 3.1, but is also you see how how fast it falls. It's going to be at like 2K within the coming weeks. So, [snorts] keep an eye on that. Uh then let's see what's happening to BNB. You guys huddle BNB. BNB coming to 200 week moving average at 490. That would be I mean the first signal to buy and then the second signal is when we go to bull trend also. I mean all of the bull trends guys now fall very rapid. The bull flips the bull flips they all fall very rapidly. Okay. So if within the coming weeks bull flip on BNB likely it's going to be somewhere here you know at 600 now it's at 900. So yeah keep an eye on that. Uh what else? We can discuss all kinds of other assets you want. Let me go through the uh some of the news. We have 20 billion in unrealized losses in one picture here. Tomly sailor man. Oh yeah yeah yeah. I mean this guy's uh they will likely survive. I mean everything is going to be fine but for shareholders of the respective stock it's uh it's painful man. It's painful. It's painful and it's also a big opportunity loss because yeah, I mean you look at Micro Strategy, you look at Bit Mine, it's a max max pain scenario for these guys holding it. The good thing for these guys right here is that they don't really care. I mean they it's not their money. It's not uh I mean the stock it's I mean for them it's secondary. It's very very much secondary for them. For them it's uh the fact that they can survive and continue and this and that. And so they're always bullish. perma bull they will get you in at the pico top and that's their goal. Their goal is to increase asset under management whether it's at a pico top or anything they don't care they actually also don't want you to exit when the bearish trend happens obviously they want you to keep the money in. So yeah, all in all, uh, different incentives. In the bull trend, our incentives will align with these guys. So we're going to be cheering them on, cheering them on in the bull trend. But in the brendan, we got to we got to be honest. They're very bad for their shareholders. They're very bad for anyone listening to them and then adjusting their crypto portfolio to whatever these guys are saying that you you've been cooked alive basically. I mean, you've been cooked alive. And the funny thing is many people who have been cooked alive it's kind of now that they're becoming a bit bearish but you know now is kind of time to be a bit bullish because we are at 200 week moving average for Bitcoin and yes we may still go lower 30% lower can happen can be six months chop we expect that we expect chop we expect it to be that's why we we don't buy a lot now we just nibble nibble but I would say we are yeah we're coming close to the to the time it's uh it's basically close to bottom or yeah so always it can go way lower than you think it Can it can also go way higher than you think but uh based on stats 200 moving average is great but the big money will be deployed when we turn bullish on the money line. Okay, so that's that. Also, uh there are many reasons why we're down. Uh Alex Krueger did a list here 1010 the October 10th and we became bearish on October 8th. Just a reminder, the liquidation then you have digital asset treasury situation. They the hangover they're dumping. They they don't buy more. Many of them sell also reverse flows from crime syndicates. Major flows reverse after the DOJ indictment of the Cambodian prince group last. This one I've missed, but apparently DOJ coming after crime, so they don't use crypto anymore. Quantum fears. Uh, this one is something we'll have to fix over the coming years. Add quantum resistance to Bitcoin. I hope they're going to add it. Enormous AI opportunity cost. Yeah, so capital is pivoting to AI a lot. Talent pivoting to AI. Miners are pivoting to AI. That's also interesting because they need GPUs in AI perception of Bitcoin as American Chinese buyer. So all of these know there's a lot of negativity. This is basically summarizing all of the reasons why people are bearish now. But guys, this is not the time to be uh super bearish. I mean it's time to be a bit I mean a bit a bit cautious like we said can still go down, can still chop for six months, but now is not the time to super be focused on this. The the time to to be super focused on the stuff was in October. Okay, that was when it was time to be super focused on this. Now, this is kind of uh, you know, everyone knows this. Everyone knows this. Everyone is aware of this bare stuff when everyone is aware of the bare stuff and agrees that it's a bearish. Um, yeah, that's kind of, you know, kind of coming to an end of the bear kind of somewhere. So, let's see what's going to happen. But all of this is true. It will likely have a have a overhang over crypto or over the coming months. That's again, we're not calling for Valhalla. We're not calling for fast pump. We're not calling for anything of uh like that, but we are saying listen, likely likely within the coming months, tides are going to turn. Okay? And uh that's why we're nibbling. We're nibbling the cookie a bit now. We're nibbling. We're nibbling. Now, um next uh look here, ETFs don't have a lot of outflow. And this is correct because ETFs have outflow, but you see it's not too much. It's basically, you know, normal outflow. Now, let's see what's going to happen today. Maybe today we're going to be hit with like a two billion withdrawal or something. [laughter] But yesterday was quite okay. I mean we did see this 400, 500, 200. We saw it normally last month also. I mean we see it all the time this 400. So ETFs don't really get more panicked when we fall so much which is a good thing because probably it's only strong hands left in these ETFs. I mean that that that would be the hope that they don't have too much more to sell. So this is not too bad. Obviously, it's outflow, but uh you would you would think that when Bitcoin has fallen from 90. I mean, just imagine, guys, uh in the middle of January, it was 93 and now it is 64. And we've been calling for this. Listen, if this range breaks here, it's going to be a flush button press. And uh for most people, this is surreal. I mean, if you told them in January, in the middle of January, listen, we're going to go to 64. We're now at N. We're now at 94. We're going to go to 64. For most people, it's surreal. Most people who don't watch this channel, who who are not in bullying, who don't know mechanical, like for them, it's like what? It's surreal. It's not like part of their known universe. Okay. So, that's why we have to be a bit humble. We have to be a bit uh you know, we have to understand that many people are struggling. But uh at the same time, truth is truth. And we have to say that there there was another option that everyone could have taken joining bul being part of our community like there was another option. So it's it's hard man we have to be humble but if we don't demonstrate the other option and say that things could have been different they going to fall for the same thing again. So let me know what you think how we should spread the gospel. But it's crazy like I really see this as a humanitarian aid we're doing here. Uh that's why I do streams every day. It's humanitarian aid. Okay. Look here Bob Lucas. Don't be a hero of the Bitcoin 2020 super had a single weekly candle down 30%. We're in full capitulation unwind mode if you're buying for the long term. Okay, not horrible spot. But ask yourself, is it really I fully agree with this by the way guys if you're nibbling here together with me. If you're nibbling here and now it's too high of a price, but if let's say we go back to like you know 63 62 it is the nibble time. But uh remember then it really has to be for the long term because we can still fall 30%. But I trust math. I trust math. I love math. Let me know if you love math. Historically, buying a 200 week is very good. Okay? Histo you see here sometimes it can go lower but historically it's very good. So I trust math but still we can have more pain. Okay. So it has to be for the long term. Often people will convince themselves they're only they they are only to puke the eventual. Exactly. So whatever you nibble here you cannot puke it out once uh uh in case we go 30% lower. Okay. You cannot nibble the cookie and then when in case we have another capitulation candle which which will happen but if you love math you love 200 week moving average then it's good time to nibble it is good time to nibble uh now um this we covered this we covered this we covered uh guys micro strategy uh outline that they have to go uh that bit has to go to $8,000 for them to start unwinding and selling their uh their stack. Okay, $8,000. Uh, now likely this will never happen. Okay, again, never say never, but [laughter] maybe this is the maybe this is the pico bottom crash. Uh, I mean, something guys, I'm a bit paranoid. So, something tells us, you know, we've been great on October 8th. It's been fantastic journey. Something tells, but you see, we we have to stay humble in the sense that, you know, something tells us like it cannot be this good. like you know I don't know if you have that in life but sometimes you know when something is too good I'm like man what what's happen why it's so good why it's so good even though you know you know that you work hard even though you know that you worked a lot for the good outcome like you did everything for it to be a good outcome you've put time and effort and you have a good out but I'm like I become a bit pr like mom it's it's going to end soon do you think so that's why we have to be humble even now in the sense that we nibble again don't go all in in this bison nibble nibble nibble because who the hell knows maybe George Soros sees that Micro Strategy is going to basically start collapsing at 8,000 Bitcoin and uh George Soros is going to short the crap like he did with the pound. Okay, when you have a public target on your back of a specific number, this would mean massive liquidation of assets. Shorters are going to feast here with 99% chance this will never happen. But uh yeah, I just have this, you know, man, we we had such a good ride. We have to like be extra We have to be like extra extra humble. Okay. [laughter] Okay. We have to be extra humble. That's why we're nibbling. I mean, we have to be extra humble, but we just follow math anyway because this is emotion. This emotion. We're like, man, the source is coming for us. Bigly bigly. Now, moving on. What's happening? We have Oh, guys, this is a bit of news uh from France. Uh big shout out to France, but you guys are I mean, you're in a very bad spot. If you're watching this from France, let me know. But now basically they're allowing all of these undocumented guys to w to vote in elections. H the problem guys the problem guys is that they're not going to really vote in the way you like it. You want low capital gain. These guys they're going to eat you're going to feed them. So it's just you know Spain the same thing with Spain. 500,000 uh undocumented guys now documented how they going to vote. You know yourself how they going to vote. There is clear incentive with all of this. Clear incentive with all of this. They will never vote for uh lower taxes, more personal responsibility. Uh it's very rare, guys. It's very rare. More likely it's going to be more free money, more more welfare and uh who's going to pay for it because government has no money. Government has zero. It's only the citizens that have money. So more redistribution is just another thing that you should consider relocation. If you're in France, consider relocation. If you are in Spain, consider relocation. Very important. It's we actually have a full dedicated channel in bull mania in discord for relocation because these things are getting worse. You see the trajectory trajectory is not changing. It's not changing and you cannot change it either. Uh you cannot change it if it doesn't matter where you vote. They just added 500 new new guys in Spain. How you got your vote does not just add another just another 500. Okay. They're going to eventually be able to vote and and everything. So and in the France they just allowed them. So listen, you have only one that that uh and maybe it's a bit controversial but I really don't understand the system where you have one vote even if you pay as much as you know thousands of people um does it make sense with one vote one one person maybe but uh in this case you see what's happening so better to relocate better to relocate when it's not an issue then you can vote with your feet at least because that's the only power you have you have no other power no other power you no one cares what you think okay so guys let's go to Q&A Hey, questions, answers, debates, discussions. Let's go. Let's go. Let's go. Let's go. Let's go. Big shout out to Dab for time stamping us today. Big big shout out to DAB. Go to bullmania.com if you want to join Bullmania. If you want to join the mechanical rules army, if you want to become a bull maniac, okay, that that's that's a new [laughter] that's a new concept. It's a bull maniac. If you want to become a bull maniac, go to bullman.com, watch the free training. And also if you want to trade go to this link right here in description exchange I use bull.com/partners where you have pionex for bots. You have uh buy bit for going long going short. You have bitun going long going short. You have weeks going long going short. Big fat signup bonus in all of them. If you have one of them pick the other one so you get the big fat sign signup bonus and you distribute your your capital. You do a bit of decentralization here. Also if you want um a dex go to hyperlquid link here. you get also nice rewards. So all of that and on this note let's go to Q&A questions answers debates uh whether you want me to check a chart we can check charts we can ask we can debate questions answers whatever you want [laughter] whatever you want oh yeah guys the pulseyans pulse always ask Ian comment something about us comment something about us comment something I mean I don't care too much because it's you know how much you can you can talk about something that is down only like it barely deserves air time but I just want to say that it is new alltime low every day. I checked it two days ago. It was alltime low. Today it's alltime low. 8 hours ago. Yesterday it was also alltime low. So I I don't know what to comment here. Like it's the one of the worst performing cryptos. I mean you see yourself [laughter] I don't know what to what what what to say guys. It's one of the worst performing cryptos. They they are in a cult. Their leader has told them wrong everything. Everything wrong. I mean everything is wrong. He also said that for a cycle will not be I mean you've been you've been bamboozled in all ways possible and uh you choose to remain. So how much we can help you? I don't know how much we can help you. Uh that's it. I mean what else you want? What else you want? What else you want? [laughter] So uh that's that. Um uh I bought so much at Yeah. I mean that's a problem. Buying in a bare trend it's is dangerous. Is dangerous. It is dangerous. Um, uh, let's say you got 20k. How would you play this out? Now, if I had 20k, I would divide it into trenches of 1k. So, you have uh 20 trenches basically. And then um I would basically allocate 25% of these trenches uh to buying around uh around the 200 week moving average like here. And you decide yourself the speed. I mean you you can you can have it every week every month but approximately 25% around here and then 75% I would start lading in once we go bull trend like here for example you see we went bull trend you you can start uh you can be more aggressive here so the first 22 basically that we let's look at the last bear um first 25 basically we'll start buying a bit here a bit here you know b kind of you know buying here but it's only 25% because we're still B trend and then bull trend here you would just do it a bit quicker a bit quicker here you you you use those 75 to maybe you know three times as fast so you have pull allocation within the coming months here after bull try I would do something like that because again we never know what's going to happen it could just bounce here from 200 week and and go fast so we want whatever happens basically the the here's how you need to think whatever happens don't try to guess what's going to happen I mean maybe we go to 20k maybe to 30 like who the hell knows ne never try to guess what's going to happen have all scenarios figured out uh if we enter a bull trend the likelihood of us going to Valhalla is just very high. So that's why I would put 75% only after confirmable trend and 25% in case there is you know mega bounce like you know super mega bounce like it's going to always happen low probability not impossible and let's say we go we just keep falling let's say this is super you know mega bear we just fall to like 40 which may happen absolutely but then you still have 75% of your stack so you're not you're not too worried in fact you can maybe even DCA here a bit uh but keep it to 25 like whatever you do until bull bull flip, keep it 225. So, it's also fine for you. You're you're a happy cookie no matter what. And that's the best. I mean, I never claim that I can predict anything except except that bull trends are likely to be bull trends and they likely going to go to Valhalla and that buying at 200 week is historically smart. That's that's the only thing I can I can tell you. And then it's up to us to to create the trenches so that whatever happens, we're good. It goes to Valhalla now, great. it goes down to 40 great uh so that that's how I would be thinking have a nice strategy that whatever happens uh you're good one example is uh to do like that can you talk about something no I I don't know what it is man uh don't ask me about like weird stuff but thanks for donation but um I don't want the reason why I don't want to talk about uh weird stuff I don't know I definitely will not no some crap on on the poo chain No, no, no. Oh, it's is it's the new poo poo thing. It's the new poo project. Yeah, yeah, yeah. It's the new No, I mean, what do you want to say about it? It's it's it's just uh make it makes uh hexagons and pulse more wrecked because there's a new coin. So, what do you mean want what do you want me to say about [clears throat] even you have even more dilution? Sailor may be the only survivor at this rate. Yeah, Sailor doesn't care. Sailor doesn't care. Uh, as long as it's above 8K, he's good. He It's not his money. Like, that's what he does. It's not his money. There's no It's not his money. That's that. I mean, you mentioned in your weekly report that you would put 10% into gold and silver. Yeah. So, once gold and silver go to moving averages, I will add them to my uh long-term portfolio. Uh that uh um that will be like all weather portfolio. So, uh in the coming. So guys, the next bull market I will personally play it a bit differently because in the past I was all in, you know, 100% cryptos. Now I will do it a bit differently. I will have precious metals. I will have u uh stonss as well and I will share all of this with you as we start to bottom out. But I will play it a bit differently. Why? Because other assets they become more volatile like crypto and crypto becomes big. So it's kind of like other so you understand it's like it's not that it's not like it was in 2010 when you buy Bitcoin it goes like to Valhalla crazy. Okay. So I think we have now graduated towards being 360. That's why I repeat B360 B 360. So all assets uh so when it comes to gold and silver so silver for example I think it will go eventually to 50WE moving average. It always does like it's all assets eventually meet their 50week moving average. Go look at any chart look at 50WE. It's it always will come there. So 50 moving average goes like this. Maybe silver will meet it somewhere here. Who the hell knows? But that that's a signal to get uh to get bullish and added. The same with gold. I think also is going to go to moving average sooner or later. Gold technically still in in a bull trend. But because of this week and because of daily trend bear and because of all of the gains we've made, I I risk anyway. So I exit gold uh since two weeks ago. We're lathering out and this week should be should be fully out. uh but uh the time to add it is going to be you know once we go here to 50 week and then I will add a position to my long-term portfolio 10% precious metals gold and silver that's it um and it's not to you know to trade them or anything it is just as a insurance against some kind of you know hyperinflation what because we do see debasements more and more and more and for my peace of mind um I because I I'm now not only do I want to grow portfolio I also want to preserve I want to preserve wealth. So for me to have 10% of uh uh of gold at nice moving averages is very important just for peace of mind in case we see like redefinition of what the dollar is or something crazy happens or some global conflict. the wealth is going to flow from tradi into gold and silver which means that if you just have 10% like the capital migration is going to make it so that just those 10% can save your entire portfolio. Let's say you have trad like everything from this this this allocation from 10% can easily go to 70% in a cat catastrophic scenario like how much capital is just going to rotate like how how much precious metal is going to pump versus everything else catastrophically failing and again I'm not expecting that scenario to ever happen I mean hopefully that scenario never happens in our lifetime hopefully uh but that's why also it's 10% it's not it's not more because it's a very low likelihood hood tail risk scenario but will it help me to sleep better at night knowing that whatever happens that that is in place yes so and um buying at the 50 moving average is smart it can still go below I mean in many cases things go below but it's all about uh uh getting in at the okay price kind of good price but it can easily go below also here it went to 50 week then it went below also it can go below but it's not the point the point is to have that nice allocation And you don't have to go all in like those 10% you don't have to deploy them in one go. You can ladder in over time also and but lading will start at 50 week for me. Uh so that's that's the plan there. What do you think of this one? Have not seen but explanation. What is this IP liquid stock? It's a memecoin or what? I don't want to say it out loud, man. I don't want to say it out. I I see a memecoin that is called that. It's not the time for memecoins. They go to zero. Um, what is it? It's stock hyperlquid. What is it? Ah, you mean Okay. You mean the I see I see I see. I see. I see. It's like a treasure company. I see. I see. I see. Let me let let me check the chart. Let me check the chart. So, it's a new uh it's a new treasury, right? Yeah, I mean daily bull trend. Fantastic. I would still buy Hyperlquid directly, but this is a treasury company that's that's going to do like micro strategy for hyperlquid. Uh my analysis is kind of the same like other treasury companies. If you have a reason to buy it, let's say you have a tax tax like optimized way to buy it via the stock, maybe it makes sense. But just buy hyperlquid otherwise. Why is hyperlid better to buy directly self-custody here? You have a risk with the CEO. I mean, it's it's dudes there running the company. They can make all kinds of decisions, maybe good, maybe bad. Today it's this company, tomorrow they makes a few changes. It's another company. They issue more debt. They take on more risk. Like anything can happen here. uh they have a custody risk. If they do leverage, they lever up. Uh it's another risk. Uh and and yada yada yada like fraud risk. If it's a company, you can have a fraud. It can happen. It's low risk, but it can happen. You can have someone siphoning money from the company and yada yada yada endless amount of risk. So, [snorts] you need to have a good reason to buy it. Uh I would just buy Hyperlquid directly. Uh if if that's an option because again, self custody and so on so forth. Um so yeah that's um that's the situation. Soul is inflationary. There is no max supply. How will soul go to new alltime highs since soul does not have so a very good point. The the way to play soul is that you buy it and you stake it. The most inflation comes from staking. Now there is another inflation figure that comes out from the like the unlocks their team unlock or whatever. It also adds to inflation but as far as I know it's it's mainly over. So the biggest inflation is the staking and you have to stake because soul has a lot of percent for stakers which means that if you don't stake you get diluted. Uh let me actually see what is this Solana staking percent yearly. What is it now? It's like 7% or something. What was it? 8% annually. Here uh let's check. So you definitely have to stake. You have to stake. Uh can I stake? Can I what is it? Uh remove uh where did it say staking 8%. 8% it says somewhere here initial is 8% decreasing by 15%. Okay. So what is it now then? Let me check with cloud. What's the current Sana staking? But you see anyway it's quite high. So what is the what is one second inflation now from staking? I have my sorry I have my AI here. Let me see what it is. [snorts] Uh but you you need to look at Sana market cap. That's very true. Slana market cap now at this price is way higher than last cycle at this price. Why? Because of inflation. So current inflation rate is 4%. Uh though some sources say slightly higher yeah depends on how you count. I think if you only count staking it should be like 4%. Staking yield is higher than the raw inflation rate for two reasons compounding within staking accounts. The fact that not all Oh yeah exactly not all Sana is st that's another reason. Okay so this is interesting. So if you stake you get the six seven% but because not all Solana is staked the overall inflation is a bit lower. Make sense? Yeah. So that's that's the situation. Again think about where where inflation goes to. It goes to stakers. So it goes to you if you stake. So you have to stake 100%. And if you buy on the stock market there there are Solana ETFs you can buy on the stock market with staking. Just ensure it is stana. I think 21 shares have a staked one. Uh and other ones have also staked one. Uh Ivan, I wasn't following you in the last bear. You stopped streaming. Why is it different for you this time? How are you feeling? I'm feeling I'm guys I'm feeling a bit euphoric. I mean I have to be truthful with you. It's uh I tried to like take in this moment. I I'm feeling a bit euphoric because we've been so mega correct and again I'm not bragging. You ask me how I feel. So I I explained to we've been playing it super well. Uh also last cycle I was busy with other stuff. Uh we were building Morales the infra company. So I just has had less time to focus. Uh and um yeah I mean then I realized I want to be focusing on on trading only. So since last summer I'm trading only. So I'm not super involved in building the infra anymore. Um so that has changed. And yeah I mean when you have full focus on something it's uh very good. you have a fantastic performance. So that's that's what we've had. And uh yeah, al also you guys are watching in the bear. It also gives me energy. Uh as long as you guys are interested, you guys are watching, you guys are smashing the like to Valhalla, we do the streams. Um and I mean it's also more fun like we've uh yeah, we have now also last bear we didn't have the same like structured mechanical rules. We didn't have like you know the bullmania now that I keep telling you about like we never had something like this before [snorts] and so because now we have a structured approach to trading mechanical rules we have money line we have money scan like it works so well uh it's also fun because we see results in real time like I share with you every day it's fun for me to see it's u it's great motivation just I mean when I see this every day and this is just today like this is not something we collected over the last like year you know this is just today 6th of February This last last 24 hours. Last 24 hours. And yesterday we had this. Yesterday I included this. So you guys see that the losses also happen although they're small. Yesterday we had this. Then on 4th of February we had this like every day every day. Every day every day every so yeah it's fun. I mean it's I'm motivated. So what can I say? How can I get your motiv in in go to bullman.com watch the free training. That's the only entry. There's no way to buy without watching the free training understanding what we're doing and so on and so forth. So do that. Thanks for the nation. Ivan, you should brag. It's good to know a few people actually understand what is going on. I know. I know. Exactly. Exactly. That's why we're humble, but we're always ensuring everyone knows when we risked. It's uh Exactly. You have to you have to I mean generally in life if you're too much humble pie guys like it's Yeah. It's like bad advice. I mean to be fair obviously you need to be like a nice person and everything but especially when it comes to you know let's say you're at work and you're a humble pie you're like let's say you work in a corporate let's let's say average person works in corporate and he's super humble pie uh you know to to ladder the the ladder so to speak you cannot be man humble pay like it's going to be hard man it's going to be hard I mean just how other humans work they're going to take credit for your stuff like being humble I I don't understand like what's what's the point of it obviously you need to be you cannot be like obnoxious just mfer it's not what it's about but at the same time to ensure that people know what you're doing to ensure that people know you're worth it's very important obviously in business even more so [laughter] obviously in business you have to like take it in a few notches but um yeah I I remember yeah I mean just looking back on my life whenever people say me you have to be h I don't know you have to for what for what I'm humble for what [laughter] yeah you have to find like a nice balance there a Nice palace. What's up with your right eye? Let's see. This one or which one? I mean, I don't know. I'm bad at lighting, guys. I need to be better at like setting up lights. Uh people say like I look like a vampire. I look like, you know, something happened to my Nothing happened to my eye, guys. It's just like, yeah, I I'm not the best at videography. I guess the guy yesterday said I look like a vampire, but that's true because we need sun, man. I I look forward to being uh in the sun more. Uh I mean I I live in um in a warm place, but uh I mean now it's February, so it's not it's not too warm. Uh I need I I I Yeah. Uh I'm looking forward to being more tanned. Uh you need a I maybe I need soft box. It takes so much room. Yeah, I need I don't have salt box now. You you understand it correctly. You're probably a professional. I don't have I have a light here and I have a light there and there no salt box. Maybe that that will fix it. But they are coming from above me. So how can I have a a brown eye here or it's like light is literally coming right here. Why is why it's not removing it? But then at the same time you also need shadow to make it look cinematic. So you want both shadow but so it doesn't look anyway. Anyway I I'm uh learning as we go along here. I I I need to buy some uh some mastermind for for movie making. Diffuse the light. Okay. I'll check I'll check it Milan. I'll check it. Thanks a lot. Um, you're looking thin too. Yeah, I mean that's good. I mean that's that's also like sometimes I have camera in the wrong angle. It makes me look like 50 pounds bigger. I put camera a bit in another angle. Now people say you look thin. [laughter] Okay, good question. Kyle Saman, did he leave? Uh, let me check that because I did see that he did leave. Um, and uh, what what what is he doing now? I I guess he wrote the crap out of the Sana trend and now Sana is going to 30. So, he's out. Uh, let's see. What did he say? I didn't read his I just saw that he is out. I didn't He also wrote like a message. Uh so to be crystal are clear I'm aiming to increase my ownership in this company and therefore implicitly sold as a result of this transition. I'm still mega long soul mealong crypto and will continue to be involved in crypto. Okay. So what did you do? Personal update. I have decided to step back from multicoin. It's bittersweet moment for me because my time at multin has been some of the most meaningful rewarding of my life. Yeah I mean true been bull soul forever. So that's great. That said, I'm excited to take time off and explore new areas of technology. And so he's be in for what is that? A world leading Solana treasury. Ah, okay. He's going to do okay. Okay. I believe the claract will unlock. Moreover, I will continue to serve. Oh, yeah. So, he will continue to be there. Or maybe it is his kind of, you know, soft exit scam from this company. Could be, man. [laughter] This treasury not doing too great. He's like, \"Yeah, I will still help out.\" But, uh, yeah, guys, you are on your own. [laughter] Let's see. Forward. Yeah, [laughter] I understand, Kyle. I understand. He's like, \"Yeah, but I'm still going to help out.\" Yeah. Yeah. Yeah. What? Yeah. Exactly. He's like, \"Yeah, guys. I mean, I'm still going to like help the board or Yeah. Yeah. But for personal reasons, I'm out.\" I understand. I understand fully. Yeah. Uh it goes without saying that I will remain bullish on multicoin. So did he say anything? I will remain in my So he didn't say what he's going to do. Normally you say that there's a reason to ah what the hell? He he didn't even say what he's going to do. No, I thought he said that he would exactly what he's going to do, but he says he's going to go to other technologies. Maybe AI. I mean, let's see. Let's see. I mean, he's smart dude. He's going to find something. personal reason sipping cocktail on the island. I mean that I don't think like being in tech is too fun man too who wants to sit on a island with cocktail I I mean it's I'm sure he's going to do something probably with AI probably with AI maybe with Saul but I don't think he's going to be with Sana guys because he was super sana with multicoin was super sana now Ford was super sana so if he wants to stay in Sana what he's going to do he said he's going to explore new areas of technology maybe he got a deal to be some you know AI fund uh uh manager let's Okay, let's see what's going to happen. I mean, do you think Trump should sell some gold at 5K to buy Bitcoin at 65K? You mean as a nation, as a country? I mean, it would be fantastic. I mean, I'm all about that. [laughter] I think he should do it. Uh, but uh, gold moon so much. So, it's kind of interesting like for crypto. We need we need we need to see we we will have to figure out a new narrative for the coming bull because gold moon like more than bitcoin so what's the point you understand like he needs to explain but you know gold moon so much and uh as an asset uh crypto it will only regain its respect when it comes to like big asset allocators in case we go to Valhalla which I think we're going to do next year especially but normally they don't act before the price tells them to act. Okay. So, uh now everyone respects gold. Everyone wants to be be super gold. So, until gold crashes and Bitcoin pumps, it's going to be hard to convince anyone that Bitcoin is digital gold or whatever. But that's good for us. I mean, that's actually fantastic for us because we have all the time in the world to allocate to position ourselves. And then as gold goes down to to the moving averages and the bitcoin uh uh moons uh the world will follow and maybe even central banks will follow. Let's see [snorts] without getting into politics but do you think the scenario of strikes on Iran in the coming days can this cause a black swan? Um definitely I it's going to be volatility. It's going to be volatility u meaning in the in meaning down. Yeah, I think it's going to be down. It's going to be black swan. I mean, hard to say. Uh, we're prepared for it anyway with the big fat capital to buy whatever low is happening. We're prepared for it. That's why we're just nibbling now. Super super small buys. But, uh, and not even now because now it's too expensive. But if we're at 63 or lower, then it's good. But yeah, I mean, anything can happen. We we need to be prepared that any kind of bad news in this bare trend will send us low very fast. Okay, we're in bare trend. Meaning that any kind of bad news dumps us and all good news don't pump us. Understand this? That's the bare trend. The bare trend is you you have a good news, no one cares. You have bad news, we dump. Bull trend is vice versa. You have bad news, no one cares. Good news, we pump all we always. So we any kind of uh problem in the stock market, any kind of problem in the crypto market, geopolitics uh in this trend will be very bad for us. uh very bad for crypto. I mean for us it's not bad because we can buy it but uh look here the for example what what worries me in terms of the the down down scenario is that stocks are really not doing too great. Amazon falls 10% after reporting Q4 earnings. Now it's down 50% on the day including its regular hour. I mean it's it's very down. [laughter] So Amazon so uh I would probably just look at S&P and if this thing keeps going lower it's going to be bad for crypto guys. It's going to be very bad for crypto. But at the same time, it's still good to nibble at 200 week and um yeah, that's it. That's it. But don't do it too much. Just a bit. Boop boop boop. So you're part of the long term the math is is going to be on your side. Do you think ordinary people will come back? Yeah. As as soon as we pump, they're going to come back. They came back into gold when we when gold pumps they they will come back. If we pump, they will come back. If we don't pump, they will not come back. But we will pump at some point. But guys, isn't it crazy that that Bitcoin is already at 200 week? We said, \"Come to papa. Come to papa.\" I mean, it's almost here. [laughter] Is it crazy? I think it's crazy, man. It was so fast also. I mean, literally a toilet flush. Toilet flush. Crazy, man. But see, there are some no one knows the future. like we we don't know the future but there are some things we can put big probabilities on. Trend is obviously the biggest. If trend is up it's going to continue up. If trend is down it's likely going to continue down. Another one is break of range. When you have break of range I mean we said that listen if it breaks range we're going to flash to 200 week. Boop instant flash. So these things you you can more or less be more confident in what's going to happen. Never a guarantee of course but when you have a you know break of range normally big big volatility to the to the side where the break happens. Um oh guys and another thing another thing I really want to highlight because I learned that uh uh through you know by by being in crypto when you have consolidation that looks like this it's not good. When you have down big down and then it moves up like this many people say, \"Oh, but it's bullish. It's bullish. It's going up lower higher highs and higher lows.\" No, no, no, no, no. If it's bare trend, it is actually the mark of the beast or how you say it's it's very bad. Uh compared to here, it went down and then you what you want is that consolidation is downward sloping. This is to many people this is counterintuitive but if you look at charts you you you will see you want it down for it to be the bottom you want it down okay when it's up it's not good like many people made the mistakes thinking it's good the best example of this is uh here in the in the last uh bara also you had many people being so excited you know this kind of went up like this while in reality See, you wanted it to be down like this. I think even I have a tweet from a few months ago where I said that people expect this thing right here to be a repetition of this because they uh just like people here thought that this would be repetition of this although it it was quite different. That's another thing like when you have you want it to slope down. Okay, when you have a big dump and you want the bottom if it slopes down and loses momentum it's a higher chance of a bottom. Not a guarantee. It can even that can break down. But it's all about chances. All about Yeah. Higher chance, lower chance. So that that was an interesting thing also that happened this this cycle. Would you de-risk now if you're fully Yeah, I mean is is the hard question, you know, would you de-risk? I mean, honestly, guys, for Bitcoin, likely I would just uh you know, I would take the rest of the pain at this point. It's uh you know it fell so much already it can still fall it can still fall more but if it is again I want to highlight this this is there's no good answer here you are in a situation you need kind of saving from a situation where there's no good answer if it's Bitcoin at this point I would just uh ride it you know maybe it goes down another 30 like you're down a lot already so just just ride it just try to switch your brain to long-term thinking >> [laughter] >> When it comes to all guys, that's different because many of them will not come back. That's a big problem. Many alls don't don't come back. Uh so there I would divide it into maybe 10 tranches and then uh move them to cash one at a time maybe in weekly weekly weekly moves because you need to release pressure from your brain. Release pressure from you know huddle huddle huddle. Uh, and I told it yesterday, but think in for your altcoins, think every day how much you have in them and think like like you're buying them every day. If you hodddle another day, it means that you took that money that you have in them and you bought them again. And then you hle another day, it means that you have the money in them and you buy like if you think like that, it's it's very easy to say, would you buy them if you had the money in cash or not? Okay. And so if the answer is no, then yeah, move out then. Why you hold them? Move out. You could you don't have to move out all at once again because that's very psychologically it's tough to move out everything at once because if you have a some kind of bounce or relief rally the next day you may for back in and get like chopped up. So instead if you split it up is better. And it's only for all coins. Sana, if you have Sana or ETH, it's a bit harder because Sana, I think, still has a chance to go to 30. So consider how that's going to be for you. Um, ETH still has a chance to go to 1K. Nothing is guaranteed. Neither Solan to 30 or ETH to 1K. But just, you know, if you hodddle or ETH, I think you're going to be fine anyway. But just be prepared for uh for pain. Even Salana and ETH, I would also at least a bit I would transition so I don't have the mental pressure. when you have transitioned a bit then you don't have you can think clearly I mean that's that's the only thing and um yeah uh exactly so the major altars will most likely come back but you know if you have some of the smaller ones uh memes especially memes like many of them will not so yeah how much in percentage of the total dry part would you consider as a nibble I mean kind of like we discussed I answered kind of this exact question before but let Let me here write one example. So we don't want to go too heavy before the bull flip on the money line which is currently at 99 but you know it's it's coming down quickly. So 75% of the dry powder I would not uh touch at all before we go bull bull trend on the money line. 25% you can start nibble around this like you know 63 62 um and then how fast here either divide in 10 or 20 trenches these ones and yeah and and then and then you can do weekly or or bi-weekly. So this is more for you like how fast you want but just keep it to 25 like again it can go down like this can go to 40 even find the bottom here. So here you would be like uh nibbling and 75% of your dry powder save until it goes bullish on the money line. Now it may look like it's so high but again it's coming down very quick. You see here in the last bear it wasn't like too far from the from the bottom that it flip bull because it's coming down very quickly the bull flip. I would do something like this. But guys listen we are at 55 minutes good length. Thanks a lot for being here. Thanks a lot for contributing to the show yet again. Big shout out. Big shout out uh to Dub for timestamping us today. Uh let me take another one. What's your best guess for bare cycle low? I don't like that question because I don't know guys like no one knows. No one knows. I think around 200 week moving average is um is is a good bet. Okay, if I have to guess, I would say within to I mean my range, let me put you my range. My range my range is let's see here. it. It's now here. I think the bottom is going to be at the worst like 40 because that's 30% from the uh from from here. Okay. At the worst, I think it's going to be here. Like if I have to guess, but again 25% is nibble now. So even if it goes to 40, we're just going to nibble with the 25% of the dry powder. 75% of the dry powder, we we enter only after bull flip. So we I mean we don't have to guess where the where the bottom is. That's why I say I don't really like the question because I don't really care where the bottom is. I know that wherever it is, we're going to be fine no matter what because we only nibble with the 25 now. So if it goes slower, great. [snorts] And 75 will go when it's bull trend and also not going to be all at once. It's going to be in in trenches. So yeah, that that's what I would say. Thanks a lot for good questions, good answers, good debates. See you. Maybe we see you today. If it falls a lot, maybe we're going to be back. But if it's somewhere here at like 60, then you know you know everything. Guys, have a good day. Beach out to Dub and goodbye guys. Goodbye."
    }
]