[
    {
        "video_id": "Eg5z-qFIQD4",
        "title": "Palantir Stock CRASHES While Growth Stocks Rally!",
        "published_at": "2026-01-03T03:23:10.000Z",
        "sort_date": "2026-01-03",
        "url": "https://www.youtube.com/watch?v=Eg5z-qFIQD4",
        "views": 7229,
        "duration": "00:10:01",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. I hope everybody had a wonderful day and a wonderful new year. Welcome to 2026. Here we are. It's great to be here. I hope everybody is able to put all the negativity behind them in 2025 and start with a fresh look and that can especially correlate to the markets here uh for 2026. We're going to be talking about some very very interesting things that happened today uh that kick started us off for the first trading session of the new year. uh very interesting moves in terms of rotation. What we're seeing in terms of kind of the risk asset uh sector that saw a lot of growth and out of the mag 7, we see Palunteer that's coming down even about 5% even with the broader market that somehow finishes in the green a lot of choppiness and some decent volatility today. We'll be talking about that, why Palanteer could be possibly pulling back and what we're looking in terms of some of the other big stocks that we've been talking about on the channel. Now, if you're new or returning viewer, hit the like button, subscribe for daily videos, and follow me an X down below if you want to get more daily updates on a quicker basis before I have time to make these videos. Now, pop it up at the screen here. Palanteer closes at 16960. We saw a ton of selling pressure on Palanteer. Now, first things first, there was no specific news or catalyst from Palenteer that all of a sudden, you know, caused this sell-off. Uh some of the big things that we need to consider is that Palunteer in terms of we know it has a high valuation but you know to all those criticizers Palanteer has kind of beat those doubters over the previous few years and we've had astronomical gains for Palanteer. So you know where Palanteer sits at is at a really important spot. One thing that did cause a little bit of concern for me is that we saw a lot of selling pressure today on the daily that sold us below and closed below this 170 support level. Now, this 170 support level is really important because Palanteer has had a lot of accumulation within this zone. The last time we saw that was, remember during November, we had a ton of selloff. That's where Palanteer came back here to the 150s before getting a reversal to reclaim back into the 180s, 190s where it's been hanging out for some time. Um, you know, if Palenteer continues to see some selling pressure, that's where you could see a possible breakdown if it's not able to reclaim this 170 zone where it's basically at right now. I predict in the short term I think we could possibly be retesting the 150s. Um, however, you know, Paler could easily reclaim the 170s and sit in the zone. It's not like all of a sudden, oh my god, it's red and he's flipping bearish. No, it's just more, you know, what's the move looking like? The market can go both ways. And a lot of people are really focusing on right here, the technical setup is this head and shoulders pattern. Uh in terms of the head and shoulders here, if you look over the last year, a lot of people are talking about this up here and Palanteer falls pretty quickly underneath its 50day moving average. So in terms of that, what we saw was also on top a ton of single egg calls that were being sold right here. You can see calls here that were sold 38.46 million and you know puts on top of that. So you see that with a lot of selling pressure that gets pushed on the underlying share price. um you know, but in terms of the long term, Palanteer has really, you know, beat the doubters. So, I'm not going to get too concerned about this name, especially with the gains that we've seen over the previous few years. And, you know, long-term, I'm still bullish uh on Palunteer. However, just looking from a technical perspective, I think this market could be very interesting in 2026. Uh so, definitely those are my short-term predictions and my long-term uh you know, kind of thesis is still bullish, of course, on Palunteer. Now, let's talk about what we saw in the market today. We see the spy here. It closes at 68297, which is a pretty good close for the spy. Still just kind of slightly right underneath this 15, it's 200. Uh, looking at the S&P 500 index though, we see it close right here at 6858. What was interesting about this is, you know, this opened up and fell back down, you know, here in the intraday to about 6830 and was actually red most of the day after we saw kind of a morning bullishness and then we saw a decent amount of selling. However, you know, that was the main story for a lot of the stocks within the MAG 7. within the MG7 we saw a lot of rotation out of there and a lot of the big tech names actually kind of struggling which I think is why we saw you know the broader market and the S&P 500 index that was struggling the thing that really brought resiliency to it uh we saw Nvidia that was able to climb about 1% and Nvidia does have a strong weight on the index as we know we also saw some of the other big names within the whole AI industry like Micron here that had a big big boost for 2026 and we see a push up here more than 10% on the single day. Uh but what we saw here like you know looking at Microsoft, Crowd Strike, Salesforce, Tesla, you know that's where we saw some selling pressure. So the question you know was where was the the rotation go to? And the rotation really went into a lot of these growth and risk on asset more speculative names like we've been talking about on the channel such as Cipher, such as INAUS, these AI data center stocks and all of a sudden you saw Cipher that saw an insane amount of bullishness right here. Cipher right now at 1628. It's great to see a little bit of breath that's coming back into this individual name. I think this could be a cool name for 2026. I like it. I'm bullish on it for 2026 just in terms of the whole perspective and the psychology behind the AI bottleneck and not just the psychology but also the reality behind the AI bottleneck is the power for compute and energy. Um, Cipher and IN are working to provide you, we know, energy. Cipher is working on building and providing more compute power by building out these AI data centers to help keep up with the AI demand, which we know is struggling to be met. Now, with that being said, in terms of the perspective, the underlying share price here for Cipher, we see it pop above its 50-day, and you see it getting a little bit of love and breaking out of its consolidation zone, kind of between the 14s and the 15s, where Cipher's really been hanging out uh here for basically the last two weeks. Ever since December 15th, we've had Cipher that's been hanging out here in the 15s. Um, same thing with INE. You see it reclaiming up about 14% today and it gets back into this important zone right here that I like. This is where you kind of had this recent triple bottom that was unfortunately invalidated and we saw a further breakdown that brought Iron back down here to the 33s. The thing I like about IN right here is it's recaptured this 40 level of support. And it'll be interesting to see if Iron's able to kind of flip that into support again and if it can break through this last local resistance. You can see right here at the 43s. Um, you know, if we continue to see a breakthrough, that's where things could get interesting for these AI data center stocks. Same thing with Core Weef up about 12% right here at 80. You see here with Nibbius comes up about 8% right here at 90. We'll see if NBIS can quickly reclaim back above its $100 kind of zone and find some support here at the 100. So, you know, in the short term and we're also seeing a lot of love for the space sector. You see ESTs right here at 1483. You know, we're up about 1483%. The thing about the whole theme for 2026 is, you know, what's going to be the theme? A lot of people are predicting that space is going to be a very hot theme and we see that especially with the whole anticipation of the SpaceX IPO. On top of that, I think data center stocks are going to be an important theme and also looking in other type of energy type of related things. Um, other than that, let's talk about what's really happening in crypto because by golly, we're finally starting to see a little bit of a bid. Now, I'm going to take this with the biggest biggest grain of salt because in terms of Bitcoin holding this 90, it has not. It's always fallen back to like 87, but it's got a daily close and is currently right now at 90. We'll see if it stays here. It's above its 50-day. Same thing with Ethereum. We're starting to see a little bit of momentum that comes in here. Now, of course, this could be faded. I'm not trusting this just quite yet. If we see this hold uh Bitcoin at 90 and if we see Ethereum here for the big crypto lovers, they might be getting a little bit of a relief. We'll see what happens. Uh but Ethereum, it's above 3,000. It's climbed above 3,000 quite quick. [snorts] Up about in the last 24 hours here up about 4.5%, currently at 3125. What does it mean for Tom Le's BMR? BMR got some love today. up 15%. Uh lot finally seeing a breakthrough here on BMR. Reclaiming the 30 important here. We kind of see this double bottom that's kind of being formed here for BMR. We'll see what happens if these moves are validated getting into next week. Next week we're going to have a full trading week. So I think that's where things are going to get a little more juicy. We could see some more volatility. Looking at some other names that I do particularly like Path. I like Path a lot. uh sitting right here about 1595. I think this will be a cool stock for 2026. Uh looking at other things in terms of getting away from AI is looking at SoFi. Uh SoFi right here is at 2750 and I think SoFi could have a cool year especially with a possible S&P 500 inclusion. You see SoFi that's been trading and facing some resistance here in kind of the low30s basically 3132. So we'll see what happens here. But, you know, some of these more riskier, more speculative, you know, risky, more speculative names catching a bid today. We'll see if it stays. Let me know what you think down in the comments. What stocks do you want to see covered on the channel? And what are your own personal favorite stocks for 2026? On top of that, what theme do you think is going to win? I like to hear and gather all of your ideas so I can process them for myself and include them in my research. Thank you guys so much. Peace out. Take care. And I hope you guys all have a wonderful weekend."
    }
]