[
    {
        "video_id": "J1LiYgztTiw",
        "title": "Bitcoin to $90k, Tariff CRASH, Clarity Act, Death of Altcoins &amp; More!",
        "published_at": "2026-01-19T13:54:59Z",
        "sort_date": "2026-01-19",
        "url": "https://www.youtube.com/watch?v=J1LiYgztTiw",
        "transcript": "fake out. We thought a $100,000 BTC might be back on the menu, but geopolitical tensions and regulatory gridlock have brought back the January blues. Lack of clarity. The long-awaited crypto market structure bill just got torpedoed by Coinbase. Here's what happened and why it matters. Info finished. The powers that be at X have rung the death nail for one of crypto's most hated sectors. Should we mourn its passing or celebrate its demise? And we'll have Lewis with the TA, the tweets of the week, dates for your diary, and much more besides. This is the Coin Bureau News Live. Hello everyone. It is indeed the Coin Bureau News Live. And how about this? Good news from the very top of the stream. Nick is back and he is still alive. Nick, it's good to see you. >> That was what an experience I tell you. Yeah. A watershed moment for me and my my experience with su seafood now I think. >> Okay. That's that's it for you and seafood. >> That's it for me. Yeah, exactly. But it was a very important experience. I think it gave me a lot of perspective. It made me realize that despite how crypto was going for, >> things can always get worse. and and never ever and health is very important guys. So in that moment I realized yeah >> good you had you had a moment of clarity as you as you vomited >> moment of clarity that we can't get from the crypto markets unfortunately but >> well there you go folks something philosophical to start us off with today. You know it's everything looks everything looks a lot worse when you're when you're that ill. Um but h yes well it's good to have you back. I'm glad you survived it. Um, yeah. Lay lay off the seafood. >> Yeah, I think so. For for quite some time. For the rest of your life. For oysters for life. Forever. No more. No. >> I mean, let's before we move on. I mean, the the irony of this is is really quite something because Nick is, you know, as you can probably tell, a very disciplined individual. He is not whenever there's like cake or something in the office, he always just no no thank you. Always steers away from it. You know, he he does not eat a very varied diet. And the one time, >> the one time I experimented, I think that's it, bro. Chicken and rice forever. Never ever anything again. If I have to face even the risk, the min minuscule risk that I'm going to go and get food poison like that again, I think chicken and rice for life, man. It's all good. >> Okay. Well, there you go. There's some advice for you. Anyway, uh it's great to see you. Thank you for joining us today. And it's great to have Nick back and uh what appears to be in good health. Um before we get started, uh smash the like button. Um, smash the like button if you're pleased to see Nick back. >> Jeez, guys. >> Um, I I wasn't I wasn't too impressed uh with the amount of likes we got last week. I I don't know if you managed to watch last week's >> I did manage to watch at the end. Yes, your impression was quite uncaged to, you know, recruit in in my space now. But yeah, attempt good attempt. >> Thank you. Thank you. Um and yes, well, well done to Lewis who did a great job and I'm sure we'll have him back in one of our chairs next time. uh Nick or I uh are on the wrong side of some shellfish. Um but yes, so hit the like button if you're pleased to see Nick back. Don't forget to ring the bell as well. Do all the do all those bits of admin. Um but it is time for us to kick off and talk about what has been an eventful last week in crypto. >> Very indeed. So roll back to Monday. Um and if you guys will recall, uh wait, I got the wrong chart. I got the wrong one open yet. One second. Okay, >> so we got first it started off with Michael Seder of course as per usual but a massive buy this time. This was the biggest buy he bought um since the summer of last year and this is a total of over a billion. Right. So, he's still accumulating. Still accumulating. And he has hinted that he will be placing another orange on this the tracker, the Sailor tracker today. So, keep your eyes peeled for that, guys, and let us know in the comments if it drops while the stream is going. Uh at the same time, gold hits another all-time high. >> Gold is just Yeah, it just will not stop, will it? Um, so eyeing up eyeing up $5,000 now. >> I think it's going to I think it's going to hit that pretty soon, man. >> Okay. >> Tuesday we had the CPI numbers and they came out bang on expectations, although they were the lowest numbers since March of uh last year. >> Okay. Okay. Um Trump uh Trump though is signaling um that that could mean a cut is coming, right? >> Of course. Yeah. He came out very quickly and he said that this means we need to cut. Of course, I don't think Jerome was in a very good mood given the fact that he was being uh he got a letter from the DOJ just the day before that. >> Yes. >> With regards to the Fed renovations, >> you thought you had a bad start to the week. Jerome Pal had an even worse one. I >> think he woke up there with a letter. Yeah. From Pam Bondi. >> Um markets did rally though. So, Bitcoin broke through 93K, 94K, 95, 96. Um >> and we were starting to believe again, weren't we? We were starting to believe. >> Exactly. We're so back. We're so back, guys. Uh Wednesday also we had massive ETF inflows, right? >> Yeah. Yeah. ET ETF inflows have actually been pretty healthy, >> pretty solid. And these were the biggest since October of last year, daily inflows. And this is also these inflows are also very important because they seem to be purely directional bets in the sense that there haven't hasn't been a similar rise uh in the in futures open interest, CME futures open interest. And the reason that's important is because it means that it seems like whoever is buying this Bitcoin, it's not the uh cash and carry the buying the long the ETF and short the futures and earning the the yield. So it seems as if these are buyers who are looking to get longside exposure to Bitcoin. >> Okay. They're not they're not trying to do any financial >> woo. Okay. Um well that helped to drive us. We were we came pretty close to 98k on Wednesday. >> Wow. Yeah. Was 100K was beckoning. >> Yeah. But unfortunately it was not meant to be because Yeah. >> Uh yes. So the Supreme Court once again uh shied away from from making a ruling on the tariffs. So we are still waiting for that. So that was the first thing that kind of shook the market a little bit and then we had the clarity act or rather the lack lack thereof. >> Lack thereof. Exactly. So it started uh to circulate that Coinbase was going to well first of all there was concerns which we'll be getting on to a bit in the next section but there were concerns around potential poison pulls within the legislation and Coinbase decided that they would be pulling their support for the legislation. >> Yeah. Yeah. Now, we'll talk, as Nick said, we'll talk about this in a bit more detail later on because this is very important. And uh I'm interested to see what you think on this one, Nick, because we we may be we may have different views on this and we'd like to hear what you guys think um about Coinbase sort of not necessarily pulling the plug on the Clarity Act, but certainly um putting the brakes on it. So, let us know what you think. Um that takes us to Thursday. Now despite uh despite this bad news around uh clarity or supposedly bad news around clarity, some giants were still diving in. State Street uh got involved with Bitcoin. >> Yeah. Another big trady institution jumping with uh allowing its ETFs and stable coins on his platform. >> Mhm. >> And then on Friday um Trump gave us an update on his thinking of who the Fed chair is uh and in the sense that he was he pulled Hasset's nomination I think in as a passing comment. Okay. basically like he likes him where he's at. So that dropped Hassets the chances of getting into the Fed chair seat. So it seems it's now between Kevin Walsh and a few other candidates um into the Fed chair. >> Okay. So uh yes, this interesting standoff between this interesting dynamic I I guess if you like between Trump and the Fed continues. Um so that takes us into the weekend which I mean I don't think really anything much went on over the weekend. >> It was quite a quiet weekend on the geopolitical front. nothing popping off here, which is surprising, right? >> Yeah. Yeah. I mean, you would have thought that there might have been some sort of arguments and falling outs going on, but really there was nothing. >> There was talk about though about an island of some description. Did they mention Taiwan Taiwan, >> some tiny island somewhere? Yeah, there was a bit of a bit of disagreement about that. Yeah. Yeah. >> Um Okay. Yes. Uh this is obviously the Greenland situation. Um Trump uh Trump Trump appear appears to mean what he says about this one. He he does not appear to be uh to be messing around. Um and so the EU um as that muscular uh body that it is um defiantly monitored the situation. >> They defiantly monitored and they're moving into action with a strongly worded statement from the uh committee. Uh but it could get even even messier to be honest because they are actually hitting back a little and they're actually considering um this uh anti-coercion instrument which is a what they call their trade bazooka which was uh which they considering well Macron said they should consider which is a very big punitive um counter measures for any sort of coercive activity. >> Yeah. >> Is that a polar bear skin they've got on the uh on the wall of that? Very observational skills there, guy. Yes, that is indeed a >> They are in the Arctic. They are actually in the Arctic. >> Yeah, that get that just >> We better put something up on the wall to make people think we're in the Arctic. Has anyone got a polar bear skin lying around? Um yes. So, um mind you, this didn't really cause much uh movement on the Bitcoin side, >> which is to be honest, let's usually a suspicious sign, right? Generally, let's be honest. Uh and as per usual, Bitcoin Well, Yep. There we go again. Yet again. >> Yes. Asian traders woke up and decided uh they they didn't want it. >> Yeah. Yeah. Exactly. Um so and um yeah, I mean like gold also rallied gold rallied to alltime highs the moment of that exact moment that that happened. So uh the rotation is happening. It's just not the way you expected. >> Yes. Exactly. Exactly. Um, interestingly today, uh, in case you have noticed, US markets are closed, um, because of Martin Luther King Junior Day. Um, but we do have a big week coming up. We've got, I mean, this tariff case may or may not be resolved. Uh, we've got the issue of Greenland, the EU going toe-to-toe with the US. >> Exactly. PC numbers and all that. >> In terms of the charts, quickly, I'll just update you where things are at on the daily chart of Bitcoin. Uh so you'll have if you've been following me on Twitter and if you've been following the stream, you will have seen me mention uh there was an important daily level. We got the chart up guys. No, wrong chart. >> Okay, you didn't you don't have a Oh, I don't have an I missed the chart. My bad. My bad. Okay, there was a chart there. Anyways, that chart was You guys can tell what that chart was. What? Can't you can't you guess what that chart was? That was the CME chart because there is a there is a C there is a CME gap down below. You put up that chart again. You shock me. There's a CME gap. Where's it at? >> Where's it on? 87K. >> 87. >> Some people have been questioning where that was the one that was opened up actually on the New Year's. Um, so in terms of key levels, because I unfortunately I forgot to put the chart in there. It's my bad. But basically, we are close to 90K now back at 92 93. We fell below the 94K support. Um, which is resistance support at the 61.8% Fibonacci which we had from the low to the highs from last year. So, we broken through that support again and now 90K is definitely a strong support psychologically and also because that is where the 50-day moving average is right now. So, keep an eye on that and if we fall below that then people are pointing to potentially 88k which was the start of the open and then 80 about 87 to 88k is where that unclosed CME gap is as well on the downside. So, keep an eye out for that. >> Okay. So if I was to trade this situation, I would I would imagine short Bitcoin down to that CME gap and long gold up to 5K. >> Yeah, I mean look, Bitcoin could also bounce back. Depends what happens with the US for the US markets tomorrow. Uh I think like it's slowly starting to pick up again. What 90 about 92.9 now. Uh gold will still continue going up. I think gold's got the the momentum for sure. Um it's likely to continue outperforming Bitcoin at least for the next few weeks, I think. >> Yeah. Yeah. Well, what with all this geopolitical uncertainty and madness going on, would you would you bet against it? Okay. Well, if you are feeling bullish or indeed bearish on Bitcoin um or indeed any other crypto for that matter, then uh you want a good exchange to be able to um to trade it on. And we can't think of a better one than Two Bit, right, Nick? >> Yes, exactly. So, this is a a large international uh exchange. It's got a solid interface, deep liquidity, competitive fees, and the onboarding is very super simple. All you need is just an email. Uh email and just an email. Just an email. Just an email, guys. You know, very and if you don't have an email, very quick and easy to get one. Um don't have an email. Just go and create a Gmail. Uh go and sign up. Scan the QR code over there or hit the link down in the description. Take your email address, sign up, and you can play around with it. See how it looks. If you enjoy the interfa, if you like the interface, and if you want to trade with it, do some demo trades, then you can go and fund it. And if you fund it, you'll get up to 90K in trading rewards subject to certain levels. And you'll also get a immediate VIP level one upgrade which gets you 50% off trading fees for life. >> There we go. >> Okay. Uh Nick, I'm going to give you an idea of what's happening in the sentiment. Uh Rob is there. Hello Rob. Um are you up early or am I am I seeing things? Good to see you anyway. When Moon, yes, that's what I'd like to know. Um a lot of people saying, \"Welcome back, Nick. How many kilograms did you shed? >> Oh, yeah, man. It was actually like 4 kgs. It's crazy. >> Yeah, it was intense, man. >> Okay, Nick. Uh Nick, the intense dieting. >> Well, that's not going lost muscle as well. >> Um uh Brett likes liked weigh in. Clearly, Guy does not steer away from the cake. No, Brett. I like to live my life. I like to enjoy life. I don't mind a bit of cake. In fact, the more cake the better. Um and I was wrong about Martin Luther King Jr. Day. It's actually Liz's birthday. Uh, the US markets are closed for today. Liz, >> so happy birthday, Liz. Assuming it it really is your birthday. >> I thought you been serious for a little second there. >> No, I'd like to remind people that it is not my birthday. That was that was a false rumor started recently. Um, I will tell you when my birthday is, but it's not today. So, happy birthday, Liz. And yeah, it's about time. US markets closed. >> Yeah, exactly. Finally recognizing the hard contributions of Liz. >> Yeah. >> Yeah. >> Exactly. Exactly. Okay. Um, so, uh, we will, uh, we'll have, we'll check in with the people in the comments a bit later on, but it's time, Nick, that we talked about, uh, the Clarity Kathuffle >> that went on recently. So, this is, uh, yeah, the Clarity Act, obviously, um, we had the Genius Act that dealt with stable coins that that passed last year, so everything was looking fine. The Clarity Act, which was much more about market structure, who gets to regulate uh, crypto? Is it the SEC or is it CFTC? This was the one that we were waiting for and it looked like we were getting pretty close. It was heading for a markup in the Senate. >> It was indeed. So this was all confirmed on Monday. Uh so David Sax confirmed that we would be getting a markup and Tim Scott as well who was the Republican on the committee, chair of the committee there also confirmed it. So it seems like the markets were getting excited about that. Mhm. >> Um and then what happened was uh of course on Tuesday uh the draft provisions started circulating but they realized that there was a bit of a loophole. Right. >> Yeah. So a po a so-called poison pill was identified and this is regarding stable coins. So the bill this new version of the bill proposed a ban on service providers. So think you know exchanges or what have you um paying interest or yield um to anyone you know who was just holding a stable coin. >> Exactly. Um and this is coming from the banking lobby the banking pressure. So basically the the report showed that the bank lobby didn't want to see any sort of deposit flight from their their checking deposits into uh these exchanges in terms of earning the yield there. >> Yeah. Now there were there were other uh aspects of the bill that weren't particularly uh attractive as well. Defi was um was particularly threatened as well. >> There was Yeah, exactly. DeFi developers. Yeah. >> Yeah. Yeah. So, there were a few basically this um this draft this new draft of the bill, it got into the hands of lawyers from the likes of Coinbase, Kraken, A16Z and uh and and other you know uh stakeholders if you like. They had a look through and yeah identified it was mostly I think that the real point of issue was this stable coin business but there were also some other problems with it as well including these uh restrictions on DeFi. Um so that led to that took us to weddings day and that is when uh Coinbase CEO Brian Armstrong um he tweeted out that basically Coinbase was not willing to support the bill. He cite he argued and I quote that it had too many issues and he specifically cited uh what he called the killing of rewards for stable coin holders. >> Yeah, exactly. And to be fair, I mean Coins Coinbase makes between 1 to$ 1.5 billion from their rewards program for stable coins. So it makes sense for them to oppose it. And he said, quote, \"We'd rather have no bill than a bad bill.\" So yeah, that's what happened on Wednesday. >> Yeah. So I mean, there are a couple of ways of looking at this, aren't there? that you could, part of you could argue that Brian Armstrong is sort of, you know, going into bat for the everyday crypto holders who would, you know, lose out basically to the banks on this. I mean because this really does reek of you know the banks looking to shut down any uh any hope that us plebs might be able to earn a yield you know because they want to you know they want to uh they want us to park our money in savings accounts that pay less than 1% meanwhile they lend it out at you know six or 7%. Um so they are acting in their own self-interest um which is not uh in the interest of crypto holders. You could argue that uh that Brian was coming out in support of crypto or uh you could argue that he was sort of defending Coinbase's interests as well. I mean, you could also argue it's possible to do both, right? >> He was doing both. And to be honest, why should he relent? I mean, we've spent years trying to fight the banks and now to just basically cow out the line. Anyways, that on Thursday, this led to the delay of the bill. Chairman Tim Scott officially postponed the markup. Um and he as he realized the bill was no longer had the part bipartisan support it required. >> Yeah. >> Um so yeah. >> Yeah. And obviously this is you know this is important. Congress is is fairly is kind of fairly evenly split down the middle. So this is not something that the Republicans would just be able to force through on their own. They need I think it was at least seven Democrat votes uh in order to get it through. So um yeah. So it very much stalled out um thanks to Brian Armstrong Coinbase. The Democrats uh then had a call uh on Friday with various crypto industry figures. Yeah. >> Um to see if they could find a way around this. Uh Donald Trump uh in the meantime was not happy. This is according to Ellen Terret who's done some great uh reporting work uh on this and you know other aspects of crypto in the past. Um the White House is said to be furious with Coinbase's quote unateral action. >> Yeah. She also says that this is um that Trump accused Brian Armstrong of quote rugpulling him which I thought was kind of wild. You know the president of the United States is accusing the CEO of Coinbase of rugpulling him. What stage of the cycle is this? >> Speaks speaks the lingo at any rate. He speaks our language. >> I mean Trump accusing people of rugpulling. >> I mean that is that is there is a fair bit of irony there, isn't there? Um but uh Brian Armstrong um kind of replied and said uh you know um they are working together to to kind of figure this out. >> Yeah, they are. So that's going through. Let's see what happens this week on on that out on that um front I think. So what happens now? I mean there's a few outcomes. The one is let's assume it doesn't pass hypothetically. There's no bill or anything. We then we just go back to I suppose the SEC first strategy. I mean look the SEC is still pro crypto. There's the whole project crypto. There's the innovation exemption. >> So many people would then just be back to the SEC and you know working with the CFTC on and with rule making instead of basically a legislation. >> Yeah. Yeah. There's also uh the the possibility that we could get a focused stable coin only bill. So um lawmakers might decide to strip out all the sort of market structure stuff which seems to be a big sticking point um and try to basically just pass something focused on stable coins only. Um, and that could involve revisiting the framework of the Genius Act. >> Yeah, exactly. I mean, that seems like could be the most likely to, you know, get the support because it is a very complicated bill. And remember, there's not just this. I know there's also provisions for DeFi developers >> and two other senators um took issue with that because from from compliance perspective, those particular DeFi developer protections. One of those was Senator Chuck Grassley, >> right? And he is he's the oldest senator. He's the longest serving. He's been there for 45 years and he's 92 years old. >> Wow. >> And he's out there opining on DeFi regulations. >> I presume he's not exactly pro. Is that being terribly agistious? >> No. No, he's not pro. Of course he's not. Come on, bro. Yeah. >> I ain't got no time for this DeFi stuff. I don't like it at all. >> I'm 22 years old and I'm I'm now I'm so forward thinking with DeFi. this new technology which is going to allow the the plebs to control their own future. No, we can't allow that. >> We can't have these kids nowadays doing this funny money stuff with their computers now, can we? Would never do. >> Exactly, man. Jeez. 45 years, man. Okay, but anyways, >> the gerontocracy in uh in in full flow there. >> If you want to hide your crypto from Chuck Grassley, man, then you just you just got to get a hardware wallet, man. And I couldn't think of a better place than on a tandem device. So there we go. >> Absolutely. This these are certified chuck proof. Okay. There is no way Chuck Grassley is going to be able to figure out how to get it off of it. I don't know. It's just a car. >> I don't think Chuck Rossy's moves to credit cards yet. He still >> I still write I still write a check to the grocery store every week when I visit. I don't see nothing wrong with that. Um yes. So, if you want to protect your crypto assets from the likes of Chuck Grassley and his fellow non-aggenarians and get yourself a tangent wallet ASAP, scan the QR code. You know, Chuck won't be able to. It's just it's just shapes to him. Scan the QR code, you'll get a 10% discount. Bish Bosch, as they say, job done. >> There we go, guys. Pick it up. >> Yeah. Um, okay. So, that was the uh we will we will be talking about the Clarity Act more uh in the future, I'm sure. I I mean, I I think I I'm kind of with Brian on this one. No bill is better than a bad bill because if it was to go through like that then then then that's it. >> They're sticky man. Once legislation goes it's sticky, right? You know remember the Patriot Act, the ACA, all of these once it's done it's done. >> Yeah. These there's no back on these things. So I kind of feel, you know, although it's frustrating for a lot of people and although Brian Armstrong did come in for a lot of flack from it, I personally think, you know, you got to spend time to get this right otherwise we'll regret it. >> Yeah. Exactly. One thing that we don't regret though or that I can't really find anyone regretting is uh the the passing last week of a crypto one particular crypto sector. Uh it was basically taken out the back and shot like a like a like a moldy old dog and that was Infoi. >> Yeah. Rest in pe. I'm sorry. Um, yeah, to be honest, I think not too many people are, you know, busting out the the the the concerned about the death of Info Fire, let's be honest. Um, so these were a lot of the AI slop replies you'd seen on Twitter these days had been followed been with the Kao yaps snaps programs for cookie and all of this. And it seems as if that would have been the large uh large incentive behind a lot of the the slop replies. Yeah. So, this started uh as so many of these things do with a tweet Nikita Beer who is head of product I think at X um and who has very much become a crypto main character over the past over the past couple of weeks or so. He tweeted this out. We are revising our developer API policies. We will no longer allow apps that reward users for posting on X aka infoi. So, basically revoked API access. And obviously that means that these apps can't gauge engagement. They can't reward uh people for that engagement. >> Can no longer track tweets. Exactly. And also distribute the rewards. So this of course caused an immediate collapse in the price of both Kaio and Cookie, the two biggest info projects out there. >> Yeah. >> Um Yeah. And they responded quickly, right? >> Yep. Kito basically sunsetted uh YAPS um and these incentivized leaderboards. Um there's uh the the founder Yoooo um speaking out and Cookie uh announced the shutdown of Snaps. So it's goodbye to Yaps and Snaps. >> Yeah, there we go. Uh now I think there's many things we can take from this. I think the first and most important is not just I think for for projects in general but any business or any description is to it highlights that if you have a centralized risk in one platform in this case access to an API the Twitter API you run a massive risk and you're a DeFi web3 project that is kao or cookie right trying to incentivize creators in the web3 community to to uh tweet or do whatever you're a defi crypto project but you rely on a one single endpoint which is Twitter's AP PI. So it was a massive risk to begin with and it seems as if they got knocked by it. So yeah and and I think this is for businesses in general. They should consider it like if you're using one platform or anywhere streaming to one platform using one social media network you got to increase you got to divers diversify man. >> Exactly. And that's why we are streaming to Twitch today among the shout out to the homies on Twitch. >> Yes. If anyone's watching on Twitch can you let us know that we got one Twitch watcher there. are um almost catching up with our Facebook audience there as well. Fantastic. >> Um but yes, you're right, Nick. This uh this did kind of underline the fact, you know, it's all very well being a DeFi project or decentralized in whatever manner. But yeah, if you rely on one particular source for your for your income, um then you are a little bit screwed when they pull the plug, which is exactly what happened to Infoi. And I mean look the there had long been a back I mean I think the backlash to info started about five minutes after these products sort of hit the market didn't they because everyone suddenly noticed that AI slop you know in particular comments and stuff but I mean there were plenty of actual creators kind of posting slop as well in order to farm this stuff. Um, but yeah, it kind of it really degraded the uh the crypto Twitter experience, which let's face it, wasn't wasn't exactly wasn't exactly wonderful in the beginning. >> Shakespearean leveling tweets out there, I'm sure. >> Yeah. I mean, it it managed it managed to make something that was fairly unpleasant anyway, even worse, which is quite an achievement really. >> Yeah, really it was. Um, so what does it mean for Infoi? I think that some people have said potentially, you know, I I saw an interesting tweet out that says the one time we really needed Farcaster. Everyone's know everyone's off of it or left it already. So the Farcaster came and went too quickly because yeah, I mean that could have been that was supposed to be the decentralized cryptocentric uh social media network, right? Which, you know, >> I think it's a for me like as I said, you know, it should be fairly obvious that I wasn't uh wasn't exactly a fan of it. I must say though like I I think it's a case of don't hate the player, hate the game. like you know I think it is kind of sad in a way and I don't want to be seen to be kind of gloating over the fact that these you know the likes of um Cookie and and Ka have had to shut down because you know there are genuine people working on that to try and make it a good product and it was an it was an interesting idea like they were trying to do something they were trying to achieve something and I don't think it's you know all that fair to to necessarily you know dance on their grave so to speak but I think it kind of shows that It exposed a big problem that that isn't unique to to crypto. I think you know this idea of kind of relying on the attention economy you know in an age of AI that is going to that is going to attract slob. >> Yeah and that's true for sure. Um but I think it's also just like the quality of the attention I think that they not need to think about new metrics for that and I although these projects it was a big big knock for them. I know that Kito has released they had been working on a broader diversification and they've rolled out a new dashboard. So, you know, it's not dead just yet. So, I think it could come back. I guess the most important question now, guy, is is uh is crypto Twitter back? Are we back? >> I mean, if you if you take a look on crypto Twitter, then the answer is a resounding no. >> We are not sentiment on crypto Twitter continues to trend downwards. In fact, I mean, I've uh I I usually just put the um following tab on. I never if I put the because I noticed that they'd switched uh automatically to the for you for you tab. >> Oh, yeah. which was like opening the gates of hell. But they seem to have switched that back. But when I when I logged on to it this morning, for instance, all I could see most of it was just uh some dude in the NFL throwing an absolutely insane pass. I was like, what has this got to do with crypto? A lot of crypto people. >> How are you lucky to have something like that on your feet? At least it's not death and destruction, you know, vive coding nonsense. Although I mean there was lots of vi coding slop as well, but uh yeah, I mean I just you the first couple of minutes of my day would just seem to be watching this this American footballer throwing throw an absolutely incredible pass. >> Yeah, it was what else was on my feed as well was a lot of talk around uh the rally in gold. Speaking of which, guys, if you're thinking about buying some gold, you know, we love our gold. It's gold. >> Yes. >> Then uh Yes. Well, BitGet, our our third brand partner, the BitGet are in gold now. >> Yes, exactly. Well, you can actually go obviously there's many ways you can buy gold, but but one of the easiest ways if you've got Bitcoin in crypto is to use either tokenized gold or go and invest in tone gold futures on a crypto exchange and one of these is of course bit. um to swap the bitcoin for tokenized gold and other assets doesn't not only gold but other tokenized assets as well and this is all through their bit bit trady functionality and features. Uh so you can now trade directly with USDT up to 500 times leverage not going to get that in your traditional brokerage account. >> Okay just you know set your stop losses accordingly and try not try to be careful >> but also enjoy deep liquidity and low slippage. >> Fantastic. Fantastic. Okay. >> And scan that QR code there. You'll also get up to 50K in sign up bonuses as well if you scan that QR code link down below. >> Yeah, >> I guess. Can we just go back to that previous slide? Um because someone's pointed out something interesting here. There we are. Nick, >> I think I think that is more than achievable. That is uncanny. Well pointed out smoking the pancake. Exactly. Nick loves gold. >> Okay. Um we uh we need to we need to look at some TA with Lewis. Right. >> Let's go. Let's go. Pull it up. >> What's going on, guys? Okay, first off, glad to see you're back in action, Nick, and back in the studio. Um, I'm sure all of that food poisoning must have really sucked. And speaking of things that suck, let's look at the price action of cryptocurrencies. Sort of joking, sort of not joking. Um, there are a few things though that did caught my eye or catch my eye um that actually do look pretty good while most of the market, you know, has sucked essentially. And so I'm just going to jump right into that. And so the thing that looks good to me, um, is actually Cardono. If you look at this first off, we'll go onto the weekly time frame and you could see that back in 2024, this marked the bottom of Cardono of the price and actually if we zoom in just a bit, you could see that there was this candle right here. This was a long wick bullish candle that essentially formed the bottom after this one, right? And now if you go over to where we are now, look at this. We have a long wick bullish looking candle within the same zone where the last one had. Of course, this one is uh you know higher up, much higher up uh compared to this. So, yeah, we probably are going to end up coming back further down. And I do ultimately want to see us sweep the low of the October 6, you know, crash, which happened with most cryptocurrencies, right? I want to see us sweep that low on almost everything before I go really, really heavy. And what I like to do personally is to look for these long wick bullish candles inside of these particular zones. I like to call them ideal buy zones. And you know we are getting one if we go down into the lower time frames. We go down into the 12 hour. This is about to close. So we have this and uh yeah I'm I would not mind longing this and longing some Cardano and you know putting a stop right around 33 or 0.336. I think that's a pretty good stop loss. or maybe if you want to be a little bit more conservative, you know, 0.326. But regardless, I like the way that this is getting set up right now. So, this out of everything that I've seen, I like Cardano the most. Most things though, if I go into the uh actual charts, I'll click on a random one like Pepe. You could see that, you know, it had this long wick bullish candle, but it's in the middle. It's not, you know, down here at where the support is like it is with Cardano. Um, one thing I did see was XRP. I love the candle, but I wish that it happened down here at around $1.85 instead of at $1.97. If it happened down here at this big support area, you know, where I'll just I'll just make it a big green box right here, that would have been I would have automatically went in, right? But it's pretty it's still pretty high up, which makes me think that's probably going to continue to roll back down and maybe have a sweep of this current candle right now. I'll do one more example, though. There's uh hype. I do like hype because, you know, exactly the same thing that I was just saying. Nice long bullish wick, close enough to the support to where to me it looks good. Um I'm still not like super bullish overall, but these are my type of trade setups. So, if you want to get into hype, if you want to get into Cardano, those are all things that I'm looking to get into with a stop-loss underneath the lows. And so, yeah, that's going to be it. And hopefully we get some moves up. >> Okay. Thank you, Lewis. Um, apologies, folks. We YouTube appeared to have made the stream private for a couple of minutes there. Not quite sure what's happened. Um, but uh I mean you will be able to watch it back um on uh on catchup, but uh yes, a few people um Sly's watching on Twitch says it's my fault. So, yes, I take full responsibility. It was my fault. I'm sorry. I don't know. I don't know what YouTube is doing there. Um we'll have to we'll have to talk to YouTube. So, apologies for that. But it looks like uh we're back and so that means we should look at some tweets of the week, right? >> Tweets of the week. Exactly. And let's bring it in. There we go. >> One. Fortunately, this happened last week. >> Yeah. Well, okay. So, I think this was we didn't really have time to cover this on last week's stream, but yeah, Eric Adams, former mayor of New York City, um launched >> literally three days three days or like a few days after leaving his post. Yeah. >> Yeah. had just left um because obviously Zoran Mani's taken over now. Um so he launched a launched a token to supposedly fight the rapid spread of anti-semitism and anti-Americanism. Um and then uh pulled all the liquidity >> right his community. Yes. $3 million. Yeah. I mean all in the good the fight. I don't know if that was meant to What? Okay. But I think I mean I think you tweeted about this earlier today or something like literally no one has talked about this since it happened. It's it's like we all just went yeah that's crypto and moved on >> per as per usual an ex mayor ex public official but to be honest do you really blame them? I mean you had Trump coin Melania and like the president of Argentina the an entire country the Central African Republic rug people and you're telling me that they're going to care about it? >> Nick you sound way too jaded. You almost you're almost just saying ah just let him just let him cry. >> I'm just saying people are like you know first of all whoever bought the N buy NYC token I mean for the for the two people who did it because they really wanted to fight the spread of anti-semitism I feel for you. I'm sorry you were rugged but for the other 90 you know 98% of the people who bought because they wanted to make money on it you know you deserve to lose. >> Okay Nick's taking no prisoners stay he hasn't been the same since this food poisoning last week. That was a cathartic moment. >> A harder, less less it bulliant Nick has has returned to Coinbau, folks. I don't know what to tell you. He's just he's taking no prisoners at the moment. Um, next up, uh, we have this tweet from, uh, Doug A. McGregor. Um, this is wild. >> Listen, you crazy, eh? So, yeah. The Bank of England told to prepare for a market crash if the United States announces alien life. >> I mean, that Okay, >> that's another thing you guys have got to worry about. No longer is it Trump's tweets. No longer is it like liquidations. No longer is it a whale dumping on you. It is alien life. >> That would uh that would take our bites off Greenland, wouldn't it? It' be like we we would we would just be wanting to go back to green the whole Greenland thing if although that does assume that you know the aliens would be bad, right? >> Yeah. Yeah. Be not that benevolent aliens and maybe you could go and show them Bitcoin. Like guys, you can It's like it's like the gold the actual silver. It's like that actual metal that you can buy and you can use it in your spaceship except it's digital. It's way way cooler. And they'll be like, \"No, I'll just take the physical gold, please.\" >> Yeah. We just We've been watching Peter Schiff. Do you know him? We think he's pretty good. >> Take me to your leader. >> Yeah. >> Look, there could be, you know, these aliens could be good. They could be hovering there with uh nuclear fusion and all that sort of stuff, you know, cures for all these diseases. So, it doesn't But yeah, that that was pretty wild tweet. I mean, would you bet against it? We just seem to be living in those sorts of times now, don't we? It'll be the least strange thing that happened to be honest. >> Yeah. Okay. Uh next up we have this uh this one here. Oh, so this is the this is the IQ. Yes. The the world's highest IQ person. >> The world's highest IQ person with the most takes. >> Um I think he's I think he must be trolling or I mean he's he was out there also saying like XRP to 10 or something crazy. I mean >> but >> well I mean it needs to be at 10,000 this in the white paper, right? You know I believe so. Yeah. So that's what needs to happen for Ripple or for XRP. But yeah, he came out. He said it's going to rally. It's going to rally Monday. I will I will prove it. And um I was like, it's crazy the amount of engagement he gets. But yeah, he was wrong. He was wrong. >> Yeah. >> So maybe he's trolling or maybe uh you know, he's talking about something else. >> Just goes to show having a high IQ doesn't mean doesn't mean you necessarily know everything, right? >> Yep. Indeed. >> Okay. And we also have this one um from blockchain chick. Heidi. >> Heidi. Stop using Ledger. Stop using Trezor. If you really want to keep your seat phrase safe, write it on Epstein's client list. >> Cuz that shit's not ever seen the light day again, bro. That's hidden below all the gold bars and go in and Fort Knox. >> Oo, that is a spicy tape, isn't it? >> There we go. >> There we are. There we are. Round of round of applause for that one. Um, uh, yes. Well, let's see what YouTube makes of that. Okay, that's what Yeah, that's one way to keep one way to keep it quiet. Good grief. Let's move on quickly to some dates for the diary. >> So, uh, tomorrow could be some ruling on the long awaited tariffs potentially. We'll have to see. Um, and then on Thursday, we've got the PCE numbers, the Fed's preferred inflation measure, as well as the first GDP revision. >> Mhm. >> And then we also on Friday have the BOJ rate decision. They expect to hold it at 75 basis points. Uh but watch for some potentially hawkish guidance on guidance on wage growth and a surprise hike or or hawkish tones from the BOJ. >> Okay. So we got to worry about the Bank of Japan again. >> Exactly. Or though I did see news. I don't know if it's true but the Yeah, it is true because we tweeted it. But um of course it's true or we all we are the single source of truth guys. The Japanese prime minister just called a snap election. >> Oh really? Okay. Well, maybe that's uh because she's worried about the aliens and she feels that she needs a mandate in order to engage with the aliens. So, >> so she needs more control of the Yeah. her party. >> Do you know my Do you know just going back to aliens because I know this is what people really want to talk about. My theory is that actually aliens are out there, you know, have been out there for a long time but are deliberately avoiding us because we are so awful. >> I think that's true. I think it's possible, man. Definitely. First of all, statistically, there is life out there, right? Think about how expansive the universe is. What was the one saying? It's like there are two realities realities which are entirely shocking. One is that there is alien life out there and that the other is that there isn't. We're the only, you know, living beings or whatever it is given how expansive the universe is. But yeah, they exist. They're out there. They've looked at us through the telescope. They've seen exactly what's going on with Greenland and all that. And they're like, \"Actually, they're going to probably nuclear planet in the next 5 years. So, let's wait until the nuclear winter come.\" I Yeah, maybe. I I think they're just observing us as an as an example of how not to do it. >> Yeah. >> And, you know, alien children are there on, you know, their planet and they're seeing us as a case study and they're like, \"Look, children, this is this is how not to run a planet.\" >> Exactly. >> You know, they've they've now gone and invented something called cryptocurrency. And >> I mean, really, let's just So, I think they're just giving us a wide birth. I think we're staying well out of our neighborhood. We're like the uh we're like the dodgy house at the end of the street that everyone avoids. >> Yeah, exactly. Yeah, just wait for us. It'll take care of itself and then they can come and pick up on the spoils if there is anything left. >> If there's anything left. Yeah. Once once we finished with it. Um okay. So, uh yes, it looks like it's going to be an eventful week then. >> It will be. Exactly. Uh today the markets are all for the US, but tomorrow they're back. We'll have to see how it opens up in the US with uh stocks. It seems like they're looking a bit soft in Europe, the stocks as well. Mhm. >> Um, gold's going to continue hitting highs, I think. Um, >> okay. Bullish gold. >> Aliens with cures. >> Oh, that is actually true. That would be great. Yeah. Aliens with cures for medical conditions. >> Yeah. Well, yes, but the ones that we don't have. Well, is that medical conditions that we don't have on Earth? So, they'll turn up with a whole load of new diseases. And it's like, don't worry, we got the cure. We didn't actually have them to start with. >> We've got a blanket for you. It's got a bit of a new smallox disease. Please accept our >> except these except these blankets and beads. Um, yes. Well, we couldn't say we couldn't complain. We hadn't been warned, could we? >> You want to go to any alien movie? Have you seen the new Avatar? >> No, I haven't. >> Watch it. Yeah, it's good. Yeah. Yeah. Okay. >> It's three hours long, but >> that's a bit much. I don't know if I can be bothered with that. I did watch the RIP on which is not an alien movie at all. Ben Affleck, Matt Damon. Good old Miami sort of heist movie. It's really good. >> Epic. I like the way the stream has deolved into a into a movie >> movie recommendation. next week. Let us know in the comments. Should we just sack the crypto off next week? Just talk about Aliens and movies or Alien movie. Well, maybe we'll just talk about the Avatar franchise. We'll go back and just start with the first one and work through to this. >> Um, but h yes, we will be back next. We we will be talking about crypto. Um, and maybe aliens as well. Who knows? Um, how are we doing on the likes? Only 30 only 30% the way there on the likes. Nick, they're not that pleased to see you back. >> Oh, I'm sorry guys. I tried my best, man. I tried to bring my agame. just go back to eating oysters and lying in bed feeling sorry for myself. >> I'm I'm disappointed. Well, Nick, I'm pleased to see you back. Even Even if even if a part of you has died and you're now just you're now just absolutely pitiles, you know. >> I know. I know. >> It's good to have you back nonetheless. >> Appreciate it. It is what it is. >> All right, everyone. It's been great to see you. We'll be back same time, same place next week. Don't worry, Nick is off the shelfish now, so he'll be fine. He'll be back, too. Um, thank you all for watching. Keep an eye out for more content coming your way from all of our channels and we'll see you soon. >> See you soon, guys. CHEERS. >> POOR NICK. HE'S HAVING A SHELL OF A TIME. GET WELL SOON. It truly is selfish. Nick is being selfish today. NICK IS DEAD. CAT BOUNCE wishing quick recovery. We need quick feel. Stay hydrated. Get well soon. Getting well soon. Get well soon, NICK. FEEL BETTER, NICK. STAY HYDRATED. GET WELL SOON. GETTING WELL SOON. HONESTLY, I'd love to know who the first human was that discovered this like oyster under the sea and thought, I'm going to open that and that slimy piece of is actually worth eating. I mean, who actually who who thought that was a good idea? Like, honestly. >> Yeah. Well, why do they sell it? And why is it why is does it have demand such that it's expensive? Why would people actually relish that that food? >> Who knows? I do hear there's a good seafood place just open further up on the pond. If you want to check it out, we can go along. voice."
    }
]