[
    {
        "video_id": "p1SyN59mgFc",
        "title": "The Rise and Fall of Celsius in Crypto",
        "published_at": "2026-01-19T10:45:24Z",
        "sort_date": "2026-01-19",
        "url": "https://www.youtube.com/watch?v=p1SyN59mgFc",
        "transcript": "Celsius was one of the largest and most trusted crypto lending platforms, managing over $20 billion worth of crypto at its peak. But behind the scenes, it was building one of the biggest financial deceptions in crypto history. So, how did Celsius go from unbank yourself to bankruptcy and fraud charges? Founded in 2017 by Alex Mahinsky, Celsius branded itself as the anti-bank. According to Mahinsky, banks were ripping people off, paying almost nothing while making billions off their deposits. His solution was to unbank yourself with Celsius promising to pay users over 10% annual returns on their crypto, far higher than anything a traditional bank offered. The concept seems simple. You deposit your crypto, Celsius lends it out safely, and you share in the profits. But in reality, much of Celsius's model relied on its own token, Cell. Users could choose to earn higher rewards if they were paid in Cell instead of the crypto they deposited. On paper, it looked like the company was thriving. In practice, [music] Celsius was often paying out rewards using its own tokens. But the public didn't know that. Mahinsky repeatedly assured users that their funds were safe, hosting weekly live streams called Ask Mahinsky Anything. He claimed the company didn't take big risks and all loans were properly collateralized. And none of that was true. By late 2021, the cracks started to show. Regulators in several US states warned that Celsius's earn program looked like an unregistered security. Inside the company, the financial strain was mounting. Celsius wasn't generating enough revenue to cover its massive yield promises. So, it started taking riskier bets, including unsecured loans and speculative DeFi positions. Then came the 2022 crypto market crash. In May, the collapse of Tara and Luna erased about $40 billion from the market. Celsius had hundreds of millions tied up in Terara's Anchor Protocol, chasing its 20% yield. Although they managed to pull their money out before the collapse, the event exposed how fragile its business really [music] was. Confidence evaporated. Users rushed to withdraw funds, but Celsius didn't have enough liquid assets to meet the demand. Most of the money was locked in loans or risky positions that couldn't be unwound quickly. On June 12th, 2022, Celsius froze all withdrawals, swaps, and transfers, blaming extreme market conditions. The next few weeks were total chaos. Celsius laid off a quarter of its staff, repaid DeFi loans to unlock collateral, and brought in restructuring lawyers. But it was all too little, too late. Just a month later, on July 13th, the company filed for Chapter 11 bankruptcy. Court filings later revealed the full extent of the damage. Celsius had secretly spent over $500 million buying its own cell token to artificially support its price. It also owed over $1.3 billion more in rewards than it had ever earned in revenue. The examiner's report called its business ponzylike, saying Celsius had likely been insolvent [music] since inception. Investigators also found Mahinsky had gone as far as personally selling about $68 million worth of sell while the company was using customer money to buy it back. In 2023, Mahinsky was arrested for fraud and market manipulation. A year later, he pleaded guilty to misleading investors and lying about the company's operations and financial health. Then in 2025, he was sentenced to 12 years in prison and ordered to forfeit $48 million in illicit gains. Celsius eventually emerged from bankruptcy in 2024 with a plan to repay users. Around $3 billion in assets is being returned to creditors along with shares in Ionic Digital, a new Bitcoin mining company built from Celsius's remaining assets. And that's how one of the biggest crypto lenders collapsed. A harsh reminder of the dangers of handing over someone else control of your crypto and that high yields often hide high risks. Watch this video to refresh your memory on a terms."
    }
]