[
    {
        "video_id": "vEsCQF4t81A",
        "title": "DCA Live: Breakout failed, now what?",
        "published_at": "2026-01-19T17:02:00Z",
        "sort_date": "2026-01-19",
        "url": "https://www.youtube.com/watch?v=vEsCQF4t81A",
        "transcript": "It's Monday, Rob. The legend is back. Some people have some sniffles because it's that time of the year and the market is still controlled by the institutions. Where do we go next? That's the trillion dollar question as to what's happening. But before we jump in, links below for all these legends and we're all streaming to our own places. Rob, welcome back. How are you? >> I'm good. Thanks for having me back. Always a pleasure to come on. See you guys. >> Always. And we chat every day anyway about other things that are probably sometimes more important. And Marty, hanging in there. >> I'm hanging in there. No. Well, guys, but I'm here. We're here. >> Yes. You're not made of sugar. South Africans are tough. Very tough. And of course, CTO. Darkness. >> Hell of darkness, my old friend. >> But not only outdoors, not in here. is warm and cozy with cozy with France and markets. >> Yes, we we can judge the season, Rob, by the light and the time. It's almost like what's it the old I forget the name of the term, the clock where it's like the pyramid and you tell by the angle of the sun where it is. What's it called? >> Uh, pretty much >> brain fart. Brain fart. Anyway, let's get into the story. Um, and figure out a few things. This one's called barbell strategy. People are concerned what they should do and what their portfolio should look like. Should they have a little bit of this, a little bit of that? Should they think about, you know, old coins again and so much more. Uh, first of all, let's get into Marty's wheelhouse if you're prepared. A lot of talk yesterday about the coordinated dump. We found out about the tariffs from Europe hitting four hours before all the market makers decide to get on the horn and say, \"Hey guys, um there could be a way to abuse sundial.\" That's the word I was looking for. Thank you so much. There could be a way to abuse this low volume Sunday night and piggyback on the new latest tariff tantrum about the EU tariffing the US because of Greenland, all that craziness. And then there's a whole bunch of buy bits, Binance, Coinbase, Winter Mute, all dumped a whole bunch. Um, Marty, were you on top of this yesterday? And what is your thought regarding this? Was it a coordinated dump last night? Because we dropped $25,000 on Bitcoin in 20 minutes and we got below that key 93K level. And coincidentally, we just got above 93K again, which is good news because that for me is an important support level. Thoughts, Marty? You might be muted. Boom. Still muted. Okay. Marty, can you hear me? Marty. Uh, Marty, you're muted. >> Marty, you you're muted. >> Technology is awesome. >> Yeah. >> Now, can you hear me now? >> Yes, you're back. Good job. >> Um, I think it was what the interesting part was, it was exactly when gold pumped. So as gold moved up, Bitcoin dropped literally at exactly the same time. So supporting once again that Bitcoin is now priced in gold in my opinion. So that's that's what I think happened. When gold moves up, Bitcoin goes down. Um we, you know, I've been analyzing that the last few weeks. If you look at the Bitcoin gold chart, I think you get a much better picture of what's really going on. And uh I think that's what happened. But obviously we've been accumulating since November 21st and so a lot of longs have accumulated was half a billion dollars of longs were liquidated in that move. So once again cleanup crew is coming in before we move up. But more importantly we hold 90,000 and uh I think we'll move over 93 again today and move back up once again. Obviously they're all coordinated. It's all it's all planned. I think it's institutional accumulation. >> Yeah. and that 93k nearly has 800,000 bitcoin now. >> Yeah. And sailor nearly has 700,000 >> and this is to focus on >> we'll talk a bit about that institutional capture and the IBIT option trade putting a lid on things. Let's go to CTO next and let's have a look at where we are in terms of the charter roies. Any good signs there? I did say it was critical for us to be above 93k for 3 days. We actually made it for 5 days and six hours till last night, but it looks like that could be recaptured. >> Exactly. So, it's kind of a critical point here. We did have a breakout here or Tuesday last week and this looked very promising. It's kind of could discuss if it was a rectangle breakout or ascending triangle breakout. It was definitely breakout. But now unfortunately if price closes like it is now that breakout has retraced and if it closes below here this starts looking more like a wedge this diagonal black lines instead which more favors downwards continuation unfortunately. So we have to see a little bit how today closes but um I actually I did buy this breakout here uh but I closed it again today. So we have to see I feel it's more uncertain uh after these few days of decline since the breakout. So that's how the Bitcoin chart looks as such. Uh Martin, you said one interesting thing here about the Bitcoin to gold chart and let's bring up that as well. And as uh you can see here as just as Martin said like from November until now the Bitcoin versus gold price has been pretty stable actually. So um that has not changed so much. So while of course it's been in a downtrend since the summer basically when gold really started ripping while Bitcoin didn't. So uh yeah but it has kind of stabilized now the past uh two yeah past two months. So >> gold is gold is ripping now today as we speak too since Sunday. It is. It is. So, of course, it's absolutely spectacular in in itself and um yeah, just just a beauty to watch and silver, too. But I know that a lot of people here are only interested in Bitcoin while I think that you should be interested also in commodities. uh guys watching. It's a great um yeah diversification strategy and commodities are not boring because you can trade them with leverage unlike most of crypto which is very dangerous to trade on on leverage because you could get things like u this for example that you're actually right but then you got like the December >> death wick >> 10 death week where your entire portfolio gets is liquidated and then boom, it shoots back and you wake up and all the money is gone. And that doesn't happen in the same way as commodities. You're not we're not going to wake up tomorrow and gold was briefly at $50 and then back to $4,700. That's not going to happen in the same way as it doesn't. So, uh yeah, that's the thoughts on the Bitcoin price here. So, it's kind of important how today closes, but it better not close here. I mean, we also it's also a public holiday, right? So, the market US stock markets are closed, so there's more focus on Bitcoin. Rob, uh, longtime gold bug. I always recall you have your your little coin somewhere buried in your backyard. >> Very, what do you make of the gold action? And, and you know, you're you also have a keen eye on AI, and AI is so, you know, supposedly going to bring a world of abundance. And in a world of abundance, the only thing that matters is scarce resources being things like gold and Bitcoin. Does it perplex you that Bitcoin hasn't chased gold? And where do you see things going in this age of abundance and AI right now? >> I I mean it does make me wonder about why why aren't we the riskoff asset that we should be? Because I mean people who have studied Bitcoin know exactly what this is. There's a difference between you all know this scarcity versus finite supply. And when I when I take a look at this, I'm kind of perplexed as things start to move up. Now, of course, you know, Marty and CTO will talk about this on on the show. I watch it uh every week and they'll I mean, they'll tell you like these the uh central banks are buying, China's buying like crazy, and that's just pretty much how it is. So like when I see this and there's a narrative risk off versus risk on today there's a lot of things in the news mostly about Trump and tariffs and what's going on with the EU. It's quite entertaining and it's fun but it's all negotiations and when all this thing happened you kind of see which one is actually being being priced in as a risk off versus a risk on. And there's a reason why I hold both. It's because I don't know which way it's going to go. I don't know which ones of the institutions are going to buy and how much they're going to do and how much the public's going to do it. But the reason why I mean gold and silver went up was because they had it's it was all about momentum and it was all about um them deciding that the price was was going to go. So once once we lost that for Bitcoin that's why we're kind of right here just struggling around since October 10th. So it's all about speculation and momentum I think and that's why gold bugs are killing us right now. >> Yeah. Yeah, and even silver uh has been fascinating too, but silver has the industrial purpose and both gold, silver, etc., they're unprecedented moves. And many people believe copper will be next, >> the next precious metal because of the electrification of the world. AI and if people run out of silver, what do they do? They use nickel and copper as a substitute. And oftent times as well, all these three are mined at the same time in the same place. So it's a fascinating uh thing to watch. But we also have other things that are happening right now. Um, so we have the institutional capture thought, but the institutions came raging back last week out of the blue. It caught me off guard. I kept on saying we got to we're not going to move anywhere until the ETFs come back and we had uh $2.2 billion come in to the ETFs last week. Yeah, Friday was a little weak, but the rest of the week, those two record days, and they are the biggest days since October 3rd. And remember 1010 was the black swan of crypto. So all of a sudden institutions are coming back. And what's important to note, most important, Robert, I'd like your take on this. For every billion dollars the ETFs buy or sailor buys, the price of Bitcoin goes up 3.6%. If the money is flowing in, the price will not go down. And if the rate of clip continues, it'll take us to 102,000 to 110,000 in Feb, which is from ecoinometrics. Beautiful little analysis right there. So Rob, is this opium bring us back down to earth? Will the ETFs continue? Because we know all the big banks are coming all of a sudden, too. All the top eight banks either they're custodying for high net worth people, they're open to trading and the top eight banks control over half of all the money in this country. Thoughts? >> That's well that's the whole title of the video. The institutions are here. We've got data that backs that up. Marty's going to talk about it. CTO is going to talk about it and it's great. But uh there's only the institutions can only do so much and then there's going to be people who are going to dump on the sidelines and I don't know how how high open interest is but I believe that we just had a bunch of liquidations yesterday. So we have to like we say or it was been said recalibrate. So can institutions bring us to 102? I can see it but they got to keep buying like crazy. I think didn't Michael Sailor just buy today or yesterday? >> Uh he doesn't announce it because the stock market's closed. He won't announce it tomorrow morning, but he did say a big orange dot, which typically means big buy. And last week he bought 13.5,000 Bitcoin, >> which is a monstrous purchase. >> So another 13 and a half thousand whole coiners declined, >> um, as we say. >> Well, I think the smart money knows where they want it to be and they're going to keep accumulating. Then people will just kind of dump on the sidelines or get overleveraged and here we go. >> Yeah. and and Vanguard with their own fund, they purchased $500 million in Micro Strategy as well last week. So, something weird is going on. CTO, what do you make of all of this craziness? Are the institutions back? >> Yeah. So, I've kind of my mind is clear now what this what's going on in the market in the Bitcoin market. It's a change of guard. The old OG Bitcoin holders who bought Bitcoin or two strawberries back in the day They're now selling some at $100,000 which seemed insane probably at the time and the institutions the Black Rockck the stock companies they are buying. So there is a change of guard now and u it's not so different from an IPO. In the beginning, it's a few crazy misfits owning the stocks and then at one point there's an IPO and the institutions come come in and buy it. And um that doesn't mean it can't go up from there. If looking at like the Amazon IPOs or whatever, but it can be choppy for quite a period during this change of guard. you know, one group of people are cashing out, another group of institutions are are entering and it chops around there and it can chop around for a significant period of time. And I think that's what's happening. That's why it's kind of hard to understand why isn't it moving despite the institutional inflow and so on. And I think that's that's the simple explanation. And um at one point those guys are down exiting hopefully and um then uh if the inflow is still there up we should go. >> Yeah, long-term holders have completely hit the brakes on selling which is good news. That happened about 10 days ago. Um this is an interesting angle from TUK. How are you buddy? I think if I recall down in Brazil but from the UK. Um, whenever silver makes a move like it has done, it typically means something big in the world is about to change. And this move is historic. So, what is going on, Marty? Is it the AI asteroid that's about to hit the planet making scarcity scarce again? >> I mean, something else. >> I mean, unlike gold, silver has, you know, it's a it's a usable commodity. It's constantly being used. It's used in every electronic device, every soldering, every microchip, every everything, every car. So silver is an extremely, you know, usable utility commodity whilst gold is mostly just held 54% I believe is just in jewelry. So it's a very different asset. I think it's very much paramount with the AI revolution, data center revolution. I think silver is very much part of the technology cycle. Um, and it's been held down through commodity suppression for the longest time. We know the silver bugs have been screaming for five to 10 years about the same things we talking about in in Bitcoin right now, which is it's being suppressed, right, for accumulation. And I think that was let go. And usually gold and silver run first and and risk on follows after. So, we've got to I think we've got to just let it happen and see the blowoff tops on silver and gold and uh understand that that's part of the new world. We're going through a technocratic revolution. Technology is pretty much going to be the the driving factor of all policy going forward. And these are these are the raw materials to to make to reduce uh you know increase bandwidth and reduce latency ma's law. These are the these are the commodities required and so I think they'll they'll have runs. What I find interesting is if you look at the Bitcoin chart priced in gold very different picture to the Bitcoin price ch priced in in dollars. I think that's what people have to start to change their mind. They have to start looking at the world in terms of of gold. I think we're going back to a gold standard. And if you look at the gold um to Bitcoin gold, it's BTC BTC XAU. Um maybe you want to pull that up. CTL Lawson BTC XAU. And I did some research and 30 billion US equivalent a day has been traded on the IC on that pair over the last few months. So clearly whoever's trading Bitcoin in large in bulk is trading against gold. It's a gold and bitcoin trade. Um, which is really interesting. Also found it interesting. It's hovering around 21 ounces, troy ounces for a bitcoin, which is interesting givingven it's 21 million coins. >> And historically, it's bounced around 36 to 38, too. So, it's way off where it should be. >> Correct. >> So, yeah, super interesting indeed. And >> I still find it's mostly been driven by these three large overhanging things. Obviously, the Trump tariff ruling, which has been pushed back, um, and the Clarity Act. Obviously, we saw the tantrums and and political masquerading over the last week um and potential push backs, but I think those things are hanging over the market for absolute regulatory clarity. A lot of people sitting on the sidelines waiting for that. Um I did a lot of research as to what are the classifications going to be under the clarific clarity act of each token, network token. That's quite interesting. Um >> yeah, let's let's unpack that now because you stepped on clarity act. I'm going to go to Rob first though because Rob, you talked about this in your video recently too if I'm not mistaken. But Coinbase, Brian Armstrong, has been very vocal about the Clarity Act and all of a sudden a week ago, he pulled his support because he said it's very unfavorable to DeFi and tokenized equity terms. It's obvious that the traditional banks do not want any yield paid on stable coins because their gravy train is taking your money, paying you 0001% on every million dollars, nothing, and lending it out for six% and then doing it in a fractionalized banking manner as well. >> So, a lot of people, Rob, are afraid now this kind of mess within the Clarity Act, it's obviously been hijacked by the banksters. It could delay what we expected could possibly happen in 2026 out. Some people are even saying 2027, 28, 29 because it would require a full bill rewrite. What is your take on that? Because I know you talked about it on NFA as well recently. >> Yeah, I believe it was your your buddy Charles Hoskinson that said that uh we have till 2029 when this bill might get rolled out because of midterms and of course Democrats and Republicans. But what I one one of the big things I saw with this is is it's not that of course it got it's got sidetracked and bankers took over. That's what they do. You know this is this is their thing. This is how they control manipulate. Obviously the biggest thing I saw was how wrong I was about clarity and how wrong a lot of people were about this. And if it wasn't for a couple of key people talking and and me taking a look at the different posts, I'd have been like clarity act is great. And then when we when we we break it down and if you actually went through that 200 almost 300 plus page document, you could see that it was ban on stable coins. They're going to make DeFi essentially a NEO bank KYC and AML just like what you do right now with your banks. They want to do a ban on tokenized equities which would be you know ban on tokenized stock which is really going to hurt the entire world of what we want to do that and then giving the SEC more authority which essentially enforcement by regulation. So like these four things are huge and we were all cheering for it and it made me realize just how fallible people are and how we should be really you know taking a look at what is under the hood and go figure Brian Armstrong was the hero that we got and it's like nope I'm not going to do it and for me I got to you know stand up and say great job Brian and uh let's see what things move to. This is a blow for the market because we need this to go into place. But if it takes longer, it's better we wait and get this right because if we all know the government's not one to say, you know what, we made a mistake. Let's just let's just correct that right now in a whole new bill. That's not going to happen. You got to just go from this from the get-go and get it right. So that's the that's what I see. So people were pinning for 2026 pinning their hopes and dreams especially for an alt run uh tokenization of everything stable coins being processed by the Trons and the Salanas and the Ethereums. It was all a big play. Even Tom Lee was kind of banking on it for Bitine. Maybe that's why he's buying candy bars now instead. I'm not sure. We'll talk about that maybe later too. Marty, give us your view. We heard some great insight there from Rob regarding Clarity Act. >> How big of a poop is this in the Punch Bowl? I've been following this write up for a year. I mean it's since the beginning draft and it started out as a very clear I mean clarity the word clarity was intended just to simply um decide you know who whose responsibility is crypto is it a is it a security or is it a commodity and I think the clarity act in when Lumis first wrote it was basically just the definition of that. So basically is a is a network sufficiently decentralized if it's sufficiently decentralized has an existing ETF traded product trading it's a commodity move it to the CFTC if it's a security if there's some kind of investment agreement if it's an obligation between two people then it's a security it should remain with SEC and slowly over the years like they do uh like governments like to do they piled in all kinds of other things into the clarity act. In fact, they they piled in market structure actually >> when it was supposed to just be the Clarity Act. And like everything, the 95% of what was needed in the Clarity Act is now going to be unfortunately delayed over the 5% which is yield. And we all know the Genius Act came out the gates without yield. If you hold stable coin in your wallet, you're not getting interest now. Even though that is backed by an interestbearing financial vehicle, you're not getting the yield. So, we know that the Genius Act as it was written already took away retail yield for stable coin by just holding it. You have to stake stable coin to get yield. Um, so nothing really changed and in fact I always said it should be an amendment to the Genius Act to adjust the yield, you know, po situation, the characteristics of yield. That's a fight between the banks and the stable coin issuers and the Treasury Department. So all of the things that were added to the Clarity Act, I think just made it untenable. Um just like we heard. I mean there are lots of things in there that just don't make a lot of sense. The regulation of DeFi um and the the tokenized stock I mean Larry Frink the whole world even JP Morgan wants to tokenize everything. That's the future. And the wordage in there was too vague. It was too easily um lawyered up and and seen as an anti- tokenization. >> And the WF are pumping this narrative now as well. In fact, this is just breaking news from this morning. New York Stock Exchange develops their tokenized securities platform to support 24/7 trading. >> Absolutely. So, it looks like Treadfi CTO as a technologist. Trifi think, hey, you know what? We can build a blockchain. We can make finality 30 milliseconds, etc. How easy is it for them to do that? or are they just trying to push crypto out? >> I think they're coming from two perspectives. Like the win is so so massive for them. I think most people don't realize how complicated and bad the whole like stock trading systems are. It's a mess. It's a mess and it's garbage. And it still only works some hours during the day because then they need the rest of the hours to just sort everything out. It it's like I I was shocked when I realized how bad it is. It's like old systems that have been patched for decades and decades and decades. And then this technology comes along. You can just basically just tokenize it, put it on the blockchain and it just works and it works like 247 with no effort. You need like one guy who checks if there's any alarms and that that's it basically. And barely that if the code is correct, it just keeps working. It's like it's a factor 10,000 cheaper or something in that magnitude. Plus, you can get new new liquidity in because the crypto guys, they have been too lazy for the past 10 years to sign up for some other trading platform. So, they don't have the platform to buy the regular stocks, but they have a bunch of USDT sitting somewhere. So, it's both cheaper and they attract a new pool of money. Like the the win is is a no-brainer. It's it's a massive win. And then comes the second question, how to do it. Should they build their own blockchain? Should they use Ethereum? No, it's too expensive. Should they use some layer 2? Should they use Solana? And then they will have like 200 meetings about that and discuss the benefits of a private blockchain versus using a public blockchain. and uh that that debate will go on for a long time but I think at the end of the day it's secondary as we have said here many times at the end of the day the global protocols tend to win so even if they start with some p private blockchain they might switch over to a public one later because it is actually better at the end of the day they don't need to maintain it at all then >> interesting uh but that was something that many of us were pinning kind of our hopes on for the year. So the big question then next so maybe alts will not fly with the tokenization of everything which some of us believed would possibly happen. Then we have another situation right now people are wondering what do we do like some people are saying well crypto is not going to rally till 2028 now because there's no clarity act and everything is just garbage but should people start layering into stuff that is the billion dollar question. Uh there was a lot of a lot of the the opium gods are kind of giving price targets. We'll talk about one of those guys in a minute who's also a former gold bug. But a lot of people are asking uh regarding the barbell approach with crypto and alts. Do they have a shot at all in 2026 or should people just sit on their hands or pivot into AI etc or DCA into Bitcoin? And uh there was a cool chart. Let me remove this for a second and see if I can share this one. Uh share screen. Yes. Dan Tapiro, former gold bug. Uh he had a price prediction of $180,000 in 2026. And he's a very conservative TRDFI guy. Again, former gold bug. But he said something which is very strange which I did not see in my Bingo card. He said stable coins will be huge in 2026. Bitcoin's going to 180K easy because of global monetary fiat being in the poop and ETF flows. And then he said, \"For the first time ever, if you had 10K to invest, stick it into crypto, split 33% across Bitcoin, ETH, and Saul.\" That was not on my bingo card. Um, Rob, you you know, Dan, uh, what did you think of that post? >> Well, first of all, that's a pretty ballsy move to do for that type of prediction. I got to save that so I can do a video next year when uh, if I can say that he's actually correct or not. So far everybody for 2021 2025 100% wrong across the board. So hopefully Dan is right that that's I mean I'll I'll say that and then for for his talk and you know for your question is like you know should we diversify? Should we get into some other thing? Should we do something else? Of course it's all you know wherever people are at. Some people you know gold, silver, bitcoin that's it. Some people equities maybe a little bit heavy gold silver whatever. But for this one, like what Dan talked about as far as like Bitcoin and getting into altcoins, altcoin season's not coming. I hate to break it to everybody. I mean, for the majority of altcoins, they suck and they're worthless and they don't do anything and we need to get away from them. We need to grow up. And a lot of those just need to die. And I put my funds heavily into Bitcoin, real estate, some precious metals and equities. But if I'm going to do an altcoins, I think the the leaders for me are the best tokens. And the best ones are the ones that are supporting like Dan talked about the stable coins. And for the USDC and Tether Rail, there's 93% of all stable coins. What do they use? The best Binance, Ethereum, Salana, Tron. That's where I'm going. >> Yeah, I can't argue with that. I think the whole definition of an altcoin altcoin is changing. I think that word altcoin is a is a legacy word that needs to change. >> Yeah. There only there are only a few networks that matter are those are the ones that going to move move tokenized uh debt which is stable coin tokenized equity for the future markets tokenized real world assets things that don't move tokenization or on Bitcoin I don't think matter anymore and they're they're holding a they're holding over the market we need to get rid of them they need to go to zero >> I I'll see if I can blow this up this is a chart I'd like to keep an eye on especially you know pre- old season which we don't have one like Rob just put pin in that. But this is this is this is the distance from all-time high. And it's fascinating to watch. We saw Zcash, which was the winner of 2025, >> pumped wildly. Now it's 83% from alltime highs. And Monero was like the biggest rotation ever. There was some Dow stuff talk with Zcash and rebranding freaked people out. And then people pivoted their Zcash into Monero. Um, and now Monero is the only asset in the top 50 that's at an all-time high. Everything else, ETH is 36% from alltime high. Bitcoin 26% from alltime high. Saul 53% from alltime high. Cardano 90% from alltime high. XRP 46% from alltime high. But if you just imagine drawing a line across the middle of this, you know, across the middle would be 50% from all time highs. The majority are now more than 50% from alltime highs. So, you're right. It's been brutal out there for people pinning their hopes and dreams to an old season. That did not happen. But Marty and and Rob and CTO, what what do you make of this? Like 25 2025 was a lost year. All the prediction masters, the Tomies of the world. Um how many times did he say we're going to hit 160K by Christmas and then he pushed it out a month and I still hope he's right one day and he will be. But it's just weird. Um, Marty, what do you what do you make of this chart here first? >> Yeah, I think the most critical thing is what CTO said. The biggest uh, you know, people that hold Bitcoin, the OGs, have to get out of the market and I think they did at 100,000 and rightfully so. Why shouldn't they? Um, there's a new kid on the block. It's the institutions and they have a different uh, you know, they're not just speculating. they have use cases in mind and that is to transform the entire financial market to tokenized digital rails and they're doing that. Um things that aren't being used at this point in 2026 at this point pivotal point before clarity and market structure are in law um things that have low TPS low adoption are are a problem. They need to go. So I'm not opposed to these all-time lows. I think uh these things need to bleed more. I think uh the speculative nature of the market needs to end and we need to move more to a fundamental valuation and so I'm all for it. I mean I personally hold you know Bitcoin, Salana and Sooie because I believe those are the three uh best technologies to serve the use cases of the new crowd which is the institutions and uh the rest you know I've never quite understood why people hold on to them honestly. So, I see it as normal. I think this is fine. This is what should happen. >> Um, I'm not I'm not going to buy these lows of these things that don't have users. >> If you don't use if you don't use it, don't invest in it. >> Follow the money, follow the adoption, follow the transactions, follow the builders, the developers, and look at the breath of DAPs on the chain that are being used. And we're seeing some crazy stuff now happening uh CTO with prediction markets. All the prediction markets going on chain ahead of tokenization of stocks which is fascinating and the volumes are getting pretty mad and people are it's it's as if people are degening it a different way before they used to maybe per crypto or do whatever buy altcoins now they're day trading uh sports events interest rates politician elections war crazy stuff. What do you make of the prediction markets going on chain so fast? >> Yeah, I've never really gambled on the prediction markets. It sounds fun and uh it's fun to watch, but uh I haven't actually tried it. So, um I don't know if you can consistently make money on it or not. Coming back to the altcoins a little bit, I think the mistake that many people have done over the years is that they have bought some altcoin on u know some meme coin on great fundamentals and uh then they've hoarded it minus 99.9% and uh then sold it. So I can say this like seen statistically over the years the strategy to hodle walt coins hasn't been successful on average but I it is often possible to trade the narratives but it's pretty difficult that's why it's it's like it's not easy to give easy recommendation for everyone here because it it has at least for me been possible to trade these old coins. But it needs like an active approach, not just buy and then you know close the computer and come back a year later and collect the money. That approach hasn't hasn't worked so well. You need to be active uh when it happens. It's more like um yeah, I don't know. It's more like a game >> because it's hard to it's hard to say what is the actual fundamental value of an altcoin. Like you can't say that you cannot find the fundamental value in the same way as a stock. Like a stock has a floor price because if if the share price goes below a certain number, someone will come and buy the whole company because you know it's it's worth something. You you can actually you you can run financial ratios now on blockchains. You can calculate price to sales ratio for Salana or Ethereum or anything Tron for example Binance you can also do PE ratios based on how profitable they are and if you look at the whole ecosystem sometimes they become very very compelling when you look at the money made by Jupiter and others it's very powerful uh so but it is different. Yeah, James, I think you put out I and correct me if I I remember this a long time ago. You put out like like uh the transaction fees per transaction and the relation to the price of that specific altcoin. I think it was like like Salana was like crazy high, but then you looked at like Cardano was like 100 100 times more than what that was. And is like are you talking about that or you talking about something else? >> Well, there's many different there's like 60 different ratios you can run on a blockchain. But for example, with a couple of the basic ones I like are the market cap divided by daily active users. So you get the actual market cap allocated per user. Uh Ethereum is quarter of a million dollars. Cardano is 20 million bucks. Salana is about $1,000. >> If you look at the transactions market cap per transaction, it gets even wilder. And that's what's really interesting. So, and then forget just looking at the revenue made by the DAPs and the chain too. But there there are ways to value these things. And I do believe like we had in 2025, we had the privacy revolution. Why that happened, I have my theories, but people are very worried about obfiscating their wealth from authorities. That might be a little bit Orwellian. But in 2026, I still believe we could see huge adoption not only on stable coin transfers, the whole payment narrative, uh different type of trading is coming back and that would be prediction markets. There'll be a lot of that and maybe you know you got your Robin Hoods tokenizing and things like ETH and money market funds on Bidd, which are now multi-chain. There's a lot happening all at the same time. And I think 2026 could take people by surprise, but we do need that clarity act before big money comes in. That's what's holding us up. So, any thoughts on my little rant? >> I mean, I think people don't understand. It's very hard for people to understand why stable coin and tokenized everything affects the tokens. We're talking about the networks. Why does it increase the value? What should I do? How do I trade that? I don't think people understand that the value of the stake of the network increases fundamentally based on the volume and the value stored on that network. So as they increase a stable coin volume on a network as they as companies issue tokens on that network tokenized equity real real world assets etc the stake to secure that network increases. So how do you trade this? you buy and hold stake, you accumulate stake like the institutions are right now. So what you want to look for is networks that are being adopted by regulation, regulatory bodies, sovereign countries, institutions, um the the institutional world and and we know what they are. They they're the regulated networks. Um Bitcoin, Ethereum, Salana, XRP, SUI, these are the things that are regulated. They have ETFs. Even Hyperlquid has treasury companies. There's there's ETFs coming. The rest really is just speculative. That was it's it's done. The speculation stage, I believe, is over. Um people are married to those coins. They got to get over that. It's not going to happen. So, you need to watch for I agree with you. I think 2026 might catch people off guard because it's all about volume and adoption. The fundamentals are coming back. We're seeing new metrics. Um, and then don't forget we just got Morgan Stanley, right? They just issued um they applied for three ETFs. People don't talk about that either. Morgan Stanley just got involved. JP Morgan is getting involved. Banks are getting involved. Why? Because they want the efficiencies of blockchain. So that increases volume, increases adoption, increases the amount of value on these networks, which will increase the value of securing the network, the stake, the native tokens. And uh like I said, I did a I did a quick study of of the classification under Clarity Act currently of current networks. And you'll be surprised there's only a handful. There's under 10 um tokens that will be classified as commodities under the CFTC. And uh you know, obviously those are the big ones, but the the list is very small. The rest will all have to reclassify as securities or or try and fit into something else. So there'll be a big shakeup. I think this Clarity Act is not just another regulatory thing. This is a pivotal moment in the history of crypto and that's why it's so hard to pass. That's why it's there's so much you know infighting that so many lobbies involved because it affects pretty much to me the intrinsic value of crypto. I think we could 2x on clarity act passing in in whatever form it passes. And so, you know, it's a very tense time, but I think that's what's holding us back in my opinion. And it'll it'll happen. Um, who knows when? Will it be the whole year? We'll have to wait. Will it be fast? I know David Saxs wants to pass it very fast. I know obviously China has made stable coin yield. They've jumped in. They've said, \"Oh, the US is uh taking their time. Let's jump in.\" They offering stable coin. If you hold digital one, you get you get yield. um if you hold digital dollar you don't get yield. So there's competitive action. That's why the Congress is pushing. They need it hard. They know that they need it. But uh there's a lot of industries involved guys. I told you they'll fight like dogs. This is uh this is the penultimate moment for crypto. The clarity act in my opinion >> the banks will die on the hill to protect their gravy train. No doubt. This is some more stats uh Rob that you were kind of interested in. But it when you look at the bifurcation between >> the amount of market cap per transaction done every day, you've got a whole bunch of chains like Aptos, uh, Near Protocol, SE, Salana, Optimism, all under $1,000 of market cap per transaction. And then you got XRP, $64,000 per transaction. >> ETH, 200,000. Cosmos, 67,000. And I took off um Cardano because their transactions have really fallen by the wayside. So that skews everything. You can't see anything else. But this is also an interesting view of the world. >> That's a very revealing. >> The the adoption is back. The number of transactions are up again. The number of users are up again. We went through a dead patch the latter half of 2025. That's all creeping back. That's positive for the space. And hopefully we can get to a billion crypto users sometime soon. And that will be extremely good too. So let's get back to our story. Uh not this remove this. Hold on. I got to add and remove little bug. Okay. There is a thesis that the institutions have captured things like the upside of Bitcoin price action with options. Uh you know global there's a ton of liquidity. You mentioned Marty the interesting pair chart between gold and bitcoin. There's somebody trading that pair heavily, billions of billions of dollars every week. And the option action across things like IBIT are huge. And of course, IBIT is the biggest money spinner now for Black Rockck from a fee perspective, but also on the options side. So, the market makers are making a killing on options as well. Anybody want to take a stab at could this institutional capture be keeping a lid on things? Has Cris crypto been lost to TRFI? >> I mean I I do think some people have that opinion. That's the that's why Monero, Zcash and so on have gotten a narrative and some other like contrarian coins like if you look at Bitcoin cash versus Bitcoin, it has gone up the past half year and so on. So I do think there are some like OGs who feel like oh no the institutions have taken over now and it's all it's all you know taken over by the people we were fighting fighting against a little bit and then comes these contrarian narratives but um yeah in a way they they they are they have taken over so it's just a fact it is like the IPO of Bitcoin it is selling selling out to the institutions and uh yeah that doesn't mean it can't go up. >> Yeah. >> But if you're if the people are here from like a uh yeah from from like a philosophical perspective more that it's uh us versus the institutions and so on then of course it's it's lost in a way. Yeah. >> Michael Sailor and Black Rockck. >> Yeah. and they're grabbing their bags are now becoming quite huge. If if you assume like I have done for years, 5 million Bitcoin are lost including the Satoshi stack. >> There's never been more than 15 million Bitcoin. In fact, 50 days from now, the amount of Bitcoin mined will be 20 million. That means only 1 million will be left for the next 130 years or 110 years, something like that. 110 years. And that's wild to think about. Of course, I don't believe Bitcoin will be round in 100 years, but Rob, what do you think of where we are going next uh in terms of this? And can we trust Treadfi? Do they do they own the space right now? Are we just along for the ride? >> And you know, as well, by the way, for the last 20 years, before gold went on a rampage, JP Morgan kept a lid on gold price with paper gold. >> Of course, that's why they got uh they went to court for scooping. Yeah, >> this is what they do. There's a reason why the powerful stay powerful and it's because of their connections and what they do. I mean, well, like as far as like where we're going, I have no idea. But I can I can tell you that uh yeah, like just to piggyback what CTO said, institutions are here. They're taking over. And I think one of the reasons why the cyber punks from 2010 11 sold was one of two reasons. First of all, they're probably scared scared that they might get hacked. Maybe they saw that there was an opportunity for ETFs to get into there and then they just like uh who was it? Jordy Lester who says this is essentially the uh Bitcoin IPO moment and they said I'm out. I mean you got a billion dollars why we should take it and just live a little bit. So as far as like where are we going? I'm hoping we're going the right direction. I've been proven wrong every single time when I go against that. And it just looks like this is just a bad year like all midterm years are historically speaking. Look at the traditional markets. this year's probably going to suck and then it's going to get better and then the ones that are sticking around which is not very happy to be here. You're going to really thank yourself later. So I don't know which how bad it's going to be probably get bad. Just stick around. I think you're going to like where we're going to go. >> That's a little bit. So you're talking Q4 patience. In the meantime we're going to chop. Is that what I interpreted there? >> I'm I'm I'm saying that then it's a good it's a good followup. I'm saying that depending on a lot of different factors, the macro, the rate cuts, who's going to take over for Jerome Powell, what's going to happen with tariffs and everything else that goes in between that will dictate how far we go. And it's just I would say that this year is going to be tough and I honestly I hope it is tough because that means I can accumulate more which is a cliche thing to say but I have long-term belief in this asset just like I have long-term beliefs in land and real estate and even precious metals. So the land man Rob as a new handle land so >> can of worms you opened up there regarding the timing of the market. I have a little bit of a different theory because the current administration in order to look good for the midterms they need to juice the market and they for the first time ever have a powerful team to be able to do that like the people like Bant and Lutnik etc. They know how to manage money and they know how to pump stuff and with rate cuts and the change of Jerome Powell we're going back to close to Zerp again. And on top of all that, we've got the AI impact which is making companies much more effective and efficient and profitable than ever before. So the S&P 500 will rise. It'll be bumpy. There will be a black swan like there usually is every year and that'll tank prices and that's when you sweep in and buy. But um Marty, what do you make of your prognosis for crypto and S&P 500 for 2026 up to the midterms? Will it be a down year? I don't think so. >> I don't know. If you look at the S&P in priced in gold, I mean CTO, pull that chart up. People think the S&P is at alltime high, but if you compare it with gold, if you think gold is the new monetary standard, S&P is at an alltime is a huge low. So, it might be a buying time in terms of gold. Look at that. That's SPX in terms of gold. Complete opposite story. People say to me all the time, \"Oh, the stock market's at alltime high.\" I'd say no. It's actually just testing an all-time low in 2020 in co look. >> Yeah, you could take this one step further, Marty, too. DC, CTO, if you might, is uh S&P 500 priced in Bitcoin. Even more interesting >> if you flip. Exactly. Another great chart. I think it's time for us to all to get our heads around this. This is happening. The dollar is is is literally losing credibility. Gold has become the new reserve. Um and so you should look at charts in gold. It's much more accurate. Look at that chart. >> It's dragging on the bottom. And uh >> I think this is a generational buying opportunity right here in my in my opinion. I look at the software, James. The software has not changed. It's only got better. The use case has not changed. It's only got more pertinent. The regulation has got way huger. Um crypto and blockchain is now part of the political cycle. It's going to be a big part of the midterms. Everything is in our favor. All that's happened is gold has appreciated as it should and everything is adjusting and balancing and obviously there's a lot of people that bought very early and they're fearful and they're selling and they should. Why not? Like CTO said, we need that recycle. We need them out of the market. This is normal. I've never been more bullish on this asset class. >> Yeah. Well, let's talk about uh adjacent assets for a second. We covered a lot of the institutional. Another thing that's kind of tied to Clarity Act, tied to institutions and that is stable coins and stable coin issuers. Circle is public. They had their IPO last year was very successful. Then it fell back down to earth. But what is interesting is they continue to grow, continue to become leaner and meaner. and Circle. Although they lost, I think about 174 million in 2025, they're looking to earn about 239 million by year end 2026, going from a lossmaking company to a very profitable company in a short window of time. We know the market cap of stable coins is going to continue to rise with or without the Clarity Act. And people are asking as well with Circle under 80 bucks, is that a buying opportunity? Well, I'll go to Rob first. I don't know if you own any Circle or got involved in that IPO at all, but it was a rager for a while. I think it issued around 25 and shot to 200 and something and then fell back down to earth a little bit. >> Yeah, that was a great one. Just like uh I mean Bitmine was also a great one. Look how great that's doing. But yeah, we think like circle, I mean I don't own any, but it could be a pretty good one. If you believe that that stable coins are going to, you know, rule the roost, then this would be a good one. I don't personally have any, but sure why not. I always see it as as circle USD and tether forging the way for staples. >> Yeah. Uh Marty, you still hold your circle. What's your take? >> I still hold circle. I think circle and tether are very much, you know, dependent on the Clarity Act. obviously they they're right in the in in the crosshairs. Um most of their revenue and profit is made by the interest and they don't have to offer that interest to to holders of their coin. But I think if you look at the stable coin market cap, we've been holding at 300 320 billion in sort of a bullish penant. And if you look at regular TA, it's calling for a breakout to around 30 375 to 380 billion. And I think uh that's this holding pattern we're in is there hasn't been much issuance of new stable coin during this this clarity markup event because there's so much at stake with regards yield. Um but these companies very much depend on the clarity act rulings uh specifically with regards yield but I think that stable coin brings the next 10 million users honestly. Uh credit card Visa making major headwinds. I mean, I've been using a Visa stable coin card for three years. Um, it's the only primary use case of of crypto right now, and I think that's going to bring in a lot of new users, specifically banks issuing their own stable coins and their own debit, prepaid stable coin, debit, and credit cards. And that's that's I think a big narrative of 2026. But it all depends on this clarity thing. Obviously, this clarity thing is massive. >> I have a question. Maybe one of you know do you know why circle lost money because I mean the business case is pretty good right you uh collect US dollar which you actually can earn interest on while you give us give out USDC which people don't get yield from Taylor made massive profits right >> yeah do you know three three reasons one they have to pay a big marketing fee to Coinbase which is renegotiated this year so Coinbase are kind of like their rain maker for circle issuance on and they pay 5% yield if I'm not mistaken on circle on Coinbase as well. Second of all, there's always a cost of an IPO. It's expensive and that gets build post fact. >> And the third thing, they had a lot of stockbased compensation which took earnings down as well. So the three reasons that I see from the financials uh of why it was negative but you know think I go back to simple fundamentals. Okay, you print money, you issue it, and you get yield on what you issue, and the market value of that's going up. It's it's a no-brainer business. So, and Tether is the most profitable company on the planet, I think, after Only Fans or something on a per employee basis, >> something like that. >> I don't I don't know what Only Fans or some sports team or something. >> Yeah. >> But nobody knows. Yeah, I've honestly I've never been there, but I only found out what it was late last year. But let's get into that's kind of Does that answer your question, CTO, regarding why they lost, but you're dead right now? >> Yeah, it does. Of course, those factors should change probably then. That's what I was >> asking. Exactly. Uh they will change. Let's get into our final story because you know you you triggered two things on my head, Marty. one you said the software for crypto is getting better and better but there is a correlary to that and I said for years there could be somebody in their basement that develops a blockchain that's better than Bitcoin better than Ethereum better than Salana whatever now we are at this oneshot world where this guy Michael built a browser like a Chrome or a Netscape back in the day whatever in cursor 3 million lines of code it ran for a using Rust which is an extremely difficult language to code in and it did it and it was pretty much flawless. So now the question is what is the value of software over this point? You can literally oneshot almost anything. I'm going to go to you Rob first because you shared your charity work you did. You built a website for a company. You want to tell us a little bit about how you became a developer over the weekend. >> Yeah. Did did let me let me I'll show my screen so you can see this. So, this is Google AI Studio and I work with a local charity here called Amigos Deos and they have a real problem with their website. It was awful. They have a real problem with their socials. They have a real problem with their donations. I said, I'll do that. And this had, you know, just just recently came out. So, I just went to this one. I had no coding experience. I'm not CTO. I never Well, I I built a site before using Optimize Press. Very easy with templates. This one when I learned it, it took me about an hour to put this website. Took like 15 minutes. And I just pretty much said, and you just type in what you want right here. I want a website, if I could spell that functions on or or is all about selling hot dogs or whatever. And it'll it'll stick this out. And then it'll give you like different like recommendations about what to do and then how to do copy meaning how to write it so people are engaged. How to put in like you know how to actually adopt these animals. And then there was two big things it did for me. You probably can't hear this but it put in an AI agent for me. And I don't have a secure all right now. I'll do that later. No, let me do this now. God damn it. Let's see. Amigos. Well, well, he's vibe coding. I don't know if that's >> No, no, this is it. Yeah, voding. And this is it. Like, so, so the agent will come on. You won't be able to hear it because it's the way that the my mic's set up, but it'll ask you, \"What are you looking for? I'm looking for a dog that is like between five and seven years old that is housebroken. Okay, here's our dogs. One, two, three. Set up a time and I'll do that right now for you.\" And it does it just like that. I This took me like maybe two hours. Now, the only thing is is to get everybody to start to donate, which is down here. join the WhatsApp, all that stuff. Again, I don't know how to do this stuff, but I did it. And what's awesome about this, this is a charity. Google is hosting this for free. So, I just told them, \"Go to GoDaddy. You guys can cancel after your six months is up from your from your year-long contract, and we can just go just on this.\" And all these things come through. Now, as time goes on, if there's if this breaks into like 6,000 10,000 visits a day, we'll have to start paying Google. I don't see it ever happening. But if you have something like and this is just one small aspect of it, right? I can make what's called a gem in in Google and I can make it do just be like my personal assistant. Like I go in there and say dude, give me a crypto report for the day. It knows all my information, spits it out. Okay, make a thumbnail, make a whatever, and it just does it. >> So like this type of thing I think is when you look at this, Mark Moss was on the Paul Bet David channel show a couple days ago. >> Yeah. And he was talking about how they asked him point blank, \"Are you going to send your your kids to college because you believe so much in AI?\" He said, \"No, what's the point?\" >> Exactly. >> He goes, he goes, \"If they're going to be heart surgeons and nuclear engineers, obviously, but if they're going for like a liberal arts degree, no, they're going to come in here, you can learn twice as fast in a tenth of the time, and it's free and huge amount of debt.\" I was like, I see why AI is so important. Now, everybody was talking about their their altcoin and how great and function utility is compared to what I just showed you. and tell me how much how much utility you're you're all >> and and this this this is this is the asteroid as I call it that's coming to hit the earth. Marty, that was brilliant. Thank you so much, Rob. Uh Marty, how profound is that? A non-coder builds a charity website in >> I mean I can throw two takes at it. First of all, um I I I encounter those websites all the time and and all I ask is can I speak to a consumer to a representative? So I just I see it as a form of AI slop. and they're just like facads that don't really offer anything other than just, you know, a feeling that they exist. But anyway, I mean, these the software we're talking about is just massively complex. This the consensus in a in a in a typical blockchain like a Salana is unbelievably complicated. There's no way AI will ever code it. In fact, let me stop let me stop you there because I know where you're going. And I we we talked about New York Stock Exchange building a blockchain to tokenize 247 trading. >> What shot do they have? Because that's where you're going with this to be able to do finality down to 30 milliseconds and have scale of a million users at once. >> They have a big advantage in the fact that Mo's law has made networking and hardware cheap and fast. Um, you know, we tried to do distributed systems in the early 2000s. We had the architecture. We had all of the complex thinking. We just didn't have the physical hardware or network to do it. Uh, we have that now. So, that is a big advantage. They have that. But, um, in order to to get trust, this is all about trust and trustlessness. In order to get trust, you you can't have an institution have its own blockchain. They might as well just have their own database, which they have now. I don't see the benefit. So it's all about trustlessness and uh to to achieve trustlessness takes insane complexity um and in consensus and so I I I think they're all coming ignorantly into the space thinking that oh this is a new kind of cloud a new kind of blockchain I mean new kind of database but they don't really understand it until they do I mean just go look at guey.firedancer.io IO just go look at the fire dancer dashboard and understand the complexity of consensus in a modern global, you know, $3,000 TPS, 3,000 TPS network. It's unbelievable uh the amount of messaging involved in order to achieve consensus in a trustless way. Um so I just think it's ignorance. Uh I don't think you can code this with AI. Um I think it's the only resistance against AI. AI will will be able to crack pretty much everything in trad cryptography. So at the end of the day, I think it's our only defense against AI and quantum computing. This is the big uh this is the shield. This is our financial shield. Like Jerome Pal said in his speech, the only thing that keeps him up at night is the cyber attack against the central bank. Just never forget that. >> I think it is like this, if I can add one thing, like copying something that exists is almost trivial. Like u what you mentioned James like some guy vip coded Google Chrome browser. Okay. >> But will they replace Google Chrome tomorrow? >> No. >> None of us have replaced the Google Chrome because just copying whatever already exists doesn't really do anything >> unless that someone is selling it for a huge amount of money and the alternative is free. Okay. So then it does do something which was the point that you raised there James was the value of software like the software companies. So I think they are in challenge but um to Marty's point copying the next thing that isn't built yet that is really difficult and um because there is no like you know cop copying the opensource part of Salana that is trivial you go to get and you fork it done you don't need AI it takes 10 seconds but that doesn't mean that you overtake Salana's network effects it requires a lot more. So I think what happens is that what what AI does here is that it redefineses what what an asset is and just having some working software really isn't it because that can be copied but having proprietary data sets or having people with skills that are not documented somewhere that is worth a lot like the proof point really is that the AI companies themselves pay hundred million dollars to get the best AI guy. If their AI could do that, okay, why would they do that? But, you know, it can't. It can only do the things that already exists. It can't do the thing that that person will do tomorrow. That is not >> in the training data. So, it can't do it. So, that's really the value of the Solana project or something. It's what they are working on now. It's the improvements that they're going to build and that is not so easy to replicate. But I do think like a lot of software companies are going to get disrupted. >> Yeah. >> And but there are still assets here like proprietary data sets is not easy to to copy the skills at the people of the forefront. It's not easy to copy. Uh network effects that Solana has for example is not easy to copy and those are the assets that are worth something today. >> Yeah, this was this site. It's very impressive the site that Marty mentioned. Yeah, that's the fire dancer dashboard. I mean, it's just like so far ahead of everything else. It's ridiculous what's going on there. Um, >> yeah, you have to understand that this is financial these are financial systems. So, unlike a website which you have nobody really trying to to hack or break these things are are constantly under attack, constantly having DDoS attacks. And you know, they're using AI now. The hackers are using AI just like we are. So they have extremely powerful tools in breaking software. They're trying to break trad. They're trying to break banking systems, banking loginins, wrench attacks. Um it's it's unbelievable the maliciousness and and the technology they use. So these things have to be unbelievably defensive as well. It's a it's a you know people forget about that as well. They're unbelievably complex and intelligent. Um, >> and they're only moving forward. I mean, the the upgrade paths are just phenomenal. The the minds involved are truly the greatest minds in the world right now. >> That's true. >> That's where I live. That's what I invest in. I invest in that >> in the innovation. And the world is changing very fast and uh we know that you know software ate the world for 20 years and now AI agents are going to eat software and the world is going to change and how that impacts um I think everything that's going on the blockchain we see that with prediction markets right now is the canary in the mine everything will have to move very very fast and very frictionless which means traditional rails won't work and we just got to be ready we got to be ready and position ourselves accordingly. >> Final thoughts before we wrap. >> It's a long-term trade. It's a long-term trade. And I think that's the biggest mistake people make is they think it's a short-term trade. Crypto is a long-term trade. We're trying to break the existing financial status quo. And that's not easy. They're going to fight like dogs. You need to expect these fights like this. But just understand, we always come back. And uh when we finally do break, the beach ball breaks out the water. Uh if you're not in, you're out. Just like gold. Everyone's going, \"Oh, I should have got in gold.\" You had like 15 years to get into gold at 1800. >> 5,000 years. You could >> You literally had like thousand years to get into those metals. >> Yeah. >> It's a crazy time. >> You have a few years to get into crypto and you know many people will miss the trade. >> Yeah. Well, this is this is what's coming. Uh crypto is exciting but also AI is very exciting. That's one thing. Final thoughts from the gang before we wrap. Rob, how was your show? You might be muted, >> Rob. You're muted. >> There you go. We hear you. >> Sorry. So, last thoughts for this. I know I know Marty, you said that, you know, this was AI slop and I appreciate your opinion. >> No, he was referring about your site. Your site is excellent, Rob. That's a misunderstanding. >> Especially the cool. >> All right. Let me just say thank you for that. And I will just say since we've done the website, we have had two adoptions and that is me doing free work. The website is free and the utility two adopted dogs. I'll take that in four days. >> Yep. That's fantastic work. I'm very impressed. And you'll get donations from me too, guaranteed. >> Uh CTO, final thoughts for the week and Rob's impressive work too. >> Oh yeah, very impressive, Rob. Uh the world is changing and it's very exciting times and it's actually happening. everything we talked about with fiat collapse and the hard money and everything. It's happening, guys. >> Yeah. >> So, it's an exciting time to be alive. >> Yeah. And and again, AI will bring abundancy, therefore be in scarcity, whatever that is. 20 million Bitcoin in 50 days will be mined. Marty, final thoughts. >> Yeah, I think it's a time we have to all grow up and and accept that this isn't crypto is not just one thing. Blockchains aren't just one thing. The use cases aren't just one thing. Bitcoin has a very specific use case as a store of value. Um as the vault, the vault of the world, a general the first globalized thing ever in finance. And these execution chains like Salana, Ethereum, Sue etc. they have a very different task that is to tokenize everything and move it at light speed uh around the world globally not just within one jurisdiction. These are very different things and I think slowly they will be valued differently. Watch out for that decoupling. I think it's coming, but uh follow the whales, follow the accumulators. Um they're creating discounts. Morgan Stanley's getting in. They're not going to buy the top, etc., etc. And once they're in, once the sellers are done, I think we go to the races. We catch up with global liquidity. Um I said it before, I say it again. We're sitting at about 140,000 if you do it in terms of global liquidity, which is only going up. We're going into wartime budgets. Trump is the entrepreneurial president we've been waiting for. He's going to fix status quos that have been broken for many years. I know it's ugly at times, but this has to be done. It's our world. We're taking it back. You know, you can't beat entropy. The old people will die. It's our world. It's our time to step up. We can't sit around asking permission for everything. We need to take it like Elon Musk says. And you're either in or you're out and the victors will be will get the rewards. That's the way it works. >> Awesome stuff. I want to thank the gentleman links below for all these legends. Thank you so much. CTO D an R >> David D. I love you. I didn't mean to stop to direct it at you. I really didn't. I just meant it really directed at my bank because my bank has a similar website and I sat there to talk to the AI. Please help me. Help me. And they give me just go like links and links and links. Please. >> Crappiest introduction. Yeah. Yeah. I got you. So, I was venting a little bit, but I love dogs and I'm going to look at your site and don't take it the wrong way. >> I'm surprised Marty has a bank account to be honest. It was not on my bank account. All right, thank you all. Have a good night everybody. Thank you to the best mods in chat team details of Sean DK, K8, and everybody else. >> Take care of the week ahead. >> I'm a little sick. I will get better. >> Okay. Cheers. Bye."
    }
]