[
    {
        "video_id": "TWC3oRD6uvw",
        "title": "EMERGENCY BITCOIN UPDATE!!!! TRUMP RUG PULLED US AGAIN...",
        "published_at": "2026-01-19T09:42:49Z",
        "sort_date": "2026-01-19",
        "url": "https://www.youtube.com/watch?v=TWC3oRD6uvw",
        "transcript": "Welcome to another episode. And as you can see right now, Bitcoin is currently in a very interesting situation. We have quite insane pump last week. We did have it. Now we're back down below below the resistance and basically Bitcoin didn't even move towards the 50WE moving average because it couldn't even get out from this resistance on a weekly time frame. This is obviously something that we've been speaking about for quite some time that even though we have this pumps now and then the thing is that we're still in a bare trend. We're still riskoff. We're still conservative and it's for a reason because I mean you see yourself at the end of the day the weakness is just too big. Now some people will point to the Trump stuff. The fact that Trump is now going to have tariffs, 10% tariffs on Denmark, Sweden, Norway, France and Germany. Why? because they sent military to Greenland and uh Trump answered, \"Listen, we're going to take Greenland in a big time. Bigly bigly bigly bigly.\" And uh yeah, you're going to have a big fat tariff if you try to defend it. And by the way, these tariffs are going to increase to 25% beginning on June 1st. So some people say that this is the reason. But the thing is in a bull market, this stuff would not be affecting the price as much as as it currently is doing. So the same news bull market bare market totally different results but yes now any kind of uncertainty any kind of bearishness from Trump from anywhere really from anywhere does kill the rally that's why in a bare trend when bitcoin is in a bare trend like we are in right now all rallies are seen as dead cat bounces just like all dumps in a bull trend are seen as buy the dip opportunities okay very very important we're in a different regime right now so the next step of course is to see when we can have the next fat relief rally that doesn't get killed by this uh geopolitical stuff because this geopolitical stuff is becoming quite I mean it is becoming quite tense and uh now it is against uh Europe, Denmark. Let's see what's going to happen. Here is Trump speaking about the tariffs and the fact that they will have to tariff uh European countries very quickly if they try to intervene with the Greenland plan. Listen to this. put a 25% tariff, which is by the way about seven times more than they would have to pay by raising their drug like seven times. This wasn't like a little bit more, seven times more. And and I may do that for Greenland, too. I may put a tariff on countries if they don't go along with Greenland because we need Greenland for national security. So, I may do that. I'll give you a little I'll talk about I'll take you out of that. In fact, that'll end up being the story. But actually this is a much bigger story because we're reducing healthcare by numbers that you haven't seen. So I put a 25. >> So markets don't like uncertainty. You have crypto going down. Uh stocks also going down a bit. Of course gold man precious metals. This is the perfect time for for them. This the perfect perfect time for commodities. You look at what's happening here with the precious metals. Massive massive massive pumps. Both on the daily time frame but on the weekly even more. On the weekly since the flip. Gold is up almost 70%, silver 170, platinum 134, paladium 73. Uh looking at the silver chart, gold chart, it's alltime high every day. Okay, almost every day when you look at the charts, it's I mean it's it's magnificent and you see yourself another week, another pump to the upside, another breakout, another pump. And just like we've been speaking about silver last week, when you have a bullish trend, you have to stay in the bull trend. Obviously, if you have good gains, big gains, you could take some chips off the table, but bullish trends are likely to continue. That's the whole idea with a bullish trend. So, keeping a position in the market, even though you may trim it down a bit if you have massive gains, especially if you use leverage, it's still a good idea. It's still a good idea to keep it. So, gold alltime high, silver, silver, uh, currently, let's look here. Bam. Another one alltime high. Another one alltime high. And last week we're speaking about listen it is parabola but if it just does a bit of consolidation it can still continue and still be in a bull trend. So don't really become bearish because it's pumping a lot. Uh and that's true for for any asset until we start breaking down until we start really changing the trend. Being being bearish is wrong even though the chart looks crazy but you remember we said last week here it also looked crazy. Then it had a bit of consolidation and then continued. So this chart currently also looks very very vertical. At some point it may enter a bit of consolidation bum bum and still continue. So making moves too quickly due to the bullishness of a chart is uh not that smart in my opinion. So we will be monitoring the situation with gold with silver with uh with crypto. But one thing is for for sure guys it's the 360 I keep telling you about the 360 is the 360 investor that we all have to be in one way or another. Crypto only is yourself. Crypto only you're missing out on a lot. actually you're also going down but being 360 being in precious metals monitoring what's happening in the stock market monitoring the the crypto market and so on so forth it's is it's the new meta it is the new meta for 2026 and beyond also as crypto becomes more mainstream and uh big it's just another asset class and it's not this price discovery kind of asset class like it was since 2010 it is now quite significant it still has a lot of upside will go to a million dollar sooner or later so it it still has massive upside Right? But you know it's not this massive massive pump out of nowhere that we had for the last 10 years. The pockets of outperformance of crazy outperformance will still be there for example with altcoins with new launches and so on so forth. But Bitcoin, ETH and Solana and and the big ones uh within the coming years they will be more and more like traditional assets and it doesn't mean that they cannot pump. I mean look at gold look at Palium they pump a lot. They still pump a lot and Bitcoin likely will run a bit faster, a bit faster than them. But look at the last four years. Bitcoin barely barely skipping up with S&P with uh with other assets since the COVID since not since the COVID dump, but since the COVID after the mania dump. So we had the COVID dump, then we had COVID mania. All of the stocks up a lot, up crypto up a lot, and then we had the dump. So since that dump you don't really see that good of a performance from crypto. So obviously it can change but it's just a signal to B360 very very important. Now looking at the daily we have Dash up 13% Monero up 7%. So both Dash and Monero are the strong horses of the market during the last few weeks in a fantastic fantastic bull trend both of them. Monero obviously privacy uh privacy narrative. Dash to some extent also privacy narrative although Monero is the is the stronger privacy coin here. Uh looking at overall market what has flipped bullish in the last let's say let's say four days. What happened in the last four days you have not too much going. I mean crypto is you know it's kind of static. It's it's kind of static. You had this thing flipping uh flipping bullish. Then you have all the small one flipping bearish. Holy crap. this thing massive nuke uh on the uh on the uh bare flip. Let's check uh here on the daily. I mean also not not too many new news happening in terms of the alls during the weekend. Hopefully this week is going to be different but during the weekend it's a bit static. It's a bit static. Let's check what's happening with the u with the overall market when it comes to stocks. I mean obviously most of them haven't even opened yet but um something to monitor which has been working great for us in the uh bull mania group. Jason our our analyst has been posting a lot there about the defense stocks during the last few weeks. Basically ever since we did see the the increase in the the proposed increase in the US defense spending by 50% by Trump. We have been monitoring a lot of these um um defense stocks. So they have been doing quite well. Uh then you look at the other categories like Max 7, silver and gold miners also super super key to keep an eye on especially as AI grows a lot uh with AI we use AI a lot ourselves both when it comes to building tools I mean just this whole website but so many other things as well internally when it comes to organizing the company and so forth which which you should do as well so it seems that the AI bubble can still grow by grow by a lot because it is producing revenue it's a big difference versus where in not really clear how much revenue they collected, how much was just dreaming and hoping and how much actual revenue there was with AI man. I mean people are spending quite a lot people are spending quite a lot on AI tools, AI AI platforms, vibe coding building and so on so forth and they go into production. I mean absolutely they absolutely I know there's a lot of skeptics for for that but if you haven't tried it in your organization it may seem like it's not happening but once you try once you get going it's uh any kind any kind of tool you need internally you can just wipe code it before you have to go SAS you I mean there are many things you have to do uh obviously depends on the reliability you need how many nines you need it's totally different if you need something mission critical versus just you know a utility a tool to make your team run faster I mean a lot of project management tools or billion dollar companies for not too many reasons now with AI and so on so let's see how it's going to be but from an investment standpoint it seems that because the result of demand there are a lot of clients a lot of real implementation that uh this thing can still run quite uh quite a lot um and we're not changing until the the trend changes for uh for AI but that's that guys in terms of the market snapshot you have the worries in Europe what's going to happen with uh Greenland. Trump is saying there's going to be big fat tariffs on also, by the way, UK, Netherlands, Finland, and it's going to happen from February 1st. There you go. Uh so he's saying that they need Greenland for national security. Again, reiting it yet again. The Netherlands and Finland have journeyed to Greenland for purposes unknown. This is a very dangerous situation for the safety, security, and survival of our planet. These countries who are playing this very dangerous game have put a level of risk in play that is not tenable or sustainable. Therefore, it is imperative that in order to protect global peace and security, strong measures be taken. So yeah, I mean listen this was supposed to be like peace president. What happened man? Great. starting on February 1st. All the above mentioned countries are going to get 10% tariff and it's going to increase to 25. There you go guys. There you go. Let's see. Negotiation tactic art of the deal or not the markets they don't like it. I can tell that the markets need stability. That's why the sleepy Joe Biden for the markets um in many ways in many ways uh was better because at least you had sleepy Joe Biden and from that perspective sleepy Joe uh had the uh safety in terms of nothing happens okay nothing happens nothing happens he's sleeping so that's it look here uh Iceland angry why because this guy Billy Long from the US ambassador is saying that is Iceland is going to be the 52nd state He's joking joking to members on the floor that Iceland will be 52nd state and he'll be the governor. Crazy. Now, uh he did apologize afterwards. Uh so this is going to be this week's uh probably the main event this week. I mean, what's going to happen? What's going to happen here with the Greenland? What kind of uh market reaction we're going to see from the from the talks? But likely what's next is some kind of deescalation. I mean, if you look at Trump, he always escalates first. massive fear, massive uh headlines then ah okay we did a deal uh so maybe that's what's going to happen let's see last time we did see uh tariff problems you know crypto dumped a lot like a lot a lot it was in March April and we were still in a bull trend so even in a bull trend we basically went down to the 50we moving average uh here then we found a bottom and went up now that we're below 50 week there no such support until the 200 week guys. Okay. So, if this is something that's going to be you know more serious, it's going to be more um um you know more intense that the you know these tires actually start becoming um start becoming real. We still don't know that because it's until February 1st. So there's a bit of negotiation room for negotiation here. But uh yeah I mean let's see if it's not the 50 week was the other support. It is the 200 week and the 200 week is currently at 57. Within the coming weeks, it's it's going to rise and rise higher and higher. So, let's see what's going to happen. But we we need to keep an eye on that because this is our buy zone, guys. Around here, as you know, is going to be our big fat buy zone. Here is where we need to be buying a lot. Okay, a lot around here. Um as you remember we have the uh simulation here with buying around the 200E moving average where if you get within 5% you got to buy you're going to have nice returns uh one month return six month is fantastic. So keep an eye on that. If this thing really escalates this is the buy zone and again even if some people are always say oh but you know Trump is just negotiation this and that. Okay, even if it's just negotiation this and that, it can still take uh like weeks. It can still take months. Here, you can argue that the tariff situation back in March and April was also just negotiation. But you just need like two weeks of big fat dump for the losses to happen. I mean, here it happened basically in uh two weeks. Yeah, this one it was a week recovered and then boom and then it did not recover until like a month later. So even if you have negotiation still uh it's enough with a few weeks boom boom boom come back here and uh from here we're likely going to be building a nice bottom and uh yeah continues to the upside. That is how it currently looks. Obviously we're monitoring the situation. we have two uh important triggers to change our position from risk off to risk on and that's if we get here or if we start going above the 50 week right here everything in between as you know is no man's land it's a no trade no trade zone but guys on this note welcome everyone who is watching live happy Monday new week new opportunities whether it's crypto whether it's stocks whether it is precious metals for us as you know matters less because we are 360 investors we have the tools we have everything in place for us to see and monitor and act on opportunities in real time with, for example, the money scanner. Whenever something flips bullish, we know about it. I mean, we're the first ones to know whether it is defense or defense stocks or gold and silver miners or any kind of any kind of stock. Uh the same with ETF, the same with commodity. We just have to add now forex. I think we're going to be adding forex in the near future. And then potentially uh like treasuries. uh we we still need to see if it makes sense for us to add them separately or if we we can just have a a category within here. I mean we kind of have them. We have the income category already here when it comes to bonds but um potentially it would be nice to have a separate one for the uh for the bonds. So you have forex, you have bonds, you have ETFs, you have commodities, you have stocks, you have crypto and then bull mania is truly 360. I mean then it's truly 360. We're now we're maybe 340. You know we have crypto stocks, commodities. So maybe it's almost there. It's almost it's maybe three for fours enough, but we need forex and we also need likely some kind of bond or income uh category. So on this note, guys, welcome everyone. Big shout out to DAB for timestamping us today. Let me know how you're doing this fantastic Monday, new week, new opportunities. As you know, that's very very nice. Smash the like, subscribe to the channel if you haven't yet. And as you know to get our tools to be part of Bulmania go to bulmania.com and watch this free video about the mechanical rules because that's the first step for you to reprogram reprogram the brain and uh understand how trading really works. Then you can get the tools so you can execute. Next let's speak about seller. Sailor is going to be buying another uh batch of bitcoin. uh last week he bought u 1.25 billion worth of Bitcoin last week and this week he's saying that uh it's going to be bigger is even even bigger orange. Okay. So as long as he's buying it's a signal to the market that uh yeah he's still here still doing something. He's still able to raise funds. So all in all good good signal for the market. Let's let's look for this when there is morning US time. Normally he twist around that time. Uh, next you have ETH saying that they need to remove features. And here, by the way, I agree with Vitalik. They actually have to make the protocol simpler. Vitalic has come out and said that ETH is too complex. I mean, no one knows how it works. No one knows how the hell ETH works. It is so complex. So, he's saying now we need to make it simpler. And I fully agree with that. You have to make it simple, massively scalable and um ensure that L1 on its own is useful and um you have so many low hanging fruits there. I mean both when it comes to increasing the block size, increasing throughput and so forth. There is research being done by other chains whether you look at Solana or even other chains like they don't even have to reinvent so much from scratch. There's already research and implementation and production in other chains where you have massive massive throughput. You can of course make your own tradeoffs based on that research. Maybe you don't want to copy exactly, you can you can make some trade-offs. It's perfectly fine. But the fact is currently no one really understands how ETH works. And the only people that do are the core devs and they don't pass the so-called walkability test. Sorry, not walkability, walk away test. walk probably they can walk probably they can walk but can they walk away okay um they can't so this means that Ethereum should keep working even if today's core developers disappear if there is a serious uh bug they should be able to fix it they should be able to uh to to keep going so from that perspective I I totally agree by the way it needs to be simple simple simple simple but instead you have um yeah you have this spaghetti code uh not too great and this is something that Bitcoin also suffers from. Uh the difference is that Bitcoin doesn't really have to update too much. I mean they they try to update it a lot but uh they really shouldn't. They they really should keep it as simple as uh possible and Bitcoin doesn't have the same urgency to scale and to compete and so on so forth because no one can compete with Bitcoin. Bitcoin is Bitcoin. Bitcoin is digital gold and um it's based on its history, based on its understanding that people have understanding of it in the world. It's very hard to compete with Bitcoin. Impossible even if you have better tech. So, Bitcoin is not in this position where it has to innovate, develop this and that and there are many people that understand Bitcoin. Bitcoin is simple enough although it's also spaghetti code. It's simple enough for many people to still get it with ETH is different. So the core issue is that new teams should be able to understand the protocol, build new clients and run the network without needing insider knowledge or trusting a small group of experts. Yes. Uh also they should try vibe coding here. I mean for real they should try uh get claude to understand the codebase. That's one of the uh interesting use cases of uh of cloud and uh and vibe coding to really you know analyze at least if you okay you don't want cloud to code okay just have it analyze the code propose improvements and propose implementation and then you can manually then you can manually either merge or not merge and so on so forth by the way guys I have news I have news when it comes to vibe coding you remember last stream on Friday I said that I'm mainly in Laval I'm voding with Laval This whole website we did for for market analysis. I mean everything everything here is vibe coded with Lavable. And on Friday I said that I'm not really using cloud code because Lavable is simply better for full stack for full stack application. It's it's way better because it's all integrated back and front and like it's so nice like the whole workload is super tight. Now I have found a very nice use case for cloud code and that's basically cutting my streams into smaller uh clips. So, you know, we're hiring for that position. But also, I just tested, can I vibe code something where it just, you know, cuts out, it adds the uh the uh subtitle like this and and then it posts. Okay. And then it posts. Uh apparently with cloud, this was super easy. This was super easy. So, I have uh so the use case that where cloud makes perfect sense, it is when it's, you know, it's not full stack. It's like you you need something on your desktop. You don't have to like deploy front. It's just on your desktop. It's a utility and uh you don't need any kind of dis the same amount of coordination of different moving parts and it works very nice. It worked very very nice. Now maybe in the future I'll convert that app into a uh into into a website uh and uh then probably also I'll just use uh cloud code because uh uh it's uh yeah I mean the way it's built now it's not really uh compliant with lovable back end where you have to use superbase and all of that. So cloud is very nice but if you want to build something just you know full stack website with some simple database then uh it's too much work too much work they ask you to check the terminal this and that so uh when it comes to development I think they should try it I mean they should really really try uh ging claw loose on ETH see what it can do see what it can find in terms of improvements and then you of course need some kind of person that double checks all of that as it is a mission critical software And the same with Bitcoin, the same with Bitcoin, they should have AI tools to analyze it, propose improvements, uh maybe even implement it. And the thing is when it comes to uh AI implementing, it can also check against the requirements. It can check, you can have another AI checking requirements, checking that the initial AI did everything according to the requirements. You can check a third AI checking for security vulnerabilities. So it's definitely possible to create a workflow which theoretically could be better than a a team of people where they where AI is double check the I mean what what else you you have you have a double checking requirements a double checking the security I mean that's what people are doing also but people get tired man people get people need vacation people need you know they they have sometimes mental issues sometimes they it's a dev bum bum bum but he invested in the shitcoin shitcoin went down 90% now the dev is not really deving that even though he he's kind of full-time. So from that I I wonder I wonder when will it be possible to fully have a uh team of AIS implementing checking requirement testing security uh penetration testing and they're all experts on that should be I mean with within the coming year should be possible man it should be possible should be possible uh now moving on guys moving on uh what else we have in general looking back at this year it's now a year since uh Trump created the the memecoin. Uh from one perspective, it gave the crypto a lot of attention. From another perspective, we're kind of paying for it politically now. Uh when it comes to the latest bill, not really moving forward in the way that um that uh we wanted and u currently, yeah, it's down only with this with this memecoin. It's down only. Initially, it gave good support, but uh yeah, then everything kind of stalled out. So this was the first time when people said that Trump rugged rugpulled us. That's why I have in the title today also the rugpool but now with another type of thing and someone who is not too happy with that like with this whole situation is Charles. I mean Charles is creating videos I don't know where he's streaming. He's in some kind of wooden log cabin in his ranch. I guess he is now attacking Coinbase for withdrawing their support for the bill uh which Coinbase has been put. I don't know how much Charles has been doing himself when it comes to any of these bills. You know, Coinbase is very much involved in the uh the legis legislative legisl legislative process. I don't know how much Charles is involved, but he's involved on the backseat driving. And that's great. Listen to this. And you still got people like Brad saying, \"Well, it's not perfect, but we just got to get something. You know, it's better than no clarity.\" Hand it to the same people who sued us. Hand it to the same people who put us out of business, who subpoenaed us, who put us in jail. >> Guys, does anyone know h how much is Charles involved like in the like in the actual communication with the politicians? Like I know he says he's always in like somewhere he's always doing but in comparison to Coinbase I mean who actually lobbying spending a lot of money lobbying. I don't know how much has been so let's that's why I take it with a with a grain of salt but it's still interesting that um there is now debate whether crypto should even support the bill because Coinbase I know with the new market structure bill they withdrew support because in that market structure bill it says that uh stable coins cannot earn yield. uh you need to use banks for that and many other things that were changed last minute in order to make it less attractive for for crypto and more attractive for banks. And now Charles goes goes ham goes bananas against Coinbase for withdrawing support >> better. That's what we fought for. That's what we voted for. And tell me how do we change it like we changed the Securities Exchange Act of 1933. 93 years later, have we been able to change it? No. You pass it. You own it forever. Sorry, Brad. It's not better than chaos. Take the chaos and fight for what's right. Fight for integrity. I didn't sign up to hand the [ __ ] revolution to 15 banks. To live in a world where everything is a custodial wallet, every transaction is KYC. Everything is a is mutable and reversible can be frozen at a whim when that >> I mean he he's fully correct he's fully correct but I mean my understanding is that he he wants to go forward with the bill or what because I mean the bill is not good now the bill is not good also here is is another good uh clip from Charles about AI and uh uh and big tech and how crypto is the solution for that and that's very true listen to this >> here's the brass tax about what's at stake You got AI, you got tech oligarchies, and you got your entire life connected to this guy right here. >> Ah, guys, guys, guys, by the way, I I see a clarification. Is sorry, sorry, sorry. Maybe it's another Brad. Exactly. Is it? Oh, sorry. It's Brad Garlinghouse. Is Brad Gar? Sorry, sorry. So, he is attacking Brad Garlinghouse, not Brad from Coinbase. That That makes That's That makes more sense because I mean, Coinbase is pushing. Okay. Okay. Remove remove. We we need to backtrack the blockchain here. Okay. What has happened? So, okay. He is then agreeing with Coinbase that the bill needs to be reworked. Makes sense. Makes sense. Makes sense. See this why we have you guys in the chat. Okay. That makes sense. That makes sense. So then there see there's too many Brad. There's Brad Garlinghouse. Garlic Garling. They have Brad uh Brian Arong guys. It's Monday morning. Let me taste. The other guy is Brian. I need coffee, man. I need coffee. Cut, cut, cut, cut, cut, cut, cut. Brad from Ripple, he wants the bill with all of the problems in it. Brian Armstrong from Coinbase, he doesn't want the bill. Charles from Cardano, he doesn't want the bill. Now it makes sense. We're figuring it out together in this in this crazy world of crypto. That That's correct. That's correct. That's correct. Okay, let's let's let's listen to another take. Let's listen to another take here about uh the big tech and AI. Here's the brass tax about what's at stake. You got AI, you got tech oligarchies, and you got your entire life connected to this guy right here. Tracks everything you do. Goes along with you everywhere you go. And you have outsourced everything to these tech oligarchs. And with AI, they will know every single thing about you. And they're going to put a number on your head right here, just like the number of the beast. And your entire experience as a human being is going to be based on whether that number is higher and that number is low. That is the system you're sleepwalking into as you complain about paying your car payment and your bills and all your other stuff. That's the system you're sleepwalking into. Do you really want to live in a world where every single thing you say, think, and do is monitored? Do you really want to live in a world where your entire value as a human being is a number that an artificial intelligence agent has stamped on you? >> Holy crap. So he he's fully correct. The crypto is a solution here and he's very good at speaking in this um preacher kind of way. He's fully correct. So yeah, the reason why and then he says something very good and does that the reason why we we're still here even though we have retards of things happening like the meme coins and everything is that the value we give to the world is so big because we're the only solution to this dystopia that's happening. Guys, before we go to Q&A, let me just quickly see the key key charts here. When it comes to ETF, we're going to have a new reading later today. Um then when it comes to the fear and greed, let's check. We're currently in fear. We're currently in fear. So people that trade based on this, they go to fear, they go to extreme fear, then they go to greed. You saw last week we were actually in greed. Now we're back to a bit of fear. Um when it comes to performance by year, let's check this one. U the midterm year, where are we now versus other midterm years? Kind of exactly where we're supposed to be. you look at the average, we're still a bit above the average, but uh it's very common that we have the midterm year starting with a bit of a pump and then boop boop boop boop down and they all end 50 to 70% down right here. Uh next, let's check u a lot of these long-term charts don't really update uh too quickly. So, nothing has really changed when it comes to Fed balance sheet. Uh daily inflows we're going to have tomorrow. Oh, this one. Let's check the positions on Hyperlquid. You have now the giga charts being bearish. Not slightly bearish, not a bit bearish, bearish. You have these 100k to 1 million bearish. And now even the dian pros are becoming indecisive. I mean this is interesting. At some point guys probably when we are close to the 200 week moving average if bit really will continue down you will have all of these small ones bearish and then the giga charts will turn bullish and that's going to be a big big sign. If we look historically what has happened here? Uh yeah, the gigash they go from a bit bearish to slightly bearish. Sorry, I mean actually bearish to a bit bearish and now we're back to bearish. Uh and the big brains the same. And these things DJ Pros, they're flip-flopping. Flop flop flop flop flop. And then everything else below is bullish. I mean these guys are bullish all the time. Not going to make it fighter we call them. Lilis very bullish. Very bullish most of the time. I mean I guess it's you start with uh you start with traing. You just put in a long trade. You got even if you get wrecked it's uh yeah you tried you tried it. So a lot of them are counted here and here. Then here's when you have problems like sacrificial plebas here is where you've lost how much you lost? You lost between 10k and 100k where you're still hopeful maybe you're going to make it back. And these guys are always super bullish except this day last week they were a bit bearish. Other holders we call these guys who have lost 100k to 1 million and they're very bullish. Fantastic. Fantastic. And then wrecked labas are always super bullish. They have lost 1 million or more. They're always bullish. Very very bullish. So yeah, every day we have a bit more data here. We started to collect this data on January the 8th. So, it's going to be interesting to see this heat map as the cycle evolves. The the we go from the current depressed state to a hot state is going to happen at some point. We're not there yet, but at some point it's going to happen. Let's look at the pump fun stats. What's happening in the meme world? You have basically pump pushing alltime high when it comes to revenue, when it comes to new memes. There's a renewed interest for uh for memes. you have this uh gas um uh gas coin uh which uh turns out to be a memecoin. Uh I thought it it was you know one of these old gas coins where you could pre- buy gas on ETH blockchain. You remember it was in the past possible. I don't think it's even it's possible now because they change how ETH works. So you cannot you cannot buy gas coins where basically you can pay for gas today you have gas coins then you can use them as gas in the future because the way it worked was that when you create a gas coin it like spams the blockchain with uh a smart contract and then when you spend the gas coin it removes the spam it put because then you get gas back and so when you create the spam when gas is cheap you can then remove spam when gas is expensive so you can get a bit of arbitrage. So that was quite a big market maybe five years ago but it's not really a thing nowadays and the gas thing that um that became big during the last uh uh it's by the way it's also has collapsed you remember like on Friday it was pumping a lot but when you this is the problem with memes uh holy crap I mean you see yourself it's already collapsed it was pumping and now it's already collapsed but this one was a a bit of an interesting concept where they launched a coin this gas coin It is a coin that represents an AI open-source library. Okay. And so they this AI library fully real library for devs like a tool for devs. Uh they launched this coin then they did it in the bags app which is an app where you can launch memecoin but then the real person for for whom the coin is created or you know who is the face or the logo of the coin they can then claim that coin and get a bunch of fees. So that's what the guy did. The guy that created this open- source library upon which this memecoin was created, he claimed, he endorsed the coin, then it pumped and then I guess he said he's out and it dumped. So anyway, that's why when it comes to memecoins, the the cars are really stacked against you. If you are an alcoin trader, traditional alcoin trader, you're going to get wrecked. It's it's not even compatible with all coin trading. Meme trading is that you're terminally online. You're online all the time, 24/7. You monitor all of that and you move in and out on an hourly basis. I mean you see yourself you're a bit too late just a few days you took a week and bump down 93%. And this is one of the coins which I mean it is you could maybe you could say it is you know one of the more legit ones because the actual founder of the library of this AI tool claimed it. He endorsed it. He supported it and still this is this is a problem. Guys, let's go to Q&A questions, answers, debates, discussions. Let's go. Big shout out to uh dab or time something else. That's number one. While you're thinking about questions, uh let me remind you about a few things. If you go to bullmania.com/partners, you're going to see this page. It's also in the link below where it says exchanges I use. So, what do you see here? You have the situation with Pionex where you sign up, you get a nice signup bonus. You get you can copy my boss and also you can participate in this competition with the US stock market. Uh as you know a lot of stocks are now tradable on Pionex and they now have this competition where you can trade the semiconductor stocks and compete. That's number one. Then you scroll down here by bit. If you want to trade stocks, gold, commodities, crypto, it's all on bybit also. And you have a nice amboss. The same thing with Bitunix and the weeks. And of course here you can trade either spot or with leverage. If you want to go long, you can. If you want to go short, you can do it on by bit, bit weeks, bionics. But one thing I want everyone to know is that it is possible to trade gold and commodities and um stocks on the crypto exchanges now uh 100%. They have added a lot of trfy in the last uh months. Why? Because they they're also seeing the change towards the 360. You got to be a 360 platform where you allow all kind of investments including trades. That's important. So guys on this note, let's go to Q&A. Let's go as soon as possible. Is the 100 moving average a thing? So it is a thing but not for the big uh big moves for Bitcoin. Let me put it here on the chart. Uh I believe we do get some support there but see simple simple simple simple. There we go. There you go. There there you go. And then let me put in 100. So oh by the way this is interesting. So currently we have a bit of support here but I I don't use it too much. Why? because it doesn't normally mark big uh you know big support that is uh uh turning it's more intermediary here we also touched it remember in the last bear we also kind of touched it then uh yeah and then the broke so this is more you know intermediary if you want to trade the the relief here for example if you wanted to trade this kind of relief to the upside you could have done it but it doesn't mark uh anything significant other than that I mean in my experience at least I don't use it too much. Um, for example, it does not mark whether we're in a bull or a bear. Uh, because that's the 50WE moving average. Uh, normally it's very good at that. That in a bull it is support. I mean, you see yourself bum bum bum bum bum bum bum. In a bull support, bam, bam, bam, bam. Then we break it is bare. And in a bearish resistance, bam. And if we break it, if we break it, then it's bull. Um, so yeah, it is possible to use it for the short-term uh trading. Let me actually leave it on. Let's see when when um because you can also speculate that once we break down, we could see acceleration very quickly. But we're kind of going to be derping here. Bam, bum, bum, bum, bum. But once we start breaking down, you could bet on acceleration to the downside. That could be a use for it. So, is it useful for short-term trading? Yes. for big moves in terms of u are we in a bull or bear is it bottom of the bear then it's less useful if I mean it's not useful for that it's not useful then you have the 200 moving moving average right here um what do you think about AI crypto hype now will it end up the same as NFTs and metaverse um yeah so the crypto and hype for most part it didn't really make sense in any way except the narrative because you don't have any kind of big AI projects being in production that people use maybe with the exception of Venice which is super simple just open- source AI and they don't uh track you I mean that's it so it's it's a big innovation I don't know it's good that there is something but the more complex use cases that AI coins were selling they're simply not here they're not here and um instead you have a TRDFI and uh web do investing in. So strata invests in um open AAI entropic other uh companies even smaller ones that do things that get into production that get into people's daily workflow and it's happening. So a AI should already be in prod like you have a good AI tool it should be in prod it should be used by many people. So in crypto obviously we don't have that. We we don't really have that. Maybe the exception is Venice uh because they have a simple use case which has a big audience outside of crypto which is that it's a privacy focused AI. So uh will so will AI come back? I'm sure it will in one way or another. Um because it is still the biggest tech trend and likely it will continue and it is still possible to create systems that potentially could be useful. For example, AI and crypto has been intended to have training data, sharing of training data that has kind of disappeared. But why? I mean it could have been big. Uh so our execution has been very bad guys. Instead you have other companies doing that. Uh what are this I mean I just listened to a bunch of this podcast with the AI training training guys. There is this u Asian dude what's his name? Slurge spurge surge Sergei for example exactly Sergei. So Sergei is not a crypto project but this kind of thing uh if you just Google Sergei you're going to find it but you know this kind of thing should have been crypto okay now it's a a normal SAS and I think he took it from zero without raising any company exactly to 1.2 two billion in revenue uh quite quickly. Quite quickly. Um so this this should have been crypto. Okay. Uh because the the way that his company works is that if you know if you're an expert, you're a PhD or something, you can then sign up on his website and you can train AIS using your knowledge. This kind of thing should have been should have been crypto. So there are use cases still that could be figured out but currently they're being served by um by SAS I mean by by stuff like this. Okay. By the way if you're interested in business you should listen to podcast with him. He has many podcasts because many people are blown away that he himself was able to grow this uh this platform to 1.2 billion in revenue without funding without yeah without anything just himself. Quite crazy quite crazy story. But anyway, so back to crypto. Is it possible? It's possible. There are use cases. Our execution is just very bad. Okay. And it makes sense. I mean, people create a coin, they want a fast pump, then they're out. Then bare market comes. They can say, \"Yeah, it's bare market, guys. What do you want from us?\" And the bag holders, they hold. Although it's a bare trend, they hold, they hold, they hold. And the founder can say it's a bare market. It's a bare market. What do you want from me? Everything is done. Everything is done. What do you want from me? What do you want? Oh, everything is out. And by the way, we're we're moving on. He's he's now he has another project. So, that has been a problem with a coins, guys, and many other coins also. So, this thing with cryptocoin, it's kind of also a curse when it comes to building nice products. It takes time, man. It takes time. I mean even this story to go from zero to 1.2 2 billion revenue in six years is very fast but you know it's still six years how many projects in crypto do six years without yeah without any funding or anything how many projects in crypto work for six years it's um yeah I mean uh what about bit tensor I don't see any any kind of output from bit tensor that matters in the AI and again I'm telling you that as a daily AI user I mean I told you that I use AI a lot just you know for internal stuff externally. I did this website that I use every day myself for markets also with um let me see if I can run it also lately with cloud code. I mean during the weekend basically I did a website for clipping my clips. U it's not a website yet but it's like a web desktop app. So I'm using like I I'm using all of the hot stuff so to speak. I don't see anything from Bit Tensor like where is it? Where is it? Not to say that there is nothing but uh yeah I don't see anyone speaking about it online like they do with like R. You remember like two weeks ago this Ralph thing became a became big on AI Twitter where it's a like a configuration of cloud code that can plan big tasks like implement big features and uh then it uh does a specification it follows specification it checks the specification so you basically go to sleep and Ralph is just implementing a big big project for you I mean everyone was speaking about that so with bit tensor I just don't see thing being discussed. Now, I'm not saying that it's not going to pump. Don't don't get confused. I'm saying just from use case perspective. Things that don't have use case, they still pump and maybe they're going to have a use case. It's all about the narrative. So, if you see Bit Tens are bullish on the money line or in in Bull Mania and there's a narrative, you can make a lot of money there. So, don't try to be like too smart speaking about the use case, okay? It's a classic matter. But but by but by but by but by but by but by but by but by but by but by but by the way guys here is I vip coded this one the clipper during the weekend. Basically it imports the video from YouTube here. Then it finds interesting moments here. Uh and I can say do you want subtitles? Do I want snappy edit? Basically it removes the silences. Then it proposes a bunch of them. I can fix the transcript because sometimes it misunderstands the words like it it transcribes it wrong. uh everything is running locally meaning that the transcription the AI model everything is local oh also this is interesting so I it tweets out so it tweets out these things and then into I'm rate limited here but it tweets out these things and then it tracks the performance of the tweets so in the future I'm going to see if I can make it like learn how to find this uh clippings uh even better because uh it should like learn in real time. For example, this one we posted uh yesterday. It got 27K views, 131 likes, but then this one one day ago here it got 300 uh likes on Twitter. Okay, let me refresh this. Let's see. The Twitter API is super rate limiting. I need to wait before I refresh. Let's see. Yeah, there you go. So, this one, how to escape mental prison gut. So my next step here is to see how we can how it can learn what is the biggest engagement by having a bunch of tweets that is done and then it uh becomes better at clipping the stuff and then also we need to add more you know maybe some bling bling you know in in this clippings people normally add some sound effect bling bling bling something that's going to be the next step but man it's fantastic fantastic vibe coding it's it's awesome So man, normally you would buy a SAS. I mean I tried many SAS for clipping it. They all very bad. So back to your question about AI coin. They are useless. Like no one is using any of them. Uh I use tools every day. VIP code, not VIP code. I mean I I use all the all tools. I'm like addicted to AI. I'm addicted to I don't see any crypto. Uh it can still pump. If there is a bull trend in the coin, you still buy it. I mean it is what it is. It's you if you want to make money, you you buy it. If you want to be correct that they're they are wrong, you don't buy, but then you're going to be wrecked pleb. Okay, it's it is what it is. I I can have two thoughts in the brain at the same time. I know they're useless. No one is using them. I can still buy them. Okay, the tech and implementation and adoption is not a requirement when there is a bull market. It's not. I mean, simply not. Sorry, it's not. You don't need it. Maybe they they're going to have a use case. I I just have not seen it. I have not seen it. or at least it's not big enough for me to have noticed although I use a lot of stuff man I mean this this vibe coding guys it's especially if you know a bit of programming is the best so see for example I am computer scientist I university education is computer science I worked as a full-time dev in crypto since 2017 so I have not been full-time dev since 2017 which you as you understand means But for me to build something, oh my I I need to put like a weekend maybe more to like figure out the new tools, the new, you know, there's always new library, you know, dev love complicating stuff. So they they created 500 million libraries since I was full-time. So yeah, I basically I I it's too much. It's too much for me to like get up to speed and code. So before VIP causing, I didn't code too much. I mean it's easier to just hire someone that that can execute but with vibe coding man I can do anything and because you know a bit of programming you you can tell it the architecture you want back back and front end caching bum bum bum and it execute it's it's such a freedom thing such a freedom thing also you as long as you can tell it what all you want it can do stuff in languages you yourself don't necessarily know so for example this clipper this clipper when it finds all of these um clippings. The back end here isn't Rust. I've never programmed in Rust. I don't know how the hell Rust works. I don't need to know how Rust works. That's the best. That's the best. I just told it, listen, this what I want. I want you to have this architecture. It askan, do you want Rust? I think I says I think Rust is going to be great here. I said, do Rust. I don't know Rust. It works. If something does not work, I I tell bum bum. What the hell? Doesn't work. Fix it. He's like, I'm searching. I found it. How can find and fixes it and freaking works. Now I need the next step. I I'll tell it is that we need to start getting to 1K plus likes on on on the stuff at post. Let's see. Let's see what it can do. Let's see. I needed to be more responsible for the KPI. Now it can do clipping, but the monkey can do clipping. Can you be responsible, Claude, for the KPI of engagement? Okay. Not just be a cold monkey, but responsible for a key metric that we care about. Okay, very important. My cloth. I love cloth. I didn't like it on Friday. Now with this clipper I did in during weekend, I love it, man. I love it. So obviously cloud has way more use case than loavable. Lovable is great for like end to end full stack a bit simple. With cloud, man, we're going to go nuts. We're going to go to town. Is that how you say it? I don't know who said. So, uh, yeah, most coins from previous cycles will eventually die. Exactly like the upsets. That's pretty correct. Indeed, VIP coding is awesome with correct prompting as so exactly. So, if you are a newbie, you have never developed in the past, I can imagine that vibe coding is almost there. Like for even for you, it's almost there. But I can imagine that it will do some dumb stuff sometimes and you simply don't notice it or you don't understand or yeah because it's all about you prompting correctly. So if you see it's doing something dumb, if you know what it's doing a bit, you can tell, listen, why do this, why do this, do this, don't do this, do this. And oh yeah, correct, correct. Yeah. Yeah. So then it goes. So but soon even for normie is going to be enough soon because why why is it going to be enough for normie soon? Because see most people think of AI as just one AI you talk to. In reality, it's very bad. Ideally, you need several AIs. Why? Because as you know AI is all about pattern matching. So you will have u uh I mean the way it works under the hood at the end of the like to if you boil it out to simplest uh terms it's it's pattern matching. So if you have a thing it's building and working on it's going to pattern match and it's going to be a bit hard for it to like see the big picture. Then you have another AI and another AI he's his job is to pattern match but specifically looking for exploits. let's say specifically looking for did you actually follow the the the requirements and or did you pattern match too much here that you didn't really understand the big picture. So because they're all pattern m you need to have several of them. So they all pattern match but like in their own direction in their own like in their own prompt. So this is why let's say you're a noob dev you don't know anything you soon I think you can have like a companion that is your engineer and it can oversee the claude bum bum bum whatever claude is doing. So, so it makes sense. I'm very bullish on Yeah, guys. I mean, it's uh crazy. It's it's uh yeah, a lot of the negativity I see with hallucination, people have been saying, \"Yeah, it's worthless hallucination.\" It's kind of fixed to a big extent because of this like multi- aent setup. It still needs to be simplified a lot. It still needs to be improved a lot. But even if AI doesn't develop more, let's say AI is like capped out. No more development. No more. I mean just for normies to start using what is already possible man the economy should boom like would even if let's say that AI all of this AGI is for guys maybe it is I don't know but AI is freaking smarter than most people now anyway just there's no more development let's let's just imagine that everyone all the normies all the corporates they just start using what we currently have I mean that's that should that should pump the assets a lot a lot so anyway next thing I need to vibe code something with uh like coin or something. I win to vibe called some some speculation, some ponzi. Let's see. I use multiple conversations at different levels of abstraction also for causing finance. Yeah, exactly. So you you need different agents. That's why AGI I mean as it as a concept AGI it cannot really work with the existing ones if it's not like multi- aent. Maybe a maybe a different agent because you you need different uh different AIS uh to to have a proper end to end the process from let's say in development from requirement to shipping to testing to security they need to be their own separate ones otherwise they they're pattern matching too much into their own prompt and it's it's hard for them to yeah to zoom out like to switch syncing it's but together maybe it's going to be agile let's Yo, Isaac Rockwater, greetings Ivan on Teonic and each and everyone across the cryptosphere. Welcome, welcome, welcome, Isaac. How are you doing? If I was a Vibe quarter. Oh yeah, exactly. You can fork ADA, but people should try that more. I haven't seen too many people trying to like fork Bitcoin using Vibe coding, you know, fork ETH, fork. Why not? Like it should be should be possible. probably going to have a lot of security problems, but uh this is fascinating fascinating experiment. I love A2 and use CLA to code a plugins says Winstead, but I have been in audience for over 15 years. I know what I'm Exactly. Exactly. Exactly. I mean, if I'm to do a audio plugin, I don't I don't even know where to start. Ian is UK cooked. is very cooked. But uh see with all the AI stuff, I'm not even that interested in the in the fall of the west anymore as a topic. It's it just um it doesn't excite me anymore. I spoke about it on uh Twitter actually my AI. We we clipped we clipped out just before the stream. We clipped out this one. Why I'm don't done talking politics. Let's see the engagement here. We have now going towards 100 likes on this one. So yeah, I spoke about it here. It's I I don't just just don't care. You can move somewhere. There are many countries in the world uh with low tax uh no engineers and doctors and I mean you know I mean just I I I don't know like I don't I don't get any excitement from that anymore. I don't care. It's uh it's too too many other things. Maybe it is the dopamine I get from claw code and vibe coding. everything else doesn't uh doesn't trigger anything like okay politicians are retardio they ruined countries and you have very high tax there so you're retardo if you don't move okay that's it this is this is my message do what you want if you that's finished we're finished let's go let's build something let's fork it let's fork Sana hey Ivan I'm still on the rat race SD at fang barely wrote any code in 2025 and still my coding stats are top of the team. Yeah, there you go. There you go. You're in fang. That's that's which fang? Facebook, Apple, Amazon, Netflix, Google. Uh but I'm thinking how Yeah, man. Yeah, you you you need to if you still want to work there, you still you need to use all AIS because the only devs that will matter are those that can use AI. If the dev doesn't use AI, they are so inefficient. It's crazy crazy. Now I I don't know how you know the dev practices in fang but uh yeah if I'm just thinking like let's say you you are running a dev team and they go click click click click click by hand click click click meanwhile this freaking rust thing is done in like a few hours during weekend I didn't write any line of code it can clip out videos it can trim videos for example some videos they have too much mumbo jumbo in the beginning I can here. Trim start. I can remove like the first few seconds. Bam. Crazy, man. Crazy. Crazy. Crazy. And then you have click click click click click. Manual dev. What is he doing? What is he doing? Is he Neanderthal? Is he a primitive life form? Something like that. So yeah, using AI is the man is the only way. Maybe if you if it's not allowed for you yet, still use it. soon is going to be allowed and you're already expert. What are your thoughts on farming perexes for air drops? Uh yeah, I mean do an AI. You should do an AI that does it. You should do an AI that does it. Uh there should be AIS that can farm the stuff. There's no click click click click. I don't know, man. When it comes to farming, the only thing that was very good that was really good was the Pango airdrop and I didn't have to do anything for that. I just had to buy penguin. So, you know, farming, I'm not a fan farming depends on who you are, man. You have a lot of time to farm, but also you need capital. You need both capital and time. So, yeah. I don't know, man. In the next bull, probably it's going to be interesting. Now, okay, you get some coins. You never know also if they're going to exit scam. They can in in in the sense that they you farm and then you get like 5 cents. It can also happen. Um and um I don't understand really the risk reward. I mean, you have to you have to use it. You have to you have to it's not the risk word. It's more opportunity time, opportunity cost. you don't have to spend time and also you see the they the exchanges these projects they don't want farming I mean they want real users so don't get surprised if you get the rug pulled so that's why I'm looking back at the last bull the only thing that was really nice airrop was pango and it wasn't you I didn't have to do anything except having a penguin uh NFT and that was the best one because it aligned with their goals they want they want to re reward Pango holders I had a Pangu NFT. I got airdrop. Perfect. All of this, you know, we're going to we're going to farm. We're going to this. We're going to do that. It's fake engagement. So, yeah, you probably you can make a lot of money in the bull now. I don't know, man. But you can make even more money in the bull by doing other things. I think this cycle has marked the disappointment of farming. I mean, that's my impression at least. People have been trying to farm, but see projects are too smart, man. They're too smart, man. You had the opportunity to farm in 2021 when projects project founders still didn't know too much and this farming was kind of a new thing. So you had a lot of arbitrage. You know project founder they don't know better. They give everyone a million bucks. Turns out they gave everything to one guy who is uh who is running 500 different wallets. They're just smart man. Now it's with onchain tech. So listen uh never say never. I'm just it's not my strategy. It's not my strategy to to farm. I would rather be focusing on the trends on the trends on trading on things in my control. I don't like that it's not in my control. I don't know what's going to happen. Will they have an airdrop? Will they not have an airdrop? Uh by how much by which uh user class? And then people are angry. This is the best. This is the best. I love seeing when people are angry on Twitter. Oh, airdrop got exit scammed. We the community got a ragput. We didn't get airdrop. I spent five months farming. Listen, what do you which community? Number one, which community? You're not community. You're a scam farmer. Spam farm. Okay, maybe not scam, but spam. Are you community? Do you really? Are you really community or you here to to make some uh monies? You're here to do some business and now you're business with fake fake transaction um you know, volume forming. It got busted because the project doesn't want you to get a million bucks for just doing fake transactions or like spoofing wash trading. Okay. And now, no, the community got rabbit. The community the community, man, the rack community with Get out of here. I love that. I love it. Instead, man, keep it simple. Go to bullmayer.com. Get the tools and you you you have things that are within your control. You buy new bull trends in assets. It's way better. Way better. Way better. Keep it simple. Go to buling.com, watch the free video, learn, get the tools. Guys, thanks a lot. Big shout out to uh Dub for time stamping us. To dab for time stamping us. Hope you enjoyed. Hope you learned something. Smash the like, subscribe, and we're going to be back tomorrow. And for all of you inside Bulmania, a weekly TA is coming out in a few hours. So yeah, have a good good day and goodbye guys. Goodbye. Goodbye. Goodbye."
    }
]