[
    {
        "video_id": "aqz1zk6Ysl8",
        "title": "Breakout Failed. Now What?",
        "published_at": "2026-01-20T12:15:08Z",
        "sort_date": "2026-01-20",
        "url": "https://www.youtube.com/watch?v=aqz1zk6Ysl8",
        "transcript": "Here's my market analysis of Bitcoin stocks, gold, silver, and altcoins. Bitcoin did have a breakout last Tuesday. This was legit. And after this close, it did go up further, but then it turned around and the breakout reverted. I did buy this breakout, but with basically no tolerance at all. When it didn't work out, and I closed this at almost plus -0, and it did continue down further. Why was I so stingy? Do I not believe? Why did I have so little confidence? Why not give it more room to wiggle? Because at the breakout, the trend and the chart pattern pointed in different directions. Trend down, chart pattern, ascending triangle or rectangle breakout pointing up. Conflicting signals, then I have basically zero tolerance. Now, this again looks more like a flag or a rising wedge just like it did if you remember here in December. Now, it's just at the lower trend line. So, of course, it could bounce again here. But if this confirms here on the downside, I'm not a huge fan of targets. I prefer to just play out what actually happens. But if it plays out, be aware that targets down to 58K or targets down to 62K are indeed realistic. Personally, I would love to get cheaper Bitcoin, but if we just turn around here, I'll take that, too. As always, I'm going to react to what actually happens and not believe that I or anyone else can actually predict the future of markets. My reactive approach has worked great for me so far. So I'm not going to change it. Gold daily candles. Here is today. Here's the weekly candles. Lo gold since 2023. The generational breakout which we correctly identified was in March 2024 at 2060. Silver the inverse head and shoulders confirmed in April 2024 at price 25. Today silver is at 95. So that's almost 4x. who kept posting videos about gold years ago when it was a 2000. Who talked about silver before the pump? I almost had to trick you guys into watching it at the time because if I wrote gold or silver in the title, no one clicked. So, I had to write something like better than Bitcoin. Who launched commodities in Line Pro in May 2024? Commodities, gold, silver, and so on. Launching commodities in Line Pro. Yeah, here I wrote better than crypto pro commodities launch YouTube diversification is key. May 2024 that was here on the gold chart shortly after the generational breakout and it was here on the silver chart just after the confirmation of this inverse head and shoulders. Who launched the commodities pro portfolios in March 2025? Uranium, silver, gold when things started to really heat up. the exact system to win in a crash. Thumbnail buy gold exclamation mark. So March 2025, that was here on the silver chart at 33. The gold chart, it was here below 3,000 where we brought the best person I know in the world to analyze commodities. More coups to run a pro portfolio for us for a year. I added it included. Didn't cost you a penny extra. who posted 5 months ago in August 2025 the video with Mark where we wrote better than crypto gold, silver, uranium and so on. Now after the pump all the crypto influencers are talking about silver and gold after the pump here high up on the parabola massive risk uncontrolled entries where you going to put the stop-loss if you enter now I'm sorry guys many of you try to save money by watching these influencers for free instead of getting real tools real education and taking your own decisions. Look at your own results and compare with what the laral line pro package cost at the time. Of course, up to you. Just saying. I'll schedule an update video with Mark Coops as soon as possible. Personally, I feel that it's high up on the parabola now. Difficult to find new controlled entries here. They were long back. But the world order is definitely changing. Fiat currencies are challenged. The proposition of hard assets, hard money is playing out. Just as the Bitcoiners have said all along, it's just running with physical gold and not the digital variety right now. Here is Bitcoin price versus gold price. And no one has missed that it's trending in this direction right now. And it has done that since the summer. So short-term, Bitcoin is not on the boat right now. But multi-year, this chart paints a very different picture. This can still turn into a massive inverse head and shoulders of sorts with targets massively higher. I've always calculated this ratio by simply dividing the Bitcoin price with the gold price. But I realize now there is actually a chart BTC X AU that does this for you and gives the same results. So for clarity, this is not market cap in percent. It's price divided by price. Stocks have also been doing absolutely amazing. the true power of diversification. Even when I started my course, my channel, it was always about tech assets, which I defined as crypto and tech stocks and tech stocks have done pretty well since 2018. Or what do you think? Here is Bitcoin versus stocks. And as you can see here, this beautiful parabola broke this summer in August 2025. I think this was when the old guard, the OG Bitcoiners started selling, anticipating the end of the four-year cycle. That's the guys who bought Bitcoin for two strawberries and then cashed out into the billions at the unimaginable price of $100,000. And Wall Street like the Black Rockck ETFs, the stock companies like Strategy buying it instead. the politicians, the president, the establishment is suddenly in change of guard. It was really the Bitcoin IPO we witnessed in 2025. And in many cases, price then just chops. I think that's the summary of 2025. That's why the Bitcoin chart looks like this. Now, I will show you something else interesting. I think the most interesting observation of today and something I hadn't noticed until yesterday. Here is stocks versus gold. I switched to two weeks to fit it on the screen. This has trended very well over the years and then over the last few years this has made a rounded top and it's right at support right now. You can see that it bounced one time, twice, three times, four, five and six times before. That's where people felt that stocks are getting too cheap in relation to gold or otherwise gold too expensive in relation to stocks. So they moved back allocation from gold to stocks. So either this bounces again pretty much right here and right now or if it breaks the next support is pretty much somewhere down here or maybe even here. Then stocks versus gold ratio can still drop by a factor two or even more almost a factor three. Definitely a chart to watch. I'm going to follow this very carefully from here. Bitcoin versus speculative altcoins is ranging pretty flat. The most interesting lately has been XMR. This is XMR versus BTC which is up over 100% since the breakout. But unfortunately, the breakout in XMR versus USD has retraced its breakout or it's at least in question right now. But I don't think all coins are hopeless. ETH BTC, which tend to be the first coin that moves, has actually put in a solid bottom here, which most people seem to have missed. So when Bitcoin finds its footing again, I think a lot of people will have completely given up on alts and that's when they can really run. So I'm not going to take my eyes off this ball either. It's exactly when you start seeing altcoins will never come back all over X that I'm getting interested. And if you're new here, let me tell you, it's been like that every single cycle. then the same influencers will pretend they never said that or forget it themselves. And I already see many people saying that altcoins have been dead for years. Uh, okay. Well, but that's not the results I see in my 2025 accounting. You just can't buy old coins and then hodle and hope. That doesn't work. You have to be active. Anyway, taking a step back, Lion, what should I do? You should use the learnings from the last season in 2025 to get better this season 2026 because new opportunities will come suddenly. They always do. Don't get scammed. I have only one website. It's ctoarsson.com. Largeline pro is open at regular price 5k per year. I will not DM you about some investment opportunity on any platform. Those are impersonators. Don't get scammed. Thank you, T. See now. [music]"
    }
]