[
    {
        "video_id": "rVsFggNFU8A",
        "title": "Palantir Stock Drops Overnight As Market Futures Turn Red!",
        "published_at": "2026-01-20T04:04:21Z",
        "sort_date": "2026-01-20",
        "url": "https://www.youtube.com/watch?v=rVsFggNFU8A",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. And man, it is good to be back. I mean, with the market closed today, I was kind of looking around like, what are we even doing? Just waiting for the markets to finally react to all of the uncertainty that we have, especially with the administration and the new tariffs that he's trying to impose on a lot of the European countries regarding the uncertainty with Greenland, cuz he really wants Greenland. We're going to be talking about that, especially as futures open up and the overnight market's opening up right now on Robin Hood. talking about some of the individual names, how they're reacting right now as we speak. And to be honest, overall, it's not nearly as bad as I was expecting. I was expecting maybe a, you know, more blood in the streets. Uh, especially after everybody on X was calling for the end of the bull market and this was the top and we're going to have the biggest crash. Uh, that's typically when I get quite interested in looking at some of the names when everybody is mega bearish. So, we're going to be talking about that where Palanteer is right now. It's actually losing some support. We'll be talking about that. So, if you're a new or returning viewer, hit that like button, subscribe for daily videos. Let's pop it up on the screen here. Uh, Palanteer is at 168.27 currently. Uh, it's down about 1.5%. Now, like I said, the general market in the SPY, we'll revisit this in a second here, is only down 89%, only down 89 basis points right here at 685. So, you're going to have the S&P if this holds kind of right here, it's basically going to open up kind of slightly under 6900, which that's not necessarily bad at all. Um, considering we do have a decent amount of consolidation, amount of trading, and a decent amount of support in the 6,800. So, I do like that. But going back to Palanteer here, I mean at 168 right here, the only concern in terms of a technical pattern and just where it sits is that Palanteer, as we talk about all the time, has a lot of uh foundation between the 170 and the 184. Uh we've seen that a large volume zone accumulation area, a big base that's really been built out there basically since like last August. Uh we've seen that for a long time. Uh Palanteer right now is slipping kind of underneath that that support level. So if we see any type of a further push down, whether that's due to palenteer technical trading itself, individual news, or macroeconomic type of kind of geopolitical tensions that we're experiencing right now, that's where if we see it lose this 160 support, this one high, you know, 167 support area. This is where you could see Palanteer possibly further break down back into the 150s kind of like it did the last time that it lost this pretty in important support level. Uh, and if we pop it up here, everybody's talking about, we've been seeing this on the radar talking about the weekly chart is that Palunteer, oh my gosh, head and shoulders pattern. Uh, you know, we'll see what happens if this follows through here. Head and shoulders obviously are a pretty bearish uh technical pattern. However, Palanteer is pretty resilient. So, let's just give it a second before everybody starts screaming that this thing is going back down to whatever. Uh, yes, it does have the valuation behind it. That's the biggest criticism. But nonetheless, Palanteer has been very very resilient uh in this market. So, we'll see what happens. Not too scared yet, especially with Palunteer here that has earnings that's coming out here. Now, it's going to come up. It's going to sneak up on us, guys. Uh February 2nd right here, earnings per share normalized estimated at 23 cents and that correlates to 1.34 billion in revenue. Uh, one cool thing here, earnings per share revisions in the last 90 days is up 21 uh, times, 21 different revisions in the bullish direction and zero in the bearish. So, a lot of high expectations for Palanteer. It's priced for perfection. So, that's where you can get a lot of uh, volatility that comes along with it. But, nonetheless, I still like it here and there could be room for it to break down. I guess that's just a dip buying opportunity for the people that are still long. Uh, let's talk about the terrace right here. This is what happened over the weekend and then we didn't have Mondays. We had futures that opened up, but we didn't have Monday's market to kind of really react to this. So, now it's kind of like it's almost like getting to the point where psychologically uh we'll see what happens. But is this kind of getting absorbed and is everybody expecting the taco type trade to play out? Who knows? But on Saturday, Trump here set a 10% tariff effective on February 1st on imports from Denmark, Finland, France, Greenland, Netherlands, Norway, basically all these European countries, rising to 25% by June 1st unless a deal gives the US full control of Greenland. Okay. Um, right here, basically criticizing Denmark's handling of Russian threats. They say European leaders condemned a coarition in a joint statement here talking about this. Basically, here's the tension you have here. Also, Trump sends a letter to Norway. Uh quite angry that they he didn't get the Nobel Peace Prize for stopping here. It says eight different types of large uh tensions. Plus, I have no longer obligation to think purely of peace. He says right here saying that he's done more for NATO. The world is not secure unless we have complete control of Greenland. So, nonetheless, he really really wants Greenland. Uh we're not really uh uh political on this channel. More just how is the market going to price in this political news? that's what we're more kind of prioritizing and kind of taking a look at. Uh I don't know. I guess we'll see what happens, but it doesn't seem to be having a huge effect right now. Uh the markets are holding up quite well. Like I said, I thought they were going to be experiencing further down pressure, but I kind of like them right here at 685. You know, maybe this comes down one if we get another 2 to 3% pullback. I think that definitely is justified with a recent run that we've had, especially since the beginning of January. Uh quite good gains. Looking at some of the individual names now is an interesting spot because people are going to be probably pounding the table. You're going to be seeing on X right here at some of these prices and that is with Zeda currently right now beneath 20. Zeda has a lot a lot of retail trendiness behind it in terms of the theme for Agentic AI. Zeda I think is the leader in that. Uh what you see here right is at 1986 this was just trading at 24. You also see here path another big leader in agentic AI currently at 14 and path is just experiencing a lot of downside pressure because recently you've had this whole software is going bankrupt with AI basically as we've seen with recent uh you know pieces of technology that have been released regarding AI workflows in terms of agentic and software and stuff like that. So you're seeing like oh my gosh what's going to be happening to the revenues of software and I think path just experiencing some of that downside pressure alongside with it. Uh we'll see what happens with Zeta. But nonetheless, these are at some interesting prices. Looking at some of the data center names, you have Cipher uh down about 4% currently at $18 right now. You got IEN here at $55 down about 3.5%. So these are kind of all following just this high beta type of trading action and behavior uh with the futures that are currently out right now. So in terms of the long-term perspective, I'm not really going to be making any type of moves. Of course, you could have some selling pressure in the short term, but it's not really bothering me that much. I mean, you have hood almost here back to 100 currently at 10618. So, we'll see what happens with this. Uh, but it's looking not to be as horrible. Hopefully, don't put those words in my mouth. Uh, but in terms of what's going to be happening this week, um, that you also had, you know, of course that true social post, you also have this uncertainty that's lying around. That's the Supreme Court. They could rule as soon as next week on whether to strike down these, uh, whole tariffs. Now, the big thing with that is that we've had two kind of huge anticipations of, \"Oh my gosh, are they going to strike them down?\" And then they never release their opinion. So, the market's kind of maybe going to get bored of this, too. Maybe it's already going to be priced in. I mean, in the probability markets, it's already priced in that they're going to be overruled. And we've already had Trump say, you know, he's came out to say that he's a different way of imposing them by using a different type of avenue. So, we'll see what happens. But a lot of these things are, I think, just not affecting the markets as much as some of the bears want them to. Uh some of the big things that we do have happening this week, big earnings tomorrow. Now we have Netflix tomorrow, 3M, United Airlines. So some big ones followed by that. You're going to have Trump speaking. I think he's going to be talking about like the housing market, stuff like that. And then you're going to get PCE data on Thursday. PCE data for November and October. And you're going to follow that up with some more key earnings. So lots of earnings this week to keep on the radar. We're seeing consumer sentiment. That's what we're going to get for final for January on top of PCE data. So, some macroeconomic information that will also be being released on top of all this geopolitical tension. Fundamentally, I still personally the market right here uh in terms of any type of dip buying opportunities, I think I'll be taking advantage of that for the long term. And I currently like, you know, you see crypto right here just kind of been hanging out. It's just it's just there. It's there. Bitcoin just hanging back here at 92,000. This got to 9796 and everybody thought, \"Oh my gosh, it's just going to be another run to 100.\" And now it's just back at 92 and it's just hanging out. Not really making a ton of moves. Yeah, I don't have any personal exposure right now. Just keep it on the radar. You see Ethereum right here back at 3100 when this was at like 33. Everybody says we're going 35. All the bulls hopped on board and we saw selling pressure kind of come through and now it's just kind of hanging back out here. So we'll see what happens and you know how does that correlate with BMR? BMR right now is underneath 30 uh currently right here 29.97. a lot of people interested about Tom Le and Bitmines's recent decision with the huge $200 million investment into the whole beast industry thing. Uh what does that mean? You know, is that just buying brand exposure for that newer generation that's going to be coming into the investing atmosphere at some point? Possibly. Uh so we'll see what happens there. Also with developing an app. So that's where you're seeing some uncertainty with some of the investors in BMR. Uh, personally I don't have any exposure to that, but I'll be watching it to see when a possible decent kind of reversal or as interesting as time could be to enter if there is going to be one. Other than that, that's really all that I have for you guys. Let me know what do you think about all this mumble jumble going on in the world right now. Um, what's your opinion on the market? Um, we'll see what happens if the dip buyers come through and I'll catch you guys tomorrow and we can all enjoy it together. Take care."
    }
]