[
    {
        "video_id": "W_YfizQj8dA",
        "title": "BITCOIN COMES TO PAPA...",
        "published_at": "2026-01-20T09:45:04Z",
        "sort_date": "2026-01-20",
        "url": "https://www.youtube.com/watch?v=W_YfizQj8dA",
        "transcript": "Ready? I'm ready. Let's go. Let's go as soon as possible. And we're live, guys. Welcome to another episode. And as you can see right now, Bitcoin is in a very interesting position because it's kind of got rejected from this resistance we've been poking at during the last few weeks. And last week, we actually had kind of a fake breakout above the resistance. However, we get sent back home quite instantly. And now we're coming home to Papa. That's why the title of this video is Bitcoin coming home to Papa. At least it is in that direction. Now, now who is the papa? The papa in our case is the 200 week moving average here at the 57k approximately currently. And as time passes is going to climb and climb and climb and climb and climb. And by the way guys, I have made this visualization here. If you go to bullmay.com/ivan about my plan and what I'm doing and what we have been doing because I keep repeating the same thing over and over again. But now you can go to bullmay.com. You can see when we derisked exactly and then you see for 2026 and by the way you can also see all of the tweaks we made and so on. But then you see here most importantly 2026 we have two scenarios either we buy around the 200 week or we buy above the 50WE and now we're waiting we're waiting for this we need to see which way the market goes. don't have to predict it because it's all about reacting to the momentum where the market is going and currently since October 8th it is pointing to the downward direction and that's why the current papa is at the 200 week moving average waiting for us okay very very important now can this change absolutely it could change if if it is the fact that we start pumping out of nowhere we would turn bullish but the scenario holds very very clearly now and um imagine just all of the emotional roller coasters that people had during the last week with the green line with the market structure really there's so many news just in the last few days and if you trade based on that based on the headline you try to adapt you're running like a chicken without the head you don't know what is happening instead you zoom out you see actually what's happening just uh objectively objectively objectively nothing really has happened here and objectively we're in a bare trend we're below the 50 average we cannot even get above this resistance so our uh verdict for Bitcoin stays the same we're risk off We're conservative. We're waiting for either this to happen or or or this to happen. And now we have a very very very nice plan here with exact visualization. Some people are visual learners. They need to see exactly the timeline where we've been and the timeline ahead. And now we have it right here. So check out bulmay.com/ivan. Also another thing, if you are not part of our newsletter, many people don't even know that we have a free newsletter. Also in the description, you can see it, but it's uh boommy.com/subscribe. just you know put your email here and daily you're going to be getting insights uh straight into your inbox. I mean it's very very nice because I mean at the end of the day it's uh you get real-time alert whenever there is something big whenever there is something significant you will be guessing it. So check it out. Now guys in terms of what's happening we have more and more escalation. This is something that the markets I can tell you won't like too much with Trump with Greenland with everything that's happening. Trump. I mean, Trump is posting weird stuff on uh on truth social. He's planting the flag. He's sitting in a room with map where Canada and Greenland and also Venezuela is part of the US. So, let's see where this is going to land us. Macron trying to contact Trump. Trump is posting it on online. Also, you remember that uh yesterday there was this news that uh Norway contacted Trump kind of like Macron is doing here, you know, um contacted Trump trying also get him to talk to communicate to, you know, align align and Trump answered, \"Hey, you know what? You did not give me the Nobel Peace Prize. So I have I no longer feel an obligation to think purely of peace although it will always be predominant but now think about what is good and proper for the United States of America. Denmark cannot protect the land from Russia or China and why do they have a right of ownership anyway. Exactly why why there are no written documents is only that a boat landed there hundreds of years ago. Guys, I can tell you man, if something happens here, the the market is not going to like it. Marcus don't like uncertainty. And it's crazy like why cannot we be, you know, norm why why does all have to go so far in both directions? I remember like in 2010, you know, when it was so much talk about gay marriage and so all of that. I mean, I supported that. I thought it's great. Yeah. I mean, let's uh let's be more progressive. Then a few years later it just goes more and more weird more and okay now your your kid needs to chop up the sausage and if you tell something against that you're going to lose the kid like you know it goes like mental and now in in the other direction where it was supposed to be pro peace it was supposed to be super pro- crypto and now what the hell do we have now I don't know guys I don't know what is this you guys let me know in the comment section but one thing is certain markets don't like uncertainty h uncertainty is the only certainty and um when if you if if you're going to have this kind of rhetoric now and with the tariffs and everything and everything uh S&P 500 will be shaky uh and the only assets now that are really really confident it's gold it's silver it's precious metals and that's also why I keep saying you know 360 be 360 investor because in this crazy time it's too vol like everything is super volatile so when you have uh changes in what the US president says and thinks on a daily basis like is you need something safe and uh what do we have here? The precious metals that's why they're they're just going up and up and up. I mean literally every day, every week up and up and up at some point is going to change at some point is going to be different but for now there's just a lot of fear and a lot of uncertainty and that's why gold is is being so popular and of course silver and everything else when it comes to hard assets disconnected from uh from the government. Now Bitcoin will also pump. I think towards the end of the year we're going to see a massive pump once we enter a bull trend because Bitcoin of course fits into that description also. Um but just like gold had a bare trend in the past before it started to pump. The same thing now is with Bitcoin is in a bare trend at some point it's going to exit bare trend and it's going to go towards a million dollars. We're going to be there for that. Uh for now it is what it is. And look here Ray Dal is discussing that the big things are going to happen very very soon with the dollar. Listen to this. I think that um right now we are at a decisionmaking point and very close to a recession and I'm worried about something worse than a recession if this isn't handled well. A recession is two negative quarters of GDP and whether it goes slightly there. We always have those things. We have something that's much more profound. We have a breaking down of the monetary order. we are going to change the monetary order because we cannot spend the amounts of money. So we have that problem and when we talk about the dollar and we talk about tariffs we have that we are having a profound changes in our domestic order how ruling is existing and we're having profound changes in the world order such times are very much like the 1930s I've studied history and this repeats over and over again so if you take tariffs if you take debt if you take the rising power challenging existing power if you take those factors and look at the PA factors that those changes in the orders the systems are very very disruptive. How that's handled could produce something that is much worse than a recession. >> Yeah. I mean you you may have global conflict. You may have all kinds of stuff. And Ray Dal if you zoom out he's been quite spot on when it comes to gold. He's been preaching gold for a very very long time. He's also bullish Bitcoinist you know but now that everything is actually starting to happen because he's been preaching it for maybe 10 plus years with the changing world order and everything and it has taken time to really become a reality but now that it's actually becoming a reality looking back at everything Ray Dalio said it makes perfect sense and we've been following Ray Dalio since 2017 2018 I mean since the early days of the channel now also looking at what's happening in crypto you have the merger of uh crypto infra and the stock market. Look here uh New York Stock Exchange is launching 24/7 stock trading through online tokenized exchange. Now this is a permission blockchain. So it's not it's not really comparable to uh to real blockchains but what's happening here is that you have 247 stock trading and of course the question is how much attention will this take from crypto? Some people are saying you know why trade bonk when you can trade Apple and there is some truth to that. I mean Apple is like many other tech stocks pumps a lot. If you just look at the performance uh especially since the COVID lows like after the COVID mania then the crash in 2021 2022 I mean since then like all of the tech stocks are doing extremely well and I think that's going to be a very important question overall for crypto. What is the exact selling point? Uh and how do we lean into that? And there are some big selling points. For example, the permissionlessness that anyone from anywhere in the world can trade and we actually have tokenized stocks in crypto also. Um, you have the uh immutable uh blockchain, no one can take your assets. You have neutral money such as Bitcoin, digital gold, fixed supply and so on. So there are still a lot a lot a lot of benefits and also when it comes to stocks, when it comes to other assets, it will go in uh in trends. So currently memes are not a trend. uh instead people trade stocks. The average investor is all in stocks. They love stocks because stocks pump a lot. At some point stocks will also enter some kind of consolidation, some kind of downtrend and then a lot of interest will be on memes again. When stocks at at some point enter the calmer time now they're not calm now. Now they're pumping a lot. Look at SanDisk. We in bull menu we discuss a lot you know SanDisk this and that is been crazy crazy calls we've had. uh but it's because of the AI but it's going to be sideways at some point then of course you will have more interest in in memes and in all coins and so on so forth uh but for now it's it is a good question if we you have 24/7 stock tracing through only tokens exchange what kind of volume will that be versus uh what crypto has now and what kind of volume is going to bleed into the into the stocks because at the end it's all a ticker so one kind of volume that will never bleed is all of the crypto finance which cannot not enter the traditional TRA system because not all of it can not all of it has you know full proof of fund so to speak not all of it has full uh full origin tracing not all of it wants to do KYC so of course there are many things that TRA will not replace but still it adds to our 360 hypothesis that you have to really be in all assets all assets are just stickers at the end they're just stickers wherever is the trend that's where we are and we're keeping it simple our strategy is super super simple Guys, welcome everyone who is watching live. Let me know how you're doing this fantastic Tuesday. Tuesday. It's Tuesday in it. How are you doing, guys? Check, check, check. Big shout out to Guzman for timestamping us today. And um then I see Matt, I see Dab or is it Dab or Guzman today who is timestamping? Um either one of you guys big big shout out. Let us know also where did you in? I mean it's it's it's nice to see we have the whole world basically represented here. And um on this note, let's check the overall news uh with u with alts with u precious metals with uh everything else. Then we'll go to your Q&A. We have quite a a lot of minor news that I just want to blast through. So we have the full state of the blockchain synced up. But let's check a few altcoins first. So Bitcoin is currently Wow, that's interesting. Look here on Binance. It is 91. Here it was some crazy. I just saw here in as an average it was like 500 bucks lower but now the arbitrage disappeared. I mean I don't know if you saw just a second ago it was like hundreds of dollars lower here but anyway now now it's swing up again. Arbitrage is gone. Uh Bitcoin is 91. Uh let's look at Soul. Soul is the same as like the last weeks. It's at this mega mega mega support. If it loses that support it's still the same um idea. It has a bit of support here still at like 90, but other than that it's right here at uh 27. And many people are shocked. I mean, how can you say 27? Well, look at any old coin. When Bitcoin goes to 200E moving average, what happens to all coins? You're going to see you're going to I mean, this is not even that bad. I mean, to be fair, this it's it's not even that bad. So, Sana or and even ETH, there's they have no special status. They also dump a lot when Bitcoin dumps. So this is why we have this uh uh drawn like this. So we have support until 90ish. If you break this one, you break the support, then it's goblin town, not 30. So keep an eye on that. And from the bullish perspective, if we flip on flip the from um from bare outlook to bull, then if we can go above 175, then it's a good signal to uh to be bullish again. But for now, uh leaning more towards the goblin town. And of course, we'll be adapting in real time. uh ETH I mean also it's kind of the same it's derping around here at the 50WE moving average with the 50WE moving average it for for alts it's not really that big of a signal because they do whatever Bitcoin does so if Bitcoin goes to the 200 week it's not like this is going to matter and also here this moving averages they matter when you have a trending market and if has been basically chopping since uh since 2024 so this you know above below above below it it has little signal when it's flat like this when the moving averages are flat because it's just chop. There's no like major change of trend. Normally the 50we moving average it's a good signal when the trend is changing when you had massive massive bull for years and years and years and now you go bare. Okay, that's a signal. If you just have chopped and the 50we uh yeah I mean basically we've been chopping around this 50e for uh for the last year. So very little signal in it. Um instead I would just be looking at Bitcoin and then ETH is going to is going to go where Bitcoin goes. If I if Papa is Bitcoin, if it makes sense. Okay, the same thing by the way with Solana and everyone else. Now, uh BNB a bit of support here. Bum bum bum bum bum at previous highs, but bare trend and uh yeah, bare trend means bar. Keep it simple. In terms of the target, let's say we go below this uh uh 800 mark, which was this previous high. Then it's uh boop boop boop towards here. Uh 550ish. So keep an eye on that. Ax any Avox fans? Holy crap, guys. Yeah. Yeah. I mean see yourself. It's going to go to eight. If it breaks this low here that it created a few uh weeks ago, it's going to go right here. Okay. And then maybe alltime low. Let's see what's going to happen. Um yeah so if you have any other coins you want us to discuss then uh save it for the Q&A. Let me just go through a few news. So the stock market is going 24/7 is going to take volume from crypto but uh um at the same time the whole world the whole financial world is also getting used to 24/7 trading. So potentially uh it will give us also some investors because if anything crypto is the most craziest market. So when we are in a bull trend is going to give us even more investors who are now used to 24/7 some hacks. This is all by by the way I know some people are asking me all the time Ivan why don't you sts uh sorry stables why don't you stables not all um and I I keep saying you know for me it's just another moving part I don't really like another moving part uh part you I just show you that hack we're going to be discussing but also a itself the biggest uh look here the the biggest protocol for lending it had also a critical vulnerability in zk sync Okay, so luckily this time no funds were stolen but because of a compiler problem. This is not even an error that the devs did but because of the compiler they use LVM which is like the biggest compiler. I mean it's super established uh you have a vulnerability in our contract on zking that could have resulted in user funds being stolen if the good guys haven't didn't find it first. So you always have a bit of extra risk with all of these yield generation platforms such as a and others. Uh so even the biggest ones could be in in danger. So just keep keep that in mind that when you uh when you lend your assets on on a it's not it's not risk free. Uh it's it's kind of low risk but you never know there is more contract risk. Always smart contract risk. Next you have Machina Finance. Another one of these platforms. uh they they had they had a stable coin uh hack uh so via flash loan they got the wrecked. I haven't used it but uh yeah just to show you guys when it comes to DeFi it's in my mind not really worth the risk because you have other things which can give you way better outcomes and that's trading when assets are entering new trends. For example, Nvidia 44% since bull trend eight months ago. Fantastic. Alphabet 88% since 6 months ago. Fantastic. So, from a riskreward, I like trading assets more than just staking and hoping that the devs did okay that the that the devs didn't mess anything up. Looking at crypto, you also have and you know, you it's not like you have to wait years and years and years. If you get in a nice bull trend when it just turn bullish, it's way better. Way better. So, if you want to get access, go to bullmania.com link below, watch the free tutorial, free free training video about mechanical rules and then you're going to get the tools. But yeah, it's it's all about riskreward. And yesterday we discussed this thing with airdrops. Some people were asking, why don't you form airdrops? Do you like farming airdrops? Said I'm not forming airdrops because it's not in your control. Like you don't know are you going to get airdrop? Are you not going to get airdrop? How much? You have farmed for 5 months. You spend so much time, so much money, so much fees and so on so forth. And what do you get back? you don't know. It's not in your control. Instead, trading the trends that is in your control. So, that that that's my uh that's my conclusion here. Next, you have Mega ETH opening for um mainet very soon. So, they're going to have global stress test. This is like another ETH EVM chain layer 2, which is supposed to be super super scalable. Uh yeah, I mean, let's see. It's another ETH. It's another L2. uh will they have like mega ETH season or or something like that that coins launching there are having a pump and um potentially but now in this bearish times uh people barely care about ETH and now they're going to be caring about NL2 potentially I mean it is now that it's a good good idea if you have time to be part of new ecosystem because you never know maybe there will be fantastic new maybe it's going to dominate the next bull market probably not but you never know so spending a bit of time poking around a bit could make sense. But recently we also saw another uh project launch which is Monad and um yeah I mean you see yourself no one really cares now people cared during the first day now no one really cares I think it's going to be different once the bull returns but for now a lot of these projects it's they're launching into the void okay they're launching into a big void so um this is just for you knowformationalformational not trading not um not doing anything with financial but seeing what's happening and it is happening. So, we're going to keep it on the radar because in the bullet it may actually be interesting. Now, guys, you have Satoshi era wallet moving 85 million in Bitcoin after 13 years. People are freaking out saying that potentially they're going to sell um which could happen. At the same time, it's uh uh it's not too it's 84, so it's not too much. And it could also be that they they are moving to protect the capital from uh quantum risk. Okay? Because old addresses they are not hashed. So when you have an old wallet they may still use the raw public key instead of the hash public key which is the modern Bitcoin address. And the hash public keys are protected from quantum. Uh the unhashed they're not. So could also be that they're just moving in order to protect the uh the wallet. Um you have this rug happening yesterday. White whale memecoin. Um, memecoins are fun, great opportunity to make a lot of money, but you literally have to be terminally online monitoring hour by hour. You miss one hour, money is gone. Okay, it's it really is different kind of uh approach. I think for most of you guys who are watching this, I mean just looking at my YouTube analytics, I don't think memecoins are for you guys, especially the this, you know, trenches trenches because you have the Gen Z's whose brain is fried. They they they don't have any attention span for them. It's perfect. Okay, they have all of these hundreds of meme coins popping up. They they're in, they're out. While if you're slightly older, I feel you have a bit different mindset. You know people buy and they hold and they're like become part of community. So is the typical boomer bag holder and and boomer in this case is if you are like uh 25 you're 25 years old like in in this kind of environment you're becoming a bit of boomer you know you bought coin okay guys let's go community I'm part of this case they have so short attention span you know few seconds bum they buy there's hundred more memes bum bum bum they sell so it it's another lesson that um for most people the cars are really stacked against you when it comes to memes but it's a big industry It's also a driver behind a lot of crypto demand. So let's keep an eye on that. But yeah, don't touch it. Don't touch it. But you could buy the derivatives of it that like the the coins that will benefit whether it is pump or sana they are benefiting from all of this and uh this behavior is not going away. This behavior of market trading, market speculation is is not going away anytime soon. Uh next you have uh Bermuda working with Coinbase to put their land registry on chain. So they're going to both put the economy, but more specifically I read is going to be land registry. Um they will have stable coin pilots and tokenization efforts and eventually they will provide the benefit of lower cost and a greater Yeah, I mean great. I don't know which coin this is going to pump, but it's good for Coinbase stock. I can tell you that if you're a Coinbase holder, let's see how their stock is doing. I don't know if it's going to pump anything else. Uh oh, yeah. Wait, stocks. But at least it's good for the shareholders and you can become a shareholder, a sophisticated share shareholder. Now, I wouldn't touch it currently. It's in a bare trend, but once it is bullish, fantastic, fantastic, fantastic. At some point it's going to flip bullish. Uh for now it's in a deep bar. Uh let's see. Um oh by the way if it goes to a 200 week you can also buy here. Even in the bare trend if it goes to 200 week it's it's still good uh riskreward because it kind of just now got below the 50 week. It got rejected down. Boop. So where is heading? It's heading to papa right here. Yeah. Could could be interesting. So I don't know if it's going to pump like anything. People are saying oh it's good for crypto. It's going to pump Bitcoin or ETH. I don't know. I don't think he's going to pump anything except coin coin. Okay. Except the coin uh which is the coin by stock. Okay. Now I don't know how much Bermud I guess it's more of a pilot because this is not going to give that much revenue I suppose but it's a pilot. You know today it's Bermuda tomorrow maybe there's something else maybe maybe there's something bigger. So Coinbase has long believed that open financial systems can drive economic freedom mambo jumbo economic freedom financial inclusion. Um, leveling the playing field. Fantastic. Fantastic. Bermuda leadership shows what's possible when clear rules are paired with strong private public collaboration. We are excited to support BA transition towards an onchain economy that empowers local business. Yeah, I mean for stock this good. This is good. I like this statement for for the stock. So once stock is bullish. Fantastic. Now Magic Eden. Uh are you guys using Magic Eden? The NFT marketplace. Uh they're bullish. the speculation. Okay, the m the magic eden CEO is saying that prediction markets are all over Emy's and the news betting is the second fastest growing industry in the US after sports book sports chips are all over everyone's favorite sports broadcast hyper casual gamers games plus real money gaming are converging and this is very true like the norm is what the norm is picking up from crypto it is prediction markets they love that it has true product market fit so the trend is more speculation not less, it's more speculation. And obviously crypto is very nice there because you speculate, okay, you have to withdraw the funds to a bank or something, they ban you because they don't understand. So from this speculation trend, crypto should be the number one beneficiary long term because again, you want to have a nice smooth global experience. Uh Coinbase CEO will try to figure something out in Davos, which is right now uh World Economic Forum. um to basically put this bill together. I don't know what they're gonna do there in Davos because yeah, I mean, listen, they're gonna fix something in Davos in some meeting room. They're gonna bring it over the line. I doubt it, but listen, it's good that they can meet potentially something's going to happen. So, he will discuss the US market bill with bank executives. He's going to try to convince them in Davos. Okay. Uh, Came CEO Branch said he will continue working on Okay. We're going to continue to work on the market legislation and meet some of the bank CEOs to figure out how we can make this a win-win. Yeah. I mean, let's see, guys. Will he jing mingle jingle rub shoulders what's going to happen? Maybe they can reach reach some agreement in Davos. Next, guys. If you are a dev or I mean nowadays to be a dev, you don't actually have to be a dev. and vibe code most of it. But Pump Fun is launching new investment arm for funding startups. So basically, if you want to get investment from them, check this out. It will advance the startup ecosystem. Let's actually see if they did a video. Did they do a video? Let's let's play the video. I want to see the the ad. I want to play the video. Let's see what's happening. >> Good morning, ladies and gentlemen. I'm here with my co-fucker to proudly announce that we have raised $15 billion. We plan to invest those $15 billion into Young Founders just to [ __ ] them over and dump on retail when we >> Okay. Okay. This is ACZ. I get it. This is the market. >> So, and good luck ever getting a hold of us unless you're really nice. Okay, let's talk. I mean, I love the simplicity here. So, look here. Have a product or an idea. Normally, you would say, \"Okay, go build it. Go make it happen.\" No, tokenize it, guys. Why Why didn't we think about that before? Why build Why make it a reality? You can tokenize it. Huh? Maybe we should tokenize it. Like it's like Jesse. Jesse tokenize the twins. I don't know. Tokenizes. Okay. Fantastic. Fantastic. Fantastic. Yeah. I mean, why not? Why not? Why not? Why not? Uh I haven't heard about pump in talks with X integration. Holy crap. And that would be that would be quite crazy. I mean, exactly. You can tokenize anything. You see a tweet, you can make a memecoin in a in a millisecond. But you know, it is in line with this mega speculation wave that's happening. Okay. So that's very very important. Literally said sold to 1,4 months ago. Yeah. Everything changed on October 8th. We were bullish before October 8th, then we're bearish. It's kind of like, you know, when it's sunny outside, you take sunglasses. When it starts to rain, you take on a uh umbrella. Let's say I tell you, take umbrella out. It's raining. Will you will you tell me but yesterday you said to take sunglasses? Like, are you dumb? Like, I mean, it's it's for this reason we have now the visual the visual representation. Like, I'm tell it's raining. It's October 8th. It's raining. Does it matter that it was sunny? You can read here. Boom. Boom. Xbox expose Xbox. You can This is This is the timeline. This I I now made a visual timeline. But it's crazy, man. Is wait. I actually have a Wait, wait, wait, wait, wait, wait, wait, wait. I I actually have a tweet here with it where like Oh, yeah. Yeah. Exactly. I I actually had this exact situation here. Look here. This was in November. I posted Ivan bullish since January 2023. Okay. Ivan calls Bitcoin top on the day October 8th. Guy in the comments. So, you were wrong until October 8th. I'm telling you guys, it's raining today. Oh, so you were wrong yesterday. It was sunny was yesterday. So, you were wrong. So, Ivan, you were wrong. SO, YOU'RE WRONG. YOU'RE WRONG. GUYS, WHAT'S HAPPENING? WHAT'S HAPPENING? That's why you can make money in crypto because this is the level of like analysis people have. Crazy, man. Crazy. So, you were wrong. Anyway, big shout out. Big shout. Big shout. Big shout out. Big shout out. You make the content fun here. If you didn't ask the question, we wouldn't have fun. Uh, you make the content fun. Big shout out. Anyway, so what were we speaking about? I don't remember. Let's go to Q&A, guys. I think that's uh that's that's a signal for us to go to Q&A. Um, yeah, let's go to Q&A, guys. Big shout out to the guy who has the question. He's great. Uh, big shout out to Guzman or Dab. Who who's Dab or Guzman? Big shout out. Big shout out. Big shout out. Smash up the like, guys. Go to bullme.com if you want to learn trading. If you want to get access to the money line, the money scanner, and if you want freebie, I know many people they want a bit of freebie, free, free, free, free, freebie, freebie, freebie, fully free. Go to bullming.com/subscribe. You find it also in the description below. And uh uh enter here fully for free. Fully freebie. I know like people there's al but you have something for free. We do shows every day, but no, no, but do you have something free? Okay, listen. If you want, we have a free newsletter and and we I mean we've had it for for for a while, but I know many people don't even know it, but booming.com/subscribe. Go there. Okay, guys. Let's go. Let's go to Q&A questions, answers, debates, discussions. Let's go. Let's go. Oh, yeah. Where is the beat? That's That's for sure. Let's see where where is the beat? I think the beat is in this. Let's see. Let's see. There you go. There you go. I I need to have this over overlay. You like the beat? You like You like the the pump. Okay. Micros, let's check. Let's check. Let's check. Maji MSDR. Ah, look here. So, micro strategy there is a bit of Oh, okay. So, I need to one second guys. I need to add the beat here also. I I want the beat. Now, when I switch it, it kind of changes. Beat background. There you go. There you go. There you go. Wait. So, we have the beat here. We have the beat here. We have the beat here. Here. No beat here. Oh, here is also beat. Okay, that's good. Wait, wait one second. I just want this beat to be fully figured out. Here is no bit. One second. One second. I need to add, as you see, I'm one man show here with the technical technical department. I'm the technique. Now, we have the beat here. Okay. I'm the technical department. I'm the market analyst. I'm I'm freaking everything, guys. I'm freaking everything. I tell you when it's raining. I'll tell you when it's sunny. And I can tell you here with Micro Strategy. So, um yeah, I mean it's it's kind of interesting that I said 200 week moving average. This is It can still go way lower. Like, let's see here. Let's see here. But, you know, it it's not too dumb to buy here. It's not too dumb. You're It's still in a bare trend. You should know that. Last time it went how much? It went below. Yeah, guys. It went another 50% below. So, you can still lose half of your money and then you have to wait like a year for it to like almost one and a half years for it to go back above the 200 week. But that's why you don't have to go all in. But, you know, just nibble a bit. Now, my concern with micro strategy, guys, is that I don't truly understand it. Like, so I'm not going to be buying here because guys, I I don't get it, guys. I don't get it. I don't know if it's legit. I don't know if sailor and it's, you know, it's fine. You don't have to attack me for that. Some people say they understand it fully. I can be upfront. I say I can tell you I don't understand. When he says Bitcoin yield, I don't understand it because Bitcoin has no yield. ETH has yield. You can stake it, you can get more ETH. Solana has yield. You can stake Sana, you can get more Solana. Bitcoin has no yield. So when sailor is saying we you know we delivered bitcoin yield I I don't like it man it's not for me doesn't mean that it's not good but just you know the from a uh asset perspective um there are simply I would rather just you know stick to bitcoin and stuff like that so I just don't get it I don't get it they have many different instruments they have this and they need to pay dividend they need to pay yield on on them like to to the full picture is too complex man I don't understand fully the risk I don't I don't get the risk. What is the risk? Then seller does this website where he has a rocket and like all of these different he does like you know strike strife what hile is called it's like different parts of the rocket like it it just makes me a bit uneasy. Okay. It makes me a bit unlight slightly uneasy. So, but let's imagine that it is uh like super legit and everything, you know, then DCAing in at somewhere around 200 week. It's not too crazy. If you're okay with losing 50% potentially, but because you're not going all in, uh maybe it could be Listen, if you're a Sailor fan, fantastic. I'm not I'm not. So, I don't Yeah, I don't I don't I don't like it. I don't like I'm I'm uneasy because I don't grasp it. And listen, it's it's impossible to grasp all assets and like everything everything. Uh so it's okay. It's okay. It's like Warren Buffett says, you know, I only invest what I understand. So with this thing, I don't get it. Uh I'm not I don't I don't know if it's a Ponzi or not. I mean, it is a bit recur recursive where, you know, you buy Bitcoin and it goes up because you're the biggest buyer. You raise money because Bitcoin went up so you can you buy more. So you're the big So I I'm not a big fan of this recursiveness. I would rather just buy Bitcoin because even if it goes down, it cannot go to zero like with with a company because when you buy my strategy, it's a company. So listen, it could potentially go to Bitcoin cannot go to zero. Okay, that that's important. So yeah, that's it. That's it. Um so all in all from a technical perspective like tech not tech but technical analysis it's not too bad here at the 200 week but just know your risk it can go 50% down like it did last time. It can take a year for it like one and a half years to recover but it can still be a good like long-term accumulation. You can it can be that. So that's that that's what uh is my view. Okay. Uh more question more question. Strategy looking wrecked. I mean it's a 200 week moving average. It's um it's going to go down another 50% though. Okay, like last time. Uh, but in general, you know, 200 week moving average is is not a bad deal. It's not a bad deal, but uh you you need to be smart here. You need to structure the entry in a smart way so you don't uh follow in and uh and it dumps 50% on you. And uh that's not an issue. I mean, you can you can have a more of a long-term view. But if you want to learn exactly know how to ladder in, how to buy, how to exit position, how to do risk management, then go to booming.com and watch the free training. Tesla, Tesla, Tesla. Check Tesla. Check Tesla. Tesla Tesla Tesla Tesla. So Tesla's looking very good. Uh charts good narrative good Optimus car AI everything. So above 50 week above I mean it's it's very good. It's very good. Now the only problem is in cases has a fake alltime high. So you know I'm not a fan of fake alltime high guys. I'm not actually here. I'm not a big fan of fake alltime high. This is what happened to Bitcoin in uh no in October. That's what that was our one of the first signals for us to become bearish. Okay. It also happened in um 2021 with Bitcoin fake alltime high. So yeah, I'm not a big fan of fake alltime high guys. So be be a bit careful if it opens if it goes below the flip level here. Uh I would be actually very careful. And why does it open so low today? 420. Okay. Yeah, it also has like a bad opening today. Let's see. But yeah, in general, I don't like it. This is just uh you know from experience. Every time I've seen this it's it's not been too great. Doesn't mean that it needs to be you know like that in the future but ju just something to keep in mind. Keep in mind so the the better entry for Tesla. Let's say you want to trade it. It is in a bull trend. So you're not in an early bull trend. I mean you should have bought here to be in early bull trend. So you're not now you're not in early bull trend. If you want a nice entry I would actually wait for it to to do proper alltime high. If you want to trade here, let's say use leverage or whatever, you can wait for it to proper alltime high. Now, like, man, I don't know what I was doing. Is it a fake alltime high? I'm not a big fan of that. Uh, and people always ask where to trade. Go to bullmlay.com/partners. You can uh you can trade on Pionex, by the way. Um, on Pionex, you can do bots. You can copy bots. We don't have Oh, actually, yeah, we have a Tesla. Look here. We have a Tesla. We have a Tesla bot here. You can copy that. Um so Pinex is one way to trade Tesla. Another way is on buy bit. You can trade Tesla on buy bit uh with leverage if you want or just spot or on bitun you can trade Tesla. So it's not only that you have to go to your broker. You can do it in crypto native platforms also. But yeah that's that that's that to summarize guys. If you are holding it like if you if you've been uh holding since the past since the previous bull trend nothing to worry about. It's still in a bull trend. Uh if it goes bare trend be careful be super careful. If you don't have it, I would wait for a real alltime high because uh if it goes to real price discovery, then um like it doesn't matter if you buy here at 430 or here at 5. Like if it goes to real price discovery, it doesn't matter for you for from a trading perspective. It's just another trade and you want to optimize riskreward. So proper alltime high would be my my uh requirement here. In current legal environment, do you think culture poly market will have a token in 2026? Probably. I think in the in the bull market 100%. Why not? Why not? I think so. It's a super I mean it's very good legal environment. Oh yeah, exactly. Another interesting thing is Elon buying a Ryan Air. I did see it yesterday. Uh maybe he's finally going to make it nice. Uh but I mean it is nice for his own audience. Look here. Where did he say that he wants to buy? He's engaging a lot with Ryan. Holy crap. He said basically he wants to buy. I really want to put the Ryan in charge of Ryionaire. How much does it cost to buy? Let's see the prediction market. Will Elon Musk buy Ryan? 7% chance. Okay. It was 15. That That'd be crazy. That'd be crazy. He needs to put Starlink in it. Exactly. I don't have Ryan stock. No. No. We need to add the European markets. So, we have the US markets added. Uh we're going to be adding DAX and let's see where is Ryan. Oh, no. We actually have it. We actually have it. It's up uh 8%. Uh there we go. So yeah, let's see what's going to happen here. We actually have RER. It's in a bull trend right now. Maybe hate Justin sound, but uh Tron charts looks very good. Uh I agree. I mean we we've always been uh respecting the Tron pump. U Tron is very good. I mean from a the chart perspective is better than most of the uh stuff that uh you know ETH influencers shill you. They shield all of the L2s and then they say haha Tron JUSTIN SON then okay let's look at what you like. Oh you shield optimism you shield arbitum. I mean look yourself. Tron is freaking above the 50we moving average. Tron is a freaking monster here. See the the money money line rejection. But I mean I fully agree. I I I 100% agree. Tron went above their previous alltime high in 2021 and in 2018 and then okay what do ETH podcasters show you where they have all of the allocation? Okay. This is supposed to be like Ethaline. This is Ethaline. This is Ethaline. E, you know, growing the pie. Growing the pie with L2s. Okay. Ealigned. Very ealigned. Orbitum. Ealigned. So, I fully agree. I fully agree. I fully agree. I think Tron has so much uh, you know, unfair criticism from the so-called high priests. It's very unfair. Now, at the same time, Tron Tron did have a crazy start there with Justin Sun like copying ETH and doing stuff and copying the white paper. But listen, that's entrepreneurship. You hustle, you hustle, you hustle this entrepreneurship. That's it. That's it. And you see the result. These guys also copy ETH, but they [ __ ] you that is their L2. They're going to add value or whatever ETH aligned. It goes to zero. So, I mean, um, big shout out to Justin S. I I fully agree. I fully agree. 100%. 100%. I mean, who would have thought, you know, it's crazy. It's crazy. That's why you got to look at the trend. Don't look at the person. See, so many people uh focus on the person. Don't f Don't focus on the person. Uh focus on the trend, the price trend. That's why uh no, that's why we we do manual. Look at the price. Don't focus on person. Don't because if you look at how much bad news Tron has had, you see this is another thing people, oh, why you say you don't need to watch news? I mean you see yourself so much bad press that Tron has had all the headlines all the ETH high priests BSers attacking it and then you look at the price totally different so price is the signal news is for plebe and it's pretty wrong how do you store your crypto oh nice try FBI Lola asking how do you store your crypto that's a good one Uh so will 2026 be a bull market near the end or just a bull trend? Don't don't don't worry about that. Don't worry about that. Will it be this or will it be that? Just uh follow the trend. If it if it turns bullish, it's uh you have to be bullish. If it turn if it continues to be bare, you're bearish. That's it. Don't try to be it's going to be a bull market. Likely it's going to be that likely. Yes. Um for example, if we go to the let's say we go here, I mean we will be betting on buying here at the 200 week as if it's going to trigger the a bull market like this. Of course, we don't know like again just to get your your expectations correct and we don't know what's going to happen. Uh we can only optimize our riskreward to the best possible um um in the best possible way. So uh whether we're going to have a bull market it doesn't matter like again doesn't m for us it's more more about optimizing riskreward buying at around 200 moving average is normally buying like here look at the last time it's like buying here it's buying before the big upside. So we're of course counting on that being the most likely scenario but nothing is guaranteed. I mean maybe we just have a small pump and then back down. So we're going to be reacting in real time. So just I I would set your expectations straight because I mean most people they they want to know will this happen 100% 100 million% because I'm here with my bank to take a to take a loan against my house. Guys go to boom watch the pre you you really need to learn about mechanical rules because when people ask that you know will it be like this will it be a bull market or a or a bull trend um don't worry about that just optimize your riskreward. Uh and that's what we speak about with the mechanical rules. So optimizing riskreward meaning that you buy early bull trends or you buy like big moving average such as 200 week then uh you've done your job you you've done you can only do so much like you've done your job if you've optimized your riskreward then what happens in reality that's it's not in your control so the only thing in your control is to optimize riskreward and that's that uh in most cases it will play out in your favor but again most cases doesn't mean all cases you can have you can be unlucky Okay. Um, so yeah, I mean hope hope it makes sense. Alan, can you add liquidity heat maps to your charts page? Liquidity heat map like what? Bitcoin liquidity or you you mean like the at which prices the like the volume u or which liquidity you want like the dex liquidity, bitcoin liquidity you or you mean volume? Uh I mean we can add anything. We can add anything. I just don't understand really exactly what's happening. what what you need anything happening between Bitcoin core and Bitcoin not I've been hearing Bitcoin core is destroying uh haven't heard too much lately I think Bitcoin core did their update which is not great and then um yeah that's it let's see Bitcoin not what is the adoption let's see adoption Bitcoin not historical adoption. Yeah. So, Bitcoin not has the what is it like 16 sixth how do you say one six sixth one sixth of the adoption. So yeah, I mean it seems that it's kind of have calmed down, but uh yeah, I mean this agreement has not gone away just as Bitcoin core published that update that you can now put the JPEGs and stuff like that on Bitcoin and the Bitcoin knows they don't agree so do their own uh their own u node. But um they're both compatible with each other. So it's not a hard fork. It's um yeah, if you if you don't want NFTs on your Bitcoin, you you write uh you run Bitcoin NOS on on your node. You don't put NFTs in on your machine. You run you run Bitcoin not if you want. You run run Bitcoin core. Ah liquidation heat map. Yeah, that makes sense. That makes sense. Liquidation makes sense. Makes sense. I going to check that. Um what's a good Let's see. Liquidation heat map. Uh that's actually very good. We can speculate on that in the daily. Yeah, I see. I see. I see. I see. I see. I see. Let's check. Let's check. Let's check. Yeah, this one, right? Yeah, this one would be very interesting. Let's see which liquidity it grabs here. 90 or two. Yeah. Yeah, makes sense. Makes sense. Justin Sun also got extremely deep pocket deep pockets short at your own peril. Yeah, I mean this argument works and doesn't. I mean many people have deep pockets and and their coin still goes to zero. Als can tell us all about that. So just look at the chart. Ignore the founder. The founder has deep pocket. Listen, the founder can be a BSer and he never does anything. He just gaslights you. It can happen. Ask the policy. Uh so look at the chart tells you the truth. The chart tells you the truth. Everything else is uh fugazi fugazi. It's a woozy. It's a wise. Maybe this, maybe that. Big shout out to Bicles. Why are your lips so red? Exactly. I don't know why people saying I have lipstick. Some Maybe it's with the camera. I don't know, man. It's uh it's correct. Exactly. Some people say it's lipstick. Where is the camera? for those who like to form RWA on Sana on refinance. Okay, there you go. Original D. Yep. Short the hell out of M my strategy. Still 25% left. Oh, that's See, Mike is shorting the crap out of Micros. There we go. Let's see. There was some good questions here before. Let me see if I can find Ivan. She date them. Okay, guys. Let's wrap it up here. Great questions, great stuff. Thanks a lot for being here. Thanks a lot for contributing to the stream. Smash up the like, subscribe to the channel. We're going to be back tomorrow. So what you need to do if you haven't yet go to bullming.com check the free trading here number one if you want freebie newsletter just go to booming.com/subscribe freebie newsletter and everything is by the way in the description and then um if you want to check exchanges I use get nice signup bonus on all of them you have Pionex bum bum bum bum bum you can trade stocks you can trade commodities you can trade anything here um you can do bots bybit of course Pionex of course and when you click here you see the emojis is because you have the bonus boop boop. You see bum bum bum. You see the emoji slide. It's because I have the bonus bit unix weeks love it. You can go nuts here and of course you support the channel if you do. Guys, thanks all for being here. Have a good day and goodbye guys. Big shout out to Dub or Guzman. Who is time stepping us guys? Who's I I ask and then I don't check the answer. Who is Dub? Are you time stepping us or Guzman? Gman. Gman. Guzman. Gman. Guzman. Big shout out to Guzman. Okay guys, have a good day and goodbye. Goodbye."
    }
]