[
    {
        "video_id": "l6vyrCL56wg",
        "title": "They Crashed Silver on Purpose… Here’s The Real Plan",
        "published_at": "2026-02-01T14:00:06Z",
        "sort_date": "2026-02-01",
        "url": "https://www.youtube.com/watch?v=l6vyrCL56wg",
        "transcript": "JP Morgan just closed their short position in silver at the exact market bottom on Friday and they're pinning it on the Fed chair. And I wasn't going to make this video. I'm literally skiing in Japan as we speak. And I was sitting in the ski lift and I thought, what just happened in the silver market? It pisses me off. And mainstream media is telling you the wrong story. And I believe you deserve the full story. So here it is. JP Morgan and I asked my editor to put the screenshot so on the on the chart so you the screen for you can see it literally sold on the exact bottom moment on Friday. That's item number one. We also had the wonderful coincidence of the London Metal Exchange going offline on Friday, probably the second most important place in the world where silver sold. And then HSBC, the second largest short holder on the LBMO, well guess what? Their systems also went offline. The same time, COMX, our lobbyist in Chicago, raised margin requirements to shake out leveraged traders. And then they waited for Asian markets to close for the weekend because they're 12 hours ahead on East Coast. And then they rattled the market a little bit with a new Fed chair. And you end up with a lot of coincidences. If you believe in coincidences, if you believe in conspiracies, well, that is entirely up to you. I'm of course not pointing my fingers at uh Comx or JP Morgan or any of those. They all have the uh general good of the public at heart just like Bill Gates and his antibiotics and his Russian friends. That story is true. That's very funny. If you haven't seen that, uh go on X. But look, if you hold silver or gold or mining stocks or any kind of ETF or anything, well, the biggest silver crash in 44 years just happened, right? 35% drop in interest in 24 hours. And it could either be a great buying opportunity before silver hits, you know, 150 and so on. Or it could leave you watching from the sidelines because you're now scared. So, let's go back one step. And I hope my camera doesn't fall into the snow. On Thursday, silver hit $120. On Friday, it crashed to $78. I'm a bit concerned about this selfie stick. Now, it was the worst day in silver since 1980. Gold fell 12%. We lost three trillion, just the market value there. But the mainstream media won't tell you this. This wasn't a market failure. It was an engineered flush, I think we should call it. So I looked at the CME silver margin data and I couldn't believe eyes, right? I searched the web, nobody had written a word on it. I searched again Friday morning, same thing. And the discovery of that bit of news changes everything about what just happened. And if you understand it, your position for what could be a tremendous, beautiful, shiny um opportunity. Now, I'm Felix Breen. I'm in a slightly odd outfit, but I'm a former investment banker. I've been studying this stuff for quite a few years. I'm also the founder of the go to cardio where we've taught over 20,000 students and the co-founder of tradevision.io where we make this kind of data available to you know you and me the unwashed masses give you the data that Wall Street would like you not to see. And a month ago I made a video about the December silver crash when we had $84. I showed you the pattern. 1980, 2011, 2025. Same playbook, same players. Believe it or not, same outcomes. Some of you watched it, some of you listened, some of you didn't. Well, they just did it again, but this time it was 10 times worse. So, we've gone through all the data. I read it over the weekend and I I wasn't I was going to I'm skiing. I'm not going to make a video on this, but I think you deserve to understand. So, first, if you actually want to take this seriously and learn the pattern spotting, Wall Street has a very simple three-step system that allows them to put spot opportunities and also tells them where the heck to get out. I will run a live session for you guys on Saturday as a link down below at Felix France/ Training. You can get yourself a free seat for that. That's going to be fun. That's going to be in-depth. It'll open your eyes and how these things work. Secondly, we have a daily and a weekly free metals newsletter. You can get to that at I think it's felix.org/metals, something like that. There's a link down to that below as well. And I appreciate like 10 or 20 thousands of you already signed up to that uh and are enjoying it. It has a sense of humor. It is, but also of course factual. So, I'm going to break down for you here in the next few minutes, and it won't be that long because it's bloody freezing out here. I'm going to break down three critical things for you. first, what actually triggered the massacre and who actually won. I'm just checking we're actually recording. Yay. Um, and then second, my previous thesis is actually now stronger. It isn't weaker. And this crash didn't solve anything about silver or gold shortages. And third, there are some moves that you might want to be making right now. And I'm going to share that with you so you don't just get news and noise at, you know, CNBC. I probably shouldn't say that, should I? And they're lovely. I'm sure the people at CNBC, but they talk a lot. We try to give you insight and then actionable insight. So, let me put this into perspective. First day we hit $120 on silver, alltime high. By Friday, we were at $78. That's a $42 drop, 35%, right? Gold, similar story, dropped 12%. That's just three trillion there wiped out. That's half the GDP of the United States gone in one day because somebody went a little loony with the trading thing. Mining stocks got destroyed, right? The gold miners ETF dropped 12%. The Global X Silver Miners ETF fell almost 15%. New, one of the biggest gold miners in the world. Did they lose all the gold on the ground? No. But they're also down 12%. Now, if you watched my last video, and I know it's always annoying to say that, but you haven't watched it, but you know, if you had, it sounded kind of familiar what happened, right? It's the fourth time we've seen the same pattern. 1980 we had silver thirst, we had the lovely Hunt brothers. They tried to corner the silver market. Uh silver hit 50, but the exchanged implemented their rules, new rules, rule number seven, which we're going to talk about a m a moment and that restricted buying it only allowed sell, which is a wonderful thing if you uh have the power to pull that stunt and silver crashed 80%. The little guy got of course in it, kicked and squeezed out. Then we had the postfinancial crisis rally in 2011. Silver hit $49. The CME raised margin requirements just five times in two weeks. Down 48% again. Same playbook. December 2025, we hit $84. CME does what? They raised the margin requirement twice during very thin holiday trading. So silver crashed like 13% and I told you about that. Now, this one here, in my humble opinion, was also engineered, and I'm not pointing the finger at anybody, uh, not even JP Morgan. Um, so January, what happened? Silver hits 120. Trump nominates Kevin Walsh as new Fed chair, a traditional hawk who might signal less money printing, right? Money printing is good for gold and silver. What happened? Well, leveraged positions on Friday got margin called, stop-losses got triggered. There's this algorithmic cascade that happens and silver crashes like crazy. So we had this four times now. Same pattern, same player, same outcome. The only difference is that they use a slightly different excuse. So how do you know when to buy? How do you know that the market bottom is in? What if silver could test $55 next week or bounce back to 100? Well, some people will panic sell after crashes like this. I'm out. This is too risky. Um, and there is some truth to that. But it's also how you lock in losses. And then there the people who think they can just ignore fundamentals and just follow I don't know what noise. Um but these are engineered events and all of that technical analysis goes out of the window with it because that doesn't matter. Someone's engineering, right? So if you're trying to trade silver or leverage or time the exact bottom of the market or panic sell, you're playing their game. They want you to do that and in their game, guess what? The house always wins. I have a little bit of insight on that. One of my mentors, a wonderful guy, he's also the head of our gold academy. He's a former London metal exchange market maker, one of the guys who was running the casino. But what Wall Street doesn't want you to know is that this crash did not solve the supply problem of silver. It didn't create more silver. It didn't reduce industrial demands from solar panels, electric vehicles, and AI data centers. It didn't change the fact that we are in the fifth consecutive year of a massive $200 million ounce annual supply deficit. You add those up, you get to a billion ounce annual, well, not annual, but total supply deficit. And the smoking gun is I discovered that the CME, the Chicago Merkantile Exchange with Silver Futures Trade, well, guess what? They hiked margins aggressively. So they forced out all the traders to get out their contracts. So with a stroke of a pen or a push of a button, they made it impossible for traders to hold on to their positions, which is exactly what I told you about happened in 1980 and 2011. And that's what explains what's happening right now. Silver paper is dying. It's sort of a reset of the comx, the paper market where people trade contracts for silver they don't actually own, that don't actually exist. It's been dismantled by actually, yes, the loons, you and me. But here's the critical part. They can manipulate the paper price. Of course, I wouldn't say that or claim that they are. Of course, they're not. They are honest, upstanding members of, you know, all all that good stuff, right? Friends with uh, you know, uh, Bill's friends. Um, but they can't create physical silver out of thin air yet. So this crash just flushed out leverage, a lot of retail leverage. The the leveraged silver ETFs went down 66%. Stop putting leverage on something like this. It's madness. And what happens when the market goes down? Well, who was feeling the pain of this silver price going up? It was the banks, the commercial shorts. they could cover their positions and reset the sentiment before the next leg up. So, this is a feature. This isn't a bug. This is how the system's been working for decades. And if you understand what has happened, the margin discovery, the paper market reset, and more importantly, what's about to happen in the next 30 or 90 days, well, your position for what could be a great buying opportunity before silver goes nuts again. Now, I'm not a financial advisor. I'm not any kind of adviser. I'm not registered with anything except for the ski pass people here. So come to your own conclusions. But as I said, if you want to understand the pattern that happens again and again and again and how to position yourself no matter what happens, whether it's this market or the next crash or the rally or the chair is good or bad. I'm talking about the Fed, not the ski lift. Then come and join me on Saturday for our free live training at Felix Front/training. No credit card requirement, no BS. and I'll walk you through the strategies for making potentially smarter decisions. It's not a silver session. Um, we're going to focus more on stocks and patterns, but you can apply that to silver or gold or your favorite tech stocks or anything really that you can put on a chart. Basically, how do we sniff out what Wall Street's doing before it's too late? But remember, mainstream media keeps talking about Kevin Walsh crashed the market, right? We mentioned that. Well, that was sort of the match that lit the fuse. Trump nominated Walsh to replace Powell as Fed chair, who was also a Trump appointee, oddly enough. And Walsh is perceived as a hawk, someone who's more focused on fighting inflation, not printing money, and he doesn't care about keeping the market happy. That was the story we were told on Friday. And the market had priced in a poodle fed. And I've been saying for a while, we're going to get a poodle. We would go, \"Daddy, what do you want me to do?\" You know, one of those. So, what are we going to get? Well, look, Walsh nomination obliterated that narrative. So, the news the dollar searched a percentage point. Now, why does that matter? Gold and silver are priced in dollars. When the dollar gets stronger, it makes metals more expensive for the foreign buggers, right? Like me who have to buy dollars. So, the demand drops, prices fall. And here's the thing, this was the most crowded trade on the planet. Gold was up 66% last year. Silver up 135%. Everyone and their grandmother, including the Uber driver, was in precious metals, retail traders, hedge funds, institution, everybody was suddenly long. And when you have a crowded trade like that, a little catalyst causes what? What Wall Street calls a liquidation event. Lever positions get margin called. Stop losses trigger. the ALGO trading system starts selling. And of course, if you're the one who's running all the trades because you're the broker or the exchange, you know exactly at what price levels, all those things get triggered. Of course, Comx would look at that data and, you know, whisper to a friend or in any way, shape, or form abuse it. They are honest, upstanding members of society. I want to make that very clear. like all people in Chicago, including that little bank that just collapsed. Um, that had nothing to do with silver by the way. They were just generally lunatics. So, what normally is orderly like profit taking, it turns into panic, right? And then on top of that, just I mean, think about all these coincidences all happening on happening on Monday on a Friday just before the market closes, when Asia is closed and all that, Reuters pushed out a report claiming the US was ending support for strategic metals. Now the energy department so the government said it's false and deliberately misleading. Just think about this. The government says this is deliberately misleading. Why would you deliberately mislead unless you had some interest in the outcome, right? But the algo trading systems that already triggered and the mass sell orders were already hitting the CME and then the margin discovery, you know, all that stuff. So with all this chaos happening, look for the mechanism actual tool they used to force the liquidation and that's how I stumbled across the silver margin data and I was you know not exactly surprised but not exactly uh like oh that's wonderful what they did again aren't they lovely people yet financial news sites the trading forums the analysts all that nothing right not a single person is really talking about this and in my humble opinion this could be described as manipulation of course I wouldn't use such phrases because I believe in the uh you know the honorable men in Chicago but essentially what one might say if one were a cynic they used the war snooze as cover but the weapon was actually the margin hike so it's the same playbook we've seen for decades so this time you had a hawkish fet nominee a stronger dollar a crowded trade forced liquidations so the margin hikes the algorithm so will do their thing and they know what levels they do their thing and then you get a bit of fake news on top of that and you know you got yourself a nice big cake for the shorts who could close their positions and enjoy this flash. Okay, so let's start with the basics here. Silver trades in two markets. There is the paper market and there's the physical market, right? The paper market is where most of the trading happens and it's a bit weird that we're in the snow doing a silver bon but this is important. So the paper market are futures contracts. They trade on the comx uh part of the CME group. So you're not buying silver, you're buying a contract that says you have the right to silver at some point in the future. And the paper market uses leverage. So say you want to buy $100,000 worth of silver. Well, you don't actually put up $100,000. No, you just put up maybe $10,000 of margin 10 to1 leverage, right? Which means if it goes up, you make 10 times more money. Now the critical part here is this and the let maybe write this down. Let me explain how margin requirements work because you can use them as a weapon because the exchange our friends at the comx they can change the margin requirement anytime they want. They can say actually we don't want 10% anymore Felix we now want 20 or 30 or 40%. And they know where the margin levels are right now as in how much margin is being used. So, what happens when the margin requirements get raised? Well, you have two choices as a trader. Option one, you add more money to your account to meet the new requirement. Option two, you sell your silver position because you got to. Now, when silver's at 120, most traders were fully leveraged. They had used up all their margin. The exchanges know that data. I'm not insinuating that they would use or misuse that data because as I say upstanding members of you know the Chicago um communities and all that of course but when they hiked the margin requirements and they did it very aggressively this time around the traders couldn't out more money so they were forced to sell and used up all their money and what happens it creates a cascade effect it's like dominoes falling one person's force selling pushes the price down which triggers the next person's margin core which forces the price down more and forces more selling and so on. It's a vicious cycle again and again. It's like a like a big snowball coming down. So why does it matter? Well, they're sort of killing the paper market, aren't they? By making margin requirements so high that traders can't participate. They're forcing everybody out of the paper contracts. And that's what I mean by it's a form of reset of the comx. They're dismantling the paper market for ordinary people. And yes, they can manipulate the paper market. Of course, I'm not insinuating that they would because, you know, upstanding members of Chicago and all that where you know, banks don't fail. But they can create paper, but not physical silver. >> The physical silver market is different. That's the actual bars, the actual coins. You buy it, you own it, you store it. I'd suggest to put it in a privately owned storage facility, but that's really up to you. Now, the physical market moves more slowly. It's based on supply and demand. And what happens on Friday? Well, where the paper market had its heart attack allegedly because of the Fed share. By now, you understand that that isn't really the reason for it, the physical market still has a supply problem, right? The physical silver premium, which is how much people pay in Shanghai over the paper market. So paper price, official silver price, and that's what I pay on top of that. It is at an all-time high. It's some crazy 40 odd dollars above the market. So yes, you can potentially manipulate the paper market. Again, not making any such al you know, al allegations. Um but you know, if you had margin hikes and a bit of fake news and a bit of algorithmic selling, that would be a possibility. Um but the silver market, well, you can't print silver. So what happens? you just create these trading opportunities for the lobbies on Wall Street. And that's ultimately why my thesis on metals is stronger after the crash. The paper market is being dismantled. And all that's left eventually is the physical stuff. And we have a shortage of the physical stuff. Now, you're going to ask me now, well, what happens next, Felix? Well, shall we go through the historic precedents for this, shall we? Um before I start shivering, this coat's actually wonderfully warm thankfully. So what happens because history does repeat certainly rhyme. So pay attention to the margin requirement pattern. I'll walk you through that here. Right. So in the 80s the Hunt brothers tried to corner the silver market. They bought massive amounts of physical silver and futures contracts. Silver went up like 10x and then the exchange came in and said, \"Nope, you can't buy. You can only sell.\" So the hunts couldn't meet their margin calls and silver crashed 80%. Now that was a speculative bubble. The hunts were trying to manipulate the market. There wasn't a fundamental supply crisis. So when it crashed, it took years to recover because there wasn't really any demand for the stuff. 2011, which was after 2008, people lost faith in banks for some reason. I have no idea why. I had some really nice friends who worked at Lehman Brothers. They seemed like responsible people you want to hand your money to. Um, at least they told me so in uh, you know, nightclubs over large champagne bottles. But people lost faith in the financial system after 2008, right? Because that was total fraud. And they piled into gold and silver. So silver went from 18 bucks to 49 bucks back then. And what does the CME do? They raised margin requirements five times in two weeks. Why did they do that? Well, it goes right. Most banks, this is my theory, most banks are always short on silver is what they do. It's a trade they do. So they raised the margin requirements, leverage traders got flushed out. Silver crashed like almost 50%. Now again, this was a fear trade and the fear subsided and we all forgot that bankers were greedy buggers. I used to be one of them. Um, and it took years to recover. Now, what happens in December? Just December 2025, silver hit an all-time high at the time, 84 bucks. CME raised margin requirements twice during very thin holiday trading, right? Silver crashed. I made a video about it. I said this was engineered potentially. Okay, pointing no fingers at all at anybody at JP Morgan or in Chicago. Want to be very clear on that. But here's what was different this time. There was fundamental demand. solar panels, electric vehicles, AI data centers, they all require silver and we are in a supply deficit. So silver recovered within a couple of weeks. It didn't take years like in the 80s or in 2011 it recovered in weeks and then we went on to hit 120 bucks. So right now, well, they're still here, right? We just had the crash. We caught them, some might say red-handed. So the fundamentals, guess what? They're stronger than a Demble. So the question, of course, is will this be like, you know, the 1980s where it takes years to recover? or will it be like December where it takes only weeks to recover? I personally believe it's the latter. But again, I'm not giving you financial advice. I'm not in any way, shape, or form, you know, qualify to do so. Even if I am in the snow on skis, which is of course generally where you find your RAS, I'm not one of those. But you will see more of these. And I told you, in fact, my market maker mentor told you at the end of that last video that, you know, we could see these 30% crashes or more uh because he knows a thing or two about how this works. But until we get to a point where silver is no longer needed as much or the alternatives, and there are some, by the way, from the solar industry, for example, I'm not saying there aren't any. until that changes and we no longer need as much silver because silver is so bloody expensive that it makes no sense to use it for industrial purposes. I think until that point this is a pretty strong market but if you haven't got the stomach for it I also completely understand that I think gold's going to be a little bit less volatile and you saw that on Friday right 30% down one and the other one's like I don't know 10 12% down or something. So you have to think about your time horizon, how long you want to hold it for, what your goal is with it. You need it, you live off it at some point, you to sell it, all that stuff, and then position yourself accordingly, and above all else, the most important riskmanagement rule really is just position size. If you're in something so much that you're losing sleep over it, you're in it too much. If you got some value out of this, join me Saturday. Felix runs/training. Share the video because very, very few people understand how this works. mainstream media is telling you complete bollocks on this if you're asking me and um I hope to see you on Saturday's life and I'm now going to continue this is I don't know what you can see of this cuz it's snowing pretty heavily but there is a beautiful run down here somewhere that I'm going to try and find and uh try and find my friends all the best to you take care if you hold a 401k a savings account bonds or cash shares ETFs what I'm about to reveal to you could mean the difference between preserving that wealth through The biggest monetary shift",
        "summary_hu": "A JP Morgan a piaci mélypontnál zárta le a short pozícióját az ezüst piacán, miközben a mainstream média eltorzítva tálalta az eseményeket. Az árfolyam drámai, 35%-os csökkenése mögött mérnökelt események és a kereskedelmi rendszerek manipulációja áll. Ahelyett, hogy a piaci hibáról beszélnénk, egy tudatos tisztításról van szó, amely lehetőséget biztosíthat a piacon belépni kívánó befektetők számára.",
        "summary_en": "JP Morgan closed its short position in silver at the market bottom, while mainstream media misrepresented the events. The dramatic 35% drop is attributed to engineered events and manipulation of trading systems. Rather than a market failure, this event represents a conscious flush, potentially providing opportunities for new investors to enter the market.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 50,
        "key_points_hu": [
            "JP Morgan a mélypontnál zárta a short pozícióját az ezüst piacon.",
            "Az árfolyam drámai zuhanása mögött mérnökelt események állnak.",
            "A piac tisztítása lehetőségeket kínálhat új befektetők számára."
        ],
        "key_points_en": [
            "JP Morgan closed its short position at the market bottom in silver.",
            "The dramatic price drop is due to engineered events.",
            "The market flush provides opportunities for new investors."
        ],
        "main_topics": [
            "Silver Market Manipulation",
            "Margin Requirements and Trading Strategies"
        ]
    }
]