[
    {
        "video_id": "cGNtHMSZMl4",
        "title": "Bitcoin dumped to 75k. Here’s what matters next. #shorts",
        "published_at": "2026-02-01T20:15:27Z",
        "sort_date": "2026-02-01",
        "url": "https://www.youtube.com/watch?v=cGNtHMSZMl4",
        "transcript": "Bitcoin went all the way to 75. This is quite close to the low from April 2025. But most importantly, we have to discuss what will happen in the coming days. How bad is this dump? And also what happens if tomorrow we open up and the price is still around here at 77 or 78 or 79 even because as you know it will create a big fat gap on Bitcoin CM future chart which closed Friday at 84. We have a very interesting week ahead where we may see volatility actually to the upside to close the gap and then we expect Bitcoin to keep going lower especially if it can break this this support right here. But as soon as we break it I think I think within a week or so we're going to be already here at our buy zone which is super close. Our buy zone basically starts here at 63 which is within 10% of the 200WE moving"
    },
    {
        "video_id": "YawcOhRcens",
        "title": "BITCOIN AND ETH: HOW BAD IS THIS DUMP (when recovery) 🚨🚨🚨🚨🚨🚨",
        "published_at": "2026-02-01T18:55:38Z",
        "sort_date": "2026-02-01",
        "url": "https://www.youtube.com/watch?v=YawcOhRcens",
        "transcript": "episode. And as you can see right now, Bitcoin went all the way to 75. It was quite crazy. Went to high 75K, basically 75.7 or something like that. This is quite close to the low from April 2025. But most importantly, we have to discuss what will happen in the coming days. How bad is this dump? And also what happens if tomorrow we open up and the price is still around here at 77 or 78 or 79 even because as you know it will create a big fat gap on the CME future chart on Bitcoin CME future chart which closed Friday at 84. Okay. So all in all, we have a very interesting week ahead where we may see volatility actually to the upside to close the gap and then we expect Bitcoin to keep going lower, especially if it can break this this support right here. It is a support which maybe going to be quite significant next week because it is the low from 2025. But as soon as we break it, I think I think within a week or so, we're going to be already here at our buy zone which is super close. Our buy zone basically starts here at 63 which is within 10% of the 200E moving average and it's going to be very very nice. I mean I feel very excited about buying Bitcoin again guys. It's it's going to be fantastic if we get here. This is going going to be the best riskreward us you know. And what's interesting to keep in mind also is that uh yes we have a CME gap. CME gap normally fill but the thing is we don't know when they're going to fill. It can take a few weeks to fill. It can take a few you know it can take a few months to fill. So not necessarily there's going to be instant but there is going to be a gap which is in theory a bullish thing because gaps normally fill on the CME and we dumped so much during the weekend that at the end of the day with highest likelihood we're going to fill we're going to fill the C gap and basically the Bitcoin will pump all the way to 84 now is going to be exactly on Monday is going to be on Friday next week and in two weeks like that's impossible to say but at some point we will be magnetized to fill the gap. So that's number one guys. Number two, very important. Tomorrow and overall in the coming week, we have a government shutdown yet again, the budget was not agreed on and uh they hope they hope to uh to have the government working on Tuesday again. I mean, let's see if it's going to happen or not. But there is a government shutdown right now and the tension between the two parties is quite high in the US. So, will they agree? Will they not agree? Hopefully, they can pass it. Hopefully, it's going to be figured out, but you never know. You never know. And so that's why also this is normally something that's a bit bearish for Bitcoin. This is something that R Paul speaks about. I mean he always has an explanation why his theory does not work. Now he's saying remember last time the government shut down. Yes, the market did exactly this basically dump. He's saying it's all about liquidity. And you know man it really blows my mind because so many people listen to RO and listen I love love Ro in a bull market he's the best but in a bare market he's the wrecker. He is the you know the the the death you know the guy with this how do you say with this no what what's this called you know the the scythe se how say I mean you you know the death guy basically for the portfolio it is like that all of his followers are waiting for the business cycle for the liquidity cycle which will come at some point your all's going to be down another 90% if it's a few months in the future grim the reaper exactly grim reaper grim reaper so you see now his explanation as to why the ISM the business cycle Everything is not really playing along with his prediction is because the government shut down. Ah, okay guys, am I done? It's fine. Then it's fine. Here is why we don't trade on any macro chart. Here's why we don't trade on any news. Because this news guys and this macro guys, they always have some kind of explanation. If something does not work, THEY ALWAYS HAVE SOME KIND OF EXPLANATION WHY it didn't work. You know, [laughter] [gasps] it's crazy. He said just look at the chart. It's a bare trend. You guys know the drill. But I just want to reiterate how important it is to just look at the chart. Look at the trend. Don't worry too much about macro. Don't worry too much about news. Why? Because even if macro is correct, if it is too late, 6 months too late, 8 months too late, your alt is going to go down 99%. And you're wrecked anyway. R Paul will say that he is correct because at some point we're going to pump. Okay. I mean actually if you just wait I mean soon if Bitcoin is here at 200 the week moving average I will also turn mega bull and then we're going to be on the same page again. The difference is that since October 8th we've been risking we do not have minus 80% down in all coins. So what's the point of following macro if you still get all of the downside and uh yeah what's the point? I mean it's dumb dumb. It's Dumbo. It's Dumbo with the big ears following macro. But anyway, big shout out. Big shout out. And also I mean I kind of commented that bro still waiting for SM to wake up and he and then Ro Paul big sh I love Ro Paul but it's just like I I don't understand how you trade macro in the B. I don't get it, guys. It doesn't work. And so he says, \"It's coming.\" He wrote, \"It's coming.\" And you see the ratio. He outrated me a lot, which tells me we need another leg down to flash all of his bag holder followers who are still hoping and praying, \"Please, please, please, ISM, please, please, please.\" Business cycle because he still gets a lot of engagement for this kind of uh for this kind of stuff. Although people are saying more and more and more. Remember last time when government opened up? Yeah, Bitcoin dumped anyway. [laughter] Okay, so the beating has been going non-stop since 2021. Yeah. Anyway, so you get the point. It's just another one, guys. And also Tom Lee. Tom Lee, man. Tom Lee says he's disappointed. [laughter] He said crypto has been a huge disappointment. And of course, Tom Lee also has a million reasons why his theory did not work out. Now he has so it was Greenland. Oh, it was tariff. Oh, he has this reason, THAT REASON. BUM, BUM, BUM, BUM, BUM. So many reasons. Holy crap, guys. [laughter] How you trade based on this? How do you adapt your trades based on this? He had so many reasons now why his trade to 190k Bitcoin did not work out and if 10k by dece by December and then by January, >> there's been a huge disappointment because, you know, whether it's debasement or geopolitical uncertainty or central banks easing, those have are tailwinds for precious metals. It really should be a tailwind for crypto, but I think crypto had suffered and still hasn't recovered from that October 10th deleveraging. Um, so you've seen the crypto market trying to recover and in fact early this year there was probably some momentum until the whole uh Greenland surprise and that caused another round of deleveraging. So I think crypto if in in my opinion is really uh watching this huge move in precious metal. >> Oh my god. Yeah, guys. And this was when Bitcoin was 87. Now it is 70. It went to 75. Let's see. So, this one was on the So, this was like two days ago. >> There's a lot of FOMO for crypto traders and I think they're actually buying metals. But in the past, these large moves in gold have actually been a precursor to a subsequent move in crypto. So, I I think part of this is we're we're seeing a big move in sort of non US dollar assets and and that follows with crypto. >> Yeah. I don't know what he says at the end there, but I don't think he knows either. like Trump said with Joe Bid I don't think you understand either but the thing is at the end of the day guys you look at the chart follow the chart follow the mechanical rules everything else these guys they have so many theories it is interesting to discuss when you drink coffee with your bros to discuss oh you know the ISM the business cycle this and that if you start trading based on that especially all coins which are okay bitcoin bitcoin okay but altcoins are unforgivable most altcoins don't come back in a new cycle that's why I really feel for everyone who fell for all this business cycle BS why because their coins may not come back. If you have Bitcoin, okay, fine. It's going to come back anyway. But, you know, many alcoins, they don't come back. They come back. They don't come back. They don't. You have to figure out the strategy out of it. One way to do it is to use the mechanical rules. Check the link below.com to learn mechanical rules how to ensure that next cycle when it happens, you're in a good position. But all in all, yeah, I think we we kind of have driven home it a lot this uh this uh point that um you need to look at the charts, not the news. People have been saying to me, Ian, you're wrong. You're wrong. You're wrong. You're wrong. You're wrong. you're wrong since October. You're wrong. You're wrong. You're everyone say, \"You're wrong. You're wrong. You need to look at fundamentals. You need to look at news.\" But business cycle. Now I see less. And now I actually see less and less people saying that I'm wrong because I mean the numbers speak for themselves. So I think that we're I mean people are understanding more and more. People seem to get it more and more. But still still now and then someone says, \"Ivan, you don't know what you're speaking about.\" I it's also that it's also like I don't know what I have to do to even if I win a Nobel prize in trading still people can I mean you don't know like what say like people online they have such confidence it's insane I've not they speak to with such confidence [laughter] portfolio bleeding portfolio zero uh trades bad holding down everything down diamond how hand minus 90% then sell and still so much confidence so much conviction okay I love it. I love it. Guys, that's why we're in crypto because at the end of the day, it's crypto is a money transfer from such people to people who have discipline, have mechanical rules. So, at the I mean, I'm not complaining, but it's it's something that I actually want to educate so much. Okay. So much about now metals crash, but alcoins aren't leading the rotation. Yeah, exactly. This is a big problem for all coins. They are not getting the money from uh from metals. Exactly. Instead, it is the dollar that is strengthening. We've been speaking about that the dollar is likely going to strengthen because people are saying it's going to hyperinflate. Normally when people say it's is going to hyperinflate. It is the low in the Dixie. [laughter] It's been like that. You look at Dixie, look at COVID, people said it's going to hyperinflate, hyperinflate, hyperinflate. It is not hyperinflate. Instead is actually start to go up. We started the trend to the upside. Also, ETFs have a massive outflow uh during the last few days. And all in all, the total for January is now minus uh 1.6 billion. So, let's see how February will go. But December was 1 billion out and then November was 3.2 two billion out and yeah let's see how this um uh February is going to be but the the institutions that were supposed to save us is another thing people were saying Ivan you don't understand in October Ivan you don't understand the institutions will not allow us to dump ah the institutions got it got well if you you [laughter] know now institutions are here black rockck will not allow bitcoin to fall because now black rockckrock is it oh my like black rockckrock guys I can tell you they would love for Bitcoin to fall. They would love for Bitcoin to fall because that's going to probably put a lot of pressure on Micro Strategy. Black Rockck has their ETF, but they have a big competitor in Micro Strategy and Black Rockck will not get in any way affected if Bitcoin goes to 200E moving average. I mean, Black would actually love for Bitcoin to go as I mean as low as possible because the more pressure on Micro Strategy, probably their biggest competitor who has so many Bitcoin, the better for Black Rockck. Black Rockck ETF does not change at all whether we go up or we go down. In fact, if if Micro Strategy goes under in one way or another or has challenge or is having more bad press yada yada yada is good for Black Rockck. So Black Rockck I I I think they would love a bit of a shakeout and then we go to 1 million and Black Rockck is the only alternative. Okay, I I I think they would actually love a bit of a shakeout. So [snorts] yeah, let's see if we get that in the coming weeks or if we have a bit of a relief rally to fill the gap maybe. Now uh more news coming out. You have uh guys, this is funny. This this is very funny. SBF is now a Republican. Okay, this was actually during the last week. There were there were many news, but he said that he's now a Republican. He's trying to, you know, lick Trump's donut. I mean, if you know understand what I mean. Look here. He says Trump uh Trump's arrest of Maduro was smart and gutsy. Meanwhile, this is the guy who paid the most to um to Joe Biden. He was the single biggest donor to Joe Biden. Now, when he used to get out of jail, why I became a Republican? [laughter] I know why. Exactly, bro. I know why. Exactly. Exactly. [laughter] Why I became [laughter] the single biggest do how say donor donor donator donor to dem to Joe Biden I mean Google this he's the single biggest donor to Joe Biden now why he became republic [laughter] bro I know exactly but Trump's arrest madur is smart and gutsy Yeah, [laughter] [gasps] I love it. I love it. I love it. I mean, he gets a bit of FOMO, I guess, because this Ilia guy who got arrested with like billions of dollars in the hack the Bitfinex bitcoins, he got released thanks to Trump and he said, you know, thanks to to Trump for releasing me this and that. So, this is very interesting story. You should really research Ilia Likenstein and his girlfriend who were kind of wannabe rappers. Okay. And um let me [laughter] I still don't understand how they got the the fans, but I mean it's it's fascinating, guys. It's fascinating. You should see these two guys like is the best, you know, the bizarre, you know, the bizarre the most bizarre couple like they and they they were running around with two billion like or five billion or how much it was in money from um from Bitfinex. Anyway, these guys, I mean, somehow, you know, this whole hour makes me a bit happy that they got released or at least he got released. I guess she also and [snorts] she was rapping is so weird songs. You should check it. But anyway, so they got released and then what happened now? Sam Bank, why became a [laughter] love it, love it, love it, love it, love it. It was the best. It was the best. Uh now, uh interesting thing is that guys, you know, when if Trump actually leaves office, we're going to have big problems with the Democrats. Oh, we guys, crypto, we're going to have big problems. We're going to have big problem. Hey, listen. I think that Trump is a nuts now with the Greenland and everything, it would be good with a bit of a gridlock. If Democrats win maybe Senate or House, like gridlock the whole thing so we don't get more tariff, we don't get more nuts. We everything just calms down, gets in a freaking gridlock. But at the same time, there are clear signs of big conflict of interest. Look here, UAE shake secretly acquired 49% of Trump's world financial uh financial days before the inauguration. Guys, if Trump somehow loses power, holy, they're going to let the hounds loose. An Abu Dhabi investment vehicle backed by UA national security adviser Shik Taknun bin Zed al- Nahayan purchased 49% in liberty world liberty fines for 500 million and this went obviously to whom to the family to Trump family half was paid up front with 87 million going to Trump family entities and at least 31 to entities tied to Middle East uh to middle middle east envy Steve Witcom's family exactly Eric Trump signed the agreement so you see I mean this kind of stuff. They're going to come. They're going to come for crypto, guys. They're going to come. They're going to come bigly bigly bigly bigly bigly. So, yeah, let's see how that will figure itself out. Guys, let's go to Q&A as soon as possible because I'm sure you have questions about all kinds of things. I just want to answer the biggest question and that's that how is money made in the current uh market? And that's by shorting all of the [ __ ] guys. I mean, looking at our community, I will soon show you the results, but that is the biggest like nobrainer thing to do right now. If you use the money scanner and you see what flips bearish on the daily and now we're checking what flip bearish in the last week you see a lot of them you know four days ago minus 65 days ago minus 48 uh 3 days ago minus 43 so this is why if you have the money scanner and if you don't go to bulmania.com to watch the free training join bulmania all of that but when I look at at the wins here most of them are short so big shout out to 90sberg who posted this earlier today he shorted the crap out of river 200 100% gain. Very, very, very nice. Then this guy, Kojoro, posted a few wins today as well. Shorting SUI, shorting XLM, shorting SAND, shorting on. And as you can see, between 50 and 80 82% gain. Fantastic in in all of these trades. And another question I get sometime is that Ivan are all trades profitable because we share this wins. So the big question is, okay, Evan, are all share are all trades profitable? No, it's not about having 100% win rate. It's all about having more wins than you have losses and that the wins are bigger than the losses. And that's exactly what mechanical rules are all about. How to enter a trade with a stop-loss and with a take-profit strategy so that if it goes against you, you have a small mistake, not a big disaster. I mean, that's exactly the opposite of how most people do it. They they enter a trade, it goes against, they're like, \"Huddle, huddle, huddle, huddle, huddle, business cycle, business cycle. Roll Paul, ISM, Tomley, huddle, huddle, huddle my shitcoin.\" And it goes minus 99. Okay? They we don't do any of that. We don't do any of that. And I love when people share the wins because it actually shows what's possible. So you see short short. So all this is shorting. Another one. Kaya 2x shorts 55% from Pu de Pero. Fantastic. Fantastic. Do short 3x. This quant very very nice. Then uh this Nasif short what is short? Pipin. You guys know Pipin. Who the hell knows? You need to know what it is. But you see when it goes bare fantastic. This guy is this guy is on fire. Antonopoulos, look here. Gala, bam, very nice short. Uh, 73%. Brett, 108%. XRP, say um, what is this? Uh, Popcat, Popcat, 100%. Then this guy almost every day he has gains. He's crazy. He's crazy. But using mechanical rules, he he can ensure that um, even if the trade goes against them, he's going to be okay. But he has high leverage. I mean, big shout out to to to Supreme Governor. But every day he post this crazy stuff. uh 500 almost 600% uh shorting a bitcoin 40x [laughter] this is not for everyone but with mechanical rules with support uh uh with stop- loss with uh uh with take profit it works mooncad another one you can read here oh and passive in passive let's see passive shorted the crap out of what oh xRP XRP yeah guys XRP we've been speaking about it some people have been taking action uh we've been speaking about you remember what the fact that it has basically no support until uh until a a long way down. A long way down. Long way down. Yeah, basically until here. So, having a short with good stop- loss, good risk management here from riskreward is fantastic. It's fantastic. And XRP is just, I mean, it's just one of many. There are many, many, many, many. So, all in all, go to booming.com, watch the preview if you want to have access, and go to booming.com/partners. Here is how the links look like. I actually have a visualization here. So below you see for the tools booming.com for exchanges booming.com/partners okay you get nice signup bonus on all of them bybit weeks bit unix pyonics bum bum bum bum bum let's go to Q&A questions answers debates let's go I think we're all content we're going to goblin town but hopefully we get a little bit of upward momentum I would like to upload 60% of my ibit yeah it's very possible But also I have I I gotta say I see more and more bearish takes and it makes me it makes me bullish to buy at um let me show you actually a picture from the other day from I think it was yesterday. I [clears throat] mean I I see more and more p more and more comments where people are saying that I'm too bullish and this hasn't happened in a while guys. I can tell you [laughter] it hasn't happened uh since 2023. So, uh, at the end of the day, we we need to see what's going to happen with the trend and all of that, but let me get this picture. Where is it? Where is it? Where is it? They see where where where I just had it here. Where did they got air dropped? One second. Uh, one second. One second. Oh, yeah. Here, here, here, here. Okay. Look, look at this. Look at this. Look at this. This guy, big shout out to Crons, uh, he said, uh, yesterday, \"Be careful buying anytime soon. The recession hasn't even started. Buckle up. 30K BT incoming. See, this makes me actually bullish because many people think we're going to go to like 30. I I I I don't think it's going to happen. Uh it could happen, but I I don't think it's good from a risk perspective to wait that long. We have a plan. We have a strategy 200 week moving average. I've been speaking about since October. Everyone say Ian, you're wrong, you're wrong, you're wrong. You're wrong. We're almost there. People are now saying, \"Avan, you're wrong. You're wrong.\" But now I'm too bullish. Like, isn't it crazy? In October, people say, \"Avan, you're wrong. You're wrong. You're wrong.\" Oh, you understand fundamentals of business. Okay, we go to almost 200 week now. And now people already now start saying, Avan, you're wrong. You're wrong. You're wrong. Recession hasn't even started. We're going to go lower. Listen, we have a plan. We're going to follow the plan. That's it. That's it. We recession or not recession, doesn't matter. We follow the plan. Bitcoin at two around 200 week is uh very nice. It's it's man, it's the best. It's it's fantastic. So, uh don't don't get too bearish either, guys. I mean, I see I see a lot of that. Uh, now I I see more than ever. It was just one, but I screenshotted it because it was not the first one. And, you know, when I see a pattern, I react a bit later. Kind of like trend following strategy. You know, I see a pattern, I I see a trend, it takes a few pictures. But, um, this was not the first comment like that. It was, you know, I've seen quite a few. I I I will maybe start a Twitter thread just so I have all of the receipts. Uh, but yeah, that's that. Also look here from the lows we did yesterday at like uh 75.7 to our buy zone. I mean it is less than 20% guys. It's less than 20%. So I think we're going to we're going to be landing here shortly. That being said quite strong support here. Maybe we get a bounce fill the CME gap maybe something like this. I mean let's see guys. We cannot predict the exact movement of the of the chart how it's going to be but we know the areas of interest. So yeah, that's the that's the plan and it did not change. I'm waiting for price to get to 200 moving average, but doesn't matter how long it takes. Say we got there tomorrow. No, for me it does not matter. Uh for me it does not matter because just on average it's a good place to buy. Always a good place to buy. It can go lower. You should be prepared to hold it maybe even at a loss for a few months. Uh and um if you look here in the last cycle, we went to 200 week. Yes. I mean it took from this like to really be become profitable here. It actually took like 30 40 weeks. Okay. So you don't have to like pomo in here as soon as we get close to it. But you know start nibbling. It's important. It can still take you see it took 40 weeks for us to really get out of it. And if you really look at how long it took Yeah. So it took 40 weeks here but then as it increased it took all the way until here to really start going above it a lot. But it increased a lot also the 200 week. So let's say that if we follow the similar strategy then we would be starting to lather in somewhere here at 22. The bottom was like the ultimate bottom was at 50 but it's fine. It's fine because our goal is not to buy the exact bottom is to buy good riskreward generational pump before the generational pump. And again it's nibbling. So a bit here a bit here a bit here. And then once we go bull trend, we go we go loco. Once we go bull trend also we go loco. So yeah. Uh all in all here to really get to the big insane pump it guys it took one one year over a year um and three months. Okay. Like 70 weeks you see like to go from this accumulation 70 weeks. What is it? 70 months. No 70 weeks. We're on the weekly. So 70 70 weeks. um to go from this, you know, nibbling, nibbling, nibbling to boom, generational explosion. You understand? So, it can take time. It's fine. We're fine with that. So, so to set the expectation straight, I mean, we're fine with that. We're fine. It's part of the it's part of the plan actually. Uh that we're okay with a bit of downside, but uh is is part of the strategy we accumulate there. That's it. Yo, Nathan also made 20% on pipping after daily update from Bullmania. There you go. You mean from Jason's? Yeah, from Jason's uh update. You listened? That's very very nice. Nathan just said in the comment section uh ultimate on piping after I guys is the is the bear flip now. It's the bear flip. It's the bear flip. It's is the gold mine. The bear flips. It's a freaking gold mine now. It's a flick flipping freaking freaking gold mine. Great to see all the live streams, man. Whoop whoop. Yeah, I mean we're on I don't know you guys watch. I see that people want to watch. So when people watch when people smash the likes I want to do more also. So I have seen more interest lately. I don't know what it is. Maybe people wake up when their portfolio uh falls probably. But it kind of give me gives me more motivation also to to do more. And uh so yes, if you want to see more streams, smash up the like uh check check the channel every day manually maybe even if YouTube does not uh send you notification. So I know that you like it. I know that it's appreciated. You smash up the like and we can we do more. I mean it's it's all in your your hands guys. It's [laughter] all in your hands. The more you watch, the more you smash, the more motivation I have to do even on on weekend which normally actually we don't do. What about the soul? Oh, guys, guys, wait. Before I talk about salt ecosystem, let me just check salt because this thing [laughter] is going to go to 30. Can our evil plan please work? That would be guys that would be the cherry on top of this fantastic execution we've had. Like there is one thing missing and that's that soul is still in my opinion it's not cheap enough. It's not cheap enough. We've had such a great run from um October. The only thing that's missing is a soul flash losing this support. And if we guys if you can buy solid 30 I I I mean listen not financial advice but I would be seeing that I would in my brain I would be seeing that as generational opportunities like literally generational. So let's see guys I mean I hope it falls. If you even if you have Solana I think you should also hope that it falls. Why? because uh you wrecked anyway, but if it goes to 30, you can buy super cheap. It's going to return to this level anyway in the future. So, you're not it's not like you're going to lose anything. You you're going to be underwater. You're going to be a lot of but that's fine. You can instead buy here cheap and it's going to come back to 100 anyway in the future. So, it's good for you. It's good for us. It's a win-winwin. It's a fantastic. So, yeah, let's see if this support holds. I mean, now guys, it is at last support like this support here, this support area, it's last support before the flash. Okay. So, that's that guys. In terms of soul ecosystem, what did you ask? Some meme coins or what was it like the meme coins? The meme coins there there's they're hot like I I don't know what's happening. I don't understand how they can be so hot and why people still buy them in this uh in this market. Uh but yeah, I mean it's quite popular still. Let's check the pump fund revenue because you remember it was kind of alltime high. Okay. The pump fun uh uh revenue I mean it still is very high. So yeah it's quite insane and then I mean then the other ecosystem with the other exchanges they it's Jupiter it's like this orca a few this lending this and that and then it's the mimas and then they try to build the perpetual decks. The big project of Spanish is to build a perpetual deck. Supposedly SBF donated equal amounts to Republicans. I I'm not sure it's going to save him because he is known as the biggest donor to Biden. I don't know how you erased like hide that or something. Um more questions. Someone asked about Algo. Algorand. Let's check Algorand. Let's see what is doing. Our friend Algo. I can I can tell you my gut feeling is that it's very bad. I I I haven't opened yet. It was long time ago I actually checked it. But my gut feeling is that it is Goblin Town and uh Fenito. But let's see. Maybe I I'm wrong. I'm not wrong. [laughter] I'm not wrong. [gasps] Oh my god. Oh my god. Yeah. It's very bad, guys. It's very bad. It will go to alltime low likely. It's just like 15% away from alltime low. I mean, what what do you want me to comment here, guys? It's going to go to alltime low. It's going to go to alltime low. It has a bit of support here at uh not that. Yeah, I mean it's kind of using it as support now. So, if it breaks that is going to be price discovery sadly in the wrong direction. It's going to be trying to find a new low. Uh this thing. Yeah. I mean, what should I tell you? It's very bad. Like what what to tell you? It looks like uh dog uh sh hi t. Okay, we want to be a bit educated, a bit, you know, it looks like dog [ __ ] Can Can you say it out loud? It looks like that. I don't want to be explicit. It looks like kaka with other words. Exactly. It looks like kaka. So yeah, that's that. That's that. Now also someone asked about I mean listen I want to give you some words of encouragement but there is none. It's better that you understand that it's very bad. You need to escape the mental prison. Likely you've been holding it for months and months and months years and years and years. You you've been married to it. You've been hoping it's going to go up every day. But I mean that's also what we speak about in bullming.com. Go and watch the free video there. But you you need to start rotating into bullish coins. I mean yeah I mean the there it's already quite I mean it's down so much. How much money you do you still have left in it? I mean uh you have any money left in your name or because this thing is down. Yeah. 83. So I mean at this point there there are no good answers here guys. There are no good answers. There are no good answers here. Is uh what I would do here what I would do is that I would uh take the funds. I would break them up into portions and start rotating a bit into bullish assets uh that are trending in bull. But yeah, go to bullman.com. Bosch mechanical rules. There there's no good answer here. We can try to repair, but you know, if you have a broken arm, it's broken. It's broken. If your portfolio is right, it's right. It's right. You can fix it. You can definitely fix it, but there's no, you know, I don't want to tell you that business cycle is or like Tom Lee is going to save you or something or business cycle or whatever. Tao, Tao, Tao, Tao. Yeah, guys, very similar with Tao kind of they're going to test the alltime low soon. looks quite bad. Um, yeah, I mean theoretically it should get get the hype from the AI. Not really doing it now. Uh, I mean if we put it like this. Yeah, it's kind of testing alltime low this last but let's see. Is there another chart with more history? Yeah, there is. But it's the same. It's the same. So, oh, you have to pray here guys with Tao. You have to pray. You have to pray. You have to pray if it breaks this is price discovery in the wrong direction sadly but uh it's going to be price discovery. Okay. You not the one you want. So now yeah is the same is the same what I just said about uh uh I'll go just copy paste it in in uh your brain also. I mean what do you use Solana for and what apps? Radium. So Jupiter is my go-to. I mean tra trading trading whatever is uh whatever I want money I want to move it's Jupiter trade back and forth with you can also do DCA with Jupiter let's say you want to buy something over time or sell something over time Jupiter can do that which is very nice then uh I mean of course when memes were big trade memes uh stable coins I mean just payments on is so nice receive payments send payments on fantastic with the stable coins um the Only problem they have is they still don't have a good competitor to hyperlquid. That's and that's a problem. They should fix that because then because I see many people in our group they trade on censor exchanges but you see how many trade on hyperlquid like this guy Kajoro who posted hyperlquid hyperlquid hyperlquid hyperlquid hyperlquid this guy on by bit. So we do and this guy on weeks by the way if you go to boom.com/charts you get all of the signup bonuses for pionex for uh buy bit but weeks bunx and all that you can go long you can go short um by bit by bit by bit by buy bit so yeah basically it's by bit weeks and hyperlquid and yeah pinx here is a guy on pinex okay so actually our community trades a bit everywhere why because um it's good to have a bit spread out hyperlquid is decks as you So no KYC but uh if it's not all assets there so you need a bit of here a bit of there u there you go but on yeah if you haven't on Jupiter try the DCA I mean it's very nice let's say SL goes to 30 I'll set up a DCA on Jupiter to to start buying near let's Anyone holding Bitcoin have any hedges open? If so, what are they? I mean, what hedge you need? You have you have stables, you have fiat, that's it. I mean, holding Yeah, someone holds in Bitcoin. Some kind of short long. I don't do that. I keep it simple. [clears throat] I I'm thinking more, you know, less dry powder, more dry powder. But yeah, some people do this, you know, they open long, then they open a short, they try to like hedge up. Yeah, to me it's uh uh I'm not doing that. I don't I just want simple. I want simple. You don't need to complicate too much. Uh and also a problem people had like when we had the the 10th of October, what happened? A lot of shorts actually just got closed. So you know this hedging kind of like what you said is it is done by market makers by you know professional traders that they have a long and like a short and it's a kind of hedging you know. So what happened? An exchange at any moment can close your position. Even if it's a valid position, if there's a lot of volatility, there's liquidity issue or probably for whatever reason at all, they can close your short as an example. Uh and that's what's happened on October 10th. People's shorts got closed. Meaning that you have a short open, it's in profit. It's moving. Prices are going down. You're making money. But exchange just comes and say, \"Listen, close. uh you I mean read read about it. It's very true. Uh if they cannot uh continue having your short or open maybe they're out of liquidity. There is a you know systemic risk to their liquidation and like whatever like there are many reasons they can just say okay we're closing it. You have your profit up until this point but that's it. We're closing. So what happened on October 10th? People had long and short to hedge to hedge a bit. Okay. Shorts got closed by the exchange and longs got liquidated because prices went down. [laughter] Oh yeah. So yeah, keep it simple. Keep it simple. I I I don't do that. I mean mainly to keep it simple but also you see this problem. Now uh let's see other other people people ask about other Yeah. I mean listen it's it's not going to go to alltime low but uh it's going to test this very soon and if it goes here it's going to go I don't feel the same form of buying other guys if it goes lower as we saw but I mean the first thing is that it's going to go here as we are in still in bearish momentum so it's going to go here to like this 0.23 23 guys if we don't get support here like like we got here in 2023 like we got here in beginning of 2023 this was the I mean guys this these are the last bare market lows if we don't get support at the last bare market lows which I mean we should we should for the love of God we're looking at another dump approxim oh my god you do you see what I see it's a 90% dump okay maybe there's a bit of support here. Yeah. Either you get supported here a bit there is a bit like minor support minor support here. Yeah. I mean it's going to be quite brutal. Okay. There's also minor support here. Then you have this this levels that I would be looking. So let's say that we start breaking. Boop. The first station is 40% down. The second station is 60% down. And the final station is 90%. If we break it. If we break it. Guys listen we we are in bare trend so we'll look at the bare scenarios. I mean it is what it is. Uh some people are saying I why you only look at bare scenario. I mean what bull scar I don't even know what the bull scenario is. The bull scenario. Okay I know the bull scenario. It is that it does something like this. You know it does something like this. It comes and touches a moving average or something like here. Um this would be the bull scenario. It goes from here and it goes you know here and it touches. If it breaks that great maybe it's a turn of momentum. But I mean you see kind of like you know is it here is it here then this other move. So that would be the bull scenario uh right now that it would go and touch a moving average like here or like here. So yeah it is what it is. Um ADA looks very bad. I see people asking about dot guys. I have a guy that sent this what guys this is what happens when you go to price discovery. So Plet actually went into price discovery that we were just speaking about with Algorand and uh what was the other one? I forgot. Oh yeah to you remember I said it's going to go to price discovery. Okay this this what happens when you go to price discovery. It goes to price discovery in the downward direction. Okay. In the downward direction. Uh where is the pola dot guy? Where is the pola? I need to find the polo guy. Let's see. Is it the last guy here that we have? >> Hi guys. Stocks. Crypto. uh which took me uh study myself and which took me you know no I need to find the polka dot anyway maybe I'll find it later on there was one where where the guy said you know I had I was married to polka dot I was married to pola and I know many people have been married to polka dot okay so yeah that's very bad I I know many people have been married to polka dot bigly bigly bigly bigly Uh let me I actually have it in AI which person was married to polka dot. Let me know if you you've been married to polka dot or some other such situation. It's very common. It's called mental prison. That's why I focus so much about it in bulls of combat. It's oh it was Marco. It was Marco. Where is Marco? Is this Marco? Hi guys, Marco here, Alias Defy Wolf, and I want to take this couple of minutes to thank Ivan and the whole team involved in bulmania.com. What can I say? I'm extremely happy. I've made my investment back after approximately 7 weeks. And uh yes, I must be honest. I was a little bit uh sc not skeptical, I was a little bit hesitant at first um when looking at the cost of the subscription and um I was worried what if I'm not going to be able to make this money back. Instead, I did make money back and now I turned it into a long profit long-term profitable journey. I so far the biggest trade I made is shorting tia with 142% shorting u uh lo finance with 68% pola dot 62% profit and polka dot for me was a revelation because thanks of bulmania's um strategy of escaping mental prison I was finally free from this coin which I was previously married to [clears throat] I kept buying the deep all the I'm thinking you was the last before the greatest pump in >> Great. I love Marco. I love Thanks, Marco. Thanks, Marco. I MEAN, IT'S AN AD. It is ad guys. It is ad. I need to show the the goodies the goodies how good it is. How good it is. It's It is ad, but it's true, man. And the guy was married to Paulot. So, and if I don't advertise, who's going to advertise for me? Who's going to explain the gospel of Bulmania and how people are saved every day? They see the salvation. I mean, you see the guy, he was married to polka dot. Okay. Okay. [laughter] If I don't advertise, who who's gonna advert? Okay. It really works. Yes, it really works. Married to polos. Yeah. Crazy, man. Crazy. Now he's the worst. Exactly. [laughter] Exactly. Oh, yeah. Yeah. Guys, thanks a lot for being here. Uh, I mean, fantastic stream yet again. Answered many great questions. Many great questions answered. Thanks for a lot for asking. And uh yeah, this is why even you know Dot, what happened to DOT? Dot was a blue chip. Blue chip. Blue chip. Blue chip. Everyone said it's blue chip. Blue chip. Blue chip. Best tech. So great tech. So many great followers. But as always, you gota be following the trend. It's still I mean the tech is still good. I I remember using Polka Dot. It was maybe now. When was it? I mean it was a while back now. But I mean I use it. It was great. I mean I love Polka Dot. I love polcot but just like I don't have Sana now after October because it went down a lot in the bare trend since bear trend I don't hold it the same thing is with pol I mean if it goes goes down like even if the tech is great another great tech guys maybe even I mean from a crosschain perspective I think I liked Cosmos even more because Cosmos had so much wallets I don't remember which wallet now but I remember using Cosmos man I think it was lip wallet you guys know lip wallet I was like man so nice wallet wallet so nice You jump between all the cosmos. Bum bum bum bum bum. It's like wow. This is the future of uh interoperability. But now like no one gives an f about Cosmos. I don't know why devs they don't dev. No one cares. Okay. Why? Maybe because L2s are the same thing on ETH. Even though ETH has bad UI UX with Metam Mask like you know you use Cosmos like it's it was so nice. UX it was great man. It was um price atom is the worst. It's the worst. He's the worst. Atom is very bad. Like, it's so bad. So bad. So guys, that's that. That's that. So, see you all uh Monday, which is tomorrow. Fantastic week ahead. Have a great Sunday. Destro. Smash the like, subscribe, have a good uh day. Have a good night. Thanks a lot for being here. Hope you learned something. Hope you become bit smarter. Have a good day. And goodbye, guys. Goodbye. Goodbye. Goodbye."
    },
    {
        "video_id": "zKs1-I4a1sc",
        "title": "How Binance messed up #shorts",
        "published_at": "2026-02-01T18:31:42Z",
        "sort_date": "2026-02-01",
        "url": "https://www.youtube.com/watch?v=zKs1-I4a1sc",
        "transcript": "how Binance messed up. There are many many accounts on Twitter going around saying that Binance API was down. It was impossible to add margin. It was impossible to manage your leverage position. So, everyone just got liquidated. CZ has come out said that you know FUD doesn't hurt the target. My followers increased. FUD hurts the market. Everyone Binance do not sell in any meaningful amounts. Also, now everyone is accusing that Binance is dumping everything and that's why we don't pump. The truth probably somewhere in between. There is I mean there's just so much so much so many videos so so many accounts uh showing proof that their uh account is weird where they you know the time stamps have been changed at the same time there are many people who are saying oh it's manipulation everything is manipulation bitcoin dumping is manipulation gold pumping but bitcoin dumping manipulation it's due to the evil market makers due to evil Binance and that's obviously not taking responsibility Let's see."
    },
    {
        "video_id": "3b_9USLfNEo",
        "title": "Dollar drops always trigger panic #shorts",
        "published_at": "2026-02-01T16:00:07Z",
        "sort_date": "2026-02-01",
        "url": "https://www.youtube.com/watch?v=3b_9USLfNEo",
        "transcript": "We're speaking about an index here, dollar strength index where dollar is compared to other currencies. So what other currency is better than the dollar? Tell me if we look at Dixie, if we look at the dollar strength index, we also need to realize that it does go down a lot. I mean this fall is quite significant and people are freaking out. At the same time, when you zoom out, let's look at the uh monthly here. If you do zoom out a bit, you see that it's not I mean it's not too crazy. The Dixie we're at now, the dotness we're at now is the same as it was in 2022 is the same as was in 2020. Like the whole 2020, 2019, 2018, uh 2016, 2015, 20 and so on so forth. So I mean in reality there there are always this panics when dollar strength index is dumping. In most cases it finds a bottom and goes up. Why? Because there is simply no good alternatives."
    }
]