[
    {
        "video_id": "yO6Xa5HIcR4",
        "title": "Mike Novogratz on BTC's Slide, Altcoins & Big 2026 Predictions",
        "published_at": "2025-12-17T08:04:00.000Z",
        "sort_date": "2025-12-17",
        "url": "https://www.youtube.com/watch?v=yO6Xa5HIcR4",
        "views": 27531,
        "duration": "00:50:26",
        "transcript": "I made a fortune on SpaceX. I'm just looking at it now. Like a bizarre fortune. Charts don't lie. People do. So, you always have to look at what the chart tells you. We're going to go back through 100 in the next 6 weeks or 6 months because we're going to get a doubish Fed share. They're going to cut rates down to 2.5%. Is as bullish as it's ever been. The flash crash was terrible for this industry because it took out 20 to 30% of the market makers. AI is a bubble and it and my guess is it's going to become the greatest bubble of all time. It's such a powerful story. All coins have sucked because they were designed to suck. The number one rule of investing is don't die, which means don't be stupid. Don't bet everything. Here's my other dirty secret. Good morning and welcome back to another episode here on the Coin Bureau podcast. Today our guest needs no introduction. It is of course Mr. Mike Novagrat, the CEO of Galaxy Digital, a Trad veteran, ex Army helicopter pilot/pro wrestler, and a real crypto OG. So Mike, a very well warm welcome to the Coin Bureau. >> Thank you. >> Great having you, man. So before we dive in, guys, a quick few disclaimers. Nothing in this episode is financial or investment advice. Please consult the disclaimer in the description for more information and consult your financial adviser before making investment decisions. Mike, so right now it seems there's a lot of flux in the market. Uh it's pretty clear that the year didn't turn out as most of us had hoped. Your head of research recently came out and he revised down the price target from Galaxy Digital for the end of the year to 120K by the end of the year. Um, but >> he's he's got 15 days and a lot of a lot of explaining to do. >> Alex is going to have a lot of explaining to do with these bosses if he doesn't hit those price targets. Um, >> yeah, I don't think we're getting there. >> Yeah, but you recently said in a pod with Anthony Scaramucci that it may take some time to get back above 100K. Let me start with an openended question right now then. How are you reading the market right now and what are you looking forward to in the new year? Listen. So I had a sign in my hedge fund. Charts don't lie, people do. Right? The charts don't lie. What? So you always have to look at what the chart tells you. And when you look at the Bitcoin chart, we spent a lot of time above 100,000. 100,000 was a psychological big issue, right? We got to 100. We all felt like we we we accomplished something. I mean, I even put out a a tweet or a post where I congratulated the community. I congratulated Galaxy. like this big accomplishment. There was a tremendous amount bought above 100, right? And we came and held it a few times. When you finally broke below 100, if you look at the chart, you can draw it. There's this very nice horizontal line. That's when we accelerate. We went from 100 down to 85 or 80 82,000, whatever the low was. Real quick amount of time. Uh that's people stopping out. That's people putting short positions on. So now that 100 becomes resistance. Normally you don't go right through that 100 the first time up. You might trade up there and roll over again. And there's a lot of trapped longs, right? People that bought above 100 that at one point just want to get out of this thing. And so you know it corresponds with the four-year cycle that you hear so many people talk about. Fouryear cycle ended just recently. There's a self-fulfilling idea that from a lot of cryptogs that come back in nine months, 10 months and it's time to buy it again. And so I don't know if we're going to go back through 100 in the next 6 weeks or 6 months. My view is we do because we're going to get a doubish Fed share. They're going to cut rates down to 2 and a half%. We're going to get good legislation passed in the United States, I think. And having just got back from a week in the Middle East, I'm more convicted now that the future of blockchains and digital assets, real world assets on blockchains, is as bullish as it's ever been. That doesn't mean the price of you name the token is going to go up in the next 6 months, right? being bullish on building out that infrastructure of neo banks and distributing Galaxy stock or or Tesla stock or Google stock into places all around the world. That's going to happen. That's an 18month to threeyear buildout process. And so we're kind of stuck in between this new bullishness that the industry finally arrived and h we still have all these tokens that need energy, right? Because most of the tokens that exist today are tokens that represent something, right? They're community tokens. They're not equity-like tokens. Hyperlid being a an exception to that, right? Where you can easily look at the math of how much Hyperlid does. And so, they're tokens that need storytellers. They're tokens that need new liquidity. It's just going to take time to rebuild that, right? the the flash crash was terrible for this industry because it took out 20 to 30% of the market makers. And since that flash crash, I don't care if you talk to the guys at Binance or Bybit or Kraken or us in in the institutional volumes are down 30 odd percent. That means liquidity is down 30%. And every time we've done that in the past, it just takes a while to rebuild. How does that get rebuilt? Well, in retail, people get paychecks, they sell on their assets, they slowly start gambling again, and institutions like to buy on momentum. I think we have kind of sideways and less than thrilling markets for a while, and you got to watch where it bottoms, and then we'll have another runup. >> Yeah, there's many things I want to touch on there. Um, I think starting with one of those, uh, and this is that it relates to, you mentioned the OGs and if I recall, there's been a lot of distribution from the OGs. um over the past few months and if I recall Galaxy executed one of the biggest of these transactions like $8 billion worth for one single OG and that's just one of them and there's been a lot of distribution we've seen it's onchain and all that so my question to you is like this distribution from the OG's cashing out how long how much longer do you think this can go can go on for God I hope I hope not much longer uh listen I I wish I knew I think from what we saw the bulk of it got on a lot of it's come from China and we don't see as much of that. We sometimes see it indirectly. What's interesting with the Chinese whales, they often are trading and they'll buy back somewhere, right? Whereas the whale that we we executed, I would be very surprised if that money ever comes back into the system. That was a one-off. Someone got lucky and bought a whole bunch a long time ago and decided to take profits and have a new life. Um, uh, I wish I could answer the question. I I do feel a lot of it. You people had plenty of time if you were going to get out and if you held it back to here. I was actually talking to a guy who's got a huge stack. And he's like, \"Yeah, maybe I I should have sold something at 120. I didn't, but I'm not going to sell it here on the next leg up. Even if it's a four-year cycle, that's that's when he'll sell something.\" And so as long as crypto doesn't fall below 70, like if Bitcoin got below 70, maybe people their pants and get nervous that oh my god, I got it. But I I don't think you see selling in the mid to low 80s from long-term holders. Speaking about these long-term holders, another way in which they have potentially been generating yield and cash from their holdings, and I don't know if you've also seen this from your end at Galaxy on the desks there, but it's been this theory has been propagated by um the guys over at Bitwise, I think was Matt Hogan and Jeff Park more recently, is OG's basically selling covered calls. Yeah, >> that's going to continue to happen. It's just going to continue to happen. There's, you know, listen, balls down a lot. you don't get paid nearly what you used to get paid for it, but there is a uh a mindset that that's a nice way to make income, spend on my car or or my boat or whatever I need to spend it on. And so that's become almost a permanent feature I would say. And that'll weigh on the market sub. >> And then what about I come back to a point you made around the momentum of this of these markets. And I think for someone who who you know has worked in Tradfi, myself and you as well, you'll know that momentum is a very important factor. You know, it's easy to sell things to invest to asset allocators when things are going higher and it's easier to sell when those things are going lower and in momentum is a very big factor when it comes to asset allocation in general in these factor models. Right now in terms of this year, crypto has not been a momentum asset uh compared to >> Yeah. Like with that factor now weighing on it, how long what do you think is going to take make the switch for these institutions to consider allocating again beyond just and and how what mind shift needs to happen for them to think about okay maybe I should be allocating again to crypto even though it has been underperforming or do they do we need that performance first before they'll consider allocating >> in the short run I think if I was a big institution I'm waiting for it to get back above 100 then buying at 87 unless it really goes lower and so it's time but you also Like crypto is always sold. To sell something, I need a story. So the story has got to be if it's Bitcoin, it's got to be about liquidity. And so let's wait to see the new Fed chair. Let's wait to see what he talks about where rates are going. Let's wait to see what the US Fed does with, you know, you could make a story where they make Fanny and Freddy risk-f free assets. Well, that would add trillions of dollar or hundreds of billions of dollars to, you know, liquidity in the banks. You know, one thing, Trump and Besson and whoever he picks to run the Fed once markets higher, they want the US to continue to be able to fund its deficit. They're going to print money. When that story picks up again is probably when you see the next leg and then the momentum like on a chart now, it would be, you know, get us back through 100. I thought wrongly that in the next two weeks we were going to grind up to 97, 98, 99 and kind of stall there, maybe even 102. Now the chart tells you doesn't look so good. We could stay here. We could bounce. But like you really got to get above 95 level to even have a shot at getting up to 100 102. You know, if you're a trader and you sold that your stop loss is 95. We've learned in crypto one giant buyer can change things quickly. And the markets are not that liquid right now. someone came in and wanted to buy $2 billion, we'd be above 90 in, you know, about 15 seconds. >> That's true. I mean, one of the biggest buyers coming back to on the selling side is um has been the OGs, but on the buying side, that's been um a big factor in earlier in this year has been the uh debts and strategy. >> I would say DATs are dead. There's going to take some time to figure out what becomes of them. Some of them are trading at 30% discounts. We were having this conversation today. What do you do with the one that's trading at a 30% discount or a 40% discount? Well, you can buy their stock and sell your Bitcoin. Put the trade on yourself. They can do that, you know. And at one point, some of these stats will transform themselves into really cool new businesses, right? It's permanent capital. You've got capital, you might as well do something with it in that space. They're not going to be just ETFs like Michael Sailor created this ETF-like structure that traded at a premium and then he became yield on it. And you know, I always thought he was unique in that he ca he became a crypto himself. When everyone tried to copy it, you don't have the capacity to do that. So now you've got I don't care if it's Nakamoto or Pump's dad or the VEX dad. All of them are going to trade at big discounts. I don't think they weigh on crypto anymore. Though they could weigh some because someone could buy the stock and sell the the underlying, but they're not going to be a way money comes into the system anymore, right? RTO got burned. That's been one of the reasons we're down is we lost our buyer. That's where the buyer, we lost the buyer. The next buyer is going to just be the continued trickle of wealth, right? If you look at JP Morgan or Bank of America, any of these big wealth platforms, right, that have the the RAAS, remember, we have about $45 trillion of wealth managed from the baby boomers. It's managed by stock brokers in the old days we call them. Right now, they're called registered investment advisors. If they move to 3% allocation to crypto, that's $1.2 trillion. 5% allocation is$2 trillion. Like the whole market cap of Bitcoin is what 1.7 trillion. You know, as wealth starts to to allocate, it dwarfs everything else. And that's just starting. >> No, that's a fair point. And like Van, you know, the the old god has fallen. Like Vanguard recently allowed this. And you know, we've seen all these incred incredible structured products that have come from the likes of Goldman, Bank of America, and >> yeah, so that that will continue to happen. Again, once the market structure bill passes, it makes Wall Street even more crypto friendly. You know, Wall Street is a selling machine. It was set up I live down here. It was set up and built to sell stuff, >> right? We're raising capital by selling it to people. It's the greatest selling machine the planet ever created. Now you're going to put Bitcoin and other digital assets through that selling machine. I usually bet on Wall Street. >> Yeah. No, that's true. We'll get on to that in a bit. I just want to come back to the DAT point because you said they did and that's fair and I think many people can can confirm that and at least the marginal debts. But there is all this FUD around strategy and it always seems to crop up you know around a bull market or around a bare market when we go into bare market very smart. He believes everything he says. It was a very thoughtful idea that they came up with, sanctioned by the board to say, \"Hey, let's let's put at least enough cash in a reserve to take off the run of the bank for the next couple years.\" And I think that calmed things down. Can he get the stock trading at a premium again? We'll see. I think it's trading about 95 cents on the dollar right now. And when it trades below par, you know, below NAV, you know, for a while it drifts into the category of just another closed end fund doesn't do anything bad for the system, right? We have closed end funds in every product in in the financial services. It just becomes less exciting. Why it's important for Bitcoin is he was the number one salesman for Bitcoin, right? He was the community salesman. He was the face of the story. He's very articulate. He's very animated and excited about it. And so if his platform becomes dull, right, strategy trades at a 15% discount permanently, there's just less energy of bringing people into the tent. In some ways, it's always time to find the new salesman. I was willing to retire a few years ago because I was laughing. I said, I've told the story of Bitcoin so many times, people are sick of hearing from me. You got to have a new generation of people that are bringing people into the tent. Larry Frink did the best job of it, right? Because his platform was the biggest. The community needs to constantly refresh itself. The story doesn't change, right? And keeping the story simple, but new generations, new avenues of bringing people into Bitcoin. In some ways, it is a game of building trust with your fellow citizens, your fellow people in your community, right? It's the value of Bitcoin comes from the the social construct that me and you both agree it has value. If you're crash, you could call it a multi-level marketing machine. I sell it, you sell it. But if if everyone stops selling Bitcoin, let me tell you what the price happens goes down. All of these ecosystems need energy. What's been fascinating is how many of them have been able to keep energy. What is energy? Energy is how do I bring eyeballs to the story? So you need Bitcoin would not have existed without Twitter. Right. Right. >> Twitter gave it Bitcoin would not have existed without Twitter. Twitter gave it a platform to tell its story. This is a storytelling asset. >> That's that's true. >> I mean, think about guys like Brock Pierce reversing he was walking around handing people Bitcoin telling the story. You think about all the OG OG storytellers. They all deserve a pat on the back for the work they did, you know, pushing the ball forward. Dan Moorehead probably did more institutional talks on Bitcoin than any man that ever walked the planet, you know, but it was, you know, there are hundreds of them and thousands of them quite frankly. And then there someone in every small village was telling that story. That's what makes crypto valuable. It's the community. We're transitioning now. Utility is going to be much more important. Not just in reality, but for the story. Because now that blockchains are fast enough to be used, the legislative framework's allowing them to be used. People are like, \"Okay, what does it do? Show me how it works.\" And so it's going to be harder for blockchains that don't do a lot. And we have a lot of ghost chains with with high valuation to keep their story alive, right? No story, no value. >> Yeah, that's true. I guess do you think that this is why many people just get into these philosophical debates around Bitcoin's original purpose, right? Uh born out of crisis in 2008 caused by bankers with the subprime mortgage crisis and you know, forced cipher punks and now it's basically just been wrapped in an ETF over at Black Rockck for Larry Frink to shill. And what do you say to those kind that kind of argument? Because admittedly there's also been I've seen it on the timeline some people think okay maybe this is part of the reason why some of these OGs may be looking to cash out. Obviously they got sitting on massive gains but I guess that argument that the original ideals of Bitcoin around um its purpose as a as a nan currency that's outside of the financial system is now basically being co-opted by it. When I think of what Bitcoin has morphed into standing for is a hedge versus the unbelievably irresponsible fiscal and monetary policy that the West has engaged in. And that happens in every cycle. That happens every reserve currency blows it. They print too many dollars and you debase the dollar. It had energy of the system because of what happened in08. The system's not fair. We want to have our own place to store our wealth. But it really still is a store of wealth. It's I'm trusting this community to store my wealth because I don't trust the Federal Reserve. I don't trust the US government won't keep Donald Trump's never liked the tax he wouldn't pay. Right? He loved debt his whole career. And so why do we think now they're going to get responsible? And they're not. Right? The deficit's bigger now than when they took over or just as big. We're at 38 trillion dollars in debt. We're going to be at $40 trillion in debt. And so that's really the story of Bitcoin. And I don't know if it matters if you keep it, you know, on your treasure you in your safe in your garage or if you keep it custody at Fidelity. You're buying it for that same reason really because you think the dollar is going to be worth less. I've got a I was looking this morning in here was my gold. Got a drawer full of gold gold coins, you know, and I was like, I got I gotta get a safe because when I bought them, they were all worth like 1,200 bucks and now they're worth $4,000 or $4,300 and I got 50 coins in there. And I was like, it was the same reason. And we were digital gold. And I think getting away from that story makes it complicated, you know, and yes, it started, you know, Satoshi thought it was going to be, you know, going to be money. Well, money you can confuse as store of value or a payment system. It was I don't think it was ever meant to to buy your Coca-Cola. >> No, that's fair to be honest. I mean, as a store of wealth, long-term store of wealth, and as a dollar debate, as a dollar gets continually debased, I think there's nothing really that compete with Bitcoin. Even if gold is, you know, performing well now and outperforming to much to much to Peter Shiff's delight, um I still think that Bitcoin is the ultimate store of value. Just coming back to when you mentioned now, of course, the you know, debasement of the dollar, the massive deficit spending, you know, this whole the proverbial nothing stops this train and you mentioned this earlier in terms of macro for next year as it relates to Fed policy. Uh so we had the FOMC last week. We had rate rates were cut but we've also had restarting of albeit limited QE to the front end of the curve and now it seems as if we've in a horse race between the two Kevins. Uh so I guess like how are you reading the macro ties from that perspective and do you think that we are going to get this mass 2008esque QE that many people seem to be hoping for beginning next year like just mass liquidity into the system? >> I think they're going to cut rates. I think jobs are a bigger worry in the administration than the market has them. Right? This this idea that AI is hitting jobs I think is real. And so watch non-farm tomorrow. But as long as you have job weakness, you're going to have a very doubbish Fed. It doesn't matter what Kevin. I know the market perceives Kevin Morsh is going to be more hawkish. He's not. He wants rates down at two and a half%. That I think is a good story. Do they do QE? I think probably more likely with Hassid than with Worsh. I think the first chapter doesn't matter because it's just getting rates down. And I think what's also going to see is like they're going to allow banks, you already did this, to get more levered up. I said like if you take Fanny and Freddy and make them risk-free assets, it's trillions of dollars of liquidity uh or hundreds of billions of dollars liquid. I should get the I should know the number. What do banks hold on their balance sheet in mortgages? and if those become risk-f free and so you're already you know they did this thing with the SLR which is giving banks a lot more liquidity and so you're already jamming liquidity I think it'll start after the new year right because right now there's year end liquidity that's liquidity gets tight as people want to clean up their balance sheets just for the the snapshot and so I I do think we're going to be in a hyperlquid space >> that's positive so like yeah >> Q you gota have the yield curve steepen around you got to be long two years but short 10 years because that should be a good environment for gold, silver, Bitcoin. Right now, silver's the silver is the the the horse in the front of the race. Normally, when you get close to the end of the year, the horse in the front of the race wins. You got to bet silver and gold outperform Bitcoin in the next two weeks. But next year, you get a new race. >> That's true. I mean, it comes back to if like you've said many times, you think Trump is going to juice the economy, run it hot, bring rates down. QE, this is obviously going to, you know, inflation expectations probably going to go up. long ends are going to you know long end bonds are going to sell off and then you know the debasement continues right in that environment. So it is interesting I guess then inflation if inflation starts if the end result of this is a is a resurgence in inflation like isn't that potentially bearish for the economy itself because you've got the whole K-shaped the economy people who in the the lower rungs of society are struggling with you know cost pressures and stuff like that I mean okay I'd like to take a moment to thank the sponsors who make this show possible SVM's ecosystem has been missing a high-speed low latency chain until now Fogo delivers 40 millisecond block times, 1.3 second finality, and near zero fees. All backed by high performance validators colllocated near major exchange infrastructure. Made for traders by traders, zero compromise. It's not theoretical. It's live and blazing fast and ready for you to test. Head to fogo.io/start and experience the future of trading. Is this necessarily the best route the Fed should be taking? I mean, obviously it's good for people in the markets if you hold assets, if you hold Bitcoin, but is this, if you were like the Fed governor, would you be juicing the economy? Would you be dropping rates? >> The $79,000 question, is AI going to be the greatest productivity enhancer and hence deflationary force we've seen? And if it is, rates should be a lot lower and you should be juicing the economy because you're going to be losing jobs. Like I actually think I see no way out in the long run without us getting to UBI to some redistribution of wealth. Right. The the real risk to the the country and actually the global economy is the inequality gap gets worse every day. And technolog is allowing fewer and fewer people to make more and more of the money. Even in finance, right? It used to be the Goldman Sachs world that made money. Now it's jump and Jane Street and Hudson River Trading and Susuana. I don't know if you saw Hudson Trading last quarter. I think they reported 4 billion in profit. You know, we're in the same building as Jane Street. It won't shock me if they make another 20 billion this year. Billion. These are companies with 2,000, you know, 1500, 3,000 employees with a couple partners. We've never in my lifetime, and I've been in this Wall Street, I'm 61, so a long goddamn time. I've never seen wealth creation like I'm seeing now in these private companies that no one knows about in the entire time I've been on this. And so why why are they able to do it? There's this confluence of events that are happening, right? On the one hand, we have a whole new generation of gamblers, and you can call them investors or gamblers. And it's same day options. It's meme coins. It's parlay bets on sports betting. It's young kids that are saying, \"Hey, it's hard to buy a house. I I I enjoy this. I can make money on it. I'm a whatever their reason is, we've made speculating cool.\" When I was a kid, you could only gamble at Las Vegas and Atlantic City and they were seen places. It was illegal to bet on sports, right? Gambling was very taboo. I make this joke. I was like, I got a chef who's a same day options guru, a son-in-law who's a memecoin genius. My son, he loves parlays on sports betting. Like, everybody in that 20 to every every male in that 20 to 30 year old range is engaged with friends in some form of speculating. I'm telling you, when I was 20 to 30, that didn't happen. Maybe if you worked on Wall Street with your PA, you'd buy a stock, but none of us were speculating. We were working trying to make money. We might have had a job trading, but not on our PA. It's a whole cultural shift. And so, I'm not sure it's a good one, but why is Jay and those guys making money? Because they're taking advantage of all that inefficient liquidity. >> Very interesting way of looking at it. I mean, so essentially, you know, these highly sophisticated private firms are making money off of retail who are trying to beat the market in some way. >> Yes. >> But but then it's like they're in a situation where if they're not being the market, I mean, they're trying to, they have this hope that they can, but then in terms of the real economy, there's not that many jobs them because AI is replacing jobs. If that's the the notion. So, is it just uh to try their luck in a dystopian way to make it a 100x on a zero day option or a memecoin or whatever it is? >> Yes. Yes. Yes. And yes. That's that's that's why if you're like a Republican, you said, you know what, as long as everyone knows what they're doing, buyer beware, right? And if you're a Democrat, traditionally like, hey, that's not good. Are these guys adding to society or should we put a transaction tax on them? you know, like and you're gonna see these conversations come up because this story is gonna get, you know, it's it's too big of a story. There's there's too much money. You know, in India, you saw Jane Street got fined and I talked to some Indians. They're like, it felt like the East Indu, but let's say they weren't even breaking the rules. Smart guys coming into our markets, taking a ton of money, and going home with it. Like, what does it do for us? And this is where you're going to see this populism show up. like, is this fair? You can look at fair from two ways. If everyone's playing by the rules, one person says, \"Well, of course it's fair. There's the rules we just played by. Don't get mad at me that I'm faster than you or smarter than you or quicker than you.\" Another could say, \"Yeah, we have a set of rules, but if the same guy wins every time, we don't like the distribution of there, so we're going to change the rules, right? Because it doesn't seem fair that one guy's going to have all the money at the end of the year.\" And so we're going to have this real debate, I think, publicly, politically, not just in the US, globally about globalization and technology. And when when Elon Musk is going to be a trillionaire in the next 18 months, and that's higher than 60% of the wealth of the rest of the United States combined, it just doesn't feel right to people. And so that's the biggest risk to markets is the political backlash, the wealth tax that's coming. And I don't know if it will come in in form of a wealth tax but some form of wealth tax always happens historically when one group of people make all the money. It's a very good point in terms of especially if yeah look at the inequality going on now and this is what Ray Dalio talks a lot about in terms of the end of societies generally and many people could argue are we in the stages late stages of capitalism the last stages of late stage capitalism how do you think this plays out then next year because I mean this is obviously will inform in terms of potentially crypto markets could go but like >> so I I was actually I was with Rey last week we had this debate just two of us in In the long run, he's going to be right. And you don't know in the short run. AI is a bubble and and my guess is it's going to become the greatest bubble of all time. It's such a powerful story that when you call a bubble, it usually is two years early. And so, and he doesn't know the timing either. And we also don't know the timing of politics. Right? We've got Mandami who represents a really smart guy who looked at the system and says, \"Hey, things don't feel like they make sense.\" And a whole group of people feel like they're falling behind. There's another part of the Democratic party in America, Mickey Cheryl in New Jersey, Abigail Spanberger who just won the governorship in Virginia, Josh Stein who who says, \"Hey, there's a middle route Democrats most Americans resonate with.\" Right? It's not socialism, it's capitalism, but we've got to actually understand we've got to deliver things to make standard of living higher. But it's hard when you bring the inequality into it. You know there's I I think in the long run you have to you have to redistribute income much more efficiently than we have in the past and that's about the best you can do. Like we already redistribute income a lot in the US and in almost every western society. We just don't do it efficiently but it's going to have to be some form of that especially with state capture going on nowadays. See, so then this next so then next year you've mentioned like the momentum and some of these Democrats have come into power through their moderate views and and this plays into what happens next year. How do you read the the political landscape then? Like what do you think is going to happen? >> Yeah, I I think unless something dramatically changes, the Republicans are in big trouble in the midterms. Now, what does that mean? That means Trump's a political animal. He's going to do everything he can to juice that economy so he doesn't lose these midterms. And that's where I think the juice the juice theory comes in. But I think if you lose the midterms, that might end the cycle in the the equity market. Might not though because AI is powerful, but it's going to stop the effectiveness of this administration and they're going to maybe, believe it or not, even be more erratic because the the Democrats are going to try to impeach Trump and that whole horseshit back and forth starts again as we're going to an election cycle where Trump can't run. >> That's going to be crazy. It's going to get messy. >> Yeah. I think from crypto's perspective why it is so freaking important to get market structure done now. The Democrats want crypto off the table as an an issue because right now it's a Republican winning issue. All the all the crypto money are most of it goes to Republicans and they had it it is both perceived and and now seen as real that crypto had a big impact on the election and getting Trump and everyone elected. from a Democrat perspective say, \"Hey, let's pass this legislation so there's nothing else to talk about. Let's make crypto bipartisan,\" which is great for crypto. So, we'll see if this thing gets done. I hope it does. >> Yeah. I mean, I think it's now been pushed back to the beginning of new year. I think there's some back and forth and someone in the White House doesn't like the um the uh conflict of interest kind of like that wording, but um how do you think the markets where do you think we would have been now in terms of the crypto space, Bitcoin? etc. If Camala had won. >> Yeah, it's hard to say. I I think you would have still passed legislation. You wouldn't have near the support at SEC. It's not just the legislation getting passed that was had getting some momentum. Paul Atkins is a radical. He's saying put it all on chain. And so the acceleration of digital assets as a as a force for good, I think would have been much slower under a democratic regime. We haven't seen the gains from the OC's change of heart or from the SEC's change heart or the CFTC's change hearts. That'll come in the next two years, right? And those gains are going to come from trade five participation. They're going to come from I mean, think about just even prediction markets. Right now, prediction markets are a hype, but pretty soon you're going to be built into everything. And that's all because of the CFTC ruling, right? And so I think the Trump impact on our business or the Trump administration impact on our business probably starts now and really ramps for three years. >> Yeah. And one of the big beneficiaries from this change especially as it relates to you know new token issuance tokenization onchain stable coins is altcoins right um and but it has is quite clear that the the experience of people who've been holding altcoins or altcoins in general as compared to bitcoin this year >> altcoins have sucked because they were designed to suck. People were so scared of giving any utility or any economic interest being deemed a security token that all the altcoins did generally speaking were represent you know it was like hey you get to be part of my energy they were community tokens so they were all a version of bitcoin with a very different stories like we were big investors in Celestia it's a very good piece of technology right the first modular blockchain smart guys built it look at the chart and it looks like so many others. Why? Because you don't get that there was no economics that came through the usage of that to the token holder. Again, why I keep going back to Hyperlquid, I think, as the as the ideal token, but hyperlid under the Genz administration would be a security token, right? And so getting these rules set in this new piece of legislation that allows people to create tokens that give some economic value to the user of the token as opposed to just, hey, it's another version of Bitcoin. will be the radical thing that happens and if it doesn't happen our industry is going to suck. >> This is so true. So it's like they're the products the the altcoins and the networks that are actually gen think thinking of ways to generate revenue like you view out like a cash like value a business right pumpf fun is a fine token it'll either he'll either pull it off and be a platform where people keep using it you know does he switch to Tik Tok and you know monetize attention on videos like smart team but the way their token is set up is fair >> it's fair just coming back to the underperformance you know that's a good point you raised in terms of the actual incentive to hold the tokens but there's There's a few other arguments I've seen around one is potentially dilution of all these altcoins out there in the space. You know, we've had a lot a lot of unlocks and now we've got like 10 different layer ones, 20 different layer 2s. So there's dilution argument and then the other argument is well retailers a lot of opportunity or people have a lot of opportunity to if altcoins are generally held as a beta on Bitcoin. There's a lot of other ways to get higher risk allocation to Bitcoin like you have ETF options, you've got leverage trades and you now you've got like the likes of options on um in Robin Hood and all that. So, and AI. So, do you think that this is potentially taken away from the attention for retail to invest in altcoins? And then do you think that the the dilution is having an impact on the ability? >> First of all, >> no matter what you're trading, here's my I've been doing this for 40 years. Kernel of truth. What what you're trading, it's always who's buying, who's selling, what's what's the what are the flows? And you could make a fortune in any asset if you knew the flows. So, I've got a guy, one of the best hedge managers in the world. All he does, he's got a 20 person team that measures flows, seasonal flows, where the flows come in every asset in wheat and gold. And you know why is gold up? Because central banks and tether have been buying it. They've been dominating the flows, right? And so when you have these giant unlocks coming, that's sellers with no new buyers. The price is going to go down. It's like third grade lessons in trading. And if you were disciplined to just sell before the unlocks, you made money. Once in a while, there's such a great hype story that it takes you takes you out. But almost never. And and quite frankly, why the highest market cap blockchains are the oldest other than Hyperl quite frankly is the only one that's kind of broken into the top 20 is because they got distributed well, right? So there wasn't this constant sell pressure. >> No, that's fair. You've mentioned Hyperlid now. Um I believe uh Galaxy in terms of your the firm um was involved in a lot of the uh Salana Dats. So I assume you're also still bullish on Salana. Like what what are the altcoins in the top? >> Yeah. Full disclosure, we you know I run the balance sheet for the firm and we we keep Bitcoin, Ethereum, Salana, and Hyperlid as kind of our four horsemen. I always wanted to be a gold company that owned gold, not a gold company that didn't own gold. We debate this all the time, right? Should you should you just have a balance sheet or should you trade the balance sheet like it's a a hedge fund? And so, but we we we we run ourselves to some index, but we basically stay long crypto. So, you know, when crypto goes down, it sucks. When crypto goes up, it's great. It's hard to break into that that top. Hyperlink was the only new one that broke in, right? You know, before the year started was three. It doesn't mean we don't trade other things. we're we'll be long coins and we have a big venture portfolio and but usually that venture portfolio when it runs its course we book our profits and move on and that's been the philosophy here. We've probably made more money selling than buying if you think about it right getting out of stuff. >> You've said multiple times recently that we've moved from narratives to plumbing. So I'm curious then if that is what is the single most important piece of crypto plumbing that you think is still missing in your view? I I say we're moving right from narratives to plumbing. Um, you know, it's the if you think about tokenized equities for a second, no one knows where they're allowed to trade yet, right? They're just we're we're working with the SEC right now on getting a what those uh sandbox exemption to to have our Galaxy digitalized token, which we tokenize on solid superstate to actually be able to trade on AMMs. And so at one point the rules have to be more clear that hey tokenized real world real world assets can trade on X or the big debate on this market structure bill in DC is around DeFi. Should tokenized assets be able to trade on DeFi? You know if I took should Galaxy stock tokenized? Is that fair? You saw Ken Griffin from Citadel said no no that's not fair. We have all this regulatory headache we put up with and those guys get to hack that. I mean, it's a little bit like what Khi and Poly Market are doing to the casinos and the sports betting. And so the lobbyists down in DC right now against prediction markets are are all casino people and sports betting people. And so we'll see how that plays out. I think getting those rules clear is really important on where these things will trade and can trade and that'll start the connectivity right the other piece is tradefi is slowly getting connected I say this all the time I think bank of New York will probably be the largest custodian in crypto and people look at me like really I like yeah because they're the largest custodian everything else and so tradefi really believes that as we digitalize or tokenize all assets like their whole business is going to be tokenized They might not trade all in tokenized form, right? The US equity market's pretty efficient. This is a big transition coming. >> Looking forward, I mean, yeah, we just need those regulations. We just need the the the actual frameworks to be able to build out in this. Just quickly moving on to some final questions here. I wanted to move on to um just some of your experience if you can impart on our viewers in terms of you've been an investor for a long time uh and no doubt faced lots of challenges, ups and downs, and no doubt you've come out on top and you've been in crypto for quite some time, right? Like I said in the beginning in the intro, you're an OG. What's your advice for those who are in their crypto journey right now uh to have that staying power uh that long-term vision and optimism? >> The number one rule of investing is don't die. And it sounds like a stupid rule, but it's, you know, when you're down on don't die, don't quit. And and which means don't be stupid. Don't bet everything. Have stop losses. Don't just keep doubling up, doubling up, doubling up. can go further down than you think. And it can go further up than you think. When something's on a moonshot, take some profits. Take a little bit more. Don't take 70%, 15% off, 15, like scale out. Unless it's your one really core position bet, right? You can't have 19 highly held convicted things. It just doesn't work that way. Figure out what your rhythm is. But like in '08, we got close to dying. And I remember my partner Wes Eden said, \"Guys, we got a couple hard decisions to make. If we swim this way and the current pulls us, we're going to miss the boat. So, we got to look at where the current like let's be really thoughtful of those decisions because that was a crisis and we luckily, you know, got to the safety raft. But the mindset was don't die because you can always come back. If you lose all your capital, you're pretty much dead. You know, it's not just capital when you're a young kid because you can get a job, but it's your reputational capital, your capital, your confidence. That's it. Listen, everyone's not meant to be an investor, right? This is a hard job. So this idea of the democratization of finance in some ways I was always thought was horshit. I thought everyone should have equal access to investing opportunities. I made a fortune on SpaceX like a I'm just looking at it now like a bizarre fortune. I invested in SpaceX in 2013. I'm telling you if id come on a podcast I would have told people why I invested in SpaceX and every one of your listeners would have said I'll do some of that. They didn't have the access and they didn't have the capital. Right? You had to have it was a special purpose vehicle by appointment only. you got lucky to get into it and now it's 100x, right? You saw Google's going to have made their largest win of all time because they put I think they put 800 million into SpaceX and it's going to be worth like 800 billion or something, you know? I mean, some crazy number. >> Yeah. No, it makes sense. So, definitely. Yeah. It's kind of like uh Squid Games um crypto investing or investing in general, you know, if you if you once you once you're out, you're out and you don't die. And uh you know the he who chases two rabbits catches none. You you can't have multiple different positions. I think there many people in crypto they just hold like people who hold like 20 different positions and sparsely allocate and it's just you're not going to make it big like that. Um that's my personal view. Just another quick question. What moment convinced you because obviously I say you got a Trafi background in prior to that. Um what moment in crypto made you realize that crypto would end up in your life's work? I walked into Joe Luben's office. Joe was my college roommate. He was a co-founder of Ethereum. The Ethereum project had just launched. I even heard of it, you know. I mean, I knew Ethereum because he had told me he was working on it. I had met Vitalic a couple years early. I went to see Joe and I thought he'd have an office with one person in it and a dog, maybe a cat. And I walked in and there were like 24 Andrew Keys was in there. There were like 24 hard charging people. And Ethereum was trading at 96 cents. But I was more impressed with the energy and these guys talked about this as a revolution. How they were going to go after each sector of society and disrupt it if it was the music business or the finance or lending or ticketing and how this decentralized peer-to-peer revolution was going to take what Bitcoin had done on money and do it on everything. It dawned on me right then that this was going to be something bigger than just speculative. There was a energy of those people that felt like a revolution. And then I started looking into it and thinking about it. We had never had a global revolution in finance, right? We had had a global markets. Crypto was like the first global market that that exists, right? You could always have traded gold, but most people didn't trade gold and currencies, but Americans don't trade currencies. And so you have a Japanese bond market, a US bond market. Now we're taking assets in the whole world. Bitcoin is bought and sold in 204 countries. It's got the biggest broadest distribution. And I thought global young and and with passion. And so that's kind of when I said, \"Hey, I should spend a little more time in this thing.\" Bought some Ethereum at 96 cents. That was a good buy. Uh, you know, I got some you get lucky in life. I bought Bitcoin at 100 and Ethereum at 96 cents. No one should be surprised I made money. You know, good entry points. >> It's interesting as well because I think many people I mean you you know you bought in those early stages but many people who says oh I wish I could go back and hold uh and buy Bitcoin when it was just coming out or 2013 2015 I could buy Ethereum in the ICO I would be so rich right now. It's it's hard, you know, because in, you know, benefit in hindsight, like in that moment, >> they all sell. And so here's my other dirty secret. I was already rich and really rich, not just a little rich. And so when I bought Bitcoin at 100, I bought a lot of it, but it was less than 1% of my net worth. And when I bought Ethereum, I bought a lot of it, but it was less than 1% of my net worth. And it made it easier to hold it. The other part that made it easier to hold it is I became publicly associated with it. I never asked to be a Bitcoin spokesman. I was actually talking about it. I didn't know the press was there and next thing you know the press was there and then I got invited to speak everywhere. And so once you're in public, you feel like a a different ownership. It also forced me to understand it better. Like I literally got invited to speak at the Oxford Union and then at some the SON conference on Bitcoin, these big platforms and I'm like I don't even know how this thing works. And so I did my digging and it was trying at that point it was the, you know, the Byzantine general's, you know, paradigm and and double spend problem and all these computer science ideas that were breakthroughs. I didn't know what a consu consumer computer science breakthrough was and why it was so interesting. And so I boiled it down to this really simple sentence. Bitcoin was the first digital asset you couldn't counterfeit. You couldn't control go control copy paste and that made it private property. And I knew from being an economist or studying economics, private property is the key to capitalism, right? It's the foundation of capitalism is the key to freedom. George Washington once said that private property there's no freedom. Every emerging market country that gets title property title, you know, title rights, they boom. And so I was like, there was something cool in that this is going to be the first private property on the internet. And I think that's probably still the the premise for why this decentralized revolution has has a great chance of of helping to kind of rewrite how finance and consumer behavior happens in the world because we now can have ownership in a digital form that transfers from B to you or and is preserved. I mean, I've told the story Gaddafi when he took over Libya took all the titles and burned them and said, \"Hey, all your property is mine.\" Well, if it's on the blockchain, notice that says it right there. It's mine. There were so many things that resonated with me from that simple insight that I was like, \"This is going to be cool.\" Now, I would tell you what, I will be really disappointed if in 10 years crypto is still mostly Bitcoin, stable coins, and and a bunch of gambling tokens with 25 to 3 to1 leverage. Like, I really want it to work, and I think it's going to work better and faster overseas than in the US. If you think about what a crypto wallet is, it's it's a personal finance. It's a bank. You should have your interest, you know, your stable coins, your money market funds, your equities, your crypto, your opera tickets, all in a self-custody or or or if you have too much, some self-custodied and some custody somewhere else. That's revolutionary. And so I I I think it's a bigger idea for rest of world than it is for the developed world. But it's a big idea. >> Yeah, no doubt. Um, and you need important spokespeople for the space to tell that story to bring that energy and you've been, you know, you know, been holding that baton for many years now. So that's a testament to your dedication to the space. I think it's important, like you mentioned at the beginning, we need to pass that baton on to the next generation of people who are willing to tell that story. >> I had hair like yours when I started. >> Yeah. I mean well I'm you know I guess like my longevity in crypto I question it many days in terms of how quickly I'm going to age but I think that you know it's that important point around having the perspective of what it can do for financial freedom especially in the rest of the world in countries that the story that you hear about is you know like we talk about tradies adopting it black robs adopting but the people who actually the real adoption that matters is those in the likes of Africa and Asia who need to to finance their need to finance like imports and they use Bitcoin or Tether or they say they haven't they haven't had access to a bank account and they're able to to do that and I think that none of that story is told. So, uh yeah, that's why I think we should remain optimistic about the space um in general. But, um thanks a lot for this, Mike. I mean, I wish it could have been longer, but I know you're a very busy man. Um we didn't even manage to get onto your uh Iawaska experiences and your wrestling background, but maybe that can maybe that can be for our next um our next podcast. But I really appreciate you coming on. Ask be wellman."
    },
    {
        "video_id": "EzOR26s2zUM",
        "title": "MSCI Will REMOVE Microstrategy!! What It Means For BTC!?",
        "published_at": "2025-12-17T17:00:24.000Z",
        "sort_date": "2025-12-17",
        "url": "https://www.youtube.com/watch?v=EzOR26s2zUM",
        "views": 29822,
        "duration": "00:19:34",
        "transcript": "Imagine waking up to find your stock could be forcibly sold. Not because earnings missed, not because of a corporate scandal, but because an index committee decided to change a definition. Well, that's the situation that Strategy is facing as Morgan Stanley Capital International considers booting it from its indexes. But Strategy isn't going without a fight with the company even stating that this is a matter of US national security. So, in this video, we dig into why MSCI might remove Strategy stock from its indexes, on what grounds Strategy is protesting, and how impactful Strategy's removal might be for the stock and BTC itself. My name is Lewis, and you're watching the Coin Bureau. First up, I must make one thing clear, and that is that I am not a financial adviser, and nothing in this video should be considered financial advice. This is educational content meant to inform you about strategies potential removal from MSCI indexes. If that sounds good to you, well then hit that like button and let's get into it. All right, so let's start by looking at MSCI or Morgan Stanley Capital International. If you've been active in markets, you may have heard the acronym before. If you've ignored it, well, that's fair. It sounds like the kind of thing that only people in Patagonia vests argue about in airport lounges. And just FYI, it's no longer part of Morgan Stanley. They're entirely separate entities. Anyway, in simple terms, MSCI is a global provider of equity indexes, benchmarks, and analytics used by institutional investors to measure and manage portfolio performance. Some of the big ones you might encounter include MSCI World for developed markets and MSCI ACWI, the all country world index, which covers both developed and emerging markets. But to be clear, MSCI isn't just a company that publishes a bunch of indexes. For many institutions, MSCI is the default benchmark. It's the yard stick a huge chunk of the investing world uses to decide whether they're outperforming, underperforming, or about to get fired. And beyond benchmarking, many ETFs are explicitly designed to mirror specific MSCI indexes. So, what kind of numbers are we talking here? Well, currently according to MSCI, about $18.3 trillion in assets under management are benchmarked to MSCI equity indexes, meaning that's money whose performance is being judged against MSCI's line in the sand. In addition, however, over $2 trillion in equity ETF assets are linked to MSCI indexes, that is tracking them directly through index products. Now, you might be thinking, \"Okay, but aren't passive flows the only thing that really follow indexes?\" Well, passive flows are one big part. But if an ETF or index fund is designed to track an MSCI index and MSCI says stock X is in, then the fund is essentially forced to buy stock X. Equally though, if MCI says this stock is out, well then the fund sells. No debate, just instructions. But active managers care too and sometimes in the most predictable way possible. They hug the benchmark. Their mandates, their tracking error limits, and the basic reality of performance comparisons push them toward a tendency to not be wildly contrarian. So even when a fund is technically active, the benchmark still has a big influence. Not necessarily because the portfolio manager loves rules, but because underperforming the benchmark while you're off doing your own thing is how you become a former portfolio manager. And that's the important part. This is why MSCI index decisions can create real mechanical buying and selling. And it's also why index changes can turn into very significant events that can make or break a stock. In practice, index providers announce changes. Markets get a heads up and then on the effective date, a lot of the required trading gets compressed into a narrow window. That's because funds that track the index have to be aligned when the index changes that creates a big burst of volume and often some absolutely cursed short-term price action. So, you could see how this is a big deal. Indexing doesn't really ask the market's opinion and it doesn't care about your thesis. It's just a set of rules that turns into orders. And needless to say, when you hear that MSCI might exclude strategy, don't ignore the significance of that for strategy stock or BTC itself. Much more on that later. So, what's MSCI actually doing here? Well, they've opened a formal consultation on how to treat digital asset treasury companies or DATs. As you probably know, DATs are businesses whose primary thing is holding BTC or other crypto assets, usually focused on raising capital to stack more coins. MSCI's proposed change would alter how DATs are viewed. If a company's digital asset holdings are 50% or more of total assets, they'd be excluded from the MSCI global investable market indexes. That 50% threshold is a big issue for the current lot of DATs, including strategy. With this proposed rule, MSCI is communicating that many DAT business models look a bit out of place in their indexes, and they're wondering whether they should be pruned out. Essentially, MSEI is asking whether these DATs belong in the bucket meant to represent the mainstream equity universe. But why exactly did they draw this line? Well, MSCI says some market participants argue these firms look more like investment funds and funds aren't eligible for these indexes. In other words, many argue that companies like Strategy are essentially just levered crypto bets rather than actual operating companies. MSCI is asking whether these businesses just so happen to own a lot of digital assets or if they're crypto asset vehicles in disguise. Formulating a clear rule is tempting, but it's messy in practice because it's an asset test tied to something that moves like crypto moves. Total assets is a balance sheet concept. Digital assets are well digital assets. If a firm is near 50%, they don't need to change the business to cross that threshold. The market can do it for you overnight. A rally can shove you over. A draw down can pull you back under. But in any case, that's why strategy is getting caught in this net. The biggest, loudest corporate BTC treasury on Earth is unsurprisingly at the forefront of this MSCI decision and the debate surrounding it. If this all seems a bit messy, well, that's because it is. Dats have already been struggling lately, and this would be yet another blow. But if you'd rather avoid the potential mess associated with that stocks and index rule changes and just trade the digital assets themselves, well then you could just simply check out the Coin Bureau deals page. That's where you'll find signup bonuses of up to $100,000, trading fee discounts of up to 50% and deposit cash backs of up to 75% on the best crypto exchanges. So if you want those deals, all you need to do is just hit that link in the description or scan the QR code on the screen. Then once you get on the deals page, find a deal that suits you and click one of the sign up now buttons. Remember though, these deals won't be around forever, so take advantage of them while you still can using the link in the description or the QR code on the screen. Now, Strategy co-founder Michael Sailor is not exactly known as the quiet type. So, what was Strategy's response to MSCI's move? Well, you don't often see a public company write to an index committee like it's sending an amicus brief, but Strategy did exactly that. The firm sent a letter on December 10th to MSEI's equity index committee on the proposed digital asset treasury exclusion criteria. The letter opens with a clear claim that sets the tone. Excluding companies whose digital assets are 50% plus of total assets is misguided and would have quote profoundly harmful consequences. Strategy's first move is to reject the label. The firm says DATs like them are operating businesses, not investment funds, and that MSCI's fundlike framing is a category error. They argue MSCI's oneline rationale that some market participants think DATs look like investment funds is too thin to justify rewriting eligibility standards. Importantly, Strategy says that they don't passively hold BTC. They run a Bitcoinbacked treasury and capital markets program that engineers digital credit instruments then uses financing proceeds to buy BTC. They highlighted that after MSCI included strategy in developed market indexes in May 2024. The company kept expanding this playbook including issuing five listed preferred securities in 2025 alone. Strategy claims its model is to capture the spread. If BTC's long run returns beat their dollar financing costs, shareholders benefit and management can evolve the business into other uses of reserves as the industry develops. And they stress investors aren't buying onetoone BTC exposure. You could get that directly or via exchangeraded products. Instead, strategy says shareholders are buying management discretion and a business model that can trade at a premium to the underlying coins. Next, they argue that Strategy's structure doesn't resemble a fund. Strategy says that it's a standard corporation with governance, no redemption rights, no management fees, and no mandate to track BTC or any index. They also argue they're not an investment company act vehicle because BTC is a commodity and that concentrated asset balance sheets already exist for commodities like oil or timber without MSCI labeling them as a fund. Then comes the 50% threshold itself. What strategy claims is quote discriminatory, arbitrary, and unworkable. The firm says this singles out digital assets while ignoring plenty of other concentrated asset models even though equity investors in all of them are paying for what management can do with an asset base. They also argue that it would create index whiplash because digital asset prices can push a firm above or below 50% without any strategic change. as we noted earlier. Plus, to enforce it, MSCI would be forced into constant auditing and novel monitoring, policing book versus fair value, indirect exposure through subsidiaries, complex contracts, and many more headaches. Accounting is where strategy says the simple test is likely to break globally. They argue BTC is fair valued under US accounting standards, while other systems used internationally can book at cost. We won't get into the nitty-gritty here, but the key takeaway is that similar economic exposure could lead to different index outcomes depending on jurisdiction. In other words, it could be quite a mess. After all the mechanics, the letter goes for MCI's identity. Strategy quotes Msei's own stance that indexes should accurately and objectively measure markets, provide exhaustive coverage, reflect market evolution, and avoid judging whether an investment is good or bad. Getting a bit spicier still, strategy then argues a digital asset specific exclusion test looks like MSCI injecting a policy judgment into benchmarks. That's combustible for institutions that need neutrality, especially after the broader backlash against what was viewed as policy laden investing through things like ESG. But strategy didn't stop there. Oh no, beyond all the standard reasoning, the letter escalated to national security. Strategy presented BTC as foundational technology, a scarce digital commodity plus infrastructure that enables permissionless transfer. They argue DATs are helping build an emerging financial system around it. The way earlier infrastructure bets became the backbone of whole economies. From there, they claim that the US government is treating digital assets as a matter of critical importance. The letter mentions initiatives like the strategic Bitcoin reserve, retirement plan access, and technology neutral regulation. Strategy warns MSCI's proposal would conflict with that strategy and kill innovation. The company contrasts this with CBDC style alternatives, naming the digital one, and argues that sidelining bitcoinbased finance strengthens state controlled models at odds with US economic liberty and security priorities. Serious business here. On top of this, Strategy claims that exclusion would shut DATs out of roughly $15 trillion in passive benchmark linked capital. So after all the fireworks, strategy asks for something pretty straightforward for MSCI to reject the proposal. They stress that MSCI citing that some market participants felt a certain way isn't a standard on which you could build a global benchmark rule. Quite the response then from Michael Sailor and company. But amid all this drama, one thing is abundantly clear. When an index methodology dispute starts overlapping with foreign policy, you know the asset class is now in the big leagues. So now comes the big question. What happens if MSCI actually removes strategy stock from the big global benchmarks? Well, the first order effect is straightforward but nasty. Any fund that tracks those MSEI indexes, ETFs, index mutual funds, and a whole slew of other mandates would be pushed to sell strategy stock because the index said so. And because tracking funds live and die by tracking error, that selling often gets crammed into specific windows around the effective date, usually near the close. Translation: confirmation of a removal often results in a particularly nasty but acute wave of selling. JP Morgan analysts have warned that removal from MSCI indexes alone could result in about $2.8 billion dollars of outflows for strategy. But it wouldn't necessarily stop there. If other index providers were to follow suit, which is possible, those analysts project up to 8.8 billion in outflows of strategy stock. Now, it should come as no surprise to you that when the market knows a forced seller is coming, it doesn't politely wait. Some managers pre-trade to reduce slippage. The fast money crowd tries to frontr run the whole thing. Index funds and institutional managers often begin trading before the official adjustment to minimize tracking error. While traders and hedge funds look to profit from the dislocations created by forced buying or selling. That whole dynamic can result in a pretty wild window of volatility. Not entirely new information, just aggressive repositioning. There's often a drift lower into the event, then a burst of volume into the rebalance, then an aftershock period where liquidity is thinner because the passive benchmark bid isn't there anymore. Beyond the stock price, there are potential corporate consequences for strategy. Its BTC treasury machine works best when it can raise capital efficiently, and that's much easier when the stock is strong and its MNAV or marketto bitcoin net asset value is above one. If the stock is pushed down by forced selling after an index removal, MNAV can fall to or below one, making new equity sales far less attractive. That's important because issuing equity has been a key way Strategy has funded its BTC purchases. At that point, investors want a deeper discount and lenders want higher rates, shrinking the spread Strategy relies on and making future funding more costly and more dilutive. And that's not to mention that general optics and the impact on sentiment. Headlines reading that strategy was kicked out of MSCI becomes an instant narrative weapon for bears that drives potential investors away even if nothing operational changed overnight. And of course, this negative impact could extend to BTC itself. Not because strategy would suddenly become a forced BTC seller, but because an MSCI exclusion would read as another riskoff signal for BTC. The spillover would be mainly narrative and positioning. A negative feedback loop of strategy stock slipping, pushing BTC lower, which then weighs on strategy stock again, and so on and so forth. However, it wouldn't be the immediate BTC supply overhang that some seem to be fearing. On that note, it's worth pointing out that strategy has recently raised roughly $1.44 44 billion of cash specifically to cover preferred dividends and debt interests for about 21 months. That makes a near-term forced BTC sales scenario unlikely unless conditions turn truly extreme. Nevertheless, the overall impact on BTC would certainly not be positive, but the impact wouldn't stop at Strategy in BTC. If MSCI draws a clear line around digital assets on the balance sheet, other DATs may start optimizing for index eligibility by restructuring. There are also BTC mining companies that could fuel enough pressure to adjust significantly. Whether that's holding less BTC through cycles, selling more production, or separating Treasury from the core listed entity. So, it may just appear like a case of strategy versus MSCI, but the potential implications for the wider crypto market can't be denied. With all of that said, here's what to look out for from here. Msei's consultation stays open until December 31st this year, but final conclusions due by January 15th, 2026. If they go ahead, Msei says any changes would land with the February 2026 index review. Between now and then, the devil is in the details. The final writeup needs to clarify what primary business actually means and any changes regarding the 50% threshold. Another indicator is who piles into the comment process. If more prominent firms and asset managers start filing letters, that's pressure MSEI can't ignore. Strives public push back is a good example of how this is turning into a broader lobbying fight, not isolated complaints from strategy. And then there's the ultimate market tell price action. Watch price movement around the key decision windows. If MSTR stops grinding lower into January and it doesn't dump, even if some sort of bad news hits the headlines, that could be the market telling us that a removal is priced in. For all the drama that has come of this situation, JP Morgan has argued that much of the MSCI exclusion risk is already priced in, which means the decision could matter a lot less than the reaction. And that is going to wrap up our outlook for Strategy and its clash with MSCI. But what do you think? Will strategy get the boot? Does it deserve to be in the indexes to begin with? Well, let us know your thoughts in the comments below. And if you want to learn more about other major changes to crypto rules that are set in stone for 2026, you can check out that video right over here. That's going to be all for now. Thank you so much for watching as always, and I'll see you again soon. This is Lewis signing off."
    }
]