[
    {
        "video_id": "XHfohKJ1ElE",
        "title": "Why The Stock Market Hasn't Crashed Yet? What Banks Don't Want You To Know…",
        "published_at": "2025-12-17T14:00:07.000Z",
        "sort_date": "2025-12-17",
        "url": "https://www.youtube.com/watch?v=XHfohKJ1ElE",
        "views": 126644,
        "duration": "00:14:33",
        "transcript": "Right now, something strange has happened. The stock market is near an all-time high, but at the same time, more people are losing their jobs. That doesn't usually happen at the same time. By the end of this video, you'll understand what's really going on with the market, and I'll give you a couple of simple things you can do this week to protect your money. My name is Felix Green. I used to invest in banker. I've seen how the system works from the inside. And I'm also the founder of the goat academy where we've taught over 20,000 regular people how to understand investing and track their money better. I'm also the co-founder of trademission.io where we give you market news and data the same quality you'd have if you were working in banking. And today I'm going to explain the reasons the market hasn't crashed yet and what you need to do to prepare for what's coming next. Now you may remember that in early April of 2025 the stock market crashed. I mean really really crashed on April 3rd the market fell 5% in one day the next day it fell another 5%. So in just two days we lost $6.6 trillion just poof bunched. So if you'd invested say 10k in the market you would have lost $1,000 in just two days. That's real money. But the weird thing is that just within a few weeks all that money came back. By June the market was even higher than it was before. the crash. When something crashes that hard and bounces back, it tells us something very unusual is going on behind the scenes. We're going to figure out what that is in the next few minutes. So, as I'm recording this right now, the stock market is at about 6,800 points. That's very close to the highest it's ever been. Interest rates, well, the Fed, who are basically the money boss of America, they just lowered their interest rates at three and a half or so. When rates go down, it usually helps the stock market go up. But we also have inflation at 2.9%. And unemployment is at 4.6, which is the highest in four years. This means more people are out of work right now. Well, if you believe the data, but usually when more people are losing their jobs, the stock market goes down. But right now, it's going up. That's kind of weird. It's backwards. It's like your car running better when you are out of gas. It doesn't make at all sense. We also have the AI hype. Everybody is super excited about AI stocks, right? Companies like Nvidia up so much they're worth $5 trillion. That's most and most countries. And a lot of people are worried about that. Smart investors are predicting well this looks like a bubble. We've seen bubbles. Other bubbles have popped and that's kind of what could give us a crash here. Now before we dive deeper here, I want to invite you to something very special, very, very cool. you want to join me live, I'm going to share a trading strategy with you, but it takes literally five minutes a week. The same strategy that I'm betting a million dollars US of my own money on. And I'm going to break it down for you in a live free training, felix.org/training on Wednesday, which is probably when your watch ends. So, in a few hours, you can grab yourself still a free seat to that. Go to fenixpens.org/training. There's a link down below in the description. Just click on that or it might say Felix Spencer webinar takes you to the same place and learn how institutions approach the market in times like these. So why hasn't the market crashed? Couple of key reasons. The Fed is pop propping it up. So the Fed is essentially the parent of the US economy. When things start to look bad, they step in to help. And right now they're helping sort of a nice parent. What do they do? Well, in the last two months, they've lowered their interest rates three times. September, they lower it. October again. December again. Why does it matter? Well, when interest rates go down, becomes cheaper to borrow money. Companies can borrow cheap so they can grow their business. People get cheaper car loans, people get cheaper, you know, mortgages and everything else. And historically, when this happens, the stock market goes up. part. The Fed is lowering rates because the economy is getting weaker, not strong. They're lowering rates because unemployment is rising. So, it's like giving someone medicine because they're sick, not because their health. And the second reason is that AI stocks are kind of carrying everything. Imagine you got a backpack and you've got 500 books on it. It's a large backpack, but only seven of those books are actually heavy. Those seven heavy books are making the whole backpack heavy. That's basically what's happening to the stock market right now, right? The S&P 500 has 500 companies, but just seven companies, mostly AI stocks are responsible for most of the gains. It's companies like Nvidia, AI chips, Microsoft uses AI in their Apple, Google, Amazon, Tesla, Meta. So why is this a problem? Why is this risky? What if those seven companies start to fall? The whole market could fall with it's like if those seven heavy books follow your backpack, suddenly your backpack is way way way lighter. A strange analogy, but you know, you can get the idea. And just look at some of these AI stocks, how much they're up by this year. Palanteer up like 148%, right? Which is which is cool for you. Palanteer investor is amazing. Micron up 130%. Nvidia is worth, you know, $5 trillion right now. So, some of these companies are priced like they're going to make huge profits for Epic. But what if they do? What if AI doesn't grow as fast as everybody thinks? Or I think the real concern is what if AI is brilliant, but it's hard to make money out of it because everyone's offering the same service and therefore we can just use it for free, right? Check out Google Gemini. It's amazing. It's free. It's just free, right? Pay for chat GPT when you can get Gemini for free. It's brilliant. Right? So that's a little bit the the challenge here. So what could happen next? Well, couple of things that could cause us problems. So we've talked about why the market hasn't crashed yet. Let's talk about what could actually cause problems in the future. And don't worry, I'm going to show you how to protect yourself. This isn't a doomer video. But yeah, you got to got to face this one in, you know, stare in the eyes. Stanflation. What is it? It's when two bad things happen at the same time. prices go up and jobs go down. It's like getting sick and breaking a leg at the same time basically. So, sort of double double trouble. And right now, we're seeing signs of both. Inflation is at 2.9%. So, prices are going up, unemployment is rising. And when both happen together, it's kind of hard for the economy to really recover. Now, the last time the US had stockflation was in the 1970. stock market fell 50%. If you had 10k in a market, you lost $5,000. Took a very long time to recover. Are we there? No. We're not in staturation yet, but we're seeing early warning signs. And that's why it's important to understand this and prepare for it. And then the second problem is, well, AI could be a bubble, right? Bubbles get big. Remember, do you use chewing gum? You can make really big bubbles and then pop absorb your face. That's what happens in stock market bubbles. Prices go up and up and up and then suddenly they crash. So there are some warning signs. Prices are very high compared to company's profits. Everyone's talking about AI and when everyone's talking about something well they usually like the party. New investors are still jumping in. Usually we're at the top and people are saying this time is different which is always what happened. People crashed and nobody knows exactly when but history shows bubbles always pop. Bench com bubble popped in 2000 started investing. I remember that one. Housing bubble popped in 2008. The AI bubble. We don't know. It could be small. It could be a small thing like a bad earnings report from Nvidia. Could be a new regulation. It could be a competitor creating a better cheaper AI or just people deciding we think prices are a little high. Let's uh let's go buy something else. And then you have a banking problem. And the government's been well shouldn't say the government, right? The Fed, the loons of the Fed have been trying to cover this one up. Banks sometimes take risks regular people don't see. And when those risks go bad, it can cause big problems, right? Remember 2023, the Silicon Valley bank collapse. That was a big bank, top 10 bank in the US. That shocked a lot of people. People didn't see it coming. So, the banking system has these hidden problems that people don't really know about. They don't really want you to know about them. And there's some warning signs here. When banks are tightening their lending, interest rates on bonds are going up and down wildly. Lots of news about banks merging or closing. Those are the kind of things we look for and I'm concerned about that. But the good news is your money is generally protected up to a quarter million by the FDIC. So if your bank fails, you probably get your money back. But it's still stressful and it's going to take some time. So what can you do about this? Because I want this to be useful for you. Look, you understand what's going on. Let me give you a couple of simple things you can do this week to actually protect your money. They're not complicated. Anybody can do them. Step one is don't put all your eggs in one basket. You heard that before, right? Same thing with investing. If all your money is in tech stocks or AI stocks, you're taking a big risk. I believe there's a smarter approach. Some money in stocks, maybe some money in bonds. Seem you got to understand those. Don't be in long maturity bonds. Maybe you want to have some cash in a high savings account. Corporate bonds can be a good thing at the moment. And the point is if one thing goes down, you don't lose everything, right? So like right now, for example, what's my top stock? Literally right now my top stock is a retailer. Victoria Secret, right? Sounds weird. Bought it here. I told you guys about it. Doesn't mean you should have bought it obviously, but it's up 135%, right? uh since uh September. So that's not an AI stock. That is not an AI story. That's more of a we've forgotten about Epstein type story. But what I'm trying to say is you can diversify even within stocks because the AI bubble burst, okay, all stocks are going to go down somewhat, but it's not really going to hit the like, you know, lace lobbing strange perfume adoring Victoria Secret crowd, right? So, there's some things you can do that mean you are less exposed to AI, but you're still in the market. You're still invested. I'm not a fan of sitting on the sidelines because that's generally a guaranteed way to lose money. Now, having some cash reserves, it's a little bit about waiting for the right opportunity. And people say, \"Oh, Buffett's all in cash.\" Well, he's actually not in cash. He's in US Treasury, so he collects a lot of money, billions and billions of dollars in interest out. And the challenge that he has is he's got too much money. So you can't just buy any old stock, buy the whole company. He doesn't want to do that. You actually have a luxury that Buffett doesn't have. You can buy any stock, anything because your portfolio is relatively small compared to his. So the cash part to me is basically an emergency fund. If you have good cash flow, that's that's helpful. Um and maybe have a little bit in high interest bonds or something like that so that you are a little bit cushioned from the rest. And the goal is partly to make sure you don't bottle up when the market crashes, which it inevitably will at some point because you're like, well, I've got this and this is doing all right. Your mind will then focus on that. So, it's a little bit of a tricking your psychology, right? And that can be 10% or, you know, some sort of random amount like that. Now, the last thing I'd say is you got to learn the basics. Knowledge is truly power. The biggest advantage rich people have is they understand money. The good news is you can learn it, too. It's a skill like anybody can acquire. It's not as complicated as it see. So start with some some some basics. Come and join me live at felixpens.org/training and I'll I'll walk you through the way that institutions are investing their money and how we can potentially do the same thing and a crazy experiment I'm running that I'm risking my money on. So here is a suggested allocation strategy a lot people sort of say is is a good thing to do. Uh I'm not telling you that these specific numbers are what we should do. It's just just some thought to kind of like what you could think about doing, right? Having some cash here. Uh learning the basics. Knowledge is ultimately the best thing that you could possibly do. So, if we recap where we're at here right now, look, the market's holding up because the Fed is intervening. AI stocks are doing tremendously well. The US government is spending $2 trillion more every year than it has in income, right? It's like a cup out the economy. But there is a stackflation risk, right? If they'll up money spending and all that tax cutting doesn't deliver us strong economic growth from the US then inflation will rear its ugly head again which I think it definitely will. It's my personal opinion of course but I think it will. So inflation to me is a guarantee. The question is just does the economy actually grow fast enough? If it doesn't you get stackflation go to Japan it's beautiful place but in terms of economy basket case AI bubble could pop at any moment. Nobody let I know when and and how and why am I invested in some AI stocks? Of course I am, but not 100%. That's what I would say to you. And there will be bank failures. It's kind of guaranteed if you if you read between the lines of why the Fed is printing money again, it's because they're worried about bank failures. So you are now in a short I don't know 10 15 minutes more prepared than 90% of investors. You want to be more prepared to potentially profit from what's coming as well. Join me live at felixfens.org/training. See what I'm betting a million bucks on and make informed decisions with more confidence. There's the link again. You got some value out of this. Share this with people. This is trying to be a trying to make this a short one. I hope that's useful for you. Um, YouTube doesn't like short videos, by the way. So, um, smash something in front of you, not your screen, but maybe the like button and shout it at people if it's valuable to you. and I I look forward to seeing you on the live. All the best. 94% of market crashes follow the exact same pattern. And yet investors keep making the same catastrophic mistakes, losing their life savings while a small group of"
    }
]