[
    {
        "video_id": "t0m36osiv7g",
        "title": "BITCOIN: $90,000 REJECTED AGAIN WTF MANIPULATION?!!!",
        "published_at": "2025-12-17T16:11:49.000Z",
        "sort_date": "2025-12-17",
        "url": "https://www.youtube.com/watch?v=t0m36osiv7g",
        "views": 16783,
        "duration": "00:09:00",
        "transcript": "Oh yes guys, the bull energy, the bull energy is in the air. We were just above 90k. Let me know if you saw that. Write in the comment section if you saw that. But we're just above 90k. People on Twitter have been rising. Ivan, what's going on? Are we going up? Do a comment, do a video. So here we are. Let's talk about it. First and foremost, as you can see, we do have a bit of support here with the 100 week moving average. And so the price is using it as support, which is very nice for the bulls. It's very constructive. And also you have another good bullish thing for the bulls and that's that the unemployment is high. This was the report from yesterday. Basically the US has high unemployment, the highest unemployment since four years. And so based on all of this, what can we say? We can say that the Fed will likely be forced to cut rates uh in January and in February and in the future months maybe as well. So that's number two. Number three, we have to acknowledge the bullish energy, which is by the way something that we will need to get rid of because the ne before the next big leg up. Let me explain you why. First and foremost, let me tell you that I love the bull energy. I mean, as soon as the Bitcoin price is up 1 2%. The amount of comments, people love it. People want to hear the update. Are we bullish now? What's happening? I really love the energy. And trust me, I'm a bull at heart. I want us to be bullish because it's more fun. I love when the people are happy in the comment section. I don't want to tell them that their altcoin is going to go down. I don't want to be bearish, but at the same time, I also don't want to lie and I don't want to tell you something that I'm not doing myself. So, in this current situation, I have 30% in the market, 70% out of the market because we derisked starting October 8th. Okay, as you all know, uh so that's that. And also what's important important to realize is that we didn't have capitulation max fear because as soon as the price goes up 1 2% man the amount of happiness is insane. It really is insane which is great. I love it. But also I need to acknowledge the fact that for us to have an clear bottom like a macro bottom it needs to be pinito it needs to be so depressed so depressing where even if you mention the idea of us going up you're going to be ridiculed you're going to be spit in the face and so on so forth currently we're not really there we're not really there many people are obviously also bearish now I mean more and more people are starting to become bearish as well but still I would say mainly the most of the community is still hoping that this is just going to be a quick you know boop and then up to the upside. So what are the scenarios here for us to really become uh bullish? We need to go above 50 week as you know this would be the first signal to become bull bullish and then the second biggest signal is going to be this flip right here to to be bull in a bull trend. We're still far away from that and likely we will get rejected here at the 50 moving average because it was previously support and when it was previous support it turns into resistance. If you break below support now it is resistance. This is very clear. I mean you see yourself how it was support support and then here in the last um a bear we went below it and now it's resistance and uh that's it and we got rejected before that support support. So 50 moving average is the key guys. It is the key. So that's uh from the uh from the core analysis from no BS, no FOMO, no hype, just pure honest truth. Do I like this situation? Guys, I don't like to be riskoff. I want to be risk. I mean, listen, I want to be bullish, but at the same time, I also don't want to lose money. So I'm very thankful to myself for being riskoff since October 8th. I mean, many people are writing that they're thankful as well in the comment section. But um uh I mean you should know that I I I I love of course when we can discuss freaking Pango to $1 and the Solana went from $8 to $300. I mean those are the times man. Those are the times. But since October 8th I need to be straight up with you. I I I don't have any olds. I'm uh very very conservative and uh yeah all in all even if we go to 50 week moving average if we don't manage to break confidently above it it's going to be rejection and then the target is the 200E moving average which is going to be such a nice place to buy here guys if we get into the green zone and start approaching 200E moving average which is this blue line which I extended here with green man you got to buy you got to buy [laughter] if 200E moving average for Bitcoin we come back to it every four years or And it's the signal to buy is monumental. I mean here I'm a buyer any day of the week. I'm buyer buying buying buying buying. It's I mean it's a no-brainer. So just keep that in mind that uh uh here many people will tell you that Bitcoin will never go up that it's over. We're going to go lower. There's going to be price targets for 20K. I mean maybe even maybe even 10K. Uh but uh yeah, if we get here it's vice versa. This reverse psychology is going to apply just like now. people still think, you know, as soon as as soon as we go up 1%, they think it's the new pump. And listen, maybe they're right, but uh for us, we're going to be axing above 50 moving average and when this flips bullish, that's it. That's it. It's strategy. I have strategy. Most people that tell you that they're bullish, they have no strategy. I mean, their strategy is just gut feeling, read some headline, be bullish for what reason? I mean, when we are in a clear bare trend, you can lose up to 99% of your money in all coins. Okay? In all coins again, Solana went from 300 to eight in last bare market. So, especially with all coins, you really got to be careful. So, guys, that's it. That's it from the job report. Job report is good and it is setting us up for a big fat printer next year. Uh next year, I think we're going to see fantastic uh performance for Bitcoin in the second half. Okay, second half. Uh when we have new Fed chair, we have all of this unemployment maybe even higher. we have all of this actually pushing the Fed to cut because even though the unemployment is high if you look here at poly market um the market doesn't think that they're going to cut the market does not believe they're going to cut so it may be a few months without cutting but of course if we see more of this job report you know unemployment is high this and that they will need to cut so this takes months and months and months and months and don't get again I keep repeating but don't get discouraged because okay second half of 2026 is going to be this quick we're already two months since October 8th since we told you to the risk we're already two months. So now to you know to wait like six more months for second half it's I think people are overestimating how long time it I mean time flies maybe it's it's you know with age I feel that time goes so fast one year is like nothing six months it's you know I go to bed I wake up 6 months pass kind of feel sometimes it feels like that so don't get discouraged we will have uh if the bren continues we will have generational entry at these levels and if we pump for some reason bull master super energy the rocket ship up well above 50 week we're going to have the first signal and then bull flip second signal so it's it's not going to go to 1 million without without us guys I have a bit of surprise for you because I know some people have been asking about behind the scenes let me see if this works uh let me see where is it I will show you a bit behind the scenes this is never seen content never before seen content let me just put some crap away here so we have a presentable situation uh let me see let me see do you see this you go there I've never used it apparently no you can use iPhone as webcam. So, uh, what do we see? What do we see? I want to show you this. I want to show you this design solution because I've never actually shown you how the studio looks like, but we have a bit of like Egyptian style here. Egyptian style. By the way, here is the the shelf and everything. But here we have a bit of Egyptian style, but with Bitcoin. Basically, you know that Bitcoin [clears throat] was already around in Egyptian time. I really love this, you know, pyramid kind of stuff and design with pyramids. And you see here we I even have this uh alien, you know, that apparently Egyptians got the Bitcoin tech from the aliens already 2,000 years ago. You know, I I'm really into this kind of alternative theory. What has happened with the pyramids? Were they a power plant? Do you know that conspiracy? Anyway, I mean, you can go deep into that, but it's a bit it's a bit behind the scenes. Let me know if you love behind the scenes. I mean, I can show you more in future videos. For now, I just want to share with you our our design solution. I mean, it's pretty cool. If if I'm to tell you myself, if I'm to give a nice review, it's amazing. And then we have more there. And then there's another piece behind me. So, yeah, that's that. Uh, let me know if you want more behind the scenes. I know people also want to see Rolex review, what happens, why I got it, how I got it. We're going to get that also. Listen, in bare market uh we can discuss many different things, many different things because we need to wait for the bulls to return. While we wait for the bulls to return, we take a bit of uh espresso. Very nice. And we see you guys very very soon. See you guys this camera. See you guys next video. Smash up the like and goodbye. Goodbye. Goodbye. Goodbye. And I have to Oh, by the way, so when I'm done, I need to click right here."
    }
]