[
    {
        "video_id": "BTBZYmyQP2c",
        "title": "Michael Saylor: The CEO Who Bet It All on Bitcoin",
        "published_at": "2025-12-08T10:43:36.000Z",
        "sort_date": "2025-12-08",
        "url": "https://www.youtube.com/watch?v=BTBZYmyQP2c",
        "views": 12222,
        "duration": "00:04:31",
        "transcript": "Love him or hate him, Michael Sailor is one of the most recognizable figures in crypto. He's the man who bet billions on Bitcoin, turning his company, formerly known as Micro Strategy, into the biggest corporate Bitcoin whale in the world. Born in 1965, Michael Sailor was raised in a military family and lived in various US Air Force bases around the world during his childhood. But after studying for a dual degree in aerospace engineering and technology at MIT, Michael became obsessed with the idea of using computers for business strategy. During the height of the computer boom in 1989, he co-founded Micro Strategy, a business intelligence software firm. And by 1998, Micro Strategy had gone public and Sailor became a paper billionaire almost overnight. At the peak of the dot boom in 2000, Sailor was briefly worth over $13 billion. But fortunes built in the dot era rarely lasted. In 2000, the bubble burst. On top of that, the SEC charged Sailor and two executives with accounting fraud, and he paid over $8 million in penalties. His paper fortune evaporated, and Micro Strategy barely survived. Still, Sailor hung on. For 20 years, Micro Strategy drifted along as a respectable but unremarkable software business. He remained wealthy, but was no longer the star he once was. In 2013, he even tweeted that Bitcoin's days were numbered, which has aged as well as milk in the sun. Then came 2020, and the pandemic shook the world. Governments printed trillions and inflation fears grew. Micro Strategy was sitting on half a billion dollars in cash and Sailor realized something. Cash wasn't safe. It was melting like an ice cube, as he said, [music] and he didn't want to watch it drip away. After months of research, he flipped from skeptic to believer. Bitcoin wasn't a fad anymore. To him, it [music] was digital property and the most reliable way to preserve wealth in a world where inflation seemed relentless. And so on August 11th, 2020, Micro Strategy adopted Bitcoin as its primary Treasury Reserve asset and bought 21,454 BTC for $250 million. It was a corporate first. For most CEOs, that might have been enough. For Sailor, it was just the beginning. Over the next few years, Sailor doubled down again and again. In late 2020, he raised hundreds of millions through debt just to buy more Bitcoin and kept repeating the playbook with every new opportunity. Even in 2022 and [music] 23 when Terra, Celsius, and FTX collapsed and crypto sentiment was at an all-time low, he didn't stop. Fast forward to mid 2025 and Micro Strategies holdings have grown past 600,000 Bitcoin. At some point, the company no longer looked like a software firm dabbling in digital assets. To many, it acted more like a leverage Bitcoin ETF with a [music] side business in analytics. So, no one was surprised when Micro was dropped from its name in February 2025. Because really, at that point, the strategy was obvious. Supporters hailed him as a visionary who gave corporations a blueprint, one that companies like Tesla and Block later followed. Critics, on the other hand, saw recklessness, comparing it to a Ponzi scheme [music] as debt is raised to keep buying BTC. But Sailor leaned into it. Bitcoin is hope, as he so often says. As a bachelor with no children, he suggested that when he's gone, his Bitcoin would disappear with him, effectively reducing supply and in his view, leaving the remaining holders better off. So, from billionaire to bust, from skeptic to believer, Michael Sailor's story is perhaps one of the boldest pivots in corporate history. And whether he's a visionary or a gambler, well, that depends entirely on how Bitcoin's story ends. Now, if cash really does melt away, could Bitcoin truly take its place? Let's explore that next."
    }
]