[
    {
        "video_id": "6YGID6omRw0",
        "title": "Why You Shouldn&#39;t Be Super Bearish on BTC Now #shorts",
        "published_at": "2026-02-07T17:03:34Z",
        "sort_date": "2026-02-07",
        "url": "https://www.youtube.com/watch?v=6YGID6omRw0",
        "transcript": "This is basically summarizing all of the reasons why people are bearish now. But guys, this is not the time to be uh super bearish. I mean, it's time to be a bit cautious. Like we said, can still go down, can still chop for six months, but now is not the time to super be focused on this. The the time to to be super focused on this stuff was in October, okay? It will likely have a have a overhang over crypto over the coming months. That's again, we're not calling for Valhalla. We're not calling for fast pump. We're not calling for anything like that, but we are saying listen likely likely within the coming months tides are going to",
        "summary_hu": "A jelenlegi piaci hangulat alapján sokan bearish állásponton vannak a Bitcoin (BTC) kapcsán, de a videó hangsúlyozza, hogy ez nem a megfelelő idő a túlzott pessimista hozzáállásra. Bár a BTC ára még csökkenhet vagy stagnálhat a következő hónapokban, a fókuszálás helyett a körültekintő megközelítés javasolt. A múlt hónapok piaci aktivitása és a jövőbeni események befolyásolhatják a kriptopiacot. A videó nem vár hirtelen árnövekedést vagy drámai változásokat, de egy óvatosan optimista álláspontot javasol a közeljövő eseményeivel kapcsolatban.",
        "summary_en": "The current market sentiment indicates that many are bearish on Bitcoin (BTC), but the video emphasizes that this is not the right time for an overly pessimistic view. While the BTC price may still decline or show stagnation in the coming months, a cautious approach is suggested instead of intense focus. Past market activities and forthcoming events might influence the crypto space. The video does not anticipate sudden price spikes or dramatic changes but proposes a cautiously optimistic stance regarding upcoming developments.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 55,
        "key_points_hu": [
            "A BTC-vel kapcsolatos bearish álláspont nem indokolt.",
            "Fókuszáljunk a körültekintő megközelítésre, nem a pánikra.",
            "Nem várunk drámai árváltozásokat a következő hónapokban."
        ],
        "key_points_en": [
            "The bearish stance on BTC is unwarranted.",
            "Focus on a cautious approach, not panic.",
            "No dramatic price changes are anticipated in the coming months."
        ],
        "main_topics": [
            "Market Sentiment",
            "Bitcoin Price Trends"
        ]
    },
    {
        "video_id": "-w8gKF7P_eY",
        "title": "Bull vs Bear: Crypto Market Reality #shorts",
        "published_at": "2026-02-07T20:34:21Z",
        "sort_date": "2026-02-07",
        "url": "https://www.youtube.com/watch?v=-w8gKF7P_eY",
        "transcript": "In the bull trend, our incentives will align with these guys. So, we're going to be cheering them on, cheering them on in the bull trend. Like, in the bare trend, we got to we got to be honest. They're very bad for their shareholders. They're very bad for anyone listening to them and then adjusting their crypto portfolio to whatever these guys are saying that you you've been cooked alive. And the funny thing is many people who have been cooked alive, it's kind of now that they're becoming a bit bearish. But, you know, now it's kind of time to be a bit bullish because we are at 200 week moving average for Bitcoin. And yes, we may still go lower. 30% lower can happen. Can be six months chop. We expect that. We expect chop. We expect it to be. That's why we we don't buy a lot now. We just nibble nibble. But I would say we are yeah we're coming close to the to the time it's uh it's basically close to bottom.",
        "summary_hu": "A bull trendben a befektetők ösztönei az emelkedő árfolyamokkal összhangban működnek, és támogatják az új befektetési lehetőségeket. Ezzel szemben a bear trendben a részvényesek érdekei sérülnek, és a befektetők sok esetben rossz döntéseket hoznak a piaci tanácsadók javaslatai alapján. Jelenleg a Bitcoin 200 heti mozgóátlagának közelében mozog, ami jelezheti a közelgő fordulópontot. A piaci szakértők azonban figyelmeztetnek arra, hogy további 30%-os csökkenés is lehetséges. Ezért most a vásárlás helyett inkább apró lépésekkel történő befektetés ajánlott. Lényeges, hogy sok befektető már bearish érzelmeket mutat, de a közelgő trendek alapján érdemes lehet életjelet adni a bullish pozícióknak is.",
        "summary_en": "During a bull trend, investors' incentives align with rising prices, leading them to support new investment opportunities. Conversely, in a bear trend, shareholder interests are often compromised, resulting in poor decisions by investors influenced by market advisors. Currently, Bitcoin is near the 200-week moving average, which may indicate an impending turning point. However, market experts caution that a further 30% decline is possible. Hence, instead of large purchases, it is advisable to invest cautiously in small amounts. It is significant that many investors are now showing bearish sentiments, but based on upcoming trends, it may be worth signaling bullish positions.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 50,
        "key_points_hu": [
            "A bull trendben a befektetők támogatják az emelkedő árfolyamokat.",
            "A bear trendben a tanácsok követése rossz döntésekhez vezethet.",
            "A Bitcoin közel lehet a mélyponthoz, de további csökkenések is várhatóak."
        ],
        "key_points_en": [
            "In a bull trend, investors support rising prices.",
            "In a bear trend, following advice can lead to poor investment decisions.",
            "Bitcoin may be near a bottom, but further declines are expected."
        ],
        "main_topics": [
            "Bull Market Dynamics",
            "Bear Market Risks"
        ]
    },
    {
        "video_id": "YESO-NXWH2Q",
        "title": "BITCOIN AND ETH: THIS BOUNCE IS SUPER DANGEROUS!!!! (EMERGENCY NOW!!!)",
        "published_at": "2026-02-07T18:45:50Z",
        "sort_date": "2026-02-07",
        "url": "https://www.youtube.com/watch?v=YESO-NXWH2Q",
        "transcript": "Um, oh yes, oh yes, oh yes, oh yes. Guys, welcome to another episode. And as you can see right now, Bitcoin is having quite a bounce. If you look at all coins, you look at XRP, you look at ETH, you look at Sana, all of the different cryptocurrencies have a nice bounce. Basically, Bitcoin bottomed out here a few days ago at 60. Now it's back to 69. And of course, this brings a bit of positivity, a bit of euphoria to the crypto space. However, I have to warn you guys that many people are going to get so wrecked because of this bounce. You see, when you have a big crash, it's very normal to have a big bounce. However, if you look at the candle, it's still freaking red. I mean, the week started at 76 and went all the way to 60. Yes, now we're at 69, but you have to be still super conservative here. Next week will tell us exactly how this will unfold. For now, it is just standard standard behavior. Next week is going to be quite critical because if we see next week a big green candle, let's say we see next week a green candle that erases all of the losses from this week, then we can speak about some kind of V-shaped recovery. If we see next week and next week is not erasing the losses from this week and we don't go, let's say, to 80. Instead, we kind of derp around here. Maybe it's a bit sideways, maybe it's a bit down. Um, it doesn't have to go all the way down to 60, but if it's not a forceful and powerful pump to the upside, you can forget all the Vshape. You can forget all the Vshape. You can forget all of the fast recovery because it's not happening. In fact, it's more likely as we continue down here, maybe we derp around at 60. Maybe we go below 200E moving average. And listen, I'm telling you that as someone who actually started to buy, you know, we bought a bit, a tiny bit at 60. I'm actually becoming more and more bullish overall. I did this post um uh when was it? It was yesterday. And I said, \"Listen, uh I'm a slow buyer here. I'm a slow buyer. We've been riskoff since October 8th, but now actually I'm starting to become a buyer of the in the zone.\" But I also said, \"Please read the whole tweet because I expect there to be months of chop, months and months of chop and likely even a drop below 200 week moving average. That's why I'm only deploying 25% of my capital at these levels. And very slowly, very slowly, I have split them up in 10 different branches. I just deployed one of them. So basically 2.5%. And so very very slowly, we're going to be buying around here at 60 200 week moving average. And then the rest and then the rest 75% we're only going to deploy once we enter bull trend. And bull trend currently will happen if we go above 100. But this this bull trend flip collapses very fast. So within the coming weeks, it's going to be somewhere here at 60. Okay, very very important to understand. So be super super careful, guys. It's we're not we're not out of the wood. Out of the wood, I say out of the wood. Out of the weed. We we're in the weed. Okay, we're we're inside the weed. Now guys, the most funny thing is that now people are analyzing what happened on the 5th of February. You know people have been complaining oh 10th of October it was manipulation manipulation everything dumb because Binance or whatever. Now most plebers have another such date to cry about and it is of course the 5th of February because they complain you know so something happened this and that. I mean you can read a very long poll. I don't read it. I I mean actually I don't care what will happen because we had a bare trend. We also had a range that clearly broke down here. Okay, clearly broke down. We've been expecting all of it. I mean all of it, 100% of it and you have the proof also from our community because the profits I saw during 5th of February have been crazy. I mean we never had so much profit during 5th of February and I shared this with you on the 6th of February but all of these gains in our community were made during the 5th of February in Bullmania. Okay, very important. So yeah, find I just find it so funny guys. Now what happened on the 5th of February? We deserve answers. We deserve put option leverage hedge fund. I mean people over the pleb overanalyzes so much what happened with the oh Ivan what do you think about call option expiry remember in December people said the call options whatever like bitcoin options they will expire in December and WE'RE GOING TO PUMP IVAN THAT'S WHY YOU'RE WRONG THAT'S WHY YOU'RE WRONG IT'S THE plebe mindset it's crazy but I that's why you see I'm so passionate I want to exterminate the plebe from your brain the plebbea mindset sits so deep it's so deeply rooted in each crypto trader and crypto investor it's crazy man it's crazy so Just like everyone is have been complaining about October 10th. Now man, people are complaining about the 2nd of February. February sec sorry 5th of February. February 5th hedge funds evil hedge fund put option something happened. Jeff Park from Bitwise writes A BIG FAT RAPACALIA BS STYLE. I DON'T KNOW WHAT it is. I don't even want to read it. When you just had a break of range. You had a break of range. When a range breaks it, it dumps like hell. It d it nor it's normal. It's normal. There is nothing unusual. There is nothing unusual about it. You don't have to over analyze. You really don't have to overanalyze. Especially when if you compare to uh previous to previous uh midterm years, which we do here like every stream. I mean, it's exact. It's exact. Don't have to. Oh, don't over analyze, man. You're going to get so lost in this over analyzation. Look here. The average midterm year. Let's see. Actually, why doesn't work? Anyway, you see the green one here is the is where we are now in the 2026 midterm year and the other midterm years are basic. I mean, we're exactly where all of them are. Okay, we're exactly where all of them are. We're exact exact exact exact where all of them are. So, you have to over analyze. Don't blame the evil hedge fund or what the hell you blame. Don't blame someone that you know, manipulation, manipulation. There is nothing strange here. I I got the average to work. There's nothing strange with with what has been happening. It's exactly what happens in all midterm years. You see the green uh chart follows the other charts. The white chart is the average is the average of all midterm years. It's exact. It's exact. And also when you look at the chart, it's also been exact because we've been arranging and then we broke down. And the beautiful thing is that you and I really have to uh have to be in pain here. You don't have to be in pain. Just like I share with you the gains from our community every day. Uh I also can share it with you today as well because yesterday when everything started to pump again, a lot of our members started to long. So you don't have to be married to anything. When it dumps on the short uh time frames, shortterm time frames, you you short. When it pumps on short time frames, you long. So big shout out to Kenny with a very very nice long yesterday. He actually reported it today because he closed it today. Then a few more shorters. Uh Kajoro Kajoro had a nice shorting shorting gains. um over shorting um Starknet and what what was it? It was Tao Tao. He said uh now he he closed he closed bounce was was crazy. So we got to adapt short-term trading we got to adapt. So all in all go to boom.com if you want to join us otherwise I mean you see you're missing out most of the stuff now. You don't have to be in pain when things just because things are dumping because when things are dumping it's fantastic. I mean we want things to dump. Why? Because it's volatility. We love volatility. If you look at what flipped bearish in the last one week, you have all of these different crypto assets, they're down basically 40%, 30%. This is just a week ago, guys. This just a week ago. So, all of this big fat short makes perfect sense. But you don't know how to short. You don't know. You don't know how to short. You have no clue how to short. Why? Because you don't have the mechanical rules. You have no idea how it works. So, that's why I'm telling you, go to bullmeion.com. Now if we look at the uh the next week uh we have to really understand that we are in very very unique times. I I want to put the bearishness aside for a second because we we are actually in very unique times and soon Bitcoin is going to really play a huge role in financial markets. Now everyone is focused on gold on stocks like no one cares about Bitcoin. You look at the mainstream media, you look at the average plebe, no one cares about media, about Bitcoin because of what's happening in the media. No, it's all about, you know, traditional assets. Instead, people only care about whatever pumps. Bitcoin will come back big time, big time, big time, big time. And we have to be prepared. That's why I'm I'm want to your brain to be warmed up for bullishness because if you're not warmed up for bullishness, you're going to be shocked when we see more and more confirmation of the bull. Still, we don't have too much confirmation outside of us just going to the 200 week and u and bouncing a bit. But I'm I'm telling you, it's not even a good bullish sign that that we b. I mean, yes, we bounce, but uh it's still red as hell. So, next week is going to tell us, but within the with the coming months, March, April, if we start bottoming out, if this flip level comes down, you have to be fast in flipping to bull mode. You have to be fast. People are too slow, man. Their brain is too slow. It took them months and months and months to flip bear. I mean, I see now many people flipping bare now. Like, you know, we've been bare since October. And I only now see many influencers saying, you know, I'm selling. I'm selling. You know, they're too slow, man. I mean, you probably can think about a few you follow that have been mega bull all the time now and now they're bare. It's always like that. So, while we don't know where the bottom is, the fact that we are at 200E moving average tells us that we are a significant long-term fair price. 200 B moving average is significant long-term fair price can still take us a year to bottom and the year the year the bottom year is from the previous top so basically until October we now have how many months like 10 months left there uh the previous stop was as you know in October so it can still take all of that time but all in all we're we're now around the fair value price especially yeah when we're here at 60 59 now we're above fair value again because we're at 70 approximately but here 60 we're at fair value okay here would be fair value So start warming your brain up for bullishness. Open up bullishness in your brain. Uh so when we see more and more confirmation, you are more and more bullish. And guys, by the way, here's another important thing. You know that many people have been saying just DCA, DCA, DCA. I listen DCA can be good, but it can also be very bad. Look here. The guy has been DCAing $30 a day for seven years and uh he spent 86K and now it's worth 68. like he lost like 20%. How can you lose 20%. Well, DCA can be good, but you can also be unlucky. And here he he wasted seven years just dcaing into Bitcoin for what? I mean, for nothing. He actually lost even more if you compare to treasuries which yield 3 4%. And if he would just put it in treasury, he would have 3 4% per year and seven years 3 4% per year. How how much is it all of you math genius? What is it? 20 30% I mean per year. 3 4% per year for seven years. uh he would have a profit now he has a loss so the difference between where he's now where he could have been what is it 50% you guys calculate in the in the cost but you understand so hodddle is not the best strategy now that bitcoin is so massive it's it really is not the best strategy it maybe it was in the early days when it went from like a cent to to to a dollar maybe it makes sense then now uh even seven years ago the guy started it's not good so what is good the good is that you have the trend you need to follow the trend I mean it is what it is. The same asset is great if you can buy it in a new bull trend and the same asset is horrible if you have if you're very unlucky and you start buying let's say at a peak and you DCA DCA DCA DCA and then we come back like to where you started and yeah and then like it doesn't m it doesn't matter now okay it okay we actually went below it also yeah so that's very important guys DCA in this kind of environment is not the the same thing as it was in the past okay now Ben Cowan is saying good to finally see uh some relief in the cryptoverse. Usually, Bitcoin finds strength shortly after 50% draw down. So, that's where we are right now. The strength usually lasts anywhere from a few days to a few weeks. Historically, many counter trend rallies by Bitcoin during midterm years have topped during early March. So, let's see if Bitcoin can put a nice big fat counter trend rally. That would be very good. Actually, I don't know if it would be good for anyone. It's not good for the bulls because the bulls I mean believe it or not the the best thing for the bulls would be us dumping like below 200 week finding a bottom capitulation get all of the weak hands out and then we pump. That's the best thing for the bulls. For the bears obviously also we wanted to dump. So it's it's as big short as possible. So, it's not good for anyone. Even listen, if we pump, it's actually a bit better for the bears because if it gets rejected, it just means that the bull market is that the bare market is a bit longer. Just like in a bull market when you have a bunch of pullbacks, it prolongs the bull market because coins change hands. Those that are in profit, they sell to those that are new to the market. And it kind of resets the overall gain that everyone is sitting on, which means that people will not dump very quickly because they don't have a lot of gain. So the same thing is on the way down. When you have a bit of pump back, it kind of rotates. It rotates the holders. It rotates the the shorters, which means that man, they can keep shorting even longer. Okay, they can keep shorting even instead you have like a f flash crash super super everyone just exits and then strong hands come in. That's different. That's different. So actually the best thing for both bulls and bears would be further continuation here below 200 week and then find a bottom and yeah and then go up something like that during the summer. That would be the best. Obviously we don't know what's going to happen. We don't know what's going to happen. We just have to follow along in the journey. We are mainly risk off although very very slowly. We're adding here at around uh 200 moving average and we will be doing that even if we go below. That's important. And the big big big 75% of dry powder uh that allocation will be deployed when we are in bull trend. Currently it's at 100k but again this thing goes down like this. So very soon it's going to be at like 60 60k also. Guys that's it. Let's let's go through a few more news and then we'll go to Q&A. Cardano Cardano goes below 2023 lows. Let me actually see did it go below or it just hit it. Big shout out to all of the Cardano fans. Uh your portfolio is not doing too well but that's life sometimes. That's Yeah. Basically, yeah, it went to it it it it actually went exact to the lows. Isn't it crazy? Cardano already went to the lows of the last bare market. Isn't that crazy, guys? All of you Cardano holders, how would you describe your feeling? Like, I'm really curious. For real, I'm curious. How would you describe your feeling? If you followed me rules, if you were in Bulmania, you got a signal here to get out. But yeah, I I know many people they they missed it. Explain to us how it's how you feel. You are back to the bare market low of last bare market and you didn't even get an alltime high. This is the problem. Okay. A big big problem that this is the problem with marrying an alcoin. Okay. And if you break this guys, you have a nice fall of how much? Another 35% until the next support. So guys, be prepared. This is what's uh in front of us. If Bitcoin keeps falling, you gonna go to that next support, it is 37% down. And the next support after that, let's see. Uh well, I mean, it is 35% down from the from the support. Now, we pumped a bit from here. It's like down. Oh my god, it's like down 45%. Okay. And if we break that, the next one is going to be minus like 65. So, all in all, everything is still in the in play for Cardano. Just because it's down 80% doesn't mean it cannot go down another 80%. I mean, I'm telling you the the the harsh truth, guys, here. I'm telling you the harsh truth. Let's see how much is down. Yeah, it's down 80%. Okay, but it still has like a lot of support here. So, it can go down like another 92%, another 92%. If it goes all the way to like this support from from 2020. Okay. Uh why am I showing you this? Why am I brutally maybe taking a bit of salt and rubbing you in your in your wound? It's not because I'm evil in some capacity, guys. I'm actually very very friendly and very good and uh very humanitarian, so to speak. I'm doing it exactly because of the human humanitarian mission we're on. I see many people saying that many old coins are a great discount. They say, \"Oh, it's such a great discount. So cheap. So cheap. So cheap.\" And while there's always a chance of a pump, something that's down 80% can still go down another 90%. That's the thing. Something is down. It doesn't mean that it's cheap. It doesn't mean that it's cheap. It go down another 90%. Easily. It happens all the time. Solana did this in the last bare market. Just look at Solana. It went down 80% and went down another 90%. Okay? So, don't really bet uh too much on like you know trying to buy cheap this and that. Instead uh look at what's in front of you and only trust bull trend. That's the only thing you can trust. Don't trust anything else. Don't trust you know whatever your uh pounder is saying. And founder actually came out here. He said that he has lost three billion. Okay. I mean if that makes you feel better. Okay. But um I mean yeah I think he said it just to make everyone feel a bit better that he's also down. But listen he's down. He has I mean he's the founder of the project. It's like Elon when Tesla dumps a bit. Elon is also down a lot but Elon recovers it. So um yeah I mean as founder as a project you always have the most stake. So you have the most part of your market cap normally. So yeah uh all projects all big companies when they go down the founder loses the most. There's nothing like special about that and many founders have their net worth tied to their company or project and so on paper you go down three billion but it's on paper anyways like paper paper games anyway. So I I know he he's doing that to feel to make everyone feel better. I don't think you should feel better. You should really learn instead. Learn for real what happened. Why you held down? Why why why go instead to boom.com and enroll and so you can actually learn for real. I mean that that's my message. That's my message. Uh because he he tries to to make you feel good. And while I appreciate the gesture like it won't help you long-term it won't help you. And if you are trading, if you're going long, going short, go to bullming.com/partners. In the description below, it says exchanges I use. Let's see. This is by the way for bullming.com. But exchanges I use is this one. Exchanges I use bull.com/partners. And there you can sign up for by bit, pion, all of these different exchanges. If you want to trade, whether it's short or long, leverage, without leverage, stocks, gold, you can do it on BB for example. All of it. You can do stocks, gold. Oh, by the way, soon BBIT is going to be like a bank also. If you use the link below, you get a big fat signup bonus. BBE just announced they're going to do a bank account. So, you can create a bank account so that you don't have to deal with your boomer bank and explain yourself each time you try to buy crypto. Instead, you can deposit your salary there. You can like use it as a bank. They just announced it during this weekend. So, if you have not, definitely go to BBIT in the in this uh page. Uh just click exchanges I use. You're going to come to this page in the description and sign up for Bit Fat signup bonus. uh weeks the same all of the different assets all of the gold and crypto and everything big big signup bonus and between as well and the other ones as well. So, uh, what else should we check? The crypto.com pivots toai. All of the CRO holders. Let me know what you feel about that. But the founder of Cryp.com bought AI uh.com for like 70 million. Okay. 70 million since the bare trend. Holy macaroni is down a lot. Yeah, it's actually kind of breaking down from this low last year. Still, let's see. It can still go. Yeah, it can still go like another 50% to go to the lows from last bare market. So, not as bad as ADA. Not as bad as ADA, but uh yeah, still not too great. So, yeah, keep an eye here. That's the next big support, guys, for for all of the CRO holders. It is 40% down. Can easily go there. Uh and now the founder bought AI.com. He's going to do AI now. What's going to do? 70 million acquisition of AI.com. Um, I guess he's still going to run cryp.com. I mean, I guess he's going to do both. In April, he purchased a.com. Since that time, we created a team. He's been steadily building. Wait, wait. So, he's he's not he's only on this a.com. I see. Whenever you have a CEO, he he's he needs to be focused on one thing. The only person in the world can that can focus on two things is Elon Musk, and no one else can do it because he has a special brain. Everyone else, I become a bit concerned when they do two different things. But anyway, let's see what's going to happen. Uh, but he bought air.com for like 70 million. Okay, 70 million. Uh, Justin Bieber got wrecked. Why? Because he bought board a pep board ape not pep board ape NFT worth 1.3 million. Well, he paid 1.3. Now it is worth 12k. So yeah, if you want to feel good, you can think Justin Bieber is down 1.3 million almost. So yeah, you can if you want to play that game that the Cardano guy is telling, you know, I lost so you lost. Justin Bieber lost. Everyone has lost. Um, that's it guys. Let's go to Q&A. Questions, answers, debates, discussions. Let me know what you think about this very fast emergency uh Saturday stream. Not even planned. Not even planned. But listen, uh, many people have a bit of confusion about this this bounce. We need to go live. We need to go live. We have to explain. We have to set the record straight. And that's why we're here. And uh, let's check up on on the Sana thing. Sana holding support for his dear life right here. You know, if it loses it, it's the flash button. Is the flash button right here. And again, will it go to 30? It's going to be very nice if it does. We don't know if it's going to go to 30. But can you short it once it starts breaking down? Absolutely. With tight stop- loss, you can short the crap out of it. In fact, last week, many many many many of our members already did and uh they're out. Like now they're out as the bounce happened. Uh it's fantastic. It's fantastic. When you have the mechanical rules, you can short them. I'm trying to find here. Here this guy, he shorted just from 97 to 78, then he's out. That's it. That's it. Perfect. Let's see if we have more Sana shorters here. Here's another one shorted from uh 78 to 7. So as long as you have mechanical rules, you're actually able to to short in a confident way because you know what the hell you're doing. So, uh, looking at Saul, if it goes to 30, guys, big fat buying right here. This is a perfect buy zone. It's amazing buy zone. Uh, and if it starts breaking down, it's a interesting short play you can do here. Uh, so yeah, let's see what's going to happen. But what you don't want to be the the worst position to be in is to be some kind of holder who just prays that please don't go down. Please don't. Like that's the worst. You have no control. Like you're at the mercy of the market. like he you you're you're like a chicken waiting to get grilled. You're not in control of your destiny. Okay? You you you are praying. You're in pray mode. So, as long as you're not that, you have two options. Either to buy somewhere here or short. Uh and the third option, I guess, is if you really find it's like a nice asset, you can buy it even a bit before. But I I wouldn't do that. I I wouldn't buy before too much before uh Thursday. Instead, I would be buying when we bullish again. And this bull level, it drops a lot now. So soon is going to be like 50 40 as well. So that's the that's the plan guys. And now let's go to Q&A. I haven't is SU going to be a good thing for I I don't know guys. Um I don't see too much on Suy to be fair. I don't like I don't use it too much. So will it be good? I I don't know guys. I don't think it's kind of in the same league as Sana. It could have been. Um yeah. Um I will not be like front running it or something. If it turns bull, okay, if it uh doesn't turn bull, I'm not I'm not touching it. But yeah, the next support is here. It is minus 40%. For SU um I mean I don't the thing is I don't use SU. So it's a bit hard. There are only two things that I'm front running the bull trend on. It's Bitcoin which we are already now we're nibbling. We're nibbling at around the the 200 week moving average. We're nibbling a bit and it is sold because I use sold every day. So if it goes to 30, I will be front running it. At least if it doesn't go to 30, we just scoop it up on the on the way up into a new bullsh. Simple. Simple. We don't predict. As always, we don't predict. Like at the end of the day, we don't run the market. We don't know what's going to happen. But that's the best. Like if you know the mechanical rules, you don't have to predict. Like it removes, it removes so much mental load from you like trying to analyze, trying to predict. Like imagine trying to actually like predict like understand like trying to understand all the variables. It's impossible. Like it's litally and you have variables that speak against each other like imagine you're a pleba trying to learn. So what happened on the 5th of uh uh February and you go here like you know you okay how how we going to trade with this and also it's it's post the fact it's after the fact. Okay now you have all of this data what the hell it means. Okay good luck. I mean this is a time waster. It's a time waster. So we don't know what's going to happen. We know the chart though and if the chart is bullish, we know how to trade. If the chart is bearish, we know how to trade. And when we trade, it's not that we're 100% sure, but the cards are stacked in our favor. And if it goes to poo poo against us, we have a stop-loss, we're out. So the losses are always small. That's the best thing with the mechanical rules with Bulmania. The losses are tiny, tiny. They're like this. They can they can always happen because again it's all probabilities but because of stop-loss discipline execution position sizing they're always tiny. Okay. And we're never this grilled chicken like waiting to get grilled. The chicken waiting to get grilled. Please please Sana don't break down. Don't break down. Please don't break. I I know many people are like that. And I've been there myself guys. I've been there so many times myself. I speak from experience. Like there are many people now praying please don't break down. Please don't break down. Please Solana, don't break down. That's the worst position you want to be in. You're like bended too much in in the bad d direction by the market. Do you want to be that? You don't want to be that. Okay. So that's that. Uh so that's so guys sui just wait for the bull flip. I I wouldn't call it you know that it must be some kind of major asset next bull run. Probably it will be. I mean I don't see anything else that has been created. So maybe just the same assets in the next bull run also. But it's not because I don't use it. I cannot tell you like, you know, too much about uh how great the tech or something. I don't know too many people that use it either. I know R Paul is shilling at still like he's going to come back or what did he say guys? You you guys who listen to R Paul, you're probably not in too great position, but he's still bullish on what's happening. I mean, in the long term, do you think crypto has uh become too US-centric under Trump? Uh Democrats and their bureaucrat minions will do immense damage. I I think that's a Yeah, that's a fair that's a fair um like warning to us. If Trump loses power is going to be man they're going to come after they're going to come after a lot in crypto. Will it matter on the big macro scale? I don't think so because crypto is crypto like it at the end it's not political. So okay you go after Trump maybe for a year we have a bit of uh uh struggle and that's it. But on a big macro scale, it obviously doesn't matter. On a big macro scale, will we see some kind of, you know, new SEC that is even harsher if they don't get the correct laws in place that protects us against that? It's I I think it's almost a certainty, but I'm actually interested how Trump will play it because I think he has so much to lose if he loses presidency. So, yeah. Uh, I mean, with everything, with all of the crypto stuff, with all of the Yeah. Uh, so let me know. Yes, it's a bit of a conspiracy, but he has just so much to lose. I mean, they're going to come after him big time. I mean, bigly. Bigly. They're going to come after him. So, yeah, let's see. Let's see what's going to happen there. But, uh, crypto is going to be in the how you say in the crosshairs. You say in the cross hairs. Is that how you say it? Like the hair on your head. But it's crosshair. It's We're going to be in the hairs, guys. In the crosshairs. Uh, let me see here. There is one thing and that's that Trump may bail out his [ __ ] son. And then there's this picture on of Eric Trump. Hey friends, Eric Trump. Welcome to American Bitcoin. It's a little sneak peek of our facility. Buying Bitcoin on the Trump may need to bail out his morum, son. Exactly. Let's see what's going to happen. So we still have we we still have this bullishness as long as Trump is in power. Someone asked about ICP. Thanks for donation. Let's check ICP. H why you ask me? I mean why why do you ask me? I mean why do you ask me? Because I feel bad like rubbing the salt in your wound. Why? Why do you ask me? I can please check ICP. Yeah. I mean I think you know yourself to be fair. I think you know yourself. There's I cannot see guys a single thing that's good about this chart. It's below all the moving averages. Like literally all of them below the 100, 200, 50. It's in a fat bar trend. It just did an alltime low this week. It also did new price discovery to like super alltime low. So yeah, I mean if you Okay. Okay. Okay, guys. If you want a bit of hope, maybe it's double bottom. But man, this is like so bad. It's so bad. Hopium. I wouldn't even trust myself. It's It's too bad. Hopium. It's so bad. Hopium. Don't Don't trust this opium. This thing cannot go anywhere on its own if Bitcoin goes down. Maybe it can master a pump back to moving averages like this. Okay. Maybe that's what's going to So, all in all, uh yeah, yeah. Yeah. Yeah. I I don't know what what you wanted me to say. Did Did you want me to see the double bottom or what was the why you asked you? Because you know yourself. You know, you and again I feel bad rubbing the the wound in your in your Yeah. rubbing the salt in your wound. So, let me know. Yo, Guzman, we need a new Hopium setting to inject straight into Yeah. ICP Hopim I cannot give you. There's no there there's nothing I can tell you. Uh check if volume okay indicator volume I have to go to hourly in guys I don't look at hourly I look mainly on what you want to find on hourly okay let's go to hour I I don't go to hourly what happened nothing happened you had Big you mean this? What happened? This I I I don't know what kind of tea leaves you're you're reading here. This is tea leaf. The from a big picture perspective, all of this is tea leaf also. Which which exchange, man? Which exchange? It's it's Tiff, man. It's CIF. All this is Tiff. I mean all this hourly is is you can only use it if you are trading short time frame like you're putting in longs and shorts based on the bull trends flipping back and forth and uh other than that if you for for a big picture where like ETH is coming going in the coming days and weeks like it's too much tiff man say you know t if reading you see something I I don't go down to daily guys because I don't trade the shorter time frame my main my main trading is on the weekly So yeah, Ivan only rub salt in Pelion. Exactly. Because those guys are the most like confident and uh I I rub where where I know they can take it. Yeah, that's the only one I don't feel bad about like discussing because you know they're so confident. It's crazy. They're so confident. I don't know if it's a mask, you know, this confident mask and they're crying below like this. Yeah, you see on Twitter sometimes. I don't know if that's probably is that, but yeah. Yearly is the best. No, I don't like yearly chart either. I don't like yearly chart. Uh why I don't like yearly chart because the the signal is too late. It's uh the weekly guys. I mean the weekly for for crypto the weekly is the best. You don't have to over complicate the weekly is the best. That's where you you get fast signal on the trend change and the signals are good. They are reliable. Um yearly is just too it takes too long. Like what are you going to see on yearly? You can you can only maybe you have another tea leaf with this three green one red maybe but it's not really working. It didn't work now. Why? Because on the weekly you have actual actually very clear you know how many weeks it is between top and bottom. But because it's not a full year it just gets pushed like it's a it just get translated. So some sometimes like the years change like what is green what is red it changes. But if you look on weekly it's always been exact. There's a I did a video like a yearly close. Go on my channel. Go on videos video tab. There's a yearly close like something crazy yearly close or something. I I shared it the other day. I Where is my Lambo? Where is my Lambo? Please I beg will play get rich. If you stay another cycle, I think you will, but you have to like do it properly. Apply the mechanical rules and so on forth. If you just u gamble away the opportunities, it's not going to like you're just going to waste another like 5 years. I Ivan Ivanzo Monad Mina Mega ETH are they still relevant in your opinion? I I have a hard time saying anything. Why? Because I'm not really in also I have like no clue. Let's see. Monad, man. Monad. Well, monad monad monad. It's I mean this new coin like ETH scale scaling. It's it's too new to have a trend really. But yeah, it's still bullish. I mean this one guys maybe it is slightly more interesting if but Bitcoin needs to go up. If Bitcoin doesn't go up, this thing is going to is going to go down also. But in general like the first thing of recovery is just a long fat sideways. Okay. So that's like the first thing. But then you also need to get above let's get above the 50 moving average and so on. But because Bitcoin is still in the bare trend guys, I would be super careful. If you ask me about tech whether this matters or not like all of the different uh other chains like fast ETH, Mega ETH, Monad, I don't know if you ask about the price or price-wise. I I still think it's like it's good when it's sideways like this. In general guys, when you have a a chart like that is silos like this, it's just a bit more chance that it has bottomed out. No, never a certainty, but yeah, I would rather see this than just bleed and bleed and bleed and bleed. But I I'm still not touching it because Bitcoin is Brendan and I'm not in all. And then in terms of tech, yeah, it's a hard one because Vitalik said that they're going to scale L1. So if they scale L1, yeah, it's going to be tougher tougher uh argument to make for all of the this fast ETH that are L1's. Uh let's see if ETH can really scale L1 or not. But Vitalik said that he doesn't like L2s anymore. He wants to scale L1. So from that perspective there's less market share for an for a fast ETH copy with like you know better parameter and the better model is actually not even a like it's it's really re-engineered from scratch. It's ETH re-engineered from scr from from scratch. So it's they've done fantastic work but what is their place in the market now that ETH is focusing on L1? I don't know. And actually guys, I don't really care either because we just follow the damn trend. When Bitcoin is is coming back, we're gonna see. Maybe if it pumps a lot, we're going to obviously participate. But this, you know, trying to predict will they win, will they not win? It's very hard because it all depends on people and I don't control them. I don't even know them. I don't know how good the execution is of those guys. Are they really hungry or are have they raised enough money like have taken out money somehow from the project that they don't really care like all of these question marks before like what what would I do before when I was uh you know a noob a noob wrecked noob losing money I would study I would go to code I would like try to understand and then the guy just doesn't work hard enough I don't know h when he wakes up I don't know how he how much he pushes Is he a slacker? Is he a [ __ ] Like I just don't know. And it's not like it's not any particular project. I just mean in general. In general, it takes a lot of effort to make something great. A lot of effort, a lot of focus. So most people cannot do it. Now most people can raise money if they if you just uh become good at it's a skill that can be learned. It's a skill that can be learned. I'm telling that I mean we raised 50 million as well for for Morales like that that's that's something that you it's it's learned like it's learned uh then to really make something great with clients with clients love it users love it it's another level man it's another level and also it is easy like you know nothing is easy but easier when something is new so Vitalik for example he was like 15 or something when he did ETH or 17 or how old he was or 20 something like that there was no ETH. So just having the first mover advantage uh is uh can make a lot of this difference. So as long as you're like early that can give you a lot for free. You don't have to like work as hard and so on forth but also you have to be super smart to even be in the first place. I'm not saying that you know Vitalik did I mean Vitalik did fantastic he did what he did is is great. He's great but just you want to compete with Vitalik now it's not it's not as easy man. It's not as easy. It's now it's crowded. When it's not crowded it's easier. Okay. So, um yeah, that's that the conclusion, guys. Conclusion, follow the price trend. Don't worry about much else. That's it. That's it, guys. That's it. And you know, I love it when the the average Joe who has like full-time job, who has wife, kids, maybe three kids, that he then decides that he's going to do like true due diligence. He's going to follow the true fundamentals. He's like he he takes on the the task the great task to really understand a project for real. Okay. He obviously has no time for it. He has like 10 minutes per day to maybe check the chart. So what happens then? He starts like listening to podcasts and other stuff getting fed a position as with a lot of assumptions that he uses to build his trade and his conviction. Okay. He that obviously has no no research himself because there's just just no time. I mean most people even I I'm full-time like there's no time for me to go and like check the team how much they work measure like their output per day is it effective team is it for guys team like there's no way man but I love sometimes people like no Ivan you're wrong you need to look at fund listen guys I am Mr. fundamentals. I entered this space as a developer. I'm a computer scientist. I entered this as a fundamentalist. Let's look at the code. And then I GOT MEGA WRECKED IN THE PAST. So if anyone I am the person to do all of the freaking fundamentals. There are very few people better than than me doing fundamentals. And I love it especially when like the average Joe has zero technical understanding. Maybe has like a roofing company or something. He's like, \"No, Evan, you're wrong. You're wrong. You should check. I I will check GitHub. I will I will get out of here. I love it. I love it. I love it. I love it.\" Okay, guys. Final question and then we're out. Actually, we're at a good length now. We're We're good. We're at good length now. Yes. And relax. Exactly. Yes. I need to relax, man. It's getting late. I need to relax. I need to relax. But that's why we have the Q&A because your questions trigger me. I don't even know how we got into this, but that that's that's the fun thing of Q&A. I mean, there's no way I can prepare so much content that the Q&A gives me. You you guys give me gold content to comment on. That's perfect. That's perfect. The spring is upon us. Yeah. I mean, actually, I I would say we now see the first like, you know, the some kind of, you know, green leaf from the snow. Now, we're at 200 week moving average. Still can guys, Bitcoin can still go down a lot, but just normally from a long-term perspective, 200 week is good is good. So, I'm I'm a bit I'm a bit a bit a bit nibbling. Nibble, nibble, nibble. Um, yo GD, I would give my left arm to watch you and and the piano Matty B. Piano Matty do a stream together and talk about Bitcoin fundamentals because his technical analysis is the only person uh Matty B. I haven't heard him. No idea who it is. Let us see some N. I don't even I doesn't want to say the word. Can we close the stream with pumpamental song? Actually, let's do it, guys. Let's do it. Let's do it. Let's do it, guys. Uh, let's see where it is. Actually, let's do it. Pumpamental. Thanks for the suggestion, Guzman. So, as you know, you got a 50% fundamentals, but you know, since this song, I mean, even since this song, which was four years ago, I would even redo it now. I would say, you know, maybe 90% pumpamentals and 10% fundamentals. But this is a historic this is a historic piece here a historic you know piece of crypto culture. So at that point I felt it was 50% fundamentals 50% pumpamentals. Now I would say 1090. Oh G XG you joined Bulmania. That's awesome man. That's awesome man. Okay guys I'm playing it and then we're out. Let's do some nice dance moves and we're out. Fundamentals. Fundamentals. Pumpamentals. fundamentals. But pump but fundamentals will always ensure that you at least pump initially pump initially. Pump initially pump initially. Pump initially pump initially pump initially. Famentals fundamentals fundamentals fundamentals fundamentals. Fundamentals funamental and fundamentals fundamentals fundamentals. Fundamentals fundamentals fundamentals fundamentals fundamentals. The best thing. Nice. 50% fundamentals. 50% fundamentals. Perfect. 50% fundamentals. But fundamentals are always decades behind the fundamentals. Fundamentals. Fundamentals. Fundamentals. It's all fundamentals. It's only funamentals. It's all funamentals. But fundamentally, it does make sense. Fundamentals. Fundamentals. Fundamentals. Fundamentals. Fundamentals. Fundamentals. Funamental. And fundamentals. Funamentals. Fundamentals, funamentals, fundamentals, funamentals, fundamentals, funamental and fundamentals. What is the pumpamental? Pimeamentals. What is the pumpamental in this? What is the pump? Pimeamentals. What is the pumpal in this? What is the pump? Pimeamentals. What is the pumpal in this? What is the pump? Fundamentals. What is the pumpal in this? Because guys, what is the pump? What is the pumpal in this? What is the funamental? Fundamentals. What is the funamental in this guys? Bump bumper man under the man. Bump bump bump under man. That's why I found when you assured that the fundamentals are good, you can move on to fundamentals. Fundamentals, fundamentals, fundamentals, fundamentals, fundamentals, fundamentals, fundamental and fundamentals, fundamentals, fundamentals, fundamentals, fundamentals, fundamentals, fundamentals, fundamental and fundamental together.",
        "summary_hu": "A Bitcoin jelentős visszapattanást mutatott, elérve a 69 dolláros szintet, miután pár napja 60 dollárnál mélyponton volt. Ez a visszapattanás eufóriát generál a kriptovaluták piacon, de a narrátor figyelmeztet, hogy ez veszélyes lehet, mivel a gyertyák továbbra is pirosak. A következő héten fontos lesz figyelni, hogy a következő gyertya záródása milyen irányt mutat. Ha nem látunk erőteljes emelkedést, a tőzsdei helyzet nem javul. Rámutat, hogy sok befektető nem ismeri a shortolás technikáit, ami megnöveli a kockázatokat. Az október óta eltelt időszakban sokan úgy tűnik, hogy lassan és késlekedve reagálnak a piaci változásokra. Az elkövetkező hónapokban a Bitcoin komoly szerepet játszhat a pénzügyi piacon, de egyelőre konzervatívan kell eljárni.",
        "summary_en": "Bitcoin has shown a significant bounce, reaching a price level of $69 after hitting a low of $60 a few days ago. This bounce creates a sense of euphoria in the cryptocurrency market, but the narrator cautions that it could be dangerous since the candles remain red. The coming week will be crucial in determining the market's direction; if we do not see a strong upward movement, the situation may not improve. The current market sentiment indicates that many investors are unaware of shorting techniques, increasing risks. Since October, it appears that many are slow to react to market changes. In the coming months, Bitcoin could play a crucial role in the financial markets, but a conservative approach is advisable for now.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 50,
        "key_points_hu": [
            "A Bitcoin árfolyama a közelmúltban emelkedett, de a piros gyertyák figyelmeztető jelként szolgálnak.",
            "A következő hét fontos lesz: ha nem látunk erős emelkedést, a helyzet nem javul.",
            "A legtöbb befektető nem ismeri a shortolás lehetőségeit, ami kockázatot jelent."
        ],
        "key_points_en": [
            "Bitcoin's price has recently risen, but the red candles serve as a warning signal.",
            "The coming week is crucial: if we do not see strong upward movement, the situation may not improve.",
            "Most investors are unaware of shorting opportunities, which poses a risk."
        ],
        "main_topics": [
            "Bitcoin Price Analysis",
            "Shorting Strategies",
            "Market Sentiment"
        ]
    }
]