[
    {
        "video_id": "Zpzv9dhn7xQ",
        "title": "Coinbase's Base: Where Retail Will Flock To??",
        "published_at": "2025-12-22T10:43:02.000Z",
        "sort_date": "2025-12-22",
        "url": "https://www.youtube.com/watch?v=Zpzv9dhn7xQ",
        "views": 3419,
        "duration": "00:07:16",
        "transcript": "Let's talk about BAS, the layer 2 built by Coinbase on Ethereum. It's recently been turning into one of the most active ecosystems in crypto where people swap, mint, and experiment all inside a familiar Coinbase ecosystem. So, what's driving this sudden momentum? Well, in this video, we're going to unpack the growth, the key projects shaping the ecosystem, and whether Bass could become the retail hub this cycle. Coinbase has been building its own vision right on top of base. Earlier this year, they outlined three pillars for the network's future. Base app, base build, and base chain. So, the base app launching publicly later this year is set to replace the Coinbase wallet. But it's not just a rebrand. It's shifting toward a more social creator focused experience. [music] Inside the app, users will be able to mint, trade, and even monetize content [music] directly on chain. There's also growing buzz around a possible base token. The team has confirmed that a launch is being explored. >> Going to be exploring a network token for Bass. [cheering] >> And let's be real, the idea of an airdrop always brings the crowds. [music] But the attention isn't just about Bass's own plans. But it's also about what's happening inside the ecosystem itself. Take Farcaster for example. It's a decentralized social protocol where users actually own their posts, profiles, and followers. Farcaster is integrated into the upcoming base app, which means you'll be able to post, mint, and interact with content all from one place. Its standout feature frames turns social posts into [music] interactive apps where users can mint NFTs, vote or trade without ever leaving the feed. And then there is Zora. Originally known for NFT minting, Zora evolved into a creator economy platform where anyone can mint content as tokens, earn revenue, and trade on secondary markets. During Q3, Zora's activity surged, averaging 30.8,000 8,000 token launches and representing roughly 96% of the daily tokens launched on base. It's even outpaced Solana's pump fund in the number of tokens launched. Zora has also been integrated with the base app and it is possible that we'll see another big wave of creatorled minting take off once the app goes public. Aer Drrome plays a different role. It acts as BAS's central liquidity hub. Forked from VO drrome on optimism, it has grown to almost 520 million in total value locked and now anchors much of the network's trading [music] activity. Then there is the prediction market limitless exchange where people can bet on realworld events from crypto prices to sports outcomes. [music] It's still small, but the app feels tailorade for retail engagement. And then of course there's the AI [music] wave. Projects like Clanker and Banker are redefining how users interact with crypto. Clanker lets anyone create a token through a simple social command and it claims to have already seen over 4 billion in volume. Then Banker lets users manage assets through chat with an [music] AI assistant. By the project's own figures, it's passed 220,000 [music] active wallets. Now, these projects show how BAS's low fees and possible integrations make it a home for social and AIdriven apps. Okay, now let's talk [music] numbers. As of midocctober, Bass is hovering around 5 billion in total value locked. At its peak in September, Bass processed more than 13 million transactions in a day, [music] and that's now somewhere around 11 million a day in October. So, zoom out to the broader EVM ecosystem and you'll see that Bass is actually just behind BSC's lead in transaction count for the third quarter. Back in June, Bass saw a peak of 3.6 million daily active users, but it's now settled closer to just 900,000 [music] as of mid October. And there's still a lot of building going on. In October, Bass surpassed 650 live dabs, which is more than double its count at the end of 2024. So, what's pulling everyone to Bass? Well, a big part of it comes down to trust and accessibility. Being built by Coinbase, one of the bigger brands in crypto, gives Bass a credibility few other layer 2 can match. Since the base app connects directly to Coinbase fiat rails, users have the option to fund their wallets and trade onchain without [music] ever leaving the app. DeFi, swaps, and NFTts are all accessible through a familiar interface that can be taken on the go. And then, of course, there's the social and creator angle. Integrations with Zora and Farcaster hint at a model where creators earn more directly and users get to engage beyond just trading tokens. And of course, there's speculation. The idea of a potential base token airdrop has already fueled a wave of activity with users testing dabs, farming points, and exploring new projects. [music] Add to that bases grants, liquidity rewards, and developer programs, and you potentially get a self- sustaining ecosystem that's attracting both builders and retail. Still, Bass, of course, isn't without its risks. Coinbase's involvement gives it credibility, but it could also mean limitations. While BAS is meant to be an open and permissionless layer, too, there's always the possibility that regulation laws imposed on Coinbase could indirectly affect BAS's full capabilities. And on top of that, many projects on base are new and highly speculative. If rewards slow or hype fades, liquidity could dry up fast, something that we've seen happen before on other chains. Bas's rise could draw comparisons to the Binance Smart Chain boom in 2021, a moment when retail users flooded into a lowcost, high-speed network. But while the surface looks similar, the underlying drivers feel a little bit different. Back then, the excitement around BSC [music] was fueled mostly by yield farming opportunities and interest in Gamefy. With Bass, the momentum seems to come from accessibility and the network's close [music] link to Coinbase's existing user base. Now, whether that shift leads to a more sustainable wave of retail adoption is still an open [music] question, but it's what makes Bass an interesting case to watch this cycle. So, are you a fan of Bass? Let us [music] know in the comments which project in the ecosystem has caught your eye. And of course, if you enjoyed [music] this breakdown, don't forget to like this video and subscribe to stay updated on all things crypto. Bye. [music]"
    }
]