[
    {
        "video_id": "GjKIx1XTG3Y",
        "title": "Palantir Stock Jumps Overnight as Wall Street Turns Green!",
        "published_at": "2025-12-22T03:50:35.000Z",
        "sort_date": "2025-12-22",
        "url": "https://www.youtube.com/watch?v=GjKIx1XTG3Y",
        "views": 5087,
        "duration": "00:10:57",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope everybody had a wonderful weekend. Had some time to mentally relax and take a break. I mean, from the markets at least, but now we have the holiday week that is coming up here. Uh we'll be talking about that with some macroeconomic data that'll be coming out. Not a ton of data, but still some uh from the delayed government shutdown. And we'll be talking about futures right now, how the overnight session is looking um and kind of gearing up for 2026. We do see some buying pressure and the futures are looking green right now with some momentum. uh how is that going to tide with a shortened holiday week. We'll be talking about that when the markets will be closed and kind of the interesting things that are occurring right now overnight as we speak. Uh it's been a crazy year. So, as always, if you're a new or returning viewer, hit that like button, subscribe for daily videos. Let's try to hit 30,000 subscribers. Pop it up at the screen here. Let's talk about Palanteer first cuz it's it's been doing incredibly well. Remember all the bears out there that have been calling for this huge pullback in Palunteer? Well, we're seeing the bulls that are starting to take control and the bears right now have kind of lost I think their position as we see Palanteer, especially in the overnight hours right here that is currently at 195. Now, Palanteer came up about 4% on Friday's session is now up about another 1.5% and currently is breaking out of this consolidation zone. This is really bullish for Palanteer, especially after kind of retesting and kind of just hanging out in this accumulation uh zone here between the 170 and the one kind of mid- 180s. You see, Palanteer was able to break through that resistance of the 190 right here, currently at 195 as we speak. And I think if this bullishness kind of continues through this holiday week, Palanteer could definitely test the 200s in the short term. Uh, you know, we're probably going to see some psychological resistance there. We've seen some, you know, actual physical resistance there in terms of the chart right here before. Uh, but I think that definitely could be tested here in the short term, uh, before the end of 2025. Uh, in terms of Palunteer, no huge, you know, individual catalysts that have came out over the weekend or anything like that. One chart that I did want to show here is this bar chart that I really liked. Uh, I'll show this with some of the AI data center stocks here in just a few moments, but palenteer, you can see the institutional ownership that is just continuing to accumulate at a very rapid pace. I mean just look at the year between 2023 2025 now uh basically at all-time highs in terms of institutional ownership. So in terms of following the big money um a lot of retail has done that you know and retail was early to the game on Palanteer. So crazy to see here at a $460 billion market cap nearly half a trillion um I think it can get over 200 uh in terms of the bullish perspective in 2026. It'll be interesting to see where this stock goes. Um, talking about before we kind of get into the other individual stocks, let's talk about, you know, what to expect in the markets this week currently in terms of the index and the price action that we saw. The S&P 500 came up basically about a percent on Friday's trading session, which is great that was it was able to break kind of out of this low kind of selling pressure zone. um that when the S&P 500 fell back into the 6,700s here and some people were calling, hey, are we going to get a retesting of that 6,500 level where we have kind of this most recent double bottom. Uh in terms of the index, I like it in the 6,800s. It's currently above its 200 basically kind of hanging out right above its 50. Uh in the terms of the last, you know, month that we've seen, the S&P 500 has done a good job holding support and consolidating above that 6,800 zone. So, I think as long as that holds here, that's going to be bullish uh going into the end of the year. And, you know, with the possibility, of course, is it going to be testing, you know, 6,900s in terms of the all-time high, 7,000. I mean, who knows? Uh, but I do like it here currently where it sits. The SPY right here is up about $2 in the overnight session and the futures right here up about.3%. So, uh, some bullishness across the board. You can see all the stocks that we have currently here on the watch list on just this, uh, legend right here in Robin Hood. a lot of uh gapping up that we're currently seeing. In terms of how that ties into what to expect in the markets, uh we're going to be getting, of course, the shortened uh holiday trading session, the GDP right here, consumer confidence, and jobless claims. Now, why are we getting a little bit more than usual is because we have some reports that are delayed by the government shutdown that's going to be released this week led by an initial report on third quarter GDP that was initially scheduled to come out on October 30th. Uh so in terms of the uh analysis that we're going to be getting, they're going only going to be putting putting out two GDP reports for the third quarter uh and two estimates and a final report. So just looking here, Monday, no huge things. Tuesday's when we're going to get that actual uh GDP report for the initial estimate of Q3. Uh and of course Wednesday, we'll see initial jobless claims. That's where on Christmas Eve here on Wednesday, you're going to see stock markets are going to close at 100 p.m. Eastern right here. bond markets at 2 pm Eastern. Thursday, of course, Christmas, we're not going to see anything. Uh Friday, an open uh trading schedule and market. However, nothing is going to be scheduled. Uh personally, you know, kind of what I'm seeing, what some other people have been talking about, uh we're probably going to obviously see in terms of the market short, you know, lower trading volumes. But I think generally what we could see in terms of the bull, you know, the bearish correction that we just kind of went through, especially with some of the individual names, I think we could just see a general kind of float up in all these names. you know, obviously I could be wrong, but right now I'm leaning more bullish than bearish in terms of the short term. Um, I mean, just look at some of the buying pressure that we're seeing going into the week, which is a positive catalyst. However, we have seen a lot of market and kind of intraday selloff. So, I mean, I guess we'll see what happens, but right now holding more of a bullish perspective. Um, one of the big things that we I want to talk about and what I'm bullish for for 2026 is right now the AI data center trades. I mean, talking about Coreweave, you got Cipher, IN um some of the other big ones, Nebius, of course, uh there's many different other ones out there, some smaller market cap ones, but right now I'm kind of really bullish on Cipher and I personally really like the names. I like the potential behind these. You know, in terms of the whole AI data center trade, they do trade with some similarities. However, you know, there's changes in management and stuff like that. So, of course, just do your own research and due diligence for, you know, which which ones do you like personally? uh because at the end of the day, you're the one that are, you know, you're the deciding to put your money where your mouth is. So, in terms of this recent post that I do like here, uh what I do like looking into 2026, you can see right here is right here, US tech companies are committing to spend a combined 569 billion on data center leases over the next several years. Uh right here, you know, that means lease agreements for multi-year payments for data centers, offices, warehouse without owning them up front. You know, in terms of Oracle, of course, you saw that with Oracle and Broadcom in terms of the capital expenditures and accumulating debt to try to fund this stuff. That's where you have kind of the bearish case that came out. However, what we're seeing in terms of the AI demand, uh, what we've seen recently, um, like Micron's earnings and things like that, what we've seen recently and especially with the inflation print that we got at 2.6 versus 3.1, you know, this is very bullish for some of these smaller uh, smaller market cap companies. And in terms of the data center trade, I like the bottleneck in terms of what is going to be the main issue for demand and compute uh for AI and that's going to be power and AI data centers and the actual amount of compute power that's going to be need. Power is the main bottleneck. Uh so looking at that and also just the actual data centers in terms I think there's going to be a shortage there building those out. What's that build out going to look like? That's what I'm bullish on going into 2026. And that's looking at Cipher, that's looking at Aren, you know, these different companies that are working to promote or to provide the power to these hyperscalers. So that's what I like personally right now. You see Ian right here getting a little bit of a bid uh after we saw kind of this bottom right here at about 33. IN currently at 4164 in the overnight session up about 5%. Looking at Cipher, that's up about 3% in the overnight session right here, sitting right here at 16 uh75. So this stock came down here at 14. you know, recently that's where we saw support for last time that we saw a pullback for Cipher was right here at the 14. So, you can see that was holding strong in terms of IEN here. Uh IN was hoping for more support right here at the 40s, especially with this triple bottom. Uh but we saw a further correction and I mean that's okay. So, I now here above its 50, above its 200. If we have volume that does come into here in terms of the bullish case, you know, I do like that. looking at other stocks. I mean, let's talk about AS right here because the space trade is absolutely insane right now with what we've seen with Rocket Lab and AS uh currently right now gapping up about another 5%. Uh we do have some news from that one of their satellites right here. Bluebird 7 has left the factory and is headed to space. Its next step uh stop is Cave Canaveral. So, identical here to Bluebird 6, it says 7 is going to be the largest commercial satellite launched into low Earth orbit. So, another milestone. If you guys don't know what AS is, they're working to build out the cellular cellular broadband network in space. Great to see there uh to see some of that individual kind of news in terms of catalyst and buying pressure and momentum movers. Let's talk about crypto right here. You see Bitcoin kind of hanging over here at above 88,000 and you know here kind of consolidating over here uh especially over the last week just kind of hanging out. We saw this dip down here to about you know 85 84 area. If this can kind of recapture 90,000, I think that's kind of where we're going to see a reignition, a bullishness into the crypto market. Uh, Ethereum's kind of already done that. It's back above 3,000. It's kind of hanging out right here. Ethereum just has not been loving this 3,000 floor. It's kind of been dipping down is at 27 2,800. So, I want to see what happens in due time. But looking at 30,000 right here, a lot of people in terms of the whole kind of integration of traditional finance, uh, that's really working on tokenization and building on Ethereum, bringing products to Ethereum, uh, I think that buildout is still kind of in its infancy. Uh, because we're just not seeing that represented in the price action right now. So, I think a lot of big money that we're seeing behind the scenes like what we've seen with Tomley, BMR has experienced a ton of cryp, you know, criticism. The stock has been beat down. Uh but bean art back above this 30 support area right now at 3250. Um so in terms of this volatility that's with the stock of course it is insane especially what we've seen over the last month this you know went up to 41 been hanging back here at 30. So I think a lot of these players and big players in the game especially these wall street people are really just accumulating in the background waiting for the next big move. That's what my own personal opinion is and I think it's not more you know it's going to be hard to time this one out. I think with cryptocurrency and especially with Bitcoin and Ethereum however with the administration that's favorable and especially with Wall Street that's especially favorable and with more clarity in terms of regulation that's coming to the forefront um I think is there will be some type of a move here in the next I guess year. I guess we'll see what happens. Peace out. [snorts] Take care. I'll catch you guys later."
    }
]