[
    {
        "video_id": "HpUergHPCSo",
        "title": "ALEX BECKER HAS ALMOST NO ALTCOINS!!! WTF",
        "published_at": "2025-12-22T11:47:37.000Z",
        "sort_date": "2025-12-22",
        "url": "https://www.youtube.com/watch?v=HpUergHPCSo",
        "views": 21531,
        "duration": "00:09:09",
        "transcript": "Holy crap, guys. Turns out that Alex Becker basically has no altcoins. He replied to one of Benjamin Cowan's tweets saying that listen, 90% of my liquid net worth is in stocks and only 3% of my net worth is in all. Holy. Listen, I think most people in this space thought that he's all in all because he's been so bullish. He's been so bullish all along. He's been saying it's going to go 20x right here. 20x. This was back in October. As you know, on October 8th, we did the risk. We told you to sell all coins. He said 20x here. He was going nuts. Heavy heavy 30x is going to do 30x. Holding is hard, but you're going to get a 30x and so on so forth. Listen, I by the way, I love Alex Becker. I think he's a smart guy. He has a great business in uh in sales tracking for ads and so on so forth with his companies. He I mean, he's a great guy. But at the same time, I see so many people getting so wrecked in our community and they say, \"Listen, I listen to this altcoin prediction, that altcoin prediction. They ask me about black hole this and is it going to go up? When is going to go up?\" So the the effect is quite massive on our community. And I just want to set the record straight that sometimes I mean it's more of a character. I love Alex, but he's a character, you know, on Twitter. What you see this is not serious uh old coin allocation or altcoin investing. It's he he's he has a character which is highly engaging and I I love his character. It's very nice. But when people see it for something that it isn't that somehow it's a way to get uh financially successful that's when you get so mega wrecked. It's quite crazy. Now if you listen to Alex for business advice for his business stuff it's was fantastic. Probably one of the best in the world when it comes to all coins. Oh my god. The amount of traders absolutely wrecked, absolutely destroyed, fully fully fully demolished, it's uh uncountable. I cannot count it because just in our community, I see a lot. And then when you look globally, I mean, who the hell knows? Look here, this isn't old season. Old season will be 20x bigger. And listen, maybe one explanation is that, you know, now it is 3%. Maybe it was like 90%. But altcoins, they dump so quickly. You see how fast the altcoins dump nowadays? In 30 days, you can easily lose 50% in altcoins. If you're in the wrong altcoin, minus 50% minus 30. So between 30 and 50% in many alts, you lose uh quite quickly in 30 days and in 60 days is like a guarantee. I mean here you see even these ones that didn't lose in the 30 days, they lost in the 60 days. So guys, listen, make your own conclusion here. Big shout out to Alex. Big shout out to Alex. I don't want it to be like an attack or anything. I mean, big shout out. He's a great guy. But h for what it is, just like with Tom Lee, you know, we did like two videos on Tom Lee also. Tom Lee also has a character. He used to play the Ultra Bull, so he gets the compensation in um in Bitmine. Alex, he has a character for for crypto. And it's not uh to for your benefit. I can tell you I can tell you that. Let's leave it at that. It's definitely not for your benefit. If you want for your benefit, go watch his business training for uh crypto, man. Follow the system. Uh ensure that you know that uh all things can go down very quickly, 90% in a bare market. And if they're down 70%, they can go down another 70%. And this happens, by the way, with the best assets. Look at Sana in the last bare market. It went - 70%, imagine you bought when it was down - 70%, you would lose another 90%. [laughter] Man, this is the problem with buying minus 70%, you can lose another 90% from your entry. And one thing I really want to reiterate is that in a bare trend, when Bitcoin is trending bearish, you should have only Bitcoin. If you want to huddle throughout cycles, you want to build your DCA, build your base portfolio, long-term huddle only, only Bitcoin because look at Solana through cycles, Sana goes to zero versus Bitcoin. The same thing is with ETH. ETH versus BTC, yeah, very similar story. It goes to zero throughout cycles. That's why from a multicycle perspective, the only thing that makes sense is Bitcoin. It's very hard to beat Bitcoin. There are a few examples where it still looks a bit okay. Like for example, BNB. BNB has been stellar. I mean stellar, not the stellar coin, but stellar performance versus BTC. Uh when you look at other coins, it's basically only BNB who still has through cycles a bit of up structure. Although, as you can see, it didn't really do a new high here in 2025. And uh that's why yeah, if it just goes down now, it's not good. And if next cycle it cannot really beat the previous uh peak here then holding it also doesn't make sense for a long term. So all in all in the bare trend in the bare market bitcoin is the only way and as you know since October 8th we de risk. So we have 30% of the portfolio in bitcoin the rest is dry powder waiting to get deployed when the chart tells us that it wants to go up that the trend is bullish. And now some people may be asking but Ivan you were so bullish all coins in the bull market. Why are you now bearish? Why did you flip? Why? Why are you flip-flopping? [laughter] Well, as you know, markets is all about being in the tune with the trend. You don't want to fight the trend. So, when Bitcoin did a fake alltime high, went below the 50w week and went bearish on the money line, we are of course bearish. And when Bitcoin is bearish, all coins get slaughtered. And that's exactly what has happened. I mean, we've been fully fully correct. Look at the last 60 days. All coins have been absolutely absolutely slaughtered here. And these are big names. If you look at like gaming coins and other micro caps, it's even worse. Even worse, these bad numbers, remember they are in coins like Avalanche, Cosmos or like this, you know, top top um ETH Maxi approved coins. E Maxis, they love this stuff. They love all of the L2 coins. If you look at like the gaming and all of the micro caps, it's double if not triple as bad as it is here. So all in all of course as a trader you need to know what trend it is and you need to know where you are in the trend and how your bag will be affected. There will be a time to be bullish altcoins guys. Personally I I love altcoins. I mean as a tech person as you know I am a computer scientist. I'm a developer that that was my profession before I joined crypto. I love the new tech, the new innovation, the new projects. But look at Sena. Like the way to really play the old season is that Sena for example did a massive massive 300 uh 3,000% gain from the lows and obviously outperform Bitcoin a lot. So the opportunity in OS is when a bull market is starting and uh they're very cheap and you can buy them so cheap they're going to outperform Bitcoin on the way up by a lot by a lot by a lot. But that's the opportunity in altcoins. That's the opportunity with quality altcoins that are already established. Okay, that's number one. Number two is that uh you have new coins when new coins launch. Obviously, it's a big opportunity. If you can get in early, if it is uh good terms and so on so forth in the bull market, it is big opportunity. When you have hype, when you have new capital, when you have FOMO, when you have the marginal buyers queuing and running into the industry currently guys, there is no marginal buyer entering, there's no new inflow. Retail, you know where retail is? They are in gold. there are they are in silver because gold and silver is absolutely killing it. In fact, they're going to alltime high. So obviously the marginal buyer is not here. If you look here for example gold, gold is in a massive uptrend. Just did a new alltime high. Congrats to Peter Ship. Then you have silver also just did new alltime high. Congrats to Peter Ship as well and Mike Maloney gold. Silver. So obviously the marginal buyers are there. The bull market now is in these all coins in silver and in gold. You can call them all cocon also. Um, it's not in the gaming, you know, some kind of gaming that's going to it's not it's not happening. It's not happening. I'm not saying it will never happen. In the bull market, I think gaming is going to be insane in the bull market, but holding down minus 99%. I mean, I'm not over exaggerating, guys, because uh a lot of these coins, they will also never come back. The old gaming coins from the last cycle, you think anyone cares about them in the new cycle? There are 500 new coins. I mean, you know, gaming coins, there's going to be so many of them. You think the like some old games from uh listen they're not even games they have no game [laughter] like most it's it's all for guys but you the teams already are out most of them uh they you think they're going to do it again they made enough money in the last uh cycle so the next cycle is going to be new it's going to be new coins that's why most coins by definition they cannot pump in the next cycle that's why if you're holding some kind of gaming thing or something else you think it's going to come back man uh I mean I don't want to disappoint you or or make you sad, but these cars are stacked heavily against you. You you're not even sure if the team is going to be there. And then imagine all of the new teams that will capitalize on the new market is quite insane. But back to minus 99%. I'm not over exaggerating because even a quality project like Sana in the last one went down 96%. So you can imagine what's going to happen to the coins that don't like are not in the same league. Okay. So - 99. It's very very reasonable and very non non-dramatic. Okay, it's non-dramatic. But guys, you I I think you understand. Smash the like, subscribe to the channel, and I'll see you guys in the next"
    }
]