[
    {
        "video_id": "dK-F1lX0quM",
        "title": "The Fed Is ABOUT TO PRINT!! Watch This NOW!!",
        "published_at": "2025-12-11T17:01:16.000Z",
        "sort_date": "2025-12-11",
        "url": "https://www.youtube.com/watch?v=dK-F1lX0quM",
        "views": 49133,
        "duration": "00:11:14",
        "transcript": "My colleagues and I remain squarely focused [music] on achieving our dual mandate goals of maximum employment and stable prices for the benefit of the American people. The Federal Reserve says they're fighting inflation. They say they are committed to a 2% target and that they're well positioned to wait and see. But the charts tell a very different story. While everyone is distracted [music] by the quarter point rate cut and the drama of the dissenting votes, we're staring down the barrel of a massive liquidity injection in 2026 that could send crypto and other assets parabolic. [music] It's a phenomenon that some macro analysts are calling the everything code. And if you understand how it works, you realize that the Fed doesn't actually have a choice. [music] They have to print. So, in this video, we're going to explain exactly what happened at the FOMC yesterday, the massive wall of debt that is about to hit the US Treasury, and why 2026 could be the year of the liquidity flood. My name is Guy, and you're watching the Coin Bureau. First up though, I must make one thing clear. I am not a financial adviser. I'm just a chap on the internet reading the tea leaves of the financial elite so you don't have to. This is educational content meant to show you why the money printer might be dusting itself off for a comeback tour. If that sounds interesting or indeed terrifying, hit that like button and let's get into it. So, what actually happened at yesterday's FOMC meeting? Well, on the 10th of December, the Federal Reserve cut interest rates by 25 basis points, bringing the Federal Funds rate to a range of 3.5% to 3.75%. Now, on the surface, that sounds like business as usual. It's the third rate cut this year. But if you pull back the curtain a little bit, this meeting was anything but normal. We saw a historic division within the committee as three members voted against the cut. And that's the most dissenting voices we've seen since September 2019. And it wasn't just them. Four [snorts] other non-voting participants registered soft dissents. Basically, [snorts] half the room didn't want to do this. Why? Because inflation is sticky. Core PCE is hovering around 2.8% well above their target. So, Fed Chair Jerome Pal came out and gave what the market is calling a hawkish cut. He warned that future cuts will be tougher to justify and that they are quote well positioned to wait. Now, Powell is talking tough because he wants history to remember him as the guy who beat inflation before his tenure as chair ends next year. But here's the kicker. The market doesn't believe him. Traders are pricing in a 68% chance of two or more cuts next year. Why? Well, because of who is likely coming next. Jerome Pal's term ends in May 2026. And right now, the front runner to replace him is Kevin Hasset. According to Prediction Markets, Hasset has a 72% chance of taking the hot seat, and he's what you might call an inflation dove. He's publicly stated that if he were at the helm, he would be cutting rates aggressively right now. He's even argued for rates well below 3%. Now, this creates a shadow chair scenario. Even if Powell wants to hold the line, the market is looking past him to a successor who seems perfectly willing to turn the liquidity taps back on to please the administration. But >> it's not about politics. >> There's a much bigger, much scarier reason why the Fed might be forced to pivot regardless of who sits in the chair. Yes, we need to talk about the debt refinancing wall. So, the US government has a problem, a $9.2 trillion problem. That's the amount of US Treasury debt maturing in 2025 and is roughly onethird of all outstanding marketable debt. And in 2026, up to another $9 trillion comes due. Here's the maths that keeps Treasury Secretary Scott Bessant awake at night. You see, a lot of this debt was issued years ago when interest rates were near zero. Now, it has to be refinanced and at rates that are double or triple what they were before. And this is already hurting. In 2025, the US spent $970 billion on interest payments alone. For 2026, that's projected to top $1 trillion. To put that into perspective, the US is spending more on servicing the debt than it spends on the entire defense budget. This is the fiscal dominance trap. If rates stay high, the interest payments explode, the deficit widens, and the government has to borrow even more just to pay the interest. It's a death spiral. And the only way out, lower rates. Whether inflation is beaten or not, the Treasury cannot afford to refinance around $18 trillion of debt at 5%. Something has to break. And this brings us to the everything code. Now, this chart is arguably the most important chart in crypto, and you'll likely have seen enough of it to last you a lifetime by now. It shows the correlation between global M2 money supply, that is the amount of cash sloshing around the world economy, and the price of Bitcoin. Historically, Bitcoin moves with global liquidity. In fact, it has a 0.94 correlation with global liquidity over the long term. It is the most sensitive asset to monetary expansion. When the money supply goes up, Bitcoin goes up. When the money supply contracts, Bitcoin struggles. And right now, the liquidity cycle is turning. China is already aggressively easing. They've injected roughly $1.5 trillion equivalent over the last 6 months to prop up their economy. Global M2 is currently sitting at around $96 trillion. And despite the Fed's tough talk, US M2 is growing at 4.6%. 6% year-over-year. The everything code suggests that we are entering a period of synchronized global easing. Central banks around the world are cutting rates. The US Treasury is quietly injecting liquidity through buybacks. And Bitcoin, Bitcoin is just waiting for the flood. Now, before we get into the terrifying prospect of yield curve control and what this means for your portfolio, I want to share something that could help you maximize your returns when this liquidity finally hits. If you're looking to position yourself for this potential liquidity cycle, you're going to need a reliable exchange, and you might as well get some bonuses while you're at it. This is where the Coin Bureau deals page comes in because this is where you'll find signup bonuses of up to $100,000, trading fee discounts of up to 50% and deposit cash backs of up to 75% on the best crypto exchanges in the industry. To get these offers, all you need to do is hit the link in the description or scan this QR code. Once you get on the deals page, find a deal that suits you and click one of the sign up now buttons. These deals won't be around forever though, so take advantage of them while you can using the link in the description below or the QR code on your screen. Okay, now back to the nightmare scenario for the dollar. We talked about the debt wall, but what happens if the market refuses to buy US debt at lower rates? What if bond vigilantes demand higher yields because they see the inflation risk? Well, enter yield curve control or YCC. This is the nuclear option. This is where the Fed effectively says, \"We will buy unlimited amounts of government debt to keep interest rates low.\" We saw this in Japan. They pegged their 10-year yield near zero for years. It kept borrowing costs low, but it absolutely crushed the yen. And historically, the US has done this, too. back in the 1940s to fund World War II. If the Fed is forced to cap yields to prevent the US government from defaulting on its interest payments, that is effectively restarting quantitative easing or QE. That is money printing on steroids. Now, they might not call it QE, they might call it market functioning purchases or balance sheet stabilization, but make no mistake, it is liquidity. And there's one final piece of the puzzle, the electionyear effect. We know that governments love to spend money, but they really love to spend money around elections. Historical data shows that primary deficits rise significantly during election years. We're coming off the back of the great election year of 2024 and heading into the midterms in 2026. The fiscal tap is open. The deficit is running at nearly $2 trillion a year, and that money has to come from somewhere. So, let's put it all together. We have a Federal Reserve that's trying to talk tough, but is internally divided and about to be led by a dove. We have a debt refinancing wall of up to $18 trillion hitting in the next 24 months. We have global M2 money supply already expanding, led by China. and we have a fiscal situation that effectively demands lower interest rates to avoid a sovereign debt crisis. So, what's the verdict? Well, the macro setup for 2026 is looking like a perfect storm for liquidity assets. The Fed says they're fighting inflation, but the everything code, the reality of the debt and the money supply, suggests that they will be forced to print. Remember though, there is a lag. Bitcoin typically reacts to liquidity changes with a delay of about two to three months. With global liquidity picking up now and the debt wall looming in 2026, we could be staring at the start of a massive run. But here's the reality check. This doesn't mean number go up in a straight line. If inflation spikes again because of this liquidity, we could see volatility like never before. The Fed might try to slam on the brakes one last time before the dam breaks. However, if you believe that the government will choose inflation over default, and history suggests they always do, then the long-term trajectory for scarce assets like Bitcoin is pretty clear. The liquidity is coming. You just need to be patient. But what do you think? Is the Fed about to lose control of the bond market, or will Powell somehow manage a soft landing while refinancing $18 trillion in debt? Let me know your thoughts in the comments below. And if you want to understand more about how the global liquidity cycle actually works, then check out the video right over here. That's it for now, though. As always, thank you so much for watching, and I'll see you next time. This is Guy signing off."
    },
    {
        "video_id": "oqiqjwOYvfM",
        "title": "Ben Cowen: 2025 Review & What’s Coming for Crypto in 2026",
        "published_at": "2025-12-11T08:55:36.000Z",
        "sort_date": "2025-12-11",
        "url": "https://www.youtube.com/watch?v=oqiqjwOYvfM",
        "views": 76579,
        "duration": "00:42:11",
        "transcript": "I think it has been a disappointing year for altcoins for sure. You know, to speak bluntly, I mean, I I I think we've kind of lost our way this cycle in a sense. Like I think a lot of people were focused more on meme coins and I and it's not any like one person's fault. It's just like the industry as a whole seem to start rewarding meme coins. I feel like we're going through this like maturing process as an industry where we have to like find what's actually important and reward the people that are actually building something useful and not the people that are, you know, going after the quick cash back. Do you think there's an argument to be made that maybe we should maybe we should be ignoring crypto headlines and focusing more on the data points just not paying all that much attention to cryptospecific headlines even things around supposedly important stuff like regulation you know what the SEC is doing developments with technological developments within the space itself >> I mostly just trade based on if it's not like if it's not broke don't fix it right the fouryear cycle has been a thing forever And at some point I it will break. But the reality is is it's probably not going to be different more often than not. And so you're better off just assuming that it's more or less the same accepting the fact that at some point in the future you will be wrong. It seems like a fool's errand trying to predict exactly when that's going to break. Because in reality, while this cycle feels different, >> we bottomed at the end of the midterm year like we always do. Yeah. And we topped in Q4 of the post having year potentially like we always do. >> As anyone will tell you, history doesn't repeat, but it does rhyme. >> Just literally do exactly what would have worked in the cycle before and you would have been incredibly successful. >> How do you see 2026 as a whole playing out and obviously with all the data that you have at your at your fingertips? >> I think there's going to be a counter trend rally probably in early 2026 is is what I think. I actually do see a scenario in the notsodistant future where altcoins potentially, I know this sounds crazy, they might actually find some lows against Bitcoin. Hello everyone and welcome to a special in-person edition of the Coin Bureau podcast. Now, if you've been in crypto for any length of time, my guest today probably doesn't need any introduction, but he is, of course, the head honcho of Into the Cryptoverse, the master of Bitcoin dominance, uh, YouTuber and crypto analyst extraordinaire, the wonderful Mr. Ben Cowan. Ben, it is lovely to see you. Thanks for dropping by the studio today. >> Thanks for having me. It's a pleasure to be here in Dubai for the first time, meeting you for the first time. I know crazy. Having worked together, having done live streams on NFA and what have you for about three years, we finally met in person in the last few days. >> At some point, maybe you, Rob, and I will all be in the same place together, but >> I just don't know. I don't know if the universe can handle. >> We'll save something for next cycle. >> Exactly. We've got to have something to look forward to. >> Um, so yes, Ben has been in town for Binance Blockchain Week and you're also off to Bitcoin Mina next week, right? Up in up in Abu Dhabi. >> Yep. So I and Ben obviously uh has made some incredible calls uh recently especially around uh Bitcoin and Bitcoin dominance and as such you've you've been in kind of high demand. This is your sort of like ninth or 10th interview I think since you've been here. >> Yep. Something like that. But I mean you know when you fly all the way out to uh Dubai you got to make the most of it. >> Absolutely. >> Definitely the longest some of the longest flights I've been on. But it's worth I mean Dubai is a a really incredible city. I mean I didn't really know what to expect. Yeah. >> You know, but I it's it's it's really incredible and I like it and it's fun now because I get to do a little bit of sightseeing too between the two conferences. >> Yeah. Yeah. No, it is a great place and you know, obviously sort of very open to crypto and you know really kind of forwardlooking as well and there's such a great mix of nationalities here too, right? >> So, it's good to it's good to have you in the mix. You know, maybe we'll maybe we'll be seeing more of you here. Who knows? But I wanted to uh I wanted to talk to you a little bit just about I mean I think as we come towards the end of 2025 a year that has not really been easy for for those of us in crypto. I think it's fair to say um especially those who hold altcoins but you know even Bitcoin holders I think have been have had a a tough year despite an all-time high. So, I wanted to I wanted to get your thoughts on the year that we're leaving behind and also get your thoughts on what might lie ahead for 2026 because obviously we can't see into the future, but we can kind of read the tea leaves uh to an extent. So, yeah, I'm just curious to get your opinion on both of those, but you know, so how would you how would you say what what would be your verdict on 2025? I guess >> what's interesting if you look at at the ROI from of Bitcoin from the low for this entire cycle and you kind of ask someone in 2022 to draw out a potential path you might have just drawn exactly what happened right like diminishing returns >> the cycle length assuming the top is in October was basically within a few days the same length of the cycle the last two cycles they were all about that length as measured from the low. So in a lot of ways we got exactly what happened in prior cycles just with diminishing returns. >> Mhm. >> But in other ways it was like completely different in in in some sense and and a lot of that is again due to the altcoin market hadn't didn't really keep up with Bitcoin. And one of the main thesis for this entire bull market that I had was like okay if we're if we're if we're in a higher for in higher for longer interest rate environment and if we're in quantitative tightening it makes sense to just stick with Bitcoin. until that stuff comes to an end or we go to lower rates. If the Fed funds rate goes below the the neutral rate, which I've sort of approximated as the 2-year Treasury yield, uh when that stuff happens, it makes sense to potentially pivot because that's what happened last cycle. The thing that happened last cycle that was different was that all the all the monetary policy stuff changed in the preh havinging year rather than the end of the posth having year. And that's what's made it so difficult. These market conditions are actually the the exact same market conditions I launched my YouTube channel under >> because I launched my YouTube channel in 2019 >> right before quantitative tightening ended and right around the time that Bitcoin topped out at that sort of intermediate peak in 2019. Back then there was also very little retail interest as we can see now. Like if you look at subscribers to YouTube channels, people following various influencers on on X that talk about crypto, it does not look like anything like 2021 and it doesn't look like 2017 at all. So what's really interesting is that in a lot of ways this cycle is the same in the sense that if the top is in Q4 of the post having year, that's what always happens. Like why should we be surprised that it's just happening again for like the fourth time? But in another sense, it feels very different because we topped not because of euphoria, but because of apathy, which is kind of what happened in 2019. And I think I think I've actually heard you mention this some while we've been here is that like attention is a big thing, right? And there just been a lot there's been a lack of attention to the cryptoverse. And in 2019, it was that lack of attention during QT, during those higher rates that caused Bitcoin to slowly start to come back down because people weren't really selling because it wasn't there wasn't any euphoria, right? And so people were like, well, how do I sell this thing when like it doesn't really feel euphoric, but it then kind of slowly went down. I think that's where we are right now in the cycle. So I think it it has been a disappointing year for altcoins for sure. To be completely honest though, Bitcoin's trading at the same price it was a year ago, >> right? And that was the argument about Bitcoin dominance was that even after the top for Bitcoin is in, it'll still hold up better than altcoins for a while. >> And and last cycle, what happened is that Bitcoin dominance topped about a month after quantitative tightening ended. And it did. So, one of the reasons is the balance sheet of the Federal Reserve didn't even start going up until a few weeks after QT ended because the last batch of treasuries didn't mature until a few weeks later. So, I kind of think we're repeating everything from back then. The main difference is that it's starting to line up unfortunately with the midterm year. >> Yeah. >> Now, in 2019 when QT ended, altcoins bottomed against Bitcoin about a month later. So, I actually do see a scenario in the notsodistant future where altcoins potentially, I know this sounds crazy, they might actually find some lows against Bitcoin that could hold for a while. The problem is that if it plays out like 2019, which is going to be my base case because monetary policy has to sufficiently change for me to change my view. If it plays out like that, you would see Bitcoin dominance fall, but not because of a quote unquote alt season, >> but because altcoins already got annihilated in the bull market, so they don't have as much to drop in the bare market. Yeah. >> Is and the same thing that we've seen the same thing happen in plenty of bull markets in the past where the blue chips of the industry do very very well. The bare market arrives and then the the micro caps outperform the blue chips. But it's because the micro caps just don't do anything. They don't go anywhere. And it's the blue chips that that get a lot back because now they have to have to drop just like the the micro caps did before them. So that's where I I I kind of think we are. I think we just are are in this phase where we're sort of slowly drifting down. I think there's going to be a counter trend rally probably in early 2026 is what I think. >> And the reason I think that is because I think a lot of the people that are selling now are doing so because they're like, \"Well, cycle's over. Let's just get out.\" you know, I could see a counter trend rally. Actually, in 2021, we had three red months, November, December, January, and then we had a two-month counter trend rally in February and March. And if December ends up closing red, which it very well might, that's three months in a row of red. Uh, and so I I could see, and there's also people betting on a super cycle, like there always is. And so usually there's something that happens in the early part of the midterm year that makes the super cycle guys think they're right to kind of, you know, but then it it usually leads to a lower high. So that's where I am. I I think we're going to see um some macro headwinds into about mid 2026. That actually would be it would line up perfectly with a 2019 bare market uh where you had about a 9month bare market or so. So that's kind of what I see happening. >> Yeah. I guess what's been I guess what's been confusing for a lot of people or hard or hard to understand is that against this backdrop that as you point out has so many historical parallels at the same time for the crypto industry we've had you know what objectively really positive news I mean we have a in the US a pro- crypto administration basically for the first time ever and this follows on the heels of a really anti-crypto administration I mean you know it's it's night and day the contrast between the two >> you know, we've got spot ETFs which were which was something that the industry was was kind of lusting after for a decade. I mean, I think it was I think it was 2013 that the Winklvoss twins sort of first proposed the idea of a spot Bitcoin ETF and then finally we got them in in 2024. >> And so, you know, objectively, if you if you kind of if you left price out of it and you just showed someone the headlines, the crypto some a sprinkling of crypto headlines from across the year, they would probably have gone well. If you ask me to guess the price, I would say that Bitcoin is at all-time highs or thereabouts, right? And altcoins are probably ripping hard as well. I mean, do you think that's fair to say or do do you think that's kind of is that just adjusting the is that just taking the news and trying to adjust it to fit the narrative? >> I do think narrative falls price. Absolutely. I also think the market is well ahead of what the new like where the news cycle is. You know, 6 to 12 months ahead in some cases. The market is forward-looking. If you think about it, in 2022, really the end of 2022 when FTX was collapsing and all the FUD there was and all the sort of like crypto was dying and all this stuff. 2023 we had um you know what chokepoint operation what all these all these different operations they had. They were cracking down on exchanges. They were picking different exchanges off one by one going after a lot of different companies. It was crazy, right? But what was also happening during that entire time is we were in a bull market. >> Yeah. you know, and now that you know, we had this proc crypto administration, I think a lot of people thought that it had to mean this like really great thing for the crypto asset class, but markets have a way of pricing things in like way before they happen. So, by the time they happen, you know, the opposite thing starts to happen. So, that's kind of what I think is going on. You know, to speak bluntly, I mean, I I I think we've kind of lost our way this cycle in a sense. Like, I think a lot of people were focused more on on uh meme coins and I and it's not any like one person's fault. It's just like the industry as a whole seemed to start rewarding memecoins and the developers of those. And so I think that kind of led a lot of other developers that may have been building in crypto, they kind of like went over to AI. >> Yeah. >> Where their potential return on their time investment would have been more valuable because a lot of developers like I think they had to struggle with like what's the point of developing if someone can just launch a memecoin and outperform my project, you know, that I've been spending four years working on. Yeah. >> It's got to be kind of demoralizing at some point. And so I feel like we're going through this like maturing process as an industry where we have to like find what's actually important and reward the people that are actually building something useful and not the people that are, you know, going after the quick cash grab, if that makes sense. So I I do think that, you know, going into this year, it it it certainly made sense that we had a sort of a local high around the inauguration day just because of all the hype around it. And and it made sense we had a high in Q4 as well. I mean in a lot of ways like it played out like it normally does just less euphoric >> but that's also an artifact of what we've seen before as well and us diminishing returns right every cycle we have diminishing returns so like it's easy to look back on things and be like well this is the reason why it's because it's because of of monetary policy it's because of of you know whatever happened but in reality we've always had diminishing returns you know and and and maybe this cycle we didn't get this alt season that people are wanting. Perhaps that's because of monetary policy, you know, and >> there's been a lot of uncertainty as well. You know, there's been uncertainty uh with with the labor market and how AI is affecting it. There's been uncertainty with uh things like tariffs, right? Like, you know, like are we going to have tariffs? Are we not? It kind of freezes a lot of entrepreneurs. Like I've spoken with a lot of entre I've spoken with a lot of entrepreneurs and a lot of the the general consensus is like they don't know what to do because they're like well do I do I proceed with expanding my business in this way or do I wait to get more clarity on tariffs and a lot of them want to wait until there's more clarity on tariffs and I think like that's kind of holding things back as well. I I think that ultimately narrative follows price, but it's so easy to like find the narratives. Yeah. To sort of justify like, okay, we're at higher interest rates. And by the way, I don't think we've ever had an alt season when the Fed funds rate >> was sort of like durably above the 2-year yield, right? It's the major all seasons of the past 2017 and then also in 2021, they were at least somewhat equivalent, you know, or below. uh where we were in looser territory. We weren't in restrictive territory. And so that's been something this cycle that >> and it kind of shows you like why Bitcoin dominance matters like why the blue chips matter is because not every cycle like every cycle does not promise that the micro caps will pump as well. And we've seen that with stocks forever, right? There's plenty of times where the the the blue chip stocks like this cycle, the MAG 7, think about how well they've done and then you look at the Russell 2000 and it's it it the Russell 2000 just looks like the altcoin market. Like it's kind of wicked new highs, but that's about it. >> I mean, the Mag 7 is basically propping up the entire stock market, right? >> Right. And just like so, Bitcoin has propped up the entire crypto market. You know, if Bitcoin, think about it like this. If Bitcoin were trading where a majority of the altcoins are trading, it would be trading closer to its 2022 lows. than the, you know, than the 2021 highs. I mean, there's a lot of altcoins that are are really far down. And so, I think the reason why sentiment is is as good as it is, even though it's not great, is because Bitcoin is still at least trading at around 100K. And and so, yeah, like that's kind of where we are. I I think that um we'll have some macro headwinds for a while and and then hopefully things can can pick back up. >> So, before we Well, in order to lead us into the kind of next part that I wanted to ask you about, you know, what you see ahead for 2026. Okay, folks. I'd like to take a moment to thank the sponsors who make this show possible. SVM's ecosystem has been missing a high-speed, low latency chain until now. Fogo delivers 40 millisecond block times, 1.3 second finality, and near zero fees. All backed by high performance validators colllocated near major exchange infrastructure. Made for traders, by traders, zero compromise. It's not theoretical. It's live blazing fast and ready for you to test. So head to fogo.io/start and experience the future of trading. Do you think then that maybe as people who are watching crypto prices and trying to work out where they're going next? Do you think there's an argument to be made that maybe we should maybe we should be ignoring crypto headlines and focusing more on the data points and obviously like you know into the cryptoverse that the platform that you've built is very much a data platform and you you know you are I guess very much a data analyst in that in that regard. You might be talking your own book here, but do you think do you think really we're just better off focusing purely on data points pure and by that I I mean things like the Fed's fund rate as well as you know um previous cycles and what have you and kind of just just not paying all that much attention to cryptospecific headlines even things around you know supposedly important stuff like regulation you know what the SEC is doing developments with technological developments within the space itself you know is there an argument for just focusing fusing on the data. >> I there is an argument for for focusing on the data, but I also I do like to know what's going on in the industry as well. Like I I want to know, you know, what what are the latest trends, but I'm not using the headlines to trade, right? Like I'm not reading a headline and being like, oh, I need to go sell my Bitcoin or I need to go buy Bitcoin because of this headline. I mostly just trade based on if it's not like if it's not broke, don't fix it. Right? The four-year cycle has been a thing forever and at some point I it will break at some point it will and you can actually look towards the stock market for that. The stock market has gone through periods where it operated in four year cycles. There was major low by the stock market I believe in like 58, 1958, 1962,66, 1970, 1974, 1978, 1982. And every four years like clockwork there was a major low in the stock market. And then 1986 rolled around and there wasn't a drop. And then we went up and then the big lows in 1987 and the stock market crashed like 35% essentially like overnight and it wiped a ton of people out. >> But I think like it's one of those things where we can always bet on it being different, but the reality is is it's probably not going to be different more often than not. And so you're better off just assuming that it's more or less the same >> accepting the fact that at some point in the future you will be wrong, right? Like following that strategy, the four-year cycle will eventually break at some point. And when it happens, you'll have to accept that I'm wrong at that point. It seems like a fool's errand trying to predict exactly when that's going to break because in the in reality, while this cycle feels different, >> we bottomed at the end of the midterm year like we always do >> and we topped in Q4 of the post having year potentially >> like we always do. >> Yeah. And so you could argue that if someone ignored the headlines and just bought Bitcoin in Q4 2022 and then sold Bitcoin if they wanted to in Q4 2025, they could have ignored everything that happened in between and they would have made a 7 to 8x on their investment, you know, and they didn't have to worry about ETFs. They didn't have to worry about Operation Chokepoint. They didn't have to worry about the presidential election. You didn't worry about nothing. Just literally do exactly what would have worked in the cycle before and you would have been incredibly successful. So, you could argue that, hey, maybe that's going to work again. >> Maybe the the right move here is into 2026, you know, maybe that's the next next great opportunity to really get in. But, I mean, I I do think the the hard part with this cycle is that while it did top when it normally does, it it wasn't a very euphoric top. And really when you look at like risk metrics uh if you look at at like onchain data uh like things like the terminal price um supply and profit and loss like if you look at a lot of different metrics uh the pi cycle top indicator a lot of those things did not trigger this cycle. Yeah. >> Right. >> And it looks a lot like 2019 when they did not trigger because when you top on apathy the the top signal the top indicators don't don't fire off. You have to top on euphoria. Now, we might get that next cycle. It's not impossible. If it happens next cycle, it might I mean, it might take the look like a a left translated cycle or maybe you get like an earlier peak or something. But yeah, I mean, it's really interesting. I I do think you can be incredibly successful in crypto without following the news, but I also I mean, I like to somewhat loosely know what's going on just so when I'm with people in the industry, I'm not completely There are times >> if they have ETFs. >> Yeah. There are times where you're like, \"What is your opinion on that?\" And I'm like, uh, sorry, someone's calling me. You know, >> what particular project? I've never heard. >> Is that is that an alcoin? >> Yeah, it's um Yeah, I mean, I think as as people who are, you know, in the industry and and comment on it. It is it is and and just genuinely interested in it. It is kind of good to keep up with uh with what is going on and and what people are interested in and talking about. But yeah, I mean what you say about data, I mean it's, you know, as as as anyone will tell you, history doesn't repeat, but it does rhyme. And it's, as you say, it's kind of it kind of feels like it might have rhymed. And we just and and we did, you know, maybe the rhyme was a bit too subtle for us to pick up, but you know, now we're seeing that. You talked earlier about the fact that we might see a bit of a, you know, a bit of a relief bounce in in early 2026. Now, >> I'm not asking you to predict the future here, but how do you see 2026 as a whole playing out? And obviously, you know, with the with all the data that you have at your at your fingertips. >> Yeah. So, in most of the bare markets, there's a rally. Not all of them. I think the one in 2014 didn't reach it, but usually there was a rally back up to the 200 day moving average or the 50we moving average. They tend to kind of correspond to each other when we get the rally back up. Those valuations are still above 100K right now. I don't know where they'll be by the time we rally to them, but they could still be around those levels. It takes a while for like you know the 50we moving average to change because it's based on last 50 weeks >> and those are both above 100K. >> So normally what happens is you get your drop from the peak and then by the third month which is where we're in right now. You're convincing the final people in that early drop that it's the bare market. >> Yeah. >> After 3 months the people that were going to be convinced are already convinced. you run out of sellers and then you get that relief rally as the super cycle guys, you know, kind of like they went out in the short term. >> Yeah. >> So, I think I I think there there will likely be a relief rally uh back up. I don't I mean, obviously, right now, I think Bitcoin is has gone up the last couple of weeks or so, but I'm not sure that we're in the rally just yet. >> In 2021, it took two and a half months for the relief rally to begin. So, if that happens this time, it it might correspond to like late December, >> okay? which could also correspond to when the balance sheet starts to go back up by the Fed. So there could be kind of like that oh liquidity is returning like you know super cycle like that kind of narrative and especially with three months of selling in a row it seems like you could have some type of relief bounce. >> Yeah. >> On that relief bounce I think Bitcoin will likely put in a lower high >> because we haven't had a euphoric top. I am open-minded to a new all-time high and I I think because of that like I no matter what I always hold at least like 20 to 30% of my Bitcoin stack because like I have to accept that no matter how opinionated I am and even if I got this right and that right and doesn't mean I'm always going to be right about everything right. Yeah. >> So I always keep some in case. >> But I think the most likely outcome is you have a rally to a lower high by Bitcoin >> in early 2026. >> You could have some divergent highs on alts. like there could be some new all-time highs on some altcoins just like in 2022. I mean, we saw Luna go to new all-time highs in 2022 and then it collapsed to zero, right? So, you can have that like you can have some new all-time highs in some of the lower market cap stuff. Um, just because they've been beaten down so much for so long, if there's any sense of if there's a sniff of liquidity, you you could have a few. And even recently, we saw Zcash go on a major rally, right? So you can still have a few, but I don't think you're going to have like a marketwide alt season, if that makes sense. And the reason for that is if you if you look at the social interest in in both prior alt seasons in 2017 and 2021, retail interest was trending up the entire year before the alt season happened. But in this cycle, in this year, retail interest has been trending down. And the only way you can really get an all season is if more people are coming into the space. like if you don't >> that the the amount of money going into alts continues to reduce reduce. >> So yeah, I see a relief bounce uh that will probably last a couple of months. >> Okay. >> And then I think there'll be another drop kind of in like the sometime in like the March, April, May time frame going into the summer. And if you think last cycle, what's really interesting is that Micro Strategy basically bottomed in May of 2022. I think a lot of people don't remember that, but it wicked below the May low in December, I believe. But essentially, the bottom was formed in May. So, there's a chance that if it plays out like the 2019 bare market, there's a chance we bottom maybe by mid 2026. >> Okay, >> which is not necessarily my base case. Uh, but if you think about like Ethereum bottomed in summer 2022, >> right? It's not impossible for that to happen, especially if more people get on the Bitcoin bandwagon. Like the Bitcoin dominance is more important than all these altcoin stuff. Like, it's possible. I think you have to be open-minded to a low though that that could be further out as late as like, you know, October 2026 because most bare markets last one year, >> right? But I in general, I see like I I see kind of a slow progression down. But one of the reasons why I think by mid 2026 you could start to see some tailwinds start to develop will be that um they're going to replace Pal more than likely. Yeah. As the chair of the Federal Reserve. I mean he'll still be there, but he won't be the chair. >> Yeah. >> Um and so when that happens, I'm going to guess what's going to happen is the the people that the the guy that goes in is gonna want to lower rates aggressively. >> Yeah. Now, this is what actually unfortunately happened in the late 1990s is they lowered rates and when they lowered rates too aggressively, they reignited the animal spirits in all of us. And there's an animal spirit in all of us that that secretly craves that all season. You know, we all want it to happen, even if we pretend like >> beaten down, but it's still there. >> Yeah, everyone wants it to happen. Um, so there does exist a scenario where they they they rekindle the animal spirits uh 2026, 2027. But of course with the uh with the midterms in November 2026, >> there's possible they try to rekindle that. The issue is that we might learn the same lesson we learned in the late 1990s is that eventually we have to deal with the unfortunate consequence that we can't just print our way out of everything. We can't just lower rates to to solve all our problems. Yeah. >> Um and what happened back then actually was they lowered rates. It reignited the animal spirits and then they had to make the very difficult decision to raise rates again. >> Yeah. And then when they raised rates again after doing that for a few months, it finally killed the the business cycle. And then that's when we went into the sort of the end of the business cycle, we had a big reset and then we started started a fresh. >> Yeah. >> So I think there's a lot of like there's a lot of runway. There's still some tailwinds in the AI sector. I think that can keep things going for a little while. I also think there'll be a correction by by stocks in early 2026 as well. Okay. >> But maybe like 10 to 15%. not like a massive one, but just like a kind of a small correction. So, I kind of see it playing out like that. And then, you know, after they go through the business of lowering rates and then eventually they potentially like raise rates again, eventually it's going to lead we're going to we're going to have to deal with these things. But, um that's kind of how I see things playing out in the short term, right? Like just a slower bleed >> into into the into the midterm year. The reason it's slower if you look at if you look at the ROI from every peak to the low from every bare market the current one is is the best one so far >> right >> in the sense of like the draw down from the top is not as bad as any of the other draw downs and the reason is because it's coming from a non-uporic top. >> Yeah. >> Euphoric tops the draw downs are worse because you have tons of new retail investors that pile in at the top and then they just get completely liquidated. >> All completely irrational, >> right? And it's because of those retail investors that come in at the top. They're the reason you could argue the bare markets last a year is because they the niche capitulate over the next year. Without that, you get more of like a 2019 style bare market where you still go down, but it's more of a slower progression down because people aren't selling in the same way because they're like, >> where was the euphoria? Yeah. You know, if we had gone to 200k or something, everyone would be convinced that it's the top, right? Because it' be like, well, I mean, we went to 200k. it's the Q it's Q4. Like why would that not be the top? Um it's because we haven't had Euphoria that people aren't convinced and because of that it's going to I think it's it's sort of reducing the amount of selling and and if you overlay I actually just created a chart uh that I made a video on early like last night at like 3:00 a.m. because I couldn't sleep cuz I'm jetlagged. Um but we I mean where it actually compares this bare market to the 2019 bare market and it actually is tracking it almost perfectly. Um, so I I'm kind of in that camp and and could see some of those macro headwinds becoming tailwinds by by mid 2026, late 2026 at the latest. >> Yeah. By that analysis, we need to be paying attention sort of early 2026 and then we looking, as you say, to possibly bottom around mid 2026, but with an eye on the on the replacement of Powell at the Fed by someone who's obviously, you know, going to be probably dancing to Trump's tune, right? And of course the November midterms when Trump and the the Trump administration will want markets to be to be flying, >> right? And the other thing too is Bitcoin the bare markets we know are historically have lasted about one year, right? Like in in 2021 we topped in November. The bottom was December or November of the following year. In 2017, we topped in December. The bottom was December of 2018. Right? They've they've been about 12 months. What's interesting is that if we did top in October and it takes 12 months, that's October 2026. October is normally when the stock market bottoms. >> Okay, >> think back to 2022. Stocks bottomed in October, not November. They bottomed in October. And you could argue that Bitcoin is I mean, this year it hasn't been as correlated to the stock market because the stock market's going up and Bitcoin's not. But you could argue that because of the ETFs, there's a little bit more of a correlation there to stock market. And if the stock market were to drop at all in 2026, maybe it would find a low in October like it did in 2022. And that could also correspond to a potential Bitcoin bottom. One more thing, this is kind of a crazy coincidence, but in 2021 when Micro Strategy topped, it took 98 weeks for it to bottom. >> Okay. >> Okay. 98 weeks from the n the from Micro I believe it was 98 from Micro Strategy top to the bottom because Micro Strategy topped earlier than Bitcoin >> in 2021, right? Because it the the November high for Bitcoin, the higher high for Bitcoin in November was a lower high for Micro Strategy. Just like in 2025, the higher high by Bitcoin in October was a lower high for Micro Strategy. 98 weeks after Micro Strategy's top back in late 2024 is October 2026. >> Okay. >> So, I I I think October 2026 for me right now is base case, but I'm open-minded to it a bottom a little bit earlier as well. >> Okay. Before we wrap up, I want to ask you two questions about the things that could possibly um you know, possibly not necessarily invalidate what you're saying, but um you know, could play in a role. First is all the concerns around AI potentially being in a bubble. This has been something that you seems to be weighing on markets a little bit. We talked about the Mag 7 and you know, particularly companies like Nvidia, you know, they are just they're running so hot right now and obviously AI is the is the narrative that's driving all that. Do you you know as someone who we've talked about AI quite a lot in in NFA I mean everyone's kind of talking about it. You've talked about how much you know how how much adoption it's seeing. You use it I use it you know kind of everyone's using it really. Do you worry at all about a potential a potential crash in that the fact that this is a bubble that could burst or is is this kind of is this something that we have to be aware of but we can't really allow for? >> I have mixed feelings about it. There's so many different things you can look at. And the the two things that I would say is if you look at the S&P 500 divided by the money supply >> and you look at what happened from 1996 until the until the bubble topped in March 2000, >> we're tracking it almost perfectly. If you look at the the pattern, >> okay, >> if we continue to track it, we still have potentially until say 2027, 2028 before it all comes crashing down. So, um I think it it very well could come crashing down, but that it it still could be a little ways off. Like you could have a correction in 2026 where people think it's over, but then we just recover yet again because they run it hot by lowering rates. >> Yeah. >> So, I think that there is a reason to be concerned about that, but it's also impossible to know when that's actually going to happen. >> Do I think it's going to happen in the next 3 years? Probably. But when you look at it a different way, when you look at the S&P 500 divided by gold and not divided by the money supply, this does not look like the.com era at all. >> Okay? >> If you look at it like the S&P against gold, it looks a lot more like the 1970s >> where, you know, stocks just kind of stalled out and they dropped, but they, you know, it wasn't as long of a drop as what we had in the dot era or as brutal, right? you you had a drop, but then stocks basically recovered back to all-time highs within a couple years or so. >> So, I think there's probably elements of of there will likely be a drop in the S&P um that's going to exceed, you know, 20 30% within the next few years, but I don't like I'm not necessarily in the camp that it has to be like the dot crash where it has to take three years. Yeah. Uh to play out. I'm not saying it can't, but again, it depends on what you look at it. Do you denominate it by the money supply? Do you denominate it by gold? How do you look at it? And the other thing too with with with AI that I I mean there are there's a lot of similarities in terms of like the technical part, but with AI there there's a lot of profitable companies that are using AI. So it's not like it's not like these companies are not generating any returns, you know, it's not like we're just pretending that we're using this thing that's but I use AI every single day. Yeah, me too. You know, and one of the things I I always do is I buy things that I use myself, right? So, like I have position like I have a position in Apple because I use Apple products, right? Like I have a position in in Google because I use that a lot. I I have a position in uh Coca-Cola because I like drinking that, you know? Like I I I like to to buy things that I enjoy myself because I'm like, well, if I like it, then there's probably some other people that like it, too. >> Yeah. I don't like to buy things that I don't necessarily understand. Um, so with AI, I'm I've been generally bullish on a lot of these things that are are use that like Google like a lot of these different companies that are using it because I use it too and if I can understand like why it's important then other people should as well. So I remain bullish on it. The other the other thing you have to remind you have to we have to remember with with the stock market is that when it does top and this is what makes me concerned about Bitcoin now is what you look for in a top is when like 6 to 12 months go by and you barely are making new all-time highs. >> Mhm. >> So that's normally the sign of exhaustion. >> Yeah. >> And that's what's happening with Bitcoin, right? Like we've gone a year and price is kind of at the same price. And so that's kind of a sign of exhaustion and to me and the sign that we're we likely need to go down a little bit to find some more buyers. >> Yeah. >> And that's kind of what if people who follow me like with I talked a lot about Ethereum going home forever, right? Like Ethereum couldn't break 4K. And I was just like guys just like give up. Let it go home and then it'll break 4K. We just need to go down and find the buyers. So I kind of think that's what Bitcoin's doing right now. It needs to go a little bit lower to find those buyers to then try to try to send it back up. So yeah, I mean like I I think there's elements of a bubble there. Um like it could be, but in order to to be confident about something like that, I think you'd have to you'd have to wait 6 to 12 months and then look back and be like, \"All right, the price is the same that it was a year ago.\" And then you could confidently say it's a bubble or it's we just need a bare market. We need a correction. >> But when when stocks just keep putting in all-time highs every few weeks, you know, just let it do its thing, right? Don't try to be the hero calling the top because so many people do that and fail. >> Yeah. Yeah. And of course AI you know in we we we mentioned attention earlier being such an important you know commodity for crypto and stuff. I mean AI has all the attention doesn't it? It's everyone is talking about it all the time. I mean you open you you go on any news website there will be some story about AI positive or negative it doesn't matter. It has it has >> mind share. >> Exactly. And I mean whether whether it's in a bubble or not like I'm never going to stop using it. like I will continue to use it as much as I can because it's made my life easier. It made me go from seventh grade PowerPoint presentation thumbnails to thumbnails that actually look somewhat okay. Um and I I mean I use I use it I mean like I'll ask it questions. I'll be like, you know, create me a table of showing me like what the stock market the price of the stock market every single time in history, you know, where the Fed cut rates below the neutral rate and like what was the return over the next like >> month or year like it'll and it can generate those tables really fast. >> In 2022, I tried to do the same thing and it was completely wrong. Like it was like all the tables were wrong and it was confidently corre thought it was right. Yeah. >> Now it's actually getting a lot better. Yeah. >> So, and I I think one of the reasons for the continued tailwinds is probably because I think there's still improvements to come in the next year or two with AI. >> I mean, I've just started uh playing around with Gemini 5, the latest one from Google. And it is incredible, right? >> Like the difference between that and chat GPT is for me is really noticeable, >> right? And once we stop noticing those changes, that might be when you have a draw down. But as long as those are keep as long as those keep coming, like it's hard to fade it. >> Yeah. we might all be talking about the in a couple of months time we might be talking about the next model from anthropic or or open AAI or whatever and yeah it might be even better so yeah it doesn't it doesn't seem like it's slowing down >> right so I would say like if if in a year the stock market is still trading at the current prices then maybe we have to be like all right like we got to we got to pay our dues for a little while but if we keep going up like what's the point of of concerning oursel too much with it >> yeah okay Ben final question now this could completely invalidate your thesis because uh as we've mentioned before, one thing that could send the crypto that probably will send the crypto market absolutely stratospheric is your channel into the cryptoverse hitting 1 million subscribers. You are not that far away. >> So, >> I have told people that the reason all season has not happened is because I'm not at a million subscribers yet. So, it's not my fault, you know. It's not my fault. >> That's a data point we need to watch very carefully. >> Right. It is. It is. Um Yeah. Yeah. And and and maybe by the time I get there, the Fed will will lower rates below the Fed funds rate or below the the neutral rate. And then maybe that'll correspond because growth as as as I said earlier, right? I mean, just growth in in YouTube channels in crypto is really slow right now, right? Like it's it's it's so slow. If you look at it compared to 2021, it's nowhere near >> So at this rate, it'll take it'll take, you know, probably four or five months. Yeah. >> For me to get there. Maybe that'll correspond to when the Fed starts to >> That would be nice. That would be nice. Well, Ben, I mean, you know, you've made so many good calls uh well, you know, for a long time, but especially over the last year or so. So, anyone who has been following you has uh has, you know, been very very happy to have been doing so. So, for anyone watching, if you're not following Ben, you should by now you should by now have got the message that you really should be, if only because every new subscriber gets us close to uh that 1 million mark where alt season will begin. Um, but no, seriously, Ben, it's been it's been great having your insights. It's been really great meeting you in person and I appreciate you talking to us, you know, when you've been so busy out here, but um keep doing what you're doing. I'm really looking forward to 2026 and uh yeah, we appreciate all the insights. >> Me, too. And I I I've said before, I might turn my channel into a chess channel once I reach a million subscribers as well. >> Okay, so we get alt season and then we can all get into chess and uh chess stocks will go crazy. It'd be fantastic. >> Yeah, chess and crypto. I mean, what what's a better combination than that? >> That's what we That's what we all want. The pawns are the altcoins. Bitcoin's the king. >> I can't wait. I can't wait. All right. Thank you everyone for watching. Thank you to Ben for being such a great guest. And we'll see you again soon."
    }
]