[
    {
        "video_id": "9BvV1vhTtTo",
        "title": "Palantir CRASHES Overnight After Oracle Earnings MELTDOWN!",
        "published_at": "2025-12-11T03:50:20.000Z",
        "sort_date": "2025-12-11",
        "url": "https://www.youtube.com/watch?v=9BvV1vhTtTo",
        "views": 5145,
        "duration": "00:10:03",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope everybody is having a good day. An interesting thing in terms of price action in the broader market is right now we're seeing futures in a lot of these overnight individual names that are actually dumping literally as we speak. Um we see the SPY that is down overnight about nearly 1%. We'll be talking about possibly why after we had pretty doubbish remarks from the Fed today after the interest rate decision. We'll be breaking that down. What could that mean? you know, going into 2026 now and now that we got us got that past us, you know, how is the broader market, what are the tailwinds and what are the headwinds that are in front of it. On top of that, we'll be talking about Palanteer, where it's sitting at currently. Also, kind of joining in on this dump as we speak, uh what we could be possibly seeing into the weekend. So, if you're a new or returning viewer, hit that like button, subscribe for daily videos. We're trying to hit 30,000 subscribers. Help me hit that goal. Pop it up on the screen here. Let's talk about Palanteer. Now, Palanteer actually did quite well in terms of the intraday trading session. And we see it even pop up here to about 190 and close right here at 187. Uh what we're seeing right now in the overnight session is Palunteer is falling actually quite quickly to about 183 right here. It's currently at 18350 down about $45. That correlates to about 2.5%. Uh you know, Palanteer is trading overnight and there's some interesting price action that's occurring right now. I it's interesting that this is kind of occurring this quickly in the overnight session. We'll be talking about what my possible theory is on why we could be possibly seeing this price action after the actual I thought it was a decent Fed uh speech today. Um Palanteer though in this consolidation phase has a lot of support between the 170s and the higher 180s and the mid80s right here. So I won't be too concerned uh depending on what happens with the price action going on tomorrow. Uh but literally what we did just see recently with Palunteer of course remember was the announcement of that Navy deal that was worth about 448 million working to deploy its foundry software as a ship operating system working to modernizing the supply chains for nuclear submarine production and repairs. So uh these ship creations take a lot of data from the Navy. Uh so Palanteer is going to be leveraging basically its software to help with working on basically making this a quicker process with its AI solution. So uh in terms of Palunteer, it's kind of just following the macroeconomic situation as we speak. And what is that macroeconomic situation? What we're seeing right here, you can see feuds are red uh with the US 500 at 6852. Currently what we saw with the S&P 500 index that actually closed right here at 6886. So, near all-time highs. Alltime highs are like at $69.20, I believe. Um, so where this buy sits right now is down about $5, $6. Currently, if we zoom in on it, you can see some big red candle bars right here. Uh, below the 50 and the 200 moving day right now at $681. So, very interesting to see here. The spy is currently at 681. Um, after we had a decent a decent meeting today, uh, from the Fed, uh, Ahmed had came out. And I saw this as this was coming out in due time cuz this was a big market event and it could be a big market mover. Uh but what they decided here, you know, the Federal Reserve cut its interest rates by 25 basis points and we kind of knew that. What was more important was, you know, what was going to be the outlook in terms of was he going to be doubbish or hawkish and what were going to be uh kind of the guidance going into 2026. So there were nine votes for cutting 25 basis points, two votes against cutting and one vote for 50 basis points. in terms of the outlook uh because the market basically already priced this in. The outlook for the Fed was about 25 basis points, one more cut in 2026 and one more in 2027. Another bullish thing in terms of liquidity, quantitative easing is that the Fed announces that they're going to begin purchasing bonds by December 12th right here, $40 billion of short-term Treasury bills over the next 30 days. I'd agree you're here with Ahmed that quantitive easing is back. Great to see here that quantitative uh tightening is officially over. Uh so and also that inflation is coming in lower saying that tariffs may not be running the economy hot. Uh so very very doubbish remarks and the market actually like this uh in terms of the actual closes that we saw for like palenteer even specifically for Nvidia we saw some decent closes uh above the 180. You can see Nvidia here is below 180 right now as we speak. We saw a lot of liquidity coming into crypto especially with BMR. talking about that. But currently we're seeing a sell-off. One of the big things that we saw that I think earnings on Oracle could be a little bit of an indicator cuz considering here Oracle was at 222 at market close basically right after the earnings they come down about 13% in the after hours in the overnight session. Continuing to see some red candles and some selling pressure currently at 194. Now, Oracle falls after missing their quarter 2 adjusted revenue. Let's kind of break it down here. Just looking at the headline numbers. Adjusted revenue right here is at 16.06 billion versus 16.21 billion. So, slightly miss their revenue. However, beat their earnings per share at 226 versus 164. That's a quite a good earnings beat. And even with Oracle Cloud Infrastructure revenue right here at 4.1 billion versus 4.09 109 billion. One of the big things in terms of I think that's starting to bring some fear. Um you could have this revenue miss right here. Uh so talking about that with this uh long-term future kind of reprisability near-term monetization is lagging. That could be a possibility. Uh but more people are kind of pointing out right here the capital expenditures. Uh the capex hiked here to about 50 billion versus the 35 billion that were guided after quarter 1. So this is a large increase in capital expenditures. Why? What we're seeing here when the uncertainty that's starting to arise is now a lot of these tech companies are borrowing a lot of money and taking on a severe amount of debt to help try to fund the AI infrastructure uh versus earlier funding that coming from internal cash flows. So now they're acquiring a ton of debt and I mean I think we saw this headline actually with Oracle not that long ago in terms of the amount of debt that they're taking on. Maybe it was just actually official in the earnings report here that we're seeing a little bit of sensitivity to the news flow right here. So in terms of sensitivity to that capital expenditures, of course that's an uncertainty, especially for the people that are calling AI a huge bubble or that we're at the top. Uh that could be of course a fear. However, um in terms of these companies, they need a ton of money to build out these actual AI type infrastructure uh plays and projects that they need in order to succeed and to try to be uh I would say a top competitor within the AI race. this is a quick race that everybody wants to get their hands and their feet wet. Um, so in terms of capital expenditures, um, in terms of return on investment, taking on the debt of these big companies, that's where I think possibly if you couple that with the revenue this year, I don't know, despite the AI buzz, that's where I think we're possibly seeing a little bit of selloff. So once this cools off, unless I'm entirely wrong, we could just be a sell-off just because hey, FOMC was quite doubbish and we saw a decent kind of uh liquidity that came in in terms of a lot of the doubbish remarks and now possib you know sometimes the opposite just does happen. We don't know what the market's going to do. So are we seeing a post FOMC dump after we saw a decent amount of buying pressure cut in the intraday? Those are two possibilities. Let me know what you think down in the comments. toggling over here. Crypto basically experiencing the exact same thing. Dude, Bitcoin and Ethereum cannot catch a break here. And that's kind of looking at BMR. Uh but Bitcoin is back under 90,000 after this came up here to about 94,000 that we saw uh on the intraday. Uh 94,000 right here. And even looking at that, Ethereum loses its 3,300 floor. And that kind of really really stinks because Ethereum is trying to work its way back to 3500. You can see it tested 3,400 a few times. Unfortunately, got rejected there at about the 3,400 and now back at this 3,100. How that correlates to BMR. BMR right now is currently at 37.88. So, it is kind of following the same trend. BMR had a nice push into the market close right here to about $42 and then this is where you see a large sell-off profit taking. Um, a lot of profit taking across the board. To me personally, uh this is just kind of volatility that's coming I think with FOMC and then of course with Oracle earnings. However, you know, the data center stocks didn't perform quite well today. Uh they kind of just sat there and we saw some selling pressure pressure actually of course across the board. Things like Core Weaver down to 84. You got Cipher down to 1779 now. Iran at 42. Uh so Nebius here at 90. I'm not necessarily mad or anything like that. Guess I'm just waiting for some of this volatility to settle out. One of the bullish things though is that we do have FOMC that is now behind us. So now that we have that behind us in terms of we're probably going to be looking at the market's going to be looking at you know the next Fed of course still taking some of the actual uh you could say statements from Powell. Um however his last month I believe is going to be May of 2026. So market's going to be forwardlooking, more looking to see what the next Fed is going to be. Uh kind of coming out with announcements. We'll see what happens there. Uh but nonetheless, not horrible. Um the S&P 500 index right here at 68.8.8.8.8.8.8.8.8.8.8.886. This could open up around 6,800. Now this has really really traded uh between 6,800 for a while. So there's a strong level of support right at about the 6,800. If we lose the 6,800, that's where you could see maybe a further breakdown. Uh, but I'm not necessarily throwing up any white flags or anything like that in terms of a long position or a short-term bullishness. I think this is a lot of volatility and just looking to personally possibly uh buy the dip here. Peace out. Take care and I'll catch you guys later."
    }
]