[
    {
        "video_id": "y48K7-hqmPQ",
        "title": "Tom Lee Just Flipped on Ethereum… Why?",
        "published_at": "2025-12-11T15:20:05.000Z",
        "sort_date": "2025-12-11",
        "url": "https://www.youtube.com/watch?v=y48K7-hqmPQ",
        "views": 31360,
        "duration": "00:10:41",
        "transcript": "Holy crap, guys. Tom Lee just changed his predictions for Bitcoin and for ETH for this year. And this is massive because obviously many people were expecting big numbers in December. Many people were expecting a big fat Santa rally because in September, Tom said that ETH is going to go to 20K this year, this exact year. Then in November, he followed it up by saying that actually we're going to go to 15K because prices were down a bit and he said, \"Listen, not more. It's not going to be 20K anymore. Now it's going to be 15K.\" And by the way, I love Tom Lee. Big shout out to Tom Lee. I think eventually it is going to go very very high as well. Likely towards the end of 2026. But I just want to highlight that now he changed his prediction and most people are now fully wrecked without any strategy. Because if your strategy is to follow a talking head like Tom Lee, not looking at the price, not having stop-loss, not having any kind of position sizing, any kind of risk management, you are at the whim of someone such as Tom Lee just changing everything from day to day. And instead, I will show you what you should do instead. But look here, he just said, you know, no more 20K, no more 15K. He said, we're going to have new highs in January. Maybe in January, maybe not in January. And new high basically means we go to 4.9K. Okay, not 15, not 20, just maybe 4.5, 4.9. Listen to this. >> Business cycle. And both are about to turn up. So that would mean anybody who thinks the Bitcoin fouryear cycle means crypto prices are down next year. We're betting against that thinking that new highs come early like January. And this is the thing, they can always just extend the timeline because the timeline is going to be correct eventually. Listen, long term, everyone is bullish crypto. I'm super bullish ETH. I'm super bullish Bitcoin. I think towards the end of 2026, Bitcoin will start its ascent towards a million bucks. Okay, ETH likely is going to go to 20K and so on so forth. But but but but we cannot deny the fact that ETH is in a big fat bare trend. We cannot deny the fact that it can barely pump because there's a lot of sell pressure. It tried pumping here on the Fed news and got put back in in its place. The market said, you know, SCFU and sit down and be quiet. Okay, you try to pump, be quiet because there are many sellers now. There are many sellers. Now with Bitcoin, a very similar story. Try to pump into FOMC, didn't really do it. Now kind of forming a bare flag which breaks out to the downside normally. And here is where looking at the price has been very very very key. And I keep repeating this about the price. Why? because people are still not understanding. I have this guy who asked me a few days ago, Ivan, I think following only the chart is unwise. You're leaving out so many other factors. And he's fully wrong. He's fully fully wrong because the other factors will result in the price either moving up or down. And when the trend shifts, that is going to be our signal. In fact, the price is the only thing that takes all the factors into consideration and gives you a clear signal based on all factors based on all of the different um macro charts based on everything everything. The price is the final signal that you can act on because if the price is in a macro bullish trend, you can ride it just like we did from January 2023 when the price went into macro macro bullish. And when price is in a micro bearish trend, you can also act on it and either short or just be outside the market or derisk at least derisk in some way to not be a part of the big move down just like we've been derisking since October 8th. So this is how you have all of the information and you don't leave anything on the table. Because here's the thing. This guy probably thinks that you need to listen to Tom Lee or watch the ISM chart or watch the global M2 chart or any other macro chart or any other, you know, unemployment chart. There are so many charts you can look at. But here's the thing, there are many of them. There are thousands of macro charts. So, which one do you pick? Because people were looking at the M2 chart for the longest time until it stopped working and now no one cares about the global M2 chart. Now, they say ISM, ISM, ISM is going to pump us. I bet you if ISM does not pump us, they're gonna find a new microchart. So why choose specific microchart when you can look at the price which basically has all the micro charts, all the signals uh boil down to what actually moves and doesn't move the price. Okay, so this is important also. Another guy said, so apart from the four cycle theory, what are the other bearish arguments? Well, I can give you two. We're below the 50week moving average. We're in bearish trend. The price is where you see the bearish arguments. You need to look for other bearish arguments. Someone please enlighten me politely. Okay, let's be a bit more polite here since I generally do not know. So Gareth, my friend, Gareth or Curtis or Gareth Curtis or Gareth Curtis 9354. Listen, you are doing it fully wrong by looking for reasons in the news. Where do you look for reasons? You look for reasons in the news. You look for some kind of top signal, classic top signal, maybe pure multiple or maybe some other top signal. and you cannot understand how come the price goes down even though we have no so-called top signal in the news. We didn't have a uh retail mania. Well, you're doing it wrong because the thing you have to look at is the price chart where all of the signals are boiled down into a simple chart you can look at and when it flips bullish you're bullish. When it feels bearish, you're bearish. That's it. And here's why. When you look at for the reasons, you're always going to be confused. It is by design. I mean the news are made to confuse you by design. Don't look at the news. You're going to get wrecked if you look at the news. You try to find signals in the news because this guy is asking for arguments. You know what are the other bearish arguments? So you mean that you want bearish arguments such as top app in the app store is Coinbase or something you know the the classic ones or you want some kind of bearish argument that you know we had massive euphoria. So okay guys everyone exit now. A clear bearish argument. The most clearest bearish argument is that the price goes down and that's it. Okay? And that it starts a new bare trend. That's all you need. There is no way to trade on news. No way to trade on arguments. How you trade on argument. Let's say I give you a bearish argument that you like. Just imagine. Just imagine for a second. I give you like three more bearish arguments that you like. What's your position size based of them? Based on them. What's your take profit? What's your stop-loss? And what's your risk? How how many% of the portfolio you risk? Like how do you have a system of trading based on arguments? How do you do that? I really don't get it with the chart. It's very very simple. You have bare trend, bull trend. You can calculate position size. Simple simple simple. Now another guy and this may be my favorite. Another guy is saying that um uh I find it strange that a YouTuber saying that listen so basically a few to give you context a few days ago we're speaking about you know Tom Lee Kathy Wood don't listen to them for your trading. uh advice. Okay? Why? Because they are not really trading. They're not really here to give you something that will help you, some kind of advice that will help you. They're here just to get inflow. Both Kathy Wood and Tom Lee, they're here just to get inflow into their vehicles and that's it. They want people to buy their ETF. So that's below that video. This guy was commenting the following. I find it strange a YouTuber saying that listening to hed funge managers, hedge fund managers and billionaires will get you wrecked. [laughter] So this guy thinks that listening to hedge fund managers and billionaires will not get wrecked. Number one, I mean, you are smarter than them or are you really hoping we go down so we can buy back in on question? I don't think I'm smarter than them. I give big shout out to Tom Lee and Kathy Wood. I would be doing exactly what they're doing if I was in their shoes because their job is to get inflow. That's it. For me, if I have a fund, for me to get inflow, I cannot be bearish. I cannot be for a second bearish. Why? Because that is going to hurt my fund and my yearly bonus. I want inflow. And inflow means that I have to be long-term bullish. Even if the price goes down, even if Bitcoin goes into bare trend, even if the chart looks like crap, I have to remind everyone about the long-term vision, how my thing is going to be great and this and that. So, from just a rational perspective, I'm not saying that I'm smarter. I'm just saying that I know how this works. And most people are sadly a bit like sheep. They don't know how it works. They think that if Kathy Wood or Tomley says something, it's fully correct. And then they're surprised that Tomley changed his timeline. Now they're surprised. If you understand the game, you don't have to be surprised, guys. You don't have to be surprised. It's uh it's very simple. It's very simple and it's purely rational. So, they're very smart. They're extremely smart. The problem is that they're not on your side. Okay? They're not on your side. Here's an example. Kathy Wood, she has Arc Innovation. Okay, if you measure from the peak in 2021, this is her fund. Okay, this is her fund. It's down from the this 2021 um peak, it's down how much? 50%. Okay, so if you listen to her, you you buy all of her stuff, maybe you even invest in her fund, uh you would be down 50%. Meanwhile, you could have just bought S&P, okay? And since 2021, you would be in a very different situation. I mean, since this peak right here, since December 2021, you would be up 50%. So Kathy Wood took you down 50%. This thing S&P just simple S&P what your grandma has, what everyone has, it's up 50%. So basically, you would have three times more money if you bought S&P. Okay? [laughter] And then people asking, Ivan, Ivan, why do you say that it's not smart to listen to what hedge fund manager is saying on the on TV? Listen, their job is not to give insights. Understand the incentive. Their job is not to give you insight so you can go and trade. Their job is to have inflow, inflow, inflow, inflow, inflow. That's it. That's it. Hedge fund and billionaires, how will they get you ragged? Because they're playing a different game. you think that they say something that uh it's reliable information that ETH is going to go to 20K then when price turns bearish they keep telling you the same thing while we have been warning here since October 8th that it doesn't look too good and that's the big difference so guys it's up to you to decide who you listen to how you do it if you like the content you smash up the like you subscribe to the channel if you want to learn how to actually trade and you want to do it for free use the link below for free training bullmania.com watch it learn the mechanical rules and I'll see you all in the next episode."
    }
]