[
    {
        "video_id": "r7tov49OT3Y",
        "title": "Watch THESE CRYPTOS In 2026!!",
        "published_at": "2025-12-30T14:01:32Z",
        "sort_date": "2025-12-30",
        "url": "https://www.youtube.com/watch?v=r7tov49OT3Y",
        "transcript": "2025 was a roller coaster of a year for crypto and this has everyone wondering what could happen >> in 2026. >> Luckily, a recent institutional [music] report outlines what key trends could dominate the crypto market in the coming year and it's eyeopening. In this video, we are going to break down the most important trends from this report that you should be focused on in 2026. Trends that could make or break your portfolio. By the end of this, you will know exactly where to look for value over the coming months. So, be sure to watch the whole way through. Before we begin, you need to know that I am not a financial adviser and nothing in this video should be considered financial or investment advice. It's for educational purposes only. And if you enjoy content like this, prove it by punching that like button. Now, the report we'll be summarizing for you today comes from Coinbase Institutional, and it's titled, quote, 2026 crypto market outlook. It's pretty lengthy, so we'll just be giving you the key points in today's video, but we'll leave a link to the full report for you down in the description if you want more information about the key points that we cover. With that in mind, the report's authors start with something we're all wondering, and that's the key themes to watch in 2026, and not just in crypto, but more broadly as well. And one theme is AI's economic impact, especially on productivity because its integration is new and not yet reflected in official data. They even compare the current AI boom to the tech euphoria of the late 1990s. Now, for context, Coinbase has been getting into AI over the last couple of years, which is presumably why it's the first thing that they mention. Anyways, another theme is crypto regulation. In the US, the Genius Act set clear rules for stable coin issuers in 2025, while the Clarity Act aims to clarify market structure rules in 2026. Meanwhile, the EU's Mica bill is in full swing, and regions like the Middle East, North Africa, Asia, and Latin America are developing regulatory frameworks of their own. The report argues that clearer rules will allow projects to innovate and explore new possibilities, including more advanced crypto derivatives, wider use of crypto in payments and transactions, and new ways to deliver value to token holders such as enhanced staking and fee distributions. Now, another theme is also a no-brainer, and that's spot crypto ETFs and digital asset treasury companies, or DATs, both of which swung open the door to institutional adoption. The good news is that the report expects spot ETFs to gain momentum in 2026, mainly due to new SEC guidelines that shorten the approval process from 270 days to 75 days. However, the authors warn that DATs may need to adopt a new business model to stay competitive and relevant in 2026. This DAT 2.0 approach would go beyond simply accumulating coins and tokens, doing things like staking, and participating in DeFi. And this ties into another theme that the authors call quote tokconomics 2.0. With clearer, more supportive regulation, they expect projects to offer new ways to deliver value to token holders, such as revenue distributions and token buybacks. And they see regulation as the primary catalyst for the next phase in crypto's economic evolution. And this relates to another theme that's been hot lately, and that's privacy. The authors note a surge in privacy focused transactions and expect the sector to grow as both institutions and individual investors look to shield their activity from the prying eyes. Institutions want privacy to prevent competitors from copying their work while individuals are increasingly wary of surveillance technologies that threaten their freedoms. And of course, the authors also highlight the intersection between crypto and AI, which they think will be front and center in 2026. And new developments like Coinbase's X42 protocol could allow AI agents to handle microtransactions, creating new forms of commerce. And obviously, this will all be done on application specific blockchains with institutional-grade infrastructure, including payment rails and private permissioned chains for asset tokenization and securities trading. However, this growth also has made the landscape quite fragmented, and that's why the authors believe the future lies in an interoperable network of networks model, noting that winners will be those that work with others to enable atomic multi-chain settlement, unified liquidity pools, and synchronized realworld assets, another key theme for 2026. Now, the authors expect tokenized equities, aka stocks, to grow the fastest. And these assets can trade onchain 24/7, settle almost instantly, and integrate directly with DeFi, giving them an edge over traditional stocks, where capital can sit idle outside market hours, and settlement can take days. Prediction markets are also predicted to be a key sector to watch. And interestingly, the authors say this is because of a provision in July's One Big Beautiful Bull Act that limits tax deductions for gambling losses to 90% instead of 100%. Now, this may seem minor, but it could create phantom income where people owe taxes on small wins or even losses. And prediction markets could offer a more taxefficient alternative. Prediction markets are also likely to grow as tools for forecasting future events as spurring the launch of more platforms. However, this could fragment the market, creating an opportunity for prediction market aggregators to become the dominant interface for the sector. So, uh, take note. And the final theme, the authors say to watch in 2026 is, of course, stable coins. They call them crypto's top use case and the quote killer app for mainstream blockchain adoption. With clearer regulation, more TradFire players are recognizing their benefits, and the sector is expected to just keep on growing, potentially reaching $1.2 trillion by 2028. Now, the next part of the report looks at specific cryptos like Bitcoin, Ethereum, and Salana, which uh reminds me, if you're looking to trade crypto, then you have to check out the Coin Bureau deals page. That's where you'll find exchange signup bonuses of up to $100,000. Trading fee discounts of up to 50% and deposit cash backs of up to 75% on the best crypto exchanges around. Just hit the link in the description or scan this QR code which will take you right to the deals page. Over there, you'll see a lot of offers across a range of exchange partners. Simply click one of the sign up now buttons and that should take you right to the deal. Now, these deals won't be around forever, so take advantage of them while you still can ASAP. Again, using the link down below or scanning the QR code. Anyhow, uh this part of the report starts by examining Bitcoin's performance in 2025. While Bitcoin's lower volatility puts it on par with major high growth tech stocks, uh the authors note that its 2025 price action has been awkward as tech stocks and gold have outperformed it on a riskadjusted basis. Next, the authors question the relevance of Bitcoin's 4-year cycle. While most track it based on the haring, they are more skeptical given that there have been only four hings. They argue that it's hard to judge their significance when other factors like global liquidity, interest rates, [music] and broader monetary or fiscal developments are usually at play. Moreover, a mix of new factors arguably make the hing even less relevant as Bitcoin's demand and market dynamics have changed completely. Miners no longer exert major selling pressure and their influence has faded. But the biggest shift is Bitcoin's adoption by institutions, asset managers, hedge funds, and even some banks. Some publicly traded companies have started buying Bitcoin to become DATs. And these new players now have a far greater impact on market sentiment and price action than the miners. Moreover, their focus on large long-term investments rather than short-term trades has made Bitcoin more consistent and less volatile. In any case, the authors then address Bitcoin's biggest security threat, quantum computing. While not an immediate danger, it may be approaching faster than many expect. Its immense power could someday break Bitcoin's encryption, putting private keys, accounts, and funds at risk. A scenario dubbed Qday. Quantum computers could also mine blocks far more efficiently than current Bitcoin miners, potentially disrupting its economic model. Despite this though, the authors call quantum computing quote a lower priority concern due to its current limits. But they do stress that migrating to quantum resistance signatures is urgently needed. Luckily, plans to address these risks are in development, which is frankly beyond the scope of this video. Next, the reports examine Ethereum's ETH, which had a wild 2025. ETH dropped 60% from January to April, but reached new all-time highs by late summer. And this was driven by two main factors. Institutional demand via spot ETFs and digital asset treasury companies, as well as the Pectra upgrade, which improved Ethereum's UX and scalability. In 2026, the authors say a renewed ETH uptrend will rely on macro tailwinds like lower interest rates, higher risk appetite, and easing monetary conditions. RWAS and stable coins could be key drivers as well as since Ethereum holds a large share of both especially stable coins with about 53% residing on Ethereum. Ethereum focused DATs drove much of ETH demand in 2025. But as bullish momentum faded, their MNAV or multiple to net asset value dropped sharply and this made them less attractive to investors which could result in forced liquidations to stay afloat. Still, the authors expect DAT to provide a tailwind in 2026, though likely smaller than in 2025. The authors also touch on Ethereum's latest upgrade, Fouseaka, which happened on December 3rd. Now, Fusaka implemented 12 Ethereum improvement proposals or EIP to enhance scalability and efficiency. Ethereum's next upgrade, Glamsterdam, is scheduled for 2026, and it will further enhance scalability and efficiency while reducing centralization risks. Definitely one to watch closely. Now, the next part of the report focuses on Salana, which started strong in 2025. By January, Soul hit an all-time high of $295, but momentum faded fast. Over the next few months, it dropped more than 60% to around $100. Still, several bullish events helped support its price throughout the year, especially relative to Bitcoin. And these include the first sole staking ETF, the debut of tokenized equities called X stocks, the Seeker mobile phone launch, approval of the Alpenlow upgrade, and the growing number of Salana focused DATs. However, by Q4, macro pressures outweighed all of these concerns over tariffs, dollar liquidity, and inflation pushed Bitcoin lower, pulling the broader market down with it. Naturally, the authors expect altcoins to keep following Bitcoin in 2026, including Salana. Now, Soul's all-time high was driven by memecoins, which dominated most of 2024. But by 2025, traders were feeling the strain of the unforgiving PVP nature of memecoins. Soul's demand drivers then shifted from speculative retail to DATs, ETFs, and onchain funds, all of which have longerterm time horizons. However, the authors did caution that if DATs continue to trade below their NAV, they won't be able to sell equity at a premium to buy more soul and may even be forced to derisk by dumping some of their holdings. Regardless, a wave of fresh spot Salana ETFs opened fresh avenues for capital in the second half of 2025, and the authors expect more Salana ETFs in 2026 as regulatory roadblocks have been removed. And because many of these ETFs offer staking yields, these are expected to further boost demand in 2026. The authors also examine Salana's long- awaited Fire Dancer upgrade, which recently launched in a limited capacity on mainet and is intended to boost Salana's performance, resilience, and client diversity, enabling up to 1 million transactions per second while keeping fees low during congestion. And this also supports complex use cases like advanced defy and gaming. The next upgrade, Alpenlow, was approved by validators in September and is set to launch on mainet in early 2026. Alpenlow will enhance network latency, efficiency, and robustness, positioning Salana as a more mature institution ready blockchain and enabling use cases like payments, RWAs, and other high throughput applications. Obviously, another crypto niche where Salana is dominant is stable coins, which the authors examine in the next part of the report. Now, stable coins have seen a compound annual growth rate of about 63% since January 2021. Transaction volumes soared from $22.8 trillion in 2024 to 47.6 trillion in 2025. The authors do note that future growth will depend on efficient ramps, broad distribution networks, and the evolving roles of market participants. They also note that over the past 2 years, stable coins have grown from a mere convenience to a core part of digital settlements vital to the global financial system. Their role in crossber remittances and fast settlements makes them ideal for highfrequency time-sensitive transactions as well as collateral in DeFi and tokenized economies. And then the report looked at the interplay between the rise of stable coins and the ongoing trend of ddollarization. In short, the proliferation of dollarbacked stable coins is supporting the dollar's dominance, which could paradoxically slow the ddollarization trend and hinder crypto's adoption, at least in the context of replacing fiat currencies. The authors note that stable coins have moved beyond their USDcentric roots, and a new wave pegged to other assets is emerging. This diversification indicates demand for non-USDbacked currencies and also tokenized precious metals which have grown a lot recently, mostly due to the hype around gold and silver. And that's a perfect segue into the next part of the report which focuses on tokenized RWA. Excluding stable coins, distributed RWAS, that is those withdrawable to self-custodial wallets now total about $18 billion in value, which is roughly 18 times higher than in 2022, with most being held in tokenized US treasuries. And as I noted earlier, regulatory developments both in the US and globally have been and will be the key driver of tokenized RWA adoption. And this legal clarity has enabled institutions to confidently launch major tokenized RWA products, each managing billions of dollars in assets. Now, while Ethereum currently dominates the RWA market, late 2025 saw a shift toward other chains like Salana, Avalanche, and BNB. The authors expect RWA to become a core pillar of crypto alongside stable coins, Bitcoin, Ethereum, and major DeFi protocols. Not surprisingly, the authors take a closer look at tokenized equities, which you'll recall is code for tokenized stocks. They note that retail investors quickly adopted tokenized stocks in 2025, and that's mostly because exchanges listed bluechip equities. Institutions built onchain settlement infrastructure and major players, including Coinbase got clearer SEC guidance. Despite all this though, tokenized equities are still minuscule compared to other RWA categories. Naturally, uh this leaves significant upside potential, but it's not without risk. Liquidity is still extremely low, making tokenized stocks prone to slippage and volatility. And these assets also rely on oracles for accurate off-chain price data, and ownership rules can vary by jurisdiction. That said, the authors expect tokenized equities to grow rapidly in 2026. The report then examines tokenized US treasuries which more than doubled in market cap in 2025 and this growth was driven by just a few institutions namely BlackRock and Onondo Finance. The authors speculate that tokenized treasuries have become dominant for two reasons. First, they're quickly becoming the standard for onchain collateral. And second, their liquidity and access are superior to their traditional counterparts, which is presumably why they're becoming the standard for onchain collateral. And as a fun fact, treasuries are also used in Tradfi as collateral. Whatever the case, another RWA sector that grew exponentially in 2025 is tokenized commodities, which tripled in value over the year. And these tokenized versions of physical products like precious metals and agricultural goods are often fully backed and redeemable for their underlying assets. Tokenized gold was the clear outlier in 2025, though, largely due to the parabolic price action of gold itself. Meanwhile, tokenized versions of industrial and agricultural commodities are a newer development, but have clearly shown signs of growth potential. Thanks to the advantages tokenized commodities have over their real world counterparts are their convenience, programmability, and real world asset exposure. The authors expect this sector to expand further in 2026. The final RWA sector to watch in 2026 is also the largest, private credit. And tokenization is gaining traction here because it addresses many of the traditional markets pain points, namely transparency and liquidity. And this brings us to the final part of the report, regulation, which saw major developments in 2025. Alongside the Genius and Clarity Acts mentioned earlier, both the SEC and CFTC made strides of their own. The SEC launched Project Crypto, directing staff to define which digital assets qualify as securities, modernize custody requirements, introduce innovation exemptions, and set generic listing standards for exchange traded products like spot crypto ETFs. Meanwhile, the CFTC rolled out its listed spot crypto trading initiative, enabling exchanges to list certain types of crypto products, including leveraged or margined spot trades, which was previously a gray area. The CTF also sought public input on using tokenized assets as collateral in derivatives markets. Taken together, these moves set the stage for the most transformative regulatory era the crypto market has ever seen. And as we mentioned earlier, regulatory progress has accelerated outside of the US too. And this global push for clearer rules will give crypto a more consistent regulatory environment, opening the door to global innovation. Okay, this brings us to the end of the report. Well, I mean, sort of. There is another section where Coinbase basically brags about its own developments in 2025 and what it's planning for 2026. You're more than welcome to check those details out in the full report if you're curious. For now, though, you may be wondering what all of this means for crypto in 2026. While market conditions may be moving towards bare market territory, this also gives the crypto sector plenty of time to build robust frameworks that preserve its longevity and pave the way for some of the most exciting developments yet. Clear regulation will define how far developers can push boundaries, enabling solutions we can only imagine today. And this will spark not only new technologies, but also solutions to safeguard the crypto market itself. Without the pressures of delivering flashy tech that benefits retail investors, crypto projects can focus on the stuff that really matters. In fact, we reckon that this will be the time where we see huge steps towards important issues like quantum resistance. However, there are a few things in 2026 that will be interesting to watch. For instance, will DATS continue issuing equity and debt to accumulate as much crypto as they possibly can, or are they about to join the fight for onchain sovereignty by competing for block space? Only time will tell. There's also growing talk about the legitimacy of crypto's 4-year cycle, something that was also mentioned in today's report. Quite frankly, the sheer fact that so many experts have cast doubt on the 4-year cycle of late isn't something that should be ignored. With all that said though, 2025 was a wild ride. And if you're still here watching this video, it's probably because you know just how important blockchain technology really is. Yes, we may be in for some pain, but this also presents an opportunity to dye and accumulate cryptos that have serious upside potential when the bare market inevitably ends. Not financial advice, of course. All right. If you want to learn more about the quantum computing threat, check out our video. right over here on that. And if you're wondering what challenges Bitcoin will face in 2026, check out that video right over here. Thank you all so much for watching and I'll see you again soon. This is Nick signing off."
    }
]