[
    {
        "video_id": "4GG0ITYWjZs",
        "title": "Leaked: Trump’s Defense Stocks - The Investment Opportunity of a Lifetime!?",
        "published_at": "2025-12-30T14:00:06.000Z",
        "sort_date": "2025-12-30",
        "url": "https://www.youtube.com/watch?v=4GG0ITYWjZs",
        "views": 122697,
        "duration": "00:26:24",
        "transcript": "Your retirement could be transformed. But what I'm about to show you today, right now, the Trump administration is pushing through a $1 trillion defense budget that's completely reshaping the entire military landscape. We're talking about the biggest shift in defense spending priorities since World War II. Money's flowing into drones, into AI, missile defense, and technologies you've probably never even heard of. By the end of this video, you know exactly which 13 stocks are positioned to potentially capture this massive wave of government spending and why some of these companies could multiply your investments several times over over the next year or two. Now, even have to do your own research on that one. I'm going to give that research to you. In fact, I'm going to give you right now a workbook that comes with this video. It will show you first of all all the tickers. So, if you're just one of those, you know, um Tik Tok damaged brains, but it also walks you through. ask you some questions so you really understand this is really sinking in for you. Uh there is a much deeper um research document also for you guys who are in the in the premium communities uh which is I think just landed last night. Now before we dive in let me tell you who I am and most importantly who's that and why you should listen to us about this opportunity. My name is Felix Prin. I'm an exinvest and banker. I've seen how banks work. I've seen how the big money I've seen how the big players position themselves and I've got Winston who's got the largest nose out there and uh knows every analyst and banker in the world. I'm also the co-founder of goat academy. We've taught over 20,000 students. I'm also the co-founder of trademvision.io which is a cutting edge information and news platform for retail investors like you and I to like level the playing field. Now, Trump has made his priorities very, very clear. I'm going to connect the dots today between the policies and the specific companies, including the tickers, that could profit massively from these. So, Trump's just signed into law a defense authorization bill worth about a trillion dollars. And how's that different? I mean, they do that every year, don't they? Yeah, but it's not just more money for the same old stuff. There are three very different priorities and they're going to shape where these dollars are going and we can invest in these. So the first is homeland security. They're building what we call a smart wall at the border. Not just concrete but advanced surveillance technology drones sensors AI systems. They're also implementing something called the Golden Dome for America, sort of borrow from the Israelis, a next generation missile defense shield that would protect the entire United States. And then secondly, they were going to bring manufacturing back. So the governments literally banned certain critical minerals from being sourced from other countries. And companies that now make these minerals and these materials in the US are about to get a guaranteed customer. the US military with virtually unlimited funding. And then we have item numero which is the next generation weapons. What are those? Well, the hypersonic missiles that travel five times faster than the speed of sound. Laser weapons that can shoot down drones for pennies per shot. An AI that can make battlefield decisions faster than any human commander ever could. Now, before we jump into the individual 13 stocks here, what I always find is people want a stock tip, right? This isn't a stock tip video, by the way. I'm going to run you through these 13 stocks. But if you just blindly buy it, you'll probably be too late. You'll probably be too early. You're at the very least missing when to sell the risk manager, which is really what this is all about. And I see it all the time. We have these massive winners. And then someone comes along and says in my comments, I'm down 40% on it. I'm like, how how's the disconnect? I'm up 100, you're down 40. What's the difference? It's not really timing. It's not really luck. No, it's actually the skill. the skill of when is it a good time to buy, how big should the positions be, and when should we sell? And I think that's the big biggest skill gap I see in every investor. Do you want to fill that skill gap and make 2026 the year where you are more skilled investors, you can make better decisions and potentially get better outcomes. Therefore, then you might want to get yourself somebody you can learn from. doesn't have to be me, but if you're interested in the way we teach and we learn and I learn, um, I learn from Wall Street mentors. So guys, you've done this for decades in big investment banks, in big hedge funds, you know, Goldman Sachs, BTS, Maril Lynch, you name it. And you can get access to my mentors if you're interested. So if you want to kick off 2026 in a different way, you can book yourself a free call. We call it a freedom call. It's a strategy call about 30 minutes or so. You get to ask us all the questions. We'll ask you some questions. Make sure this is the right fit for you because obviously at this point it's a fairly vague proposition. You can do that at phoenix.org/freedom and then if you decide to join us, you get one-on-one access to my Wall Street mentors. That's the that's the promise there. So check that out. Link down below before we dive into the stocks. Okay, stocks. Palanteer on the screen here. Um but 12 others as well. We're going to keep this simple. I'll tell you what each company does, why the Trump administration policies benefit them specifically and how and what the key numbers are. I'm going to I'm going to deliberately keep this at a level where we don't need to be some sort of tech military expert because I I'm not. I've just got, you know, large nose behind me. So, stock number one, Palanteer PLTR is think what do they do? You probably know, maybe you don't. Um, they're basically the brain that connects all the military's different systems. So, the military has satellites. It has drones. It has radar systems. It has intelligence reports. Thousands of different sources of information. And Palanteer software takes all that messy data and it turns it into a clear picture. So that commanders can actually use that information to make decisions. The military calls this AI integration in the kill chain. Basically AI that helps the military find targets and respond faster than the enemy can. So why why is this new budget help them? AI is a top defense priority now. And Palanteer is actually explicitly named as a key technology provider for the smart ball at the border. So they're not just a military play here. They're directly tied to one of Trump's signature homeland security initiatives. Maybe disagree with that. That's also okay. But the money is going to flow in there very likely. Now, this is a big stock. The the market cap is sort of weirdly at the bottom of my chart here. Maybe you can just about see that $450 billion. I think that actually makes them the biggest defense contractor out there. And that's also why Wall Street analysts have mostly hold ratings on this. They find it difficult to see how they're going to grow a lot more, but they might be missing something. Palanteer signed a 10year $10 billion contract with the US Army, a $1 billion AI deal with the UK Ministry of Defense. That's just 11 billion in contracted revenue. Now, retail investors are very bullish on this. We've been very bullish on this. We started talking about product when it was about $26 or something like that. And the opportunity is simple. If the Trump admin goes full speed on AI powered defense systems, the border wall drones that are, you know, autonomous, Palanteer is positioned to be the software backbone. And you ask yourself, do you believe AI is the future of military operations? If yes, there is some logic in this plague. Stock number two, aeronment. um drones basically. And what do they do? Well, these guys make military drones, but not the little sort of consumer fluffy things that you you can get at, you know, Best Buy. They call um what they do group three and group four drones. These are larger tactical drones. They can fly longer distances. They can carry heavy bombs and missiles and they can provide intelligence to the soldiers beneath. So, the policies of Trump help them. Now the military is moving from having drones operated by specialized units to giving them to regular infantry squads. Every group of soldiers will have their own drones. It's called drone proliferation from strategic to tactical level. I know uh but it massively expands the market. So this is a 12 billion market cap. It's pretty pretty small. Now when I say strong buy, I don't mean that this therefore right for you. You got to come to that conclusion yourself. risk management, portfolio densification, uh your timeline, your age, your income streams, all those things feed into that. And again, that's why I highly recommend getting a mentor who's done this for a while. But these guys are likely to get a contract for the Army's long range reconnaissance program, probably this quarter, and they already have a 5-year contract with the US Army for foreign military sales and so on. Um, Wall Street likes it. That's the strong buy. That doesn't mean the sheep are right, but if they win that contract in the next couple of months, I think you could see a significant pop in the stock price. And I believe the military is going to put these everywhere. Drones are going to be everywhere. Literally where I live, there used to always be a police stop about twice a day on the road and there's now a sign there that says police drones in operations. I think this is just a reality that's becoming, you know, coming to us very, very quickly. Stock number three is Light Path Technologies. They make Swiss Army knives. That would be really silly, wouldn't it? Um, it is however one of my favorites because it has exposure to multiple trends. The ticker symbol is LPT. You see the at the top. What do they do? They make specialized glass and optical components. So, these are the lenses and the sensors that go into drones, missiles, cameras, and all sorts of of equipment that needs to see. They're a supplier of domestic US germanmanium. It's a critical mineral material really mineral for military optics. And the 2026 National Defense Authorization Act, that's the law that was just signed, literally bans the military from buying Germanium from China and Russia. That means the Pentagon has to buy from US suppliers. And Light Path is one of the one of the very few American companies that can actually provide this material. So it's a guaranteed customer with pretty good funding. But it doesn't stop there. It is also a picks and shovel play because they'll sell components to basically everybody in the drone encounter drone system. So whether you're building systems or whether you're building systems to shoot down drones, you need these optical components. It's a smalish stock, 400 million market cap, trading at $9. And here is one thing I want you to watch out for. This is the sort of secret really. Loheed Martin. This is not a video about Loheed Martin. Locked Martin, I think. So, if they win the contract to replace the Stinger, the Stinger missile, that'll be in Q1 or Q2 this year. Light path is a likely supplier. And that contract could be very very big for Light Path. You've got some buy ratings on these from some lesser known analysts. I don't really care about the analysts very much. I mean, why would I? I've got Winston. But it's one of those rare stocks that could benefit from multiple Trump priorities simultaneously. Supply chain reassuring drones, counter drone systems, and missile defense. Small cap. Small caps are more volatile. Small caps are more risky, but small caps can potentially also move up faster, can also move down faster. So bear that in mind. Stock number four is on this holding on. What do they do? They make electronic warfare systems. They can stop enemy drones. So instead of shooting a missile at a drone, which costs a lot of money, their system uses electronic signals to jam the drone. It is called a soft skill solution because it is kind and gentle on the drones. The uh human rights for drones advocates are very happy about that. They also built autonomous systems for border protection. Again, some people are not going to like that, but that's not really what this is about. This is about making money, not about politics. But of course, it can guide you if you wish. Two huge policy drivers. First, Congress just passed the Safer Skies Act, which gives state and local law enforcements new powers to counter drone threats. It creates a massive domestic US market for, you know, say there's a drone flying near a prison or a school or an airport or something, right? You're not going to get a missile out and shoot it down, are you? That would be crazy. No, you're going to want a soft kill solution and therefore holdings might get a lot of contracts from local law enforcement. And the second, and this is critical, in December this year, which is as I'm recording this, on a strategic government tender for an autonomous border protection system that ties them to the Trump border security agenda. Right now, this is a tiny stock, about $3 billion. Um $8 share price analyst targets are about 12 to 13. Not that that means very much. They're usually wrong, but you know, at least it tells you that someone's bullish on it. What are the analysts citing? A generational inflection point in military drone adoption. So, if Trump follows through on the border system and domestic counter drone deployment for, you know, prisons, airports, that sort of thing, then they're going to do well probably. Stock numero sinko chinko even, isn't it? Gosh, Spanish is terrible, isn't it? Anyway, RTX Corporation, like ticker symbol RTX, this is one of the big traditional defense contractors. This is a $250 billion beast, and they're heavily exposed to what? Well, they make the Patriot missile system that's been around for decades. Big uh defense missiles you see on the news, defending against incoming attacks, that sort of thing. They are also, however, a major player in hypersonic weapons. So missiles that's so quick, you know, five times the speed of sound. I don't know how quick that is, but it sounds quick. Now Trump has this golden dome for America missile defense plan. And that relies heavily on these old Patriot systems because they actually battle test it. So the government secures spending for Patriot 3 missiles all the way through to 2032. So it's 7 years guaranteed revenue. and hypersonic weapons are a big priority. So, they're going to potentially be on on top of that. And they have a backlog of $218 billion dollars in orders. Analysts have a buy rating on it. It's a more conservative play. It's a giant company, steady, predictable growth, long-term government contracts, all that kind of stuff. So, if you just want some exposure to missile defense, hypersonics without the crazy volatility of some of the smaller players, RTX might be your new best friend. You're going to have to vet them first, of course. And then we have Park Aerospace and Moo Inc. M OG is the ticker symbol of that one and PK. And we're lumping these together for the simple reasons that they both are manufacturers of highly specialized even components that go into the Patriot missile system. Park makes composite materials for the missile body and Moog makes precision actuators. Basically the moving parts that steer the missile. So these aren't components you can just buy at, you know, local store. They're basically companies that are often the sole source supplier, meaning the military has no other option. So why does this policy help them more than last year's? Well, Patriot spending is secured for the next six or seven years, but they could do better than RTX because they're much smaller businesses, you see. So, the percentage impact on their business is just larger when the numbers go up. Both have buy ratings from the the sheep, sorry, the analysts um and and Winston. Winston, do we like these stocks? You can interpret that as you wish. Stock number eight is a semiconductor foundry. So what is it doing on the defense list? They manufacture computer chips. Not consumer chips though, not for your iPhone. No, they make specialized chips for aerospace and defense applications. So it's a pure play on the supply chain. Coming back to the United States, Trump has made that a security priority. And if you just think about it, every drone, every missile, every advanced weapon system, it needs chips, lots of chips. The government wants those chips to be made in America. And they're willing to pay for it. They don't care that it costs more and make it somewhere else. So, Wall Street has a strong buy rating on it. It's a smalish company, about $800 million market cap. So, this is an onshoring play basically. That's really what this is all about, getting more money from the government. And stock number nine is what? Aerospace? No, Lo Rocket Lab, RKLB. Um, now you might be forgiven for thinking that they just sort of launch satellites occasionally, and you might be thinking, well, SpaceX, that's that better, don't they? They're no longer just a launch company. They build satellites, lights, and space systems. They are a vertically integrated space company. So, how does Trump help them? Space Force, which I still think sounds like a satire, doesn't it? Anyway, it's that's the the the the what it's all about. So, the administration has made space dominance a top priority. There's an executive order out there which is literally titled ensuring American space superiority. And the military needs launch satellites very quickly and reliably. And Rocket Lab is described as the obvious main play for those kind of launches. They actually got $800 million for $800 million contract as well from the Space Development Agency to build 18 missile defense satellites. So the markets obviously like that. The stock price has gone up somewhat. Price targets are now somewhere between 90 and and and 80ish dollars. But space is going to become a critical domain for military operations. If you knock out satellite communications of your enemy, well, they are basically blind. You take them back to the dark ages of World War II. So, Space Force funding increases. Rocket Lab is a direct potential beneficiary. Numero is defense and security solutions ticker symbol as Kos. What do they do? Remember Aerov we talked at the beginning? Those make smaller tactical drones. Kattos focuses on large high-performance unmanned systems. Their most famous product is the XQ55A Valkyrie. I hope we can get a picture of that on the screen. It's a jet powered drone that can fly alongside manned fighter jets. It's designed to be atitable. What the heck is that word? It's a military term apparently, meaning it's cheap enough that losing one in combat isn't a big deal. The Pentagon, it's pushing very hard towards autonomous combat systems that can operate in difficult environments. It's it's much better to send a basically a fighter jet without a person in it out there into into harm's way than a person, right? I would have thought unless you are, you know, a fighter jet loving person who loves machines more than people, which is worrying. So go see a shrink. What else do they do? Space technology, hypersonics. It gives them exposure to multiple military priorities. It's a medium-sized company, $13 billion. So we're going to see large scale deployment of these unmanned aircraft. Then Kratos could be one of the leading providers. So speculative, more speculative some of the component guys certainly, but the upside is potentially bigly. Now stock number rule 11 is um Nite ticker symbol is laser lr like laser and that that sort of gives it away rather they they do something that's called um high power fiber optic lasers. They're not laser pointers that you use to play with your cats. Uh they are industrial grade lasers. They're the core component of military directed energy weapons. So, it's sort of the engine that powers laser weapon systems. And maybe you've seen again the Israelis using those to shoot down smaller missiles. Um, they're putting these on ships now, for example, to protect them against drone swarms, right? Because say 10,000 drones come out at you, you're going to run run out of ammo, but the laser does not. It just needs energy, I believe. So the military is transitioning directed energy weapons from experimental stuff to actually operationally relevant systems. So they're moving from prototypes to actual weapons that are being used. And not just the logistics of carrying enough ammo, but just the cost. If you shoot down a drone with a missile that costs tens of thousands or even hundreds of thousands of dollars or more, well, a laser will do it for a few dollars in electricity tops, right? So, when you're facing hundreds or thousands or tens of thousands of drones, that's going to make quite the difference. They have a defense contract um for the healthc program, that's high energy lasers, basically. Um the market has them as overweight, price target of about $30 something dollars. It's trading at 39 right now. So there we go. The the sheep don't usually know very much. It's a pretty small player, only about two billion. So it's a it's it's in my opinion the way of the future to shoot things down. Right now then we have something a little bit different, bit controversial, bit interesting. Plus Korea Defense Industry Index ETF. The ticker symbol is KDEF. It's an ETF that holds Korean defense companies with very heavy exposure to Korean ship builders like Hanoa. Now, the US has a severe ship building capacity crisis. US shipyards can't build ships fast enough, doesn't have enough workforce, and the Navy is desperate to expand its fleet. So, Trump wants to build this new battleship class and expand the Navy. And the US, well, if it wants to quickly rebuild its navy fleet, it may have to outsource it. Korea is a very close ally, very large American military presence. It is one of the big ship building countries. And I used to be working in banking was one of the things I covered was ship builders. Not typically the military ones, but the civilian ones, but Korea was of course always on the top of the list there. And it'll allow Korean expertise to build some of it in Korea, but also to build and manage US shipyards because the Koreans are the most efficient ship building operators in the world. That is speculative. So we don't know if this is going to happen, but this is speculative play. Could be an interesting thing to look at. Ticker symbol is KDEF. And then least but not last, AS Mobile. What do they do? They built massive satellite arrays in space that can provide cellular coverage directly to regular smartphones. No ground towers needed. Again, it sounds very much like Space X, doesn't it? Yeah. But they haven't listed yet, right? So, we got to work with what we've got. Um, and they're military relevant because their capability in radio frequency collection and their space-based surveillance stuff is very useful to the military. So if you have a very large network of these satellites, you can collect radio signals across the whole globe, you suck it all up and the intelligence community is going to absolutely love that. It also provides communication in areas where there's no infrastructure or you destroyed the infrastructure. So again, it makes a lot of sense. So we covered 13 stocks. What are the catalysts? We mentioned some contract awards. That's a key thing. We're going to see a lot of technology going moving from prototype to actual deployment. And a lot of these have funding secured for 2032 from the US government. Right? So write these down. If you want to watch these AVAV and LPTH, you might want to set yourself up a news alert on these two in in in Trade Vision. I'll put a link down below as well. There's a trial to that too. It's a software that we built. That way you can stay informed when something happens with these particular stocks. Now, we talked a lot about opportunities. Are are there risks? Well, yeah, defense programs are generally really slow. They take years to deploy. Um, some of these smaller and mid companies, I think I've highlighted that they are more volatile, as in more risky. And tech, well, it doesn't always work, does it? That's basically the the risks here. So, this is a multi-year trend. This is not a get rich by Friday kind of type trend, I think. So, you always want to be diversified. If you are interested in this, you want to build a basket or find an ETF or something. um and watch what happens in with the defense contracts being rolled out in the next quarter. And ultimately, the one thing that'll give you the most impact will be improving your skill set, which is why I'm offering you a a free strategy call with my team where we walk you through what it would look like to receive mentorship from my mentors. You can get access to those guys directly one-on-one Wall Street guys who've worked for 10, 20, 30, 40, 50 years for the big institutions and are kind people and are super happy to teach you whether you're a complete beginner or you're a more advanced. There you are. If you got some value out of this, you know what to do. Share it, like it, smash it. Get yourself the workbooks. You remember all the tickers were. And I wish you all the best. If you invest in the stock market right now, what I'm about to show you could either make you a fortune or cost you everything you've worked for in 2026. 2026 is shaping up to be a warmson a decade."
    }
]