[
    {
        "video_id": "9ASXINLKuNE",
        "title": "BITCOIN YEARLY CANDLE IS INSANE!!!!! (2026 will surprise most...)",
        "published_at": "2025-12-30T18:04:00.000Z",
        "sort_date": "2025-12-30",
        "url": "https://www.youtube.com/watch?v=9ASXINLKuNE",
        "views": 26663,
        "duration": "00:10:26",
        "transcript": "Oh yes guys, almost new year and as you can see, Bitcoin now has a red candle. And of course, people are asking, Ivan, what's going on? Because we never had a yearly red candle in the last year of the 4ear cycle. As you know, this year is the last year of the 4 cycle. And it's normally green. You know, here we had three green candles and then red, which was the bare market. Before we had four green candles and then red, which was the bare market. So this has never happened before that. We just have two green and then red. This has never happened before. So of course people are saying Ivan this means that cycle is broken that there is something different going on. Well let's talk about it. Does this mean that we are now in totally different category of uh bull market bare market cycle? Have we now entered something that has never happened before? And most importantly how do we adapt to this insane yearly close which will be first in history if Bitcoin does not go higher than 94K until the end of this year which as you know is in approximately one day. And before I reveal all the secrets and spill all the beans, I need you to smash up the like. Do it as soon as possible. Subscribe and most importantly, share this video with your loved ones, with a friends, with everyone who needs this education because people really need it. Share it with your uncle who hates Bitcoin. Share it with your uncle who loves XRP. Share it with the right-wing conspiracy theorist uncle who is fully correct by the way, who is at dinner table always a bit spicy. Share it with him as well. YouTube really loves when you share. And then Bitcoin is being pushed by YouTube even more. This kind of content is being pushed by YouTube even more. So indirectly you pump your bags by doing all of this. With that being said, let's start. Before we discuss how we make as much money as possible in this market next year in 2026, let's first conclude that yes indeed this yearly chart looks one of a kind. We never had this kind of yearly chart before. If you go all the way back to the beginning of Bitcoin, we never had just two green years and then a red year. This has never happened before. At the same time, we cannot only look at the yearly chart. We have to be fully fair and we have to consider all perspectives which means that we have to look on the monthly chart and there you're going to see a totally different story. The story here is that if you measure the number of months it took us to go from this low in 2022 to this high in 2025. It is exactly 35 months. It took us 35 months from low to top. This is the exact number of months it took us to go from this low in 2018 to this high in 2021. 35 months. And listen, I'm not making this up, but the number of months it took us to go from this low in 2015 to this high in 2017 is exactly 35 months. So to say that this cycle is fully different. Absolutely mega different in my very very very humble opinion. [snorts] Extremely humble. I'm here for the tech by the way. [laughter] It's wrong. It's wrong. It's not different. It seems that 35 months is what is needed for the human psyche, for the investor psyche to reset, to go from mega bull buying stuff that doesn't exist. Magic internet money, believing in nonsense in many cases. Dog with hat went to 5 billion this cycle. Guys, hello. Hello. Dog with hat 5 billion. 2017 all of the ICO scams. 2021 all of the yummy yams, all of the DeFi scams. So, of course, we have to reset the psyche. And turns out approximately 35 months, that's how long time it takes to go from FCX scamming and Celsius and all of the scams to thinking, hey, maybe crypto is not dead. I'm excited about crypto again. Approximately 35 months, well quite quite exact 35 months. That's what it takes for us to go from the absolute lows, from the absolute destruction to the new peak. That's how human psyche, human emotions work in crypto. And if you're a smart student, if you're a smart listener, you will be saying, \"But Ivan, why are you cherrypicking the monthly?\" Because yes, on the monthly is 35 and that's not broken. But on the yearly, it has been three years in the past. Three green, one red, three green, one red, and now that's broken. So why are we treating monthly as more important than yearly? Because monthly is exactly the same, but yearly broke. And so the question becomes, what kind of resolution of time is most useful to you as a trader? Because let's say you want to trade Bitcoin long-term. Can you use the 1 second chart? Of course not. It's too much noise. Can you use the one minute chart? No. You need to either use weekly or monthly or yearly. To me personally, I prefer to use the weekly. The weekly is the best for me. It's the cleanest on Bitcoin. It's really really the best time frame in my experience to follow the trends. And by the way, if you measure the number of weeks from the bottom to the top is exact. This cycle has been exact like the last one, like the last one, just like the monthly. So the yearly is the odd one out here. And it's just a fact that when you have 35 months, it cannot be exactly the same number of years every time. Just how the numbers overlap. Sometimes it's going to be two, sometimes three. So all in all, it's all about the usefulness of the time frame to you because at the end of the day, there's always some kind of time frame you can cherry pick where things look good or different or bad or this or that. The question is how do you adapt your portfolio? For example, on the weekly, I find the signals to be good early enough in the bull and early enough in the bear. Bit cannot go to zero without it being bearish and it can also not go to a million dollars without it being bullish. For example, on the monthly, I find the monthly a bit less useful because the signals are too late. They're too late here. I mean, here, for example, is at 35 before the uh bull signal flipped and it's still not bearish here. So, in my mind, it's just too late. I don't use the monthly too much in my trading. And then the yearly is even more so in my mind. It is a bit useless here because I mean what do you do of this? It's it's a bit it's a bit random. It's too few years. I mean even if we look at the longer charts it's too few years and there's not too much I can do with it. And that's why I find it funny sometimes when people are accusing me of blindly believing in the four-ear cycle because you clearly see that on the yearly chart the cycles don't make sense. Instead the cycles are the same on the monthly and on the weekly. And personally I find the most use in the weekly chart and that's why when the weekly is below 50 moving average that does the first signal to be risk off and when it's bearish that's the mega mega signal to be risk off and we were risk off even before this because we did this fake alltime high on October 8th. So we start to derisk already on October 8th. So guys keep it simple keep it simp keep it simple. Uh find the time frame that's useful to you. I recommend to use the weekly because that's what works best for me and be consistent with and I don't think that any serious trader makes money by trading the yearly chart. This is just a nice chart to see how much we've grown. This is a nice chart for your DCA. If you are DCAing as you know part of my portfolio I never sell 30% of my portfolio I am never selling even though we have a bare market I don't care. So from that use case point of view then yes looking at the yearly it's nice it's the best performing asset over the past uh decade and so on and so forth but it's simply too big of a time frame to really see how human emotion and human psychology changes from bare to bull there you have to look on the monthly or on the weekly. It's like you know trying to use your eye to see a microbe on your hand. You cannot do it. You need the microscope. You need lower time frame. The same thing is with the yearly. It is just too big fat of a time frame. Now when Bitcoin has existed for 50 years, 100 years, then yes, you can look on the yearly you can see bigger human psychology just like now we can look at stock market back from the 70s.com bubble. We can see kind of bigger human psychology on that yearly chart. For now we have too few candles for this to be useful and that's why monthly and weekly is the way to go. Now let's speak about how you make the most amount of money possible in 2026. And the first thing you have to understand is that it's all about being in early bull trends. Right here, Bitcoin fleet bullish in January 2023. You should have bought here. You should have huddled all the way until the back. And of course, the same logic applies to stocks as well. When you look at the stock market, Nvidia, Apple, Google, they all have been in great great bull trends. Nvidia, for example, has been in a bull trend for seven months and you have to be in early bull trends. And when you look at the Nvidia chart, what do you see? A massive massive bull trend here from May basically all the way up until right now without any big dumps. So basically you avoid this big dump right here and then you get a signal to get back in when the dump is over and then we fly higher and higher and higher and higher. And of course the same logic applies to gold and commodities here in the bull mania money scanner which basically shows you we scan the whole market and we show you when things bullish in real time. You have gold gold has been bullish for 11 months and if you see this gold chart holy crap you avoided this dump then you got a signal to get back in and it's up only up only without major major dumps. So the conclusion is that you have to be in early bull trends. That's the recipe for success in 2026. And to learn how to become a trendbased trader, watch the free video below at bullmang.com about the mechanical rules. Before I can give you access to the money line, which is this indicator with bullish bearish on the chart, before I can give you access to the money scanner right here, you need to learn the basics because you have to understand the mechanical rules first, which guide all of the principles that I just showed you. So do it right now. And also you have to understand that being a trendbased trader is the best thing you can do for yourself because this is the way to succeed where the odds are in your favor. We don't know what the price is going to be but we know that the trend will likely be the same tomorrow as it is today. So you need to become a trendbased trader and that's exactly what we do at bullmillion.com. Go and watch the free video below. And on this note, I wish you guys happy new year. Hope you have great celebrations tomorrow. I will see you in the new year. Hope to see you before that if you watch the free video below bullmanion.com and enjoy guys enjoy this new year and we're going to crush 2026 in one way or another if we follow the trends. We're going to absolutely crush it just like we did this year. We did risk on October 8th. It was the most brilliant way to play this market just like we got into Bitcoin in January 2023. The same thing, the same opportunities are going to be opening up for us in 2026. We cannot say for sure what it's going to be. I think Bitcoin is going to flip bullish in 2026. I think many robotics companies are going to flip bullish. There's all kinds all kinds of things. There are all kinds of things that are going to be in our favor in 2026. I wish you all the best in the new year. See you in 2026. Hey, by the way, smash the like, subscribe, all that good jazz. Bye-bye."
    }
]