[
    {
        "video_id": "ReMZYfYZ4R8",
        "title": "The TRUTH About Crypto PREDICTION MARKETS!!",
        "published_at": "2026-01-04T13:00:54Z",
        "sort_date": "2026-01-04",
        "url": "https://www.youtube.com/watch?v=ReMZYfYZ4R8",
        "transcript": "While 2025 was disappointing for many corners of the crypto market, there's one sector that exceeded expectations, prediction markets. These platforms have been growing exponentially, but now the sector risks oversaturation and fragmented liquidity. To say nothing of the controversy that prediction markets have aroused. This has many investors wondering if [music] prediction markets are the next big thing or just a passing fad. So today we'll uncover where prediction markets came from, how they [music] work, how you can profit, and whether or not they're here to stay. My name is Guy. Let's dig in. Before we begin though, you need to know that I'm not a financial adviser, and nothing in this video is financial or investment advice. It's educational content intended to inform you about prediction markets. And if you enjoy content like this, then prove it by punching that like button. Now, if you're asking yourself, \"What the heck is a prediction market?\" Then here's what you need to know. In short, a prediction market is a place where people bet on the outcome of future events like an election, sports match, a product launch, or even an interaction between celebrities. Traders place their bets on these events with a standard yes or no option being the most common. So, an example of a simple bet is, \"Will the Democrats win the midterm elections?\" And an example of a slightly more complex bet is how many seats will the Democrats win in the House. Now, the price of each bet or share usually trades between 0 and $1, but always settles at $1 when the event finally occurs. While the betting is still active, the price will move up or down based on which way traders place their bets, reflecting the odds of that event happening in real time. So, if a yes result is trading at 63 cents, this basically means traders think there's a 63% chance of that outcome happening. If they're right, the trade will close at $1 and they pocket 37 cents in profit per share. If something happens and traders think the odds of the yes result are lower, the price for the yes shares will fall to say 43. This not only presents a short-term trading opportunity, but a bigger return of 57 cents if traders stick to their guns and end up being proved right. And because lots of people bring their own insights together to place their bets, these markets often give surprisingly good forecasts. Case in point, prediction markets famously outperformed most traditional polls and news outlets in predicting the outcome of the 2024 US presidential election. Poly Market, which we'll revisit shortly, gave Donald Trump high odds of victory in October, at times approaching 100%. This basically signaled a Trump win days before any major network reported any decisive results. Now, although prediction markets may seem new given the recent hype, they've actually existed in some form or other for thousands of years. Ancient civilizations wagered on everything from gladiator matches and chariot races to political outcomes and even when the next war would occur. By the 1900s, Wall Street started running informal betting markets printed in financial papers. It wasn't until the early 1990s though that prediction markets went digital. This made them even more efficient to the point that they consistently surprised economists and policy makers with their increasing accuracy. Once the internet went mainstream, everyone and their mother was betting on politics, sport, economic indicators, you name it. And the more participants joined, the better these markets captured public opinion, the more accurate they became, and the more lucrative they were for users. Naturally, this eventually attracted the attention of regulators like the Commodity Futures Trading Commission or CFTC. Some of their biggest targets included in trade, an Ireland-based prediction market that was the first to go mainstream. In late 2012, the CFTC sued in trade for operating an unlawful offchange options market and the platform was shut down in 2013. Another example was predicted, a New Zealand prediction market popular with US traders. Initially, it got a CFTC staff no action letter allowing it to run without regulatory scrutiny. But in August 2022, the CFTC withdrew the letter and ordered Predict It to wind down operations. Luckily for them, court rulings overturned the withdrawal and Predict It was able to continue. Anyway, from the CFTC's perspective, prediction markets operate in a gray area. In their view, offering betting contracts on things like election results constitutes gaming, which is essentially gambling. But the tide shifted in November 2023 when Kelshi, one of the largest traditional prediction markets of the modern day, sued the CFTC over its election contract ban. To the surprise of many, Kowi actually won the case after the DC District Court ruled that in order to ban something as gaming, you must also label the underlying event as gambling. Now, since an election is the result of a political process and not the result of gambling, the court ruled that the CFTC had overstepped its authority. This was a huge win, not just for Koshi, but for all prediction markets, and it set the stage for the enormous boom we've seen in the sector over the last couple of years. Now, doubtless, you're finding all of this deeply fascinating, but what does any of it have to do with crypto? I hear you ask. >> I hear you. I hear you. >> Well, you see, prediction markets of old faced lots of hurdles. They were fully centralized systems prone to bottlenecks around accessibility, payments, and regulation. There were also concerns around transparency and manipulation. However, by putting prediction markets on public transparent blockchains, it became possible to overcome these hurdles. The fact that you need nothing more than an internet connection to access these crypto-based prediction markets also makes it possible for more people to get involved regardless of where they live. It's just one of the many benefits of crypto. Benefits that you can take advantage of by using the Coinbureau deals page. That's where you'll find exchange signup bonuses of up to $100,000, trading fee discounts of up to 50%, and deposit cashbacks of up to 75% on the best crypto exchanges. Just hit the link in the description or scan this QR code, which will take you to the deals page. There you'll see all of our offers across a range of exchange partners. Simply click one of the sign up now buttons and that should take you right to the deal. Now, these deals won't be around forever though, so take advantage of them while you can using the link in the description below or by scanning this QR code. Now, whereas traditional prediction markets have been around for thousands of years, crypto-based prediction markets trace their origins to the founding of Orugre on Ethereum back in 2014. After several years of development, Orugre launched in 2018, promising a decentralized alternative to prediction markets with a built-in oracle for reporting outcomes and even its own native token. But Augre was ahead of its time and failed to gain traction. The same was initially true for Nosis, which was founded in 2015 in the Consensus ecosystem. And if Consensus sounds familiar, that's because it's the company behind the MetaMask wallet. Nosis was set up with the explicit goal of creating a decentralized prediction market on Ethereum. It developed the conditional tokens framework which laid the foundations for Omen, its own prediction market which launched in 2016. At its peak, Omen had more than $85 million in total value locked or TVL according to DeFi Lama. For comparison, Orga had just $18 million in TVL at its peak. So, Omen was a big step forward for crypto-based prediction markets. The quantum leap forward didn't happen though until 2020 when Poly market was founded by Shane Copelan. As a fun fact, Copelan built the protocol alone during the pandemic in his apartment bathroom due to financial constraints motivated by a desire to combat misinformation through incentivized truth seeeking. As the name suggests, Poly Market initially launched on Polygon due to its fast, lowcost transactions, and the platform experienced slow but steady growth at first, but gained significant traction during the US presidential elections of 2020. Trading volumes began to soar as people's interest in betting on the election outcome continued to grow. Perhaps unsurprisingly, the CFTC raised concerns about Poly Market in 2021, alleging that it offered unlicensed binary options. In early 2022, Poly Market settled the dispute, paying $1.4 million and shutting down non-compliant markets. The platform then restricted US to viewing only, preventing them from trading. Despite this massive setback though, Poly Market continued to see rapid growth. It raised $45 million in funding in 2024 with investment coming from the likes of Peter Teal's Founders Fund and even Ethereum creator Vitalik Peterin. Poly market then saw significant inflows during the 2024 presidential campaign. In fact, its peak TVL hit around $512 million on the 6th of November 2024 according to DeFi Lama. Once the results landed, traders rushed to cash out and TVL dropped fast. Still, the platform's broader growth helped its TVL settle around $100 million, and it's been rapidly climbing again since August. There have been lots of other prediction markets launching recently as well, but we'll stick to the biggest ones here for the sake of time. The key takeaway is that the sector is growing rapidly because people are now betting on everything. And as more people apply their knowledge to place these bets, more economists and journalists will cite their data, which only attracts more users. To put things into perspective, the prediction market industry is pulling in around $2 billion per year in revenue, at least for now. Analysts believe that prediction markets still have 5x growth ahead of them in the coming years, reaching $10 billion in annualized revenue by 2030. Now, as you've probably heard, crypto prediction markets have seen their fair share of controversies over the years, some being more severe than others. What you may not know, though, is that many of these controversies actually have to do with users rather than the platforms themselves. The scariest example is definitely what happened to Augre. The platform started receiving scrutiny when traders began placing bets on the deaths of key political figures. Quite besides the ethical issues this created, it also raised concerns that prediction markets could become assassination markets with people being motivated to kill in real life to make online profits. Other controversies have been much more tame by comparison. For instance, there have been plenty of allegations of users, especially Wales, placing bets using non-public information across all crypto prediction platforms. In other words, insider trading. A recent example of this came in early December when a pseudonmous Poly Market user, Alpha Raccoon, allegedly made $1.5 million in a single day by correctly predicting Google's 2025 year in search rankings, which included some pretty obscure topics. However, onchain data showed the bets were placed just before Google published its official data. And to make matters worse, Alpha Raccoon allegedly made other Google related predictions in November, including a bet on the exact release date of Gemini 3.0. The bet duly paid off, netting the trader a $150,000 profit. Now, obviously, many suspect that Alpha Raccoon could be a Google insider, although there's no concrete proof, just speculation. And of course, this is just one example of many. Other accusations of alleged trading on insider information include trading on the results of the Nobel Peace Prize earlier in the year. For context, the prize went to Venezuelan opposition leader Maria Corina Macardo. But what's crazy is that her odds were extremely low during the run-up. Poly Market had Micardo at just 3.6% at 6:30 p.m. the night before the results, but from there the odds began to sore. By 700 p.m., just 30 minutes later, Macardo's odds of winning shot up to 39%. An hour later, they were at 73%. Roughly 10 hours later, Macardo was duly declared the winner. And this suggests that traders knew something that the rest of us didn't. And anyone watching Poly Market got to see the winner before everyone else, but it's one thing to see the results early. Using prediction markets to alter odds or manipulate realworld outcomes is something else entirely. You see, by taking advantage of the low trading volumes on each bet on a prediction market, users could in theory alter the odds to push an agenda or shift the public narrative. And many believe this is indeed what's been happening. A notable example of this was with the 2024 presidential election where it was reported that four accounts had used Poly Market to place multi-million dollar bets on a Trump victory. One French trader allegedly bet over $50 million that Trump would win, raising concerns that such massive wages inflated his odds and potentially influence the outcome. Some outlets even labeled it a threat to democracy. That said, multiple experts and Poly Market itself found no evidence of market manipulation. Even so, ethical concerns about using prediction markets to influence real world events are only likely to grow in the future as the usage of these prediction platforms increases. Now, although most controversies around prediction markets involve users, platforms themselves have been caught in the crossfire too, including Poly Market and Koshi. That's because both platforms have actively been recruiting internal marketmaking teams to provide liquidity, which some argue could be used to trade against users. Khi runs a unit called Kouchy Trading, which places bets on the opposite side of some customer bets. Executives say the intention is to create liquidity and improve the user experience. Critics, however, argue it creates a conflict of interest and puts customers at a disadvantage. And Poly Market recently announced it was doing the same. Just like Kelshi, Poly Market is using an internal trading team as part of an effort to boost liquidity and support trading on its platform. But many argue that again like Koshi, this could make Poly Market resemble a sports book, especially as prediction markets have recently shifted from politics to sports. This is significant because Shane Copan himself has described sports books as a quote scam that rips off the customer. There's also a bigger issue and that's the similarity to gambling. Basically, prediction market operators have been accused of allegedly exploiting unclear legal definitions allowing them to operate where traditional gambling platforms can't. That's because unlike actual sports books which fall under state jurisdiction, prediction markets are overseen by the CFTC. This has sparked some backlash. But platforms like Kouchy and Poly Market argue that what they're offering is event contracts which are different from gambling, albeit that the legal difference between the two is up for debate. Logically, this creates regulatory uncertainty at the state level, especially since the CFTC can't always override state law. The result is a regulatory patchwork of sorts where operators can be legal in some states but face cease and desist orders or even lawsuits in others. Outside of this, there have also been concerns around questionable contracts and ethical boundaries, especially the darker examples like we mentioned earlier. Some platforms have hosted markets tied to realworld crises like the Los Angeles wildfires in February 2025 or even the war in Gaza. Now to be clear, those prediction platforms didn't create those markets themselves. Users did. But many argued there should be stronger safeguards to prevent sensitive human impacting events from being turned into a kind of digital casino. And honestly, they're not wrong. I mean, it's a pretty grim thought. people betting on catastrophic events and then celebrating when tragedy turns into profit. So then with everything we've covered today, you're probably wondering whether prediction markets are actually here to stay. Well, the answer is yes. Despite all the controversy, it's pretty clear that prediction markets aren't going anywhere. In fact, they're likely to become even more prominent in the years ahead. Platforms like Kelshi are already being integrated into major exchanges like Coinbase and crypto wallets like Phantom. Prediction markets are also being promoted by key players inside and outside of crypto like the aforementioned Vital Butaran who said that prediction markets are better than regular markets or social media. That's simply because contracts settle between zero and one, which he argues reduces the hype and pump and dump nature of other speculative markets like memecoins. Meanwhile, Elon Musk is also known as a supporter of prediction markets, saying that they're more accurate than polls and other forecasting methods because there's actual money on the line. As you'll recall from earlier, some experts estimate the prediction market sector could be worth $10 billion by 2030. But we actually believe it could grow even more, especially if it becomes a leading narrative in crypto like many, including Coinbase, have predicted. Coinbase has even predicted that eventually there could be so many prediction markets that aggregators emerge, becoming the sector's de facto interface. And you can learn more about Coinbase's predictions for 2026 by checking out our recent video right over here. And if you thought prediction markets are purely about speculation, then think again. They're also being used by institutions to hedge against things like policy risk, regulatory uncertainty, and shifts in narrative. Basically, these large players are purchasing event contracts to help offset losses in their equity portfolios. a strategy that's likely to expand in the future. So then this begs the question of how you can profit from prediction markets. Well, as it happens, there are a number of methods. One way is to simply use these platforms to farm for potential airdrops. For instance, Poly Market is expected to airdrop its own token very soon. Another way to profit from prediction markets is to pay attention to what's going on in the world and make educated bets about what could come next, especially if it's clear that the markets are not pricing them in. Now, it goes without saying that this strategy doesn't guarantee profits. But if you're keeping up with the headlines anyway, you might spot an opportunity that others have missed. And if you're not keeping up with the headlines, then you could also use a simple method that's becoming increasingly popular, and that's to bet on outcomes that are almost guaranteed. So, for example, if you see an event contract trading at an 80% probability, then this means there's a pretty good chance of this outcome being the end result. That means an easy 20% profit, in theory, at least. Repeat this a few times and you could make decent returns. Just remember though that all markets are manipulated, including prediction markets. And don't forget that we're living in truly crazy times. Events that seem highly unlikely tend to happen more often than people expect, especially in politics and geopolitics. So pay attention to what's going on, stick to what you know, and good luck. All right. If you want to see how the next major catalyst could come from China, then check out the video right over here. And if you're wondering what challenges Bitcoin will face in 2026, then check out the video here. Thank you all so much for watching and I'll see you again soon. This is Guy signing off."
    }
]