[
    {
        "video_id": "WS9b5tpYiFE",
        "title": "Bitcoin WON, Altcoins DIED!! The Cycle That BROKE Crypto Forever!!",
        "published_at": "2026-01-24T14:00:50Z",
        "sort_date": "2026-01-24",
        "url": "https://www.youtube.com/watch?v=WS9b5tpYiFE",
        "transcript": "Bitcoin spent most of 2025 above $90,000. Ethereum mostly held steady throughout the year. Analysts hailed it as the year crypto became a mature asset class. Meanwhile, your altcoin portfolio is down 95% and crypto Twitter has turned into a support group for traumatized gem hunters learning to trade per. The bulls always say >> this time it is different. >> And for once they were right, but for all the wrong reasons. Today we find out what happened this cycle, why, and what it means for crypto's future. My name is Louis and you're watching the Coin Bureau. Before we begin, I'm not a financial adviser, and nothing in this video is financial advice. It's just what we learned from a new industry report offering answers to some of the biggest questions hanging over the crypto market today. If you find our videos useful, well, smash that like button and let's get into it. Now, when you get burned in the markets, you've got two options. Become disillusioned and tune out, or lock in and learn how you could position yourself better in the future. If you're doing the latter, you clicked on the right video. Today, we're bringing down Wintermute's 2025 OTC trading report. Basically, a market year in review. Wintermute is one of crypto's top market making firms and whatever you think of market makers, few participants are well positioned to understand exactly what is going on in the market at any given time. Many expected 2025 to be the explosive climax of the 4-year cycle. All the pieces seem to have finally fallen into place. Wall Street and even the White House had pivoted hard into crypto. The SEC dragon was slain and Gendler and SPF were down and out. Even Trump and CZ were back in, or at least out in CZ's case. And if you held Bitcoin, you probably had a good year. As Winterm's report points out, there was no failed bull market. The price of BTC appreciated more than 8-fold between the bottom of 15,000 in late 2022 and the all-time high of 126,000 reached last summer. But for our many comrades who don't own much Bitcoin and instead hung their fortunes on an always just around the corner altcoin season that would multiply their net worth, well, it was a sobering year to put it mildly. According to Wintermute, this was the year the 4-year cycle broke permanently. Instead of traditional seasonality, their OTC data shows a year of endless chop punctuated by short-lived trends rather than long seasonal swings. the predictable patterns that used to tell you when to buy and sell essentially vanished. So, for example, that law of nature that says that the crypto market pumps every October regardless of fundamentals. Yeah, that one was a no-show in 2025. Activity was concentrated early in the year with a strong start followed by a grueling softening through spring and summer. Optimism around the new pro- crypto US administration quickly dissipated. Risk sentiment deteriorated sharply by the end of Q1 as the memecoin and AI agent narratives died down. Trump's tariff announcement on April 2nd was a particularly sharp nail in the coffin. But as you could tell from the price of Bitcoin, it wasn't that the money flowing into crypto dried up. It just got stuck in silos beyond the reach of crypto Twitter. Trading activity concentrated into BTC and ETH while only a select group of altcoins captured the bulk of trading activity. This reflected the gradual expansion of ETFs and digital asset treasuries or DATs to larger altcoins as well as the collapse of the memecoin cycle in early 2025. Capital came in, hit the majors, and just called it a day. This pulled the rug out from under altcoin holdlers expecting a rotation of market participants taking profits from BTC and reinvesting them further along the risk curve. Wintermute describes this as liquidity becoming quote more concentrated and unevenly distributed driving greater divergences in returns and activity. which is a roundabout way of saying that the rising tide that was supposed to lift all boats, well, it got trapped in the harbor. Where capital used to flow freely between assets, it now hits structural barriers that didn't exist in previous cycles. And this looks like a permanent change. So, if you want to survive in the new crypto market, you may want to reconsider everything you thought you knew about how it's supposed to work. In 2020, the game was relatively simple. Money came in through Tether, bought Bitcoin on Binance, rotated profits into ETH when Bitcoin got boring, then spilled into altcoins when people wanted more than 15% gains. ETH would pump, those profits would spill into DeFi, and eventually the whole circus would arrive at NFTts and micro caps. Everyone used the same rails, and the liquidity was fungeible. But that world ended in 2025. As Wintermute points out, the main gateways for capital entering the market are now ETFs and DATs. Many of us welcomed the opening of these new gateways because nothing says number go up like institutional adoption, right? But as it turned out, these gateways are also prisons. An ETF that holds Bitcoin cannot sell that Bitcoin to buy Salana. It is legally mandated to hold only the specific asset written into its prospectus. The fund manager can't wake up one morning and decide to rotate into altcoins, no matter how bullish the chart looks. A digital asset treasury with billions of dollars in BTC isn't rotating into altcoins either, thanks to corporate mandates and shareholder expectations that keep that capital locked in place. So these vehicles are structurally bound to majors, providing depth to the top of the market while starving everything else below it. And so the wealth effect that used to reliably follow fresh highs for BTC in previous crypto market cycles was largely absent in 2025. Now this new playing field went through an extreme stress test on October 10th, which marked the largest liquidation event in the history of crypto by a very wide margin. The trigger was ostensibly Trump's announcement of new 100% tariffs on goods from China. But questions remain as to why crypto nuked so much harder than any other asset class. At any rate, it was a bloodbath for the history books with $19 billion in open interest liquidated in a matter of hours. OI stood near $230 billion going into the event with around 70 billion of that traded outside BTC and ETH. Leverage had built unevenly particularly in altcoins. classic late cycle behavior from traders betting on a rotation that never came. The 10-10 event triggered a forced violent capitulation that washed a lot of people out of the game entirely and cut that $70 billion altcoin OI down to around 30 billion by mid December. And what happened next is the most telling observation in Winterm's entire report. In the aftermath of 1010, retail didn't rotate back into altcoins after the flush. They weren't buying the dip on their own destroyed bags. Instead, they appeared to have funneled whatever was left of their portfolio into majors and BTC. The same siloed mature asset that had already outperformed everything else and apparently topped in early October. As fear overtook greed, retail converged with institutional positioning, apparently giving up on the dream of 100x gains and licking their wounds instead. Now, when leverage unwinds and prices gap, the only assets with enough depth to absorb selling pressure are the ones inside the same silos as institutional investors. Everything else becomes exit liquidity. Case in point, Cosmos's native token, Atom, a wellestablished crypto far from a memecoin or micro cap, briefly collapsed from $4 to 0.001 on Binance. So, if you had to pinpoint the moment when the alt season dream died, it has to be October 10th, not because people stopped wanting it, but because the market structure no longer supports it, capital enters through mandate bound channels that physically cannot rotate. And when retail gets scared, they flee to the same assets institutions are locked into by law. And by the way, if you find these market insights useful, well, you can get much more out of them delivered straight into your inbox, our free weekly newsletter. You can sign up for a breakdown of all of the biggest stories in crypto each week using the link in the description. We've also secured exclusive deals for viewers of this channel, including discounts on hardware wallets, signup bonuses, and trading fee rebates on the best crypto exchanges, and a lot more. So, if you're interested in that, well, you can find out more by using the QR code right over here or by clicking the link in the description below. Now, the new dominance of ETFs and DATs and crypto money flow helps explain why altcoins didn't catch a bid last year, but they don't explain why retail stopped showing up in the first place. For that, you need to look at what else was happening last year and where crypto ranked in the attention economy. Wintermute ran the numbers on a crossasset analysis and the results paint a sad picture for crypto. Space stocks were up 64% for the year. Quantum computing gained 34%. AI stocks climbed 31%. Meanwhile, BTC was down 7%. ETH dropped 15.1% and altcoins fell 18%. If there was a narrative war in 2025, crypto certainly didn't win it. The same casual retail investors who were probably buying Bitcoin spot ETFs when they were the hottest assets around in 2024, well, they likely moved on. As Wintermute puts it, these alternative assets quote offer similar risk profiles, narratives, and return potential, but without the structural barriers strangling crypto. Basically, AI stocks became the new casino, and the house odds looked better. Wintermute's regional flow data shows how investors around the world rotated in waves rather than fleeing in unison. For example, when Trump introduced tariffs early in the year, the US and Europe were still net buyers of crypto while Asia was smashing the sell button. Europe redistributed more gradually with selling activity building throughout the summer before easing. The US increasingly started net selling into year end as macro uncertainty ramped up and the Federal Reserve started making hawkish noises. One of Wintermut's more damning findings concern the shortening lifespan of narratives in the crypto market. In 2024, when a narrative took hold, AI agents, memes, whatever the flavor of the month was, it lasted roughly 61 days. You had 2 months to identify the trend, position yourself, and exit before the music stopped. In 2025, that window collapsed to 19 days. So, less than 3 weeks from narrative inception to exhaustion. By the time someone made a YouTube video explaining why a particular sector was hot, the smart money had already sold the top. We remember crypto Twitter complaining in 2024 that the market was too PvP, but compared to 2025, in those days we were still in easy mode. Wintermute attributes the increasing brevity of the markets to quote market fatigue after last year's overshoot, which is a polite way of saying people got burned too many times and they just simply stopped believing. Individual themes periodically attracted attention, notably the perp dex wars, but also memecoin launchpads and emerging payment primitives, but none of them sustained momentum. Projects kept trying to generate the kind of narrative that used to drive altcoin rallies, but conviction failed to build each time. This is what market exhaustion looks like. There was no shortage of narratives in crypto, but the demand needed to sustain any of them dwindled severely in 2025. the capital that used to chase them was busy making 60% returns in space stocks instead. Then as a result, altcoins materially underperformed. Another major theme in Winterme's report is the rise and rise of OTC crypto derivatives. As position sizes get larger and market volatility continues, these are becoming the preferred venue for institutions to trade with size, discretion, and control and to tailor strategies for any market conditions. This was the case for Wintermute's own OTC desk in 2025, where options trading volume leapt up 2.5x year. But it's not just that more people were trading options. The way they were using them has changed completely. In 2020, most options volume came from retail buying calls like lottery tickets on Bitcoin hitting $200,000. You pay the premium to buy the option. If Bitcoin moons, you win huge. If it doesn't, well, you lose what you paid for the ticket. That strategy creates explosive upside pressures because everyone's betting in the same direction. Every dip gets bought because thousands of call holders need the price to go up. But last year, institutions started selling those calls instead. Wintermutes data shows a clear shift in the mix of BTC options flow towards yield generation and structured repeatable strategies. The playbook is straightforward. own the Bitcoin, sell you the call option, pocket the premium. It's yield farming with extra steps, and it's capital efficient since you're generating income on an asset you're holding anyway. Problem is that when you're the one selling lottery tickets, you don't want the jackpot to be hit too often. And yield strategies became even more common throughout 2025 with investors selling puts and covered calls to earn income, adding steady option supply to the market. At the same time, demand for downside protection stayed strong through continued use of longp puts. The market focused more on earning yield and managing risk than betting on further upside. And look, if this sounds boring to you, stop right there because you would need to understand what this means for the price of Bitcoin. Institutions selling call options against their Bitcoin holdings means that Bitcoin starts rallying hard, those short calls move into the money. That means the institution is now on the hook to deliver Bitcoin at below market prices. To hedge that risk, they have to sell their spot Bitcoin. The bigger the rally, the more they have to sell. This is a standard riskmanagement technique called delta hedging. And there's nothing sinister or manipulative about it. But the effect is miserable all the same. Every time Bitcoin tries to moon, there's a wall of institutional selling that reliably shoots it down. You could think of it this way. The old market had gamblers buying lottery tickets, creating explosive demand every time the price dipped. The new market has casinos selling lottery tickets and hedging their exposure by selling into rallies. The house always wins, but only if the jackpot doesn't pay out too often. Wintermute lays this out with the options flow data from 2025. Naked call buying declined significantly, reinforcing that options are being used less to speculate on upside exposure and more for systemic execution. So, the market became deeper, more liquid, and less volatile. Sophisticated counterparties played a bigger role, marked by more deliberate recurring execution that broke away from previous seasonality cycles. Now, of course, options aren't the only well option on Winterm's derivatives menu. The number of cryptos used as underlyings for contracts for difference or CFDs at their OTC desk grew from 27 in Q4 2024 to 46 by Q4 2025. If you're not familiar, you could think of CFDs as a kind of bespoke perpetual futures contract for institutions. like per CFDs are a capital efficient way to access a wide set of assets and sizing options. But even here, Wintermute says these instruments mainly benefited portfolio management strategies last year and not so much the institutions spending on explosive moves. In other words, that's more signs of that market maturation all around. This is great news if you're an institution managing billions of dollars and trying to generate steady returns with controlled risk. But for the retail investor holding on to altcoin bags and waiting for that one last Bitcoin pump that will finally cause profits to spill over, well, this is not how 2025 was supposed to go. The explosive moves that defined previous cycles are being suffocated by sophisticated strategies designed to extract steady income rather than chase moonshots. The market now rewards patience, capital efficiency, and professional execution. And it actually punishes the kind of wild volatility that used to create altcoin seasons. Winter Mut's report draws a blunt conclusion about the crypto market. You have probably guessed by now, but the takeaway is that the traditional 4-year cycle is becoming obsolete. In their words, quote, 2025 provided evidence that market performance is no longer dictated by a self-fulfilling four-year narrative. The predictable post having euphoria, the alt season rotation, the rising tide lifting all boats. Well, these are outdated expectations that no longer fit the structure of the crypto market. What comes next depends on whether liquidity can actually spread beyond the handful of majors that absorbed everything in 2025. Wintermute suggests three ways that that could happen. First would be if the ETFs expand their mandates to include other assets. If they do that, the floodgates open. There are already filings for a large number of altcoin ETFs sitting with regulators. If approved, mandate bound capital gets new destinations beyond just BTC and ETH. The question is whether approval actually translates into flows or whether institutions just get permission to hold assets that they have no interest in buying. The approval timeline depends on regulators which means really it's anyone's guess. Second is that if Bitcoin explodes upwards rallying so hard that the wealth effect overwhelms the structural hurdles to an altcoin season. If prices get really extreme, even mandate bound capital could start to leak. Corporate treasuries might rebalance. Funds could take profits and retail could once again feel wealthy and euphoric enough to reinvest their gains into altcoins. But this requires BTC to go significantly higher than current levels. Enough to overcome the delta hedging pressured from all of those institutions selling covered calls. Not impossible, but you know that's a big ask. Third, mindshare returns to crypto. Tech stocks plateau, the AI bubble cools off, and retail capital rotates back to crypto with fresh enthusiasm. Winter mute marks this as the least likely scenario, and it's not hard to see why. It requires both conditions simultaneously. Stocks get boring and crypto developing a narrative compelling enough to win back attention. That's a high bar when every week there's a new headline about data centers in space, precious metals outperforming everything, RAM facing a generational supply squeeze, and so on and so forth. For now, say a prayer for the market that used to reward buying a particular flavor of altcoins because it's XYZ narratives turned. RIP. Crypto's easy money era is apparently history. And if you want to succeed in 2026, well, you may need to let go of some old assumptions and really take a fresh look at the market as it exists now. And if this has got you wondering how to best 2026 proof your portfolio, or if you should even hold crypto at all this year, well, I've got good news for you. We've made a whole video about what strategies could sink or swim this year and why. If that sounds useful, then you can check out that video right over here. That's going to be all from me for today, though. As always, thank you so much for watching and I'll see you next time. This Lewis over and out."
    }
]