[
    {
        "video_id": "2Qn269cufak",
        "title": "Palantir Stock Reclaims CRITICAL Support Level Ahead of Earnings!",
        "published_at": "2026-01-24T04:04:13Z",
        "sort_date": "2026-01-24",
        "url": "https://www.youtube.com/watch?v=2Qn269cufak",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope you guys all had a good day. We had some interesting moves in volatility within the market, but nonetheless just kind of choppiness and the broader market basically consolidates uh towards the end of the day. What we do see though we're going to be talking about is Palenteer has a little bit of optimism that gets back into the stock and is recapturing a really critical level of support that we'll be talking about and an important zone especially with earnings that's going to be coming up here in just a few short weeks. We'll be talking about how some other commodities are doing like gold and silver. They just keep continuing to go up. It seems like hey when is their cool off going to eventually happen and we'll also be talking about some of the other big names like agentic AI names data center names like I cipher even with Ren with earnings coming up theirelves too. Um and then ending it with crypto. So if you're a new or returning viewer hit that like button subscribe for daily videos and let's try to get 30,000 subscribers on the channel. It would really mean the world to me. Thank you guys so much for watching. pop it up on the screen here. Palanteer is currently up about 2% that we see on the day up about $3 and recaptures basically this 170 level of support. Um we saw a little bit of resistance there at that 171. However, currently it's above its 50 and its 200 moving day going into the overnight session that'll open up on Sunday and also with the markets happening on Monday. I think it'll be important to recapture and hold the 170 zone. If resistance is met here and this gets beat back down, that's where you could see possibly going back to where Palinger kind of hung out at 165 for the week, which is an interesting zone for that because typically whenever we've seen kind of breakdowns with the Palunteer, that's where we've seen moves kind of back into the 150s. However, this stock does like to consolidate between the 170 and the 184. We've seen this since August in September that a lot of consolidation, a huge base between the 170 and the 184 area right here. So, it'll be really important for the bulls to recapture this in the short term because with earnings coming up, that's also going to be bringing a lot of volatility into the stock. Now, currently February 2nd postmarket, we have earnings per share normalized at 23 cents and revenue correlated at 1.34 billion. earnings per share revisions in the last 90 days. You got 21 in the bullish direction and zero in the bearish. So, uh analysts are expecting Palunteer to report good earnings and historically they have done a you know a good job. One of the main things though here for Palanteer that we need to be careful of is that Palunteer is priced for perfection in terms of its earnings. It already carries an insane valuation with the price to earnings right here at 387 and it has re you know it has maintained and has been very resilient to all the bears out there that have been calling the top for Palanteer for such a long time um and Palanteer continues to execute at a very rapid pace. One of the big things, you know, not just in terms of its, you know, actual numbers that we're seeing on the screen, uh, but looking at the fundamentals, they really don't have any big competitors. And I think that gives them a major advantage to the AI software solutions that they're bringing to the both both the defense and the commercial sectors. And with that being said, Palanteer, if they come out with his, you know, a slam dunk earnings, that's where I think you could see a possible breakthrough this consolidation zone. If it does not come in or right in line and does not meet the expectations of a lot of investors, we could possibly see a testing here, a possible breakdown into the 150s, possibly testing that area. So, we'll see what happens. Looking at some of the other commodities right here. I don't currently have any exposure to gold and silver, but it is quite crazy and interesting to see here when are we going to see any type of a silver pullback and is it getting more attractive to possibly look at any put or short, you know, short-term position, especially with these runs here. Now, the markets can be very irrational uh longer than people can kind of wait or stay solvent. So remember that is that you don't just because silver is already blown off this top here doesn't mean that it can blow off even higher. So that's where you got to be really careful. But nonetheless in due time I think these are due for a little bit of a pullback. We'll see what happens though and I'll be keeping a close eye on them. Talking about the general market you see the S&P 500 here basically consolidates on the day closes here point up um 03% uh up about two points. You know nothing crazy. Uh, one thing I do like just in terms of support and resistance and where the market's at near these all-time highs, of course, you know, on Wednesday you had Trump that had alleviated and had canled those tariffs that were expected to be started on February 1st and that's what really brought some optimism back into the market where you have the S&P 500 index that's been able to hold above the 6900 zone now. So, in terms of the macroeconomic situation, and we'll talk about this probably on Sunday night with a video, uh the S&P 500, I think it's ready to have a run towards the 7,000s as long as the macroeconomic situation continues to look well. We saw yesterday that the labor and the economic market and data was showing us that GDP is looking quite well and the labor market isn't weakening as much as we were once anticipating. Yes, that does basically cut the probability for rate cuts in January, but the market I think has already priced that in. So, this is showing you the economy is remaining relatively resilient. I think a test for 7,000 here could be in tune before we continue to see any type of a correction or a pullback considering the recent dip that was bought up here relatively quick was at 6,800 and now we're already over 100 points above that, above some of these key averages. So, we'll see what happens. One of the big things, let's talk about here, IEN, the data center names close in the green today. And you see I ran up here comes up another 8%. This stock is nuts in terms of these swings. Look at these swings. Uh, absolutely crazy. Going from 50 all the way basically up to 57, back down to 50, back up to 57, down to 50, back up to 57. The swings that I ran here have been incredibly crazy. Um and Cipher has been kind of having the same price action uh these pretty crazy swings here. But nonetheless, they've been doing quite well. Um with Iran particularly, why um why this is starting to get exciting here is because Iran moves up its quarter 2 earnings to February 5th amid a possible AI deal speculation right here. So advancing its quarter 2 fiscal earnings by basically a whole week within this conference call right here. you know, recalling the 7 9.7 billion AI cloud contract that they had with Microsoft. Um, this will be interesting to see what happens and analysts hold an upbeat 8485 average price target. So, the price target for IEN uh currently shows a lot of move to the upside compared to what the analysts are expecting. And this earning could earnings could be very very bullish for all the data center names. We're talking about, you know, what's going to be the down and cascade effect for nebius, for coreweave, for cipher, you know, and for I currently like cipher above this 15, 16, cipher has been pretty resilient right here. Any type of breakout through, you know, that 18, 19, possibly 20 area. That's where you could get a retesting of the all-time highs, especially for Cipher right here as it's really built out this base and this range is kind of getting tighter and tighter. Um, in terms of the agentic AI names that we've been talking about recently, like we talked about in yesterday's video, Zeda and Path, uh, down about 2% on the day, these are also very volatile names, but Zetta basically kind of consolidates on the day. What I like about Zetta is it had a nice retesting of that 50 moving average. It had a nice bounce right there. And you see with a decently strong bounce in terms of a reversal. So, Zetta, I like it where it's at. These are big key players that I love for the agentic AI moves uh going into 2026 on top of the AI data center plays. Those are some of the bullish things that I have. And looking at some of the smaller, you know, you have right here that is also in an interesting spot at 1212. Um this is more of a speculative drone defense type company, but um other than that, a lot of the stocks didn't really make crazy moves today, but I do like the resilience and the data center names. talking about what's really not moving at all currently is the cryptocurrency markets. You see Bitcoin that is still at 89,000 really not making any moves at all today. Uh Ethereum still below 3,000 at 2960 also not making any crazy moves here. Um people could be kind of getting exhausted possibly uh as we're seeing a lot of the names in the AI sector. We're seeing nice rotation into some of these more different individual equities that are starting to, you know, maintain and uh experience a decent bid. And you're also seeing that with commodities right now versus compared to digital assets. You know, Bitcoin and Ethereum just aren't moving. Could we see a possible rotation from the commodities like gold and silver? Of course, you know, we don't know what's going to be happening. But with that, you got BMR right here. It's just hanging out at 2863, not making any crazy moves. Uh in terms of BMR, you know, I don't know if I want to get any personal exposure to this right now. It doesn't have a nice double bottom that I've mentioned at 27. Uh just in terms though of the draw down and the beatd down and the crazy price targets that we've heard that just have not come to fruition by those timelines, it's like starting to lose a little bit of I want to say hope, but trustworthiness. Um, I still think, you know, tokenization, digital assets, and their integration is going to be huge as we see the big banks that are continuing to take a big play. But it's just more of a matter of waiting to see that confirmed type of reversal we see as uh, crypto's just been kind of hanging out here in limbo mode. But other than that, that's really all I have for you guys. Hope you guys all have a wonderful weekend. Let me know what you think about Palunteer here. Uh, you think it's going to recapture the 170s, especially with earnings coming up here, and I think that's going to be incredibly important. If not, this thing could further break down. So, peace out. the dig out. I'm going to catch you guys"
    }
]