[
    {
        "video_id": "KXgtdXdbTEk",
        "title": "The #1 Mistake That Destroys Crypto Portfolios (Don&#39;t Let This Happen)",
        "published_at": "2026-01-24T17:53:54Z",
        "sort_date": "2026-01-24",
        "url": "https://www.youtube.com/watch?v=KXgtdXdbTEk",
        "transcript": "It's all about how much you lose when you lose and how much you win when you win. I mean, please remember that because everything is probability. So your success will not be dictated by the number of fails. It will be dictated by how big the fails are and how big the wins are. Okay? So you cannot let small mistakes turn into big disasters. And trust me, I've been there. I've been there. You you buy something, it goes down. You buy the top, you you asking the telegram, \"Guys, what's happening? Is it okay?\" The telegram tells you it's okay. It's okay. It's okay. Buy the buy the huddle. Huddle huddle. Huddle huddle. Okay, you huddle bum another 20% down. You ask, \"Hey guys, what's happening? Is it still you still bull bush bush bush huddle by the zip by the zip?\" You know, it goes down 90%. So you you made the small mistake into big disaster. I mean, how long you've been"
    },
    {
        "video_id": "NadV5KQDgao",
        "title": "Bullish on Bitcoin Long Term, Cautious Short Term #shorts",
        "published_at": "2026-01-24T17:00:37Z",
        "sort_date": "2026-01-24",
        "url": "https://www.youtube.com/watch?v=NadV5KQDgao",
        "transcript": "As you know, I have 30% in Bitcoin anyway, even though it's bearish because I do believe in Bitcoin. I'm a Bitcoin believer. Longterm, I think it's going to do fantastic. It's gonna go to a million bucks, but uh I'm not going to go down in uh like you know like people do with altcoins and in in bare market like they go down a"
    },
    {
        "video_id": "lde0UrETbxM",
        "title": "Why Real Estate Can Become a Tax Anchor #shorts",
        "published_at": "2026-01-24T14:30:39Z",
        "sort_date": "2026-01-24",
        "url": "https://www.youtube.com/watch?v=lde0UrETbxM",
        "transcript": "Real estate it's always easy to buy. You can buy and if you have money you can buy like next hour you can be owner. Then you realize okay how the f do I sell that crap? Oh my god that that that was a different story. That was a different story when I decided to move to move out. Ah yeah that that that's a crazy anchor. So I don't like real estate guys. I'm not a big fan of real estate uh because it is an anchor and many countries have real estate as tax residency test. So I could not check out from Sweden as tax resident before I sold all of them. It was crazy. Not saying that it's bad for everyone, but I don't like that I cannot move that I cannot, you know, wake up tomorrow and and say, you know, I'm out of here because laws change, countries change, taxes change, everything changes. They can change everything so so fast. Today there's no wealth tax, tomorrow there's wealth tax."
    },
    {
        "video_id": "RSfEjEFwtqI",
        "title": "US Inflation, Trump, and the Fed: What Comes Next? #shorts",
        "published_at": "2026-01-24T12:05:06Z",
        "sort_date": "2026-01-24",
        "url": "https://www.youtube.com/watch?v=RSfEjEFwtqI",
        "transcript": "New research research US inflation researchers challenging Bitcoin bulls disinflationary best. So this is going to be super important. How will inflation uh continue moving ahead? Now again some um u Pearson is is this some economy like is is this someone who is trading or just philosophizing? The researchers say Trump era tariffs, tighter labor markets, possible migrant protection, large fiscal deficits, and easier financial conditions could outweigh productivity against strong AI. So, let's see what's going to happen here with inflation. But obviously, if inflation becomes high, the Fed will have tougher time cutting rates and uh this global liquidity expansion will be tougher. Now, Trump is gonna put a person that he thinks he can control, but just like Trump said yesterday during his speech, he said that, you know, he appointed Powell and he said that these guys once they get the position, they change. So Powell was supposed to be Trump's guy, but then he became rogue because once he's there, Trump cannot remove him. So he now needs to put in a guy who can print and hyperinflate or whatever they have to do to bring economy back without any opposition. How can he do that? Let's see. Like and listen, this is not I'm not saying what's what's best for US dollar or or long term. I'm I'm just saying like for crypto and everything, we need the printer, okay? We've"
    }
]