{
    "channel_name": "CoinBureau",
    "channel_id": "UCqK_GSMbpiV8spgD3ZGloSw",
    "channel_handle": "coinbureau",
    "video_id": "aJqZbw4I5EM",
    "title": "Stripe, Google and Amazon Are Betting on Crypto Payments. Here&#39;s How to Profit",
    "published_at": "2026-02-18T14:00:02Z",
    "url": "https://www.youtube.com/watch?v={'kind': 'youtube#video', 'videoId': 'aJqZbw4I5EM'}",
    "transcript": "Recently, payments behemoth Stripe announced it  would add X42 integration, letting AI agents use   USDC for payments on base. Now, this is a huge  deal because it signals that crypto payments   could remain a growing theme regardless of  wider market conditions. The best part is   though that X42 transactions have fallen off a  cliff lately, and this may not be the case for   much longer. Those transaction volumes could rise  again soon, creating opportunities for profit for   those who know where to look. That's why today  we're diving deep into the X42 protocol, telling   you what it is, bringing you up to speed on the  latest developments, and revealing which assets   could benefit the most from its adoption. My name  is Guy and you're watching the Coin Bureau. Now,   in case you've never heard of X42, here's what  you need to know. X42 is an open-source internet   native payment protocol that turns an old dormant  HTTP error code 402 payment required into an   automated way to pay for digital services. Believe  it or not, but X42 was created by Coinbase and it   only launched in May last year. Now, to understand  why X42 is so significant, consider that right now   paying online, especially for small one-off  purchases, means enduring clunky pay walls,   subscriptions, or slow credit card flows. X42  changes that by enabling instant onchain payments   over HTTP, the same protocol your browser uses  every time you load up a web page. But how exactly   does it work? Well, X42's beauty lies in its  simplicity. By adding just a few lines of code,   developers can effortlessly enable their website  to accept X42 payments. And when enabled,   the process goes a little something like this.  The client, that's you, your app, or an AI agent,   requests access to a server, which has the thing  that you want. The server responds with the   standard 402 payment required status and includes  a payment request with the required details like   the price and accepted tokens. The client then  signs a payment using USDC or another supported   token over HTTP and retries the request with the  payment attached. Then a payment facilitator,   more on that in a moment, verifies and settles  the transaction on chain. The server then confirms   the payment and delivers the goods. And that's  it. No accounts, no API keys, and no annoying   verification. And not only that, but AI agents  can pay autonomously using stable coins over   standard HTTP flows. So, no human checkouts or  API keys required. An AI agent can find a service,   pay for it instantly, and immediately move on to  its next task. Best of all, providers won't even   need to set up blockchain infrastructure just to  enable crypto microp payments. That's because X42   uses a helper called a facilitator, which handles  all the checks for them. These facilitators   confirm that the client paid the right amount with  the right token before passing that confirmation   to the provider. As the creator of X42, Coinbase  also hosts its own facilitator on the base   blockchain with no facilitator fees. But it is  important to note that Coinbase also made X42 to   be chain agnostic, meaning it can run on different  networks and accept various cryptocurrencies,   all while using the universal language of HTTP.  And since developers can integrate X42 with just a   few lines of code, this makes mainstream adoption  of this technology highly likely. It doesn't   require complicated workarounds or advanced coding  knowledge. It's basically plugandplay regulations   notwithstanding. Now, we've covered the X42  protocol in greater detail in a previous video,   and you can check that out right over here if  you want to learn more. So then just how much   traction has X42 seen so far and which companies  are actually using it? Well, to answer that,   let's go back to the beginning. In case you  forgot, X42 was created by Coinbase and launched   in May last year. And since USDC is the primary  token used for transactions, that naturally puts   Coinbase and Circle, the issuer of USDC, front and  center for this technology. Since then, progress   has accelerated fast. In September, Google,  that little tech company you may have heard of,   announced an AI agent protocol called AP2. AP2  lets agents transact with each other using cards,   stable coins, and bank transfers via the  X42 extension. Notably though, its launch   was backed by Coinbase, PayPal, American Express,  and the Ethereum Foundation. Also in September,   Coinbase partnered with Cloudflare, a massive  global network that powers millions of websites   to launch the X42 Foundation, a group literally  created to drive adoption of the X42 payment   protocol. The following month, Coinbase introduced  a new protocol for AI agent transactions,   the model context protocol, or MCP. It builds  on X42, letting AI agents hold wallets and send   stable coin payments to one another autonomously.  Visa also joined the list of companies supporting   X42 in October with its trusted agent  protocol or TAP. In their announcement,   Visa said they were quote collaborating with  Coinbase to align on interoperability with X42,   positioning TAP as an ecosystemled framework for  AI commerce. And speaking of which, October also   saw X42 transactions explode, jumping over 10,000%  with volume staying elevated for months. In fact,   2 weeks in November saw weekly transactions  hit roughly 13.7 million. That said, though,   the surge was almost entirely driven  by Dgens doing what DGens do best,   chasing a shiny new narrative and pumping the hell  out of it with a memecoin. Since then, activity   has mostly dried up, and as I record this,  weekly X42 transactions sit just above 71,000,   barely a scratch on the November peak. Still, that  doesn't mean X42 has been forgotten. Far from it.   November also saw Zuplo, an API management  platform for developers, add its name to the   list of companies supporting X42. Now, perhaps the  craziest development though of all happened in mid   December when Coinbase rolled out X42 version  2, just 7 months after the original. Basically,   X42 V2 introduced wallet-based identity, automatic  API discovery, dynamic payment recipients, and a   fully modular SDK for custom networks. Now, this  SDK simplifies custom payment flows, wallet and   identity features, and support for legacy payment  rails. The biggest change though is that version 2   standardizes network and asset identification,  making X42 multi-chain by default. But the   momentum didn't end there. It carried on into the  new year. In late January, Amazon Web Services or   AWS announced support for X42. While February has  also been a particularly busy month, first Ukay,   a global fintech company based in Singapore,  launched its own X42 stablecoin platform,   fully compatible with Google's universal commerce  protocol or UCP. The goal here is to bring stable   coin payments into realworld commerce by enabling  autonomous AI agent transactions. Then Coin Gecko   enabled the X42 extension, letting AI agents  fetch token data by paying per request in USDC.   No accounts or API keys needed. And that very same  day, fintech giant Stripe announced that it had   integrated X42, allowing developers to build AI  agents directly in USDC on the base blockchain.   And also that same very busy day, Coinbase  introduced Agentic Wallets. As the name suggests,   this is wallet infrastructure built specifically  for AI agents rather than relying on traditional   crypto wallets. It lets agents transact fully  autonomously with no human intervention. We truly   are living in the future. And say, if you want to  keep up with the latest developments in real time,   then join the Coin Bureau's Telegram channel.  That's where we share the latest breaking news,   provide deep dive alpha, and give you the most  important market updates, all pinged directly   to your device so you don't miss a thing. So,  sign up today using the link in the description   or the QR code on screen now. Okay, then. So,  now that we know which companies are developing   X42 frameworks, we can take a closer look at  the crypto projects involved. Well, as you've   probably guessed, since Coinbase created the X42  protocol, its own blockchain, BAS is naturally   at the forefront here. That said, though, Bass  doesn't have its own native token, at least not   yet. Bass has confirmed that a native Bass token  is in the works. For now, though, any X42 related   gains are likely to be captured by Ethereum's  ETH instead. Since base is built on top of the   Ethereum network, this becomes even more relevant  with a new token standard called ERC80004. Now, without getting too technical, ERC80004 lets  AI agents discover each other and establish trust.   It does this through three onchain registries.  An identity registry that assigns each agent   an NFT that basically serves as the agent's  ID. a reputation registry that logs client   feedback and a validation registry that enables  third-party verification of an agent's work.   ERC80004 went live on mainet in late January  and could be key to X42 adoption on Ethereum.   That's because it splits protocol duties 50/50  where ERC80004 handles agent identity and   credibility while X42 handles per request USDC  payments. Now, another major player in the X42   payment space is Salana. By early December, Salana  overtook base to become the busiest chain for X42   transactions and has remained dominant ever since.  In fact, in early February, Salana handled over   90% of X42 transactions. Its speed and efficiency  have led some analysts to believe that Salana   will benefit most as X42 shifts from memecoin  mania to serious use cases. And case in point,   Standard Chartered recently forecast that Soul  could hit $2,000 by 2030, saying that quote,   \"We expect microp payment uses to expand as  new applications are built, likely over the   next 2 to 3 years. And we think Salana is uniquely  positioned to capture most of this expansion. But   Bass and Salana aren't the only blockchains  adopting X42. Chainlink has also integrated   it into its runtime environment or CRA, letting  clients, human or AI, start a task, have Chainlink   verify real world data, and let X42 handle a  payment. Avalanche has also implemented X42 RS,   basically a Rustbased version of the protocol.  Then there's Near Protocol, which was actually   listed among the collaborators with Coinbase that  created X42 alongside AWS, Anthropic, and Circle,   meaning NIA has been involved from the start. In  an August blog post, Nar confirmed that it was   aligned with Coinbase's vision for AI agents,  adding that quote, \"The current focus of this   partnership is on integrating liquidity from  base onto near intense for agents to execute   multi-chain transactions.\" Polygon has also  been active developing its own agentic payments   infrastructure around X42. Polygon has positioned  itself as a leading platform for aentic payments   with dedicated documentation, native facilitators,  ecosystem promotion, and significant transaction   activity. Meanwhile, one of the more  recent additions to the list is Algarand,   which in midFebruary added full support of the X42  protocol on mainnet. This comes after the Algarand   Foundation added X42 to Algarand's development  roadmap back in August last year. And we'd be   remiss if we didn't point out Cardano, which  announced that it was testing X42 support on its   test net in late October. To be clear, X42 support  hasn't yet been implemented on mainet at the time   of shooting, but the fact that it's been testing  for months suggests it is coming soon. And so,   by now, you may be wondering what catalysts could  help drive X42 adoption and bring attention and   capital to its related cryptos. Well, one of the  most obvious drivers is further integrations with   Tradfi and fintech firms. This seems likely  given that X42 can be added to virtually any   service with just a few lines of code. As we've  already seen, Amazon's AWS has embraced X42,   suggesting the company could expand its use  of the protocol across additional services.   Similarly, Google has also opened its door to  X42 and we could see similar rollouts across   its cloud and AI offerings. The potential  here is huge. AI agents could, for example,   use X42 to manage payments subscriptions  or even store data in the cloud. Now,   imagine if Visa or another global payments giant  adopted X42 to solve key infrastructure issues.   That would be a massive bullish signal that  would supercharge X42's adoption. Anyway though,   speculation aside, another key catalyst is ongoing  protocol development. As you'll recall, version   two launched just 7 months after the original. So,  a version 3 or other updates enhancing X42 could   already be in the works. With the space growing  so rapidly and AI agents constantly improving,   future upgrades are likely with each building on  what's already shaping up to be a very exciting   ecosystem. Hackathons also play a big role in  accelerating innovation. And as a fun fact,   a dedicated X42 hackathon recently wrapped  up between December and early January,   and the next big development could very well  have been built there first. These events,   which happen throughout the year, often lead  to creative and unexpected solutions which are   announced with lots of fanfare. And one event to  look out for in particular is Ethereum's Devcon,   although that won't take place until November  2026. The silver lining, though, is that this   gives developers plenty of time to experiment  and build in preparation. On top of this,   developer incentives such as grants, accelerator  programs, or bug bounties could spark a wave of   innovation and creative use cases even outside the  walls of an organized event. Beyond these, there   are other catalysts that could accelerate X42's  growth even further. For instance, regulatory   clarity or approvals in major markets could make  institutions far more comfortable integrating the   protocol. But perhaps the biggest catalyst will  be simply seeing X42 in action. As we witness AI   agents using the protocol successfully, this could  create a snowball effect. And in this scenario,   businesses and crypto projects would be scrambling  to add X42 support of their own, hoping to cash   in on the possibilities that this innovative  tech opens up. So then, this begs the question   of which assets could benefit most from X42's  growth. Obviously, some potential winners will   be the cryptos I mentioned earlier. And to refresh  your memory, these include, but aren't necessarily   limited to Ethereum's ETH, Salana's Soul, Chain  Links Link, Avalanche's Avax, Near Protocols Near,   Polygon's Pole, and Algarand's Algo. Cardano's  ADA is another possibility, assuming that X42   is deployed on mainet, as is BAS's native base  token if or when it launches. That said though,   the biggest gainer of X42's growth will arguably  be USDC, the stable coin most frequently used for   transactions on the protocol. Other stable coins  like USDT and USDS, formally die, could also see   significant growth, especially if they become more  broadly used for payments. Now, I know what you're   thinking here. Holding stable coins won't exactly  pump your bags. And well, you're right. But if you   want maximum gain potential and don't mind taking  on the extra risk, there are plenty of other   options. The most speculative plays could be the  utility tokens for crypto projects building the   tools and services that support X42's development.  There are dozens to choose from, and you'll have   to do your research on those in your own time. Pro  tip though, you can find a lot of these projects   under the ecosystem tab of x42.org. We'll leave a  link to that resource in the description below. We   also covered a handful of these projects in our  previous video, and I'll remind you that you can   find that in the description, too. But what if you  want exposure to X42, but without holding risky,   highly speculative crypto assets? Well,  thankfully, there are two options here.   One is Coinbase's Coin stock, which could also  grow as base captures X42's economic activity.   Or alternatively, you could consider circles CRCL  stock, which could also see serious growth the   more that USDC is used across X42 payments. Just  keep in mind though that these crypto stocks will   likely trade with the broader market, especially  in the short term. In the long term though, the   X42 space clearly has serious growth potential.  And while transaction volumes have plummeted for   now, this means that any prolonged draw down in  related assets could be a big opportunity. All   right, folks, that's quite enough from me for  today. But what do you think? Are you bullish   on X42, or is this just a passing fad? Let us know  your thoughts in the comments below. If you want   to learn more about the war between banks and  Coinbase, then check out the video right over   here. And if you want to see how Tether is  coming after USDC, then check out the video   over here. Okay, thank you all for watching and  I'll see you again soon. This is Guy signing off.",
    "sort_data": "2026-02-18",
    "summary_hu": "A Stripe nemrég bejelentette, hogy integrálni fogja az X42-t, amely lehetővé teszi az AI ügynökök számára, hogy USDC-vel fizessenek. Az X42 decentralizált, webalapú fizetési protokoll, amely megkönnyíti a digitális szolgáltatások azonnali kifizetését körülményes azonosítás és API kulcsok nélkül. Coinbase létrehozta ezt a protokollt, amely különféle blokkláncokon kiválóan működik. Az X42 fogadottsága megnövekedett, mivel olyan nagy cégek, mint a Google és az Amazon is támogatják majd, ami a kereskedelmi integrációkat és a fejlesztéseket elősegítheti. Ám a közelmúltban a tranzakciós volumene drasztikusan csökkent. Az AI ügynökök autonóm kifizetéseinek lehetősége azonban fenntartja a piaci érdekődést. A várakozások szerint a stabil érmék, különösen az USDC, jelentős tényezők maradnak a jövőbeli nyerészkedési lehetőségek szempontjából.",
    "summary_en": "Stripe recently announced its integration of X42, allowing AI agents to make payments using USDC. X42 is a decentralized, web-native payment protocol that facilitates instant payments for digital services without cumbersome identification or API keys. Created by Coinbase, this protocol operates effectively across various blockchains. The traction for X42 has increased as large companies like Google and Amazon are supporting it, which could enhance commercial integrations and development. However, recent transaction volumes have dramatically declined. Nevertheless, the ability for AI agents to make autonomous payments keeps market interest alive. Expectations suggest that stablecoins, particularly USDC, will remain significant players in future profit potential.",
    "crypto_sentiment": "Bullish",
    "sentiment_score": 75,
    "key_points_hu": [
        "A Stripe integrálni fogja az X42-t, ami új lehetőségeket teremt az AI ügynökök számára.",
        "Az X42 protokoll decentralizált és könnyen integrálható.",
        "Növekvő érdeklődés a stabil érmék iránt, különösen az USDC irányába."
    ],
    "key_points_en": [
        "Stripe will integrate X42, creating new opportunities for AI agents.",
        "The X42 protocol is decentralized and easily integrable.",
        "Growing interest in stablecoins, particularly USDC."
    ],
    "main_topics": [
        "X42 Payment Protocol",
        "Integration of AI in Payment Systems"
    ]
}