[
    {
        "video_id": "qqHtm4r82-0",
        "title": "IT’S OVER! I Can’t Stay Quiet on Amazon vs Nvidia Stock",
        "published_at": "2025-12-19T14:00:06.000Z",
        "sort_date": "2025-12-19",
        "url": "https://www.youtube.com/watch?v=qqHtm4r82-0",
        "views": 85895,
        "duration": "00:17:57",
        "transcript": "If you own Nvidia stock or you've been thinking about buying Amazon, or maybe you just are in an index fund, but I'm about to show you could change everything about your investment strategy. A massive $10 billion deal just broke that's sending shock waves to the AI chip market and Wall Street is scrambling to figure out what it means. I got a notification for this on my phone from Trade Vision. I'll pop it on the screen for you so you can see it. And knowing those news items the moment they break, not some random time thereafter and not getting any political BS in your news feed is in my humble opinion one of the biggest advantages we can have and it's just about the quality of news. You want news that tells you whether your stock is going to move and we can set that up and trade vision is an app we built where you can literally get that. Try it for free. There's a free trial down below. Check it out. just so I try it for free for a week and let me know whether you still like it. Um, but this could be the beginning of the end for Nvidia's dominance. There's a link down below in the description, by the way, felixfriends.org/tradevision. So, get yourself that news trial so you don't miss these stories because look at the chart. I'm just going to pull up the chart for you straight away here. Right, the news hit here at about 300 p.m. Right? If you'd known that and I had to explain to you why it was bullish for Amazon, well, you could potentially be up 2 and a half%. Doesn't sound like a lot, but it's certainly better than being down two and a half%, isn't it? So, better than a kick in the groin. Is this the beginning of the end in Nvidia, though? Or is it the biggest warning sign of an AI bubble about to burst? By the end of this video, that's my promise. You know exactly what this means for your portfolio, whether you should be buying, selling, or running for the hills or something in between. And maybe you're wondering, why should I listen to this strange guy with an odd accent? Well, my name is Felix Pin. I'm an ex-investment banker. I've seen how this works from the inside. I'm also the founder of the goat academy. We have over 20,000 students. I'm the co-founder of trade vision I just mentioned which is why I know about this story which is where we track exactly these kind of market moving events. And I'm dedicating my retirement to teaching regular investors like you or I used to be how to spot opportunities, how to avoid the traps of Wall Street because they like making money out of you. So, I'm going to break down today a deal that could either make you wealthy potentially or it could wipe out your tech portfolio depending on, you know, whether you keep watching this. So, what just happened? Open AAI, the company behind Chat GPT, is in talks with Amazon for a deal worth at least 10 billion. But this isn't just an investment. This is OpenAI agreeing to use Amazon's AI chips instead of Nvidia's. We're talking about Amazon's Tranium chips. Chips most people have never even heard of unless you watched my video on the Google deal, the Google chips, the Google TPUs a couple of weeks ago. I'll try to put a link around here somewhere for that as well because that's that was the early warning sign, right? But wait for this. Amazon already has a million of these chips in production. That's not a typo. That's a million. A 100,000 companies are already using them through AWS, their cloud services. And get this, Amazon CEO says Tranium is already a multi-billion dollar revenue business. So why does it matter? Well, OpenAI is the crown jewel of AI, right? They're the ones everybody watches. If Open AI switches from Nvidia to Amazon chips, it's like Apple suddenly using Android, right? Saying, \"Google, we want Android.\" It could value open AI at over a trillion dollars. By the way, it makes it one of the most valuable private companies in history. They're raising an extra hundred billion dollars. That's how fast they're spending money. But before we dive deeper, I've got something probably even more exciting than this. And if you want to learn about that, it's my million-doll experiment. I'm putting a million dollars of my own cash on the line here to beat the S&P 500. And to do that, I'm going to spend only 15 minutes a week doing it. That's the challenge. I'm going to break down that challenge. I'm going to train you. I'm going to explain to you how that works, what the system is behind it, and also warn you of the risks. I'm going to do that live at a live training session just over the Christmas holidays, December 27th. Everybody's usually, you know, fed up of all the eating by that point. And it's got a little bit of time to think about, contemplate what happens in 2026. And this could be something that makes my 2026 amazing and yours too if you want to learn alongside with me. So join me for that. There's a link down below. Felix runs along/training. The links in the description. But now let me show you why this is brilliant or insane because some of you might still be thinking, Felix, didn't we just hear the story? Yeah, and you're kind of right, right? A few weeks ago, everyone's freaking out about the GPUs, the TPUs rather from Google. Google should really have just called them GPUs, right? Because they're Google TPUs. That would have been confusing. So Google was supposedly in talks with Meta to supply billions of dollars worth of TPUs. Morgan Stanley predicted Google could produce 7 million of these by 2028 and be a huge business. Everyone said the game is over for Nvidia. What actually happened is look, I warned this about this in my video and I'll link to it down below somewhere. But the reality is that Google's TPU is about twice as cheap as Nvidia's chips at scale. But Nvidia still controls 90% of the chip market. Why? because of something called CUDA, CUDA. That's Nvidia's software ecosystem. Every AI developer in the world knows it and uses it. So being cheaper doesn't automatically win the market. You see, Nvidia's GPUs work everywhere. In the cloud, on premise, on the edge, everywhere. Google's TPUs, they work mainly in Google Cloud. You guessed it. Yeah. So, there's a huge limitation there. So, why is Amazon doing this? They're following the Google footstep. Well, let me break down their strategy. And it's actually pretty clever. They have a three chip approach. So they're not just making one chip. They have three different chip families. Graviton for general compounding, inferentia for running AI models, and tranium for training AI models. Now, Trrenium offers 30 to 40% better price performance than Nvidia's comparable chips. And the upcoming Tranium 3 is four times faster than the last generation. and Tranium 4, which would be another generation of chips, is already in development and will work with Nvidia chips in the same system. So, what's it all about? Look, Amazon put 4 billion into Anthropic. Anthropic is OpenAI's biggest competitor. Anthropic is using 500,000 of these Amazon tranium 2 chips right now and they're expected to scale to over a million by the end of actually this week, literally end of 2025, end of next week. So Anthropic's Claude AI model was trained entirely on those chips. So Amazon isn't trying to kill Nvidia. They're trying to give customers choices. If you're running massive AI workloads on AWS, you can now choose NVIDIA chips more expensive but proven and versatile. Amazon chips cheaper, but you got to be locked into the Amazon AWS ecosystem. So, it's about reducing cost. It's about locking in customers into Amazon's cloud. But here's where this gets interesting and just a little bit scary. OpenAI is reportedly losing $5 billion in 2024. That was last year, right? $5 billion. This year they're going to lose a lot more money. Their costs are significantly higher than their revenues. Nobody quite knows what they are. Somewhere their revenues apparently somewhere north of 10 billion. We don't know what it is. It's a private company, right? So estimates are they're losing I don't know 10 15 20 billion this year, right? Deutsche Bank estimates they could burn through about $150 billion by 2029. So when you see OpenAI talk taking 10 billion from Amazon, is this a strategic partnership or is this a company running out of money and taking whatever deal they can get? Especially if Amazon's chips are cheaper, which they are. Cuz think about this, Amazon gives you money. You're going to stake in Open AI, which is what everybody wants to stake in because it's like, you know, apparently the greatest thing since sliced bread. But they're going to give you the money back and buy your chips for it. So actually, you are going to make a pretty nice margin on those chips, right? maybe 60 70% if you're talking about Nvidia type margins in which case you didn't give him 10 billion you gave him three billion for a 10 billion share in open AI so suddenly this looks like a pretty smart investment by Amazon and now you also get open AAI locked in more into the Amazon cloud system which is going to be good for Amazon because a lot of people want to use open AI so smart move on Amazon I would think so and I think the stock market seems to agree if you look at the chart here and And there's here's something else. Look at I always look at this. Look at when you get news out like this that's big moving the market, right? Go into the dark pools in trade vision here and and pull up Amazon like I have here and look for that day. This was a Wednesday. And look, institutions were bullish that day. They bought almost $6 million of call options, right? Someone spent $1.7 million, $1 million on call options. And it makes me always wonder, well, did somebody know? Somebody always knows, right? That's the way it works. And then you look at Nvidia at the same time. Did that crash? Did Nvidia crash in the same time? Where's Winston? Winston, come on here. Come on here. Come on here, young boy. Okay, sit down. Sit down. Sit down. Show your beautiful little face. There he is. Good morning. Did you have a nice morning? Just come back from his little hike with his pals. So, Nvidia, no, it did not crash as a result of this. Part of that's also got something to do with this chart here, which we're going to get to in a moment if you really want to understand the AI world. But there is a concern out there that there might be a massive chip glat coming up. Think about it. Amazon a million tranium chips in production. Google projected to make 7 million chips by 2028. Nvidia selling over 2 million B200 and 300 chips this year. That's 10 million AI chips just pouring into the market. And then you get all these circular deals. And this is the part that I'm probably most concerned about. I'm actually not concerned about chip clouds. I think there is plenty of demand for for for fast AI chips, but this little thing here is kind of concerning. So, you have up here Nvidia. You have Open AI in the middle. Open AI. I think I'm making this a little bit too large. Nvidia gave Open AIN billion dollars. Open AI then uses that money to buy chips. Yeah. So, it's circular, right? It's just money moving around. Big tech is projected to spend 400 billion on AI. Delete that. Delete that. Microsoft is spending 80 billion this year on AI. Meta 70 billion. Google 90 billion. Amazon 125 billion by next year. And what we've never seen before and you know by the way the Amazon deal is the same thing, right? You get Amazon over here, Amazon, they give them 10 billion and then OpenAI goes and buys chips. Yeah. So they send the money straight back basically and everybody's valuation goes up and you're kind of thinking a bit it's a bit sketchy, isn't it? It's a bit bit dodgy accounting possibly. So what's the concern here? Well, Goldman Sachs, the investment bankers who look after fluffy kittens, you know, the ones with a golden heart, those guys, that's why they're called Goldman. Um they found that these hyperscalers, you know, your Amazons, your your Metas, your your Microsofts, have accumulated debt. And normally these companies have so much cash flow that we're not concerned about their debt. But just last year they accumulate in the past year they've just accumulated 120 billion debt. That is an increase in 300%. And some companies are now using specialurpose vehicles to hide the debt of their balance sheet. Does that sound familiar? Well, it's what Enron did. It doesn't mean it's an Enron scenario, but it's a it's a it's a dodgy way of hiding your debt. And then you have an MIT study. The nerds at MIT say that 95% of companies investing in generative AI got zero returns. Maybe this is a little earlier. They don't know what the heck they're doing. But the real number is this comes from Bane, big consultancy out there. They say to justify the spend to get a return on investment on all the AI spend we need two trillion in AI revenue by 2023. That's a lot, right? That's more than the combined revenue of Microsoft, Google, and Amazon and Meta. So, we're saying they all need to more than double their revenue. kind of interesting, right? So, there is a parallel to 1999.com bubble. There's massive spending, skyhigh valuations, no clear path to profitability, and even Sam Oldman and and Sun and Pitch the the Google CEO saying there is over excitement in the AI market. Right? But now, before you all panic and sell your Nvidia stock, let's talk about why Nvidia is is is not dead in any way, shape, or form. Right? Nvidia stock is up an insane amount. They have this moat. What is a moat? It's it makes it hard for other companies to come in and steal their customers because they are basically the language of AI. It's called CUDA. Every AI developer in the world knows it. Every AI framework supports it to to switch from CUDA to Amazon system called Neuron or to Google's XLA. It just isn't that easy. It means you got to rewrite code. You got to retrain systems. You got to take risks. Businesses don't like that kind of risk. So Nvidia chips work absolutely everywhere. They are the fastest. They're the most versatile. What these companies are doing like Amazon and Google, they're building specialized chips for specific tasks and that could allow them to run and offer these services cheaper in their cloud. That's really what this is all about. Demand for chips still outpaces supplies, right? There's a strong buy rating on Nvidia. You got it on here. You see strong analyst price targets and and all that kind of stuff. And if you want to see the the full news story here, again, we always have a live summary for all these big stocks that tells you exactly what's going on. We get news alerts for exactly these kind of stocks. And you can literally just set that up in trade vision. Just click on the news alert settings here and just for any watch list you have. So you can just say, I want it for all of the S&P. I want it for all the S&P 500 stocks. Or you could make your own watch list like I have here for example or you know and then you just get news alerts for those stocks. So you could add a ticker to it and so on. Very very very easy to do and then you're going to get these alerts ping up on your phone um like I showed you at the beginning so that you are the best informed person out there. But look, it's not the end of the world. It's not the end of Nvidia. Amazon is using Nvidia chips alongside their own, right? So no one people are just trying to diversify. They're trying to reduce their cost. And yes, that will down the road create some competition for Nvidia. But at the moment, the demand is so insane that it million extra chips here or there doesn't really make much of an impact. Now, do I like Amazon here? Yeah. Let me go back to a day chart. It's a stock that's done absolutely bugger since December 2024. But look at the core business. I feel it's gotten a lot better. That's my personal opinion. So, yeah, I think it's an interesting stock to like dive a little bit deeper into. And if this open AI deal goes through, it's validation for Amazon's chips, which makes Amazon's chip business more valuable, which is good for Amazon, right? But people out there telling you it's the end of the world, Nvidia's over and so on, no, that's clickbait, or just poorly informed chaps in my humble opinion. So Winston is still a bull on AI chips. But you also got to be careful and you also got to look at, look, there are other ways to make money. You look up one of my best performing stocks in my portfolio right now is uh is underwear, women's undergarments. Victoria Secret, that's up 130% in 77 days. There are no AI chips in there that I'm aware of. Or you could look at, you know, gold or any gold miner, right? Gold's been on a tremendous rally. Still looks like a tremendous rally if you're asking me. Again, I'm not telling you to buy it, but you know, the uh the gold miners are looking pretty good. So, there are other ways to make money. And all I'd say always is be a bit diversified. Don't just be all in on this AI thing because at some point this is going to crash. It will. We won't always have days where Micron comes out and says everything is amazing. Their their their guidance was just a record quarter. Um bullish news just everything was bullish, prices going up, margins going up, demand going up, just insane. So the stock jumps really really nicely 10% in a day. And that obviously helps to keep the AI market and and and bubble going. But yeah, we're going to hit you're going to hit a bubble and the bubble will burst at some point. Doesn't mean I'm out of it. Doesn't mean I'm like not participating it because bubbles can go on for much longer than you think. But you also got to have a plan B. What happens when it pops? What are you going to do? How are you automating your exits and everything else? And you want to learn more about that, come and join me on December 27th live. and I'll walk you through how I'm risking a million dollars of my own money to show that and to experiment with that system uh live for my students. And in the meantime, I wish you a very happy Christmas and um a beautiful end to the year. All the best. Right now, something strange has happened. The stock market is near an alltime high, but at the same time, more people are losing their jobs. That doesn't usually happen at the same time. By the end of this video, you'll understand what's"
    }
]