[
    {
        "video_id": "QT89hMsSqiE",
        "title": "Palantir Slides as Investors Prepare for 2026!",
        "published_at": "2025-12-27T05:03:47.000Z",
        "sort_date": "2025-12-27",
        "url": "https://www.youtube.com/watch?v=QT89hMsSqiE",
        "views": 4917,
        "duration": "00:10:09",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. I hope everybody had a great day and I hope everybody had a great Christmas for those that celebrate. We're going to be talking about the trading session that we got today on Friday. Uh not a ton of big things. We actually see some more of the individual names that are selling off a little bit. However, with some resiliency within the actual index of the S&P 500. We're seeing silver that is continuing to go on some type of a crazy run. I mean, I don't personally own any silver right now, but it's like what the heck is going on after it stayed stagnant for so long. And on top of that, we'll be talking about uh what we could be expecting for the whole supposedly Santa rally that's supposed to begin next week. Um, and what kind of things are happening within the cryptocurrency community uh as we see some interesting things happening with BMR and Bitcoin that is still kind of struggling to catch a bid uh even though the other commodities like gold and silver are doing quite well. Um, digital gold is still trying to find its grounding. Now, if you're new or returning viewer, hit the like button, subscribe for daily videos. We're trying to hit 30,000 subscribers. Let's see if we can do it. Pop it up at the screen here. Let's talk about Palunteer first. Palunteer falls about 3% on the day. You're seeing a lot of these individual names that kind of have the same amount of selling pressure. Uh, we see that especially with the AI data center trade today. Stocks that I've recently like Cipher and I all seeing a bit of selling pressure. Uh, personally, a lot of these things aren't any type of red flags or anything like that. To me, we see no individual big news. This is more, I think, just more low volume kind of, you could call it manipulation or kind of just more just low volume selling pressure across the board. Uh, none of this is really batting an eye. I don't think a ton of people really care about the markets today. Just kind of giving a quick summary. Uh, but you see Palanteer comes down here about 188. you know, in terms of its price, in terms of its fluctuations, you know, I don't really, as long as paneler hangs out here between this 170 and this uh 86 zone, if we'll see if support is kind of tested at this previous resistance if we kind of have of a a support resistance flip possibly right here. Uh, you know, with this being said at that 187 Palunteer, uh, there's a lot of consolidation here. Palanteer is just continuing to build its base and um I think over 200 is still a possibility for next year in 2026. Uh in 2026 I think we're going to see a little bit of volatility. Uh but I'm still re you know kind of giving a bullish type of outlook personally. That's what I'm still personally expecting is more of a bullish year. I think we're going to close in the green. Uh let's talk about here Nvidia because Nvidia actually helped with some resiliency within the broader index today. Nvidia actually closes in the green. And you can see, like I said, a lot of red here on the board on the watch list that I currently have. Uh, looking at some of the individual names, but Nvidia holds quite well at 190 here. You know, one of the big things that we had from Nvidia, of course, was the $20 billion Gro AI deal. Uh, you also have shares and Nvidia closing above this kind of 180 190 zone. Um, you know, in terms of this 180 190 zone, Nvidia's done a, you know, a lot of consolidating here, kind of like Palanteer, uh, between this 180 and the 190 area. Uh so the fact that Nvidia is now above that, we're seeing kind of some bullish call buying here, projections towards 220, 240. You're seeing Bank of America, other big analysts that are hiking up these price targets at 275. Um and with Nvidia's, you know, leadership as long as the AI industry continues to do well. You know, I think you're going to continue to see resiliency here for Nvidia and possibly some moves back up to 200 if we do see more do see more momentum um into the market. Now one of the big things that we are seeing uh you know in uh oh I saw this on about Palunteer right here. I thought this was interesting. You know one of the biggest criticisms for Palanteer is its actual price to earnings ratio. Uh right here it says that you know Palunteer now trades actually at a lower forward valuation than Tesla. That the forward PE of Palunteer is 196 compared to 223 uh times for Tesla. So, you know, in terms of how long Tesla's been trading at these, you know, large forward price to earnings valuations. Uh, you know, we give Palance here a ton of criticism in terms of its valuation. A lot of the, uh, institutional retail community does, but hey, I mean, Tesla is actually currently trading at a higher forward PTE ratio. So, um, interesting to see there. Just thought that was cool to share. Uh, but nonetheless, cutting it back to the markets here with Nvidia. Huge Grock deal that we saw. Of course, what does this mean for the index? Uh S&P 500 still closing above 6900. I really do like that. Um above 6,900 here. I think this is pretty bullish in terms of the amount of consolidation that we had in the 68s. Uh and still the S&P still above its 50-day moving, its 200 day moving, but holding about that 50-day moving average. I think this will be important for the final week heading into uh January. We're going to have one more trading week here. Uh it'll be interesting to see what happens with a few trading days left. In terms of the index, I like it above 6,900. Like I said, I think the bulls still have some control. Now, you see it only closing down here 2.03%. Uh, in the after hours, you know, we continue to see maybe a little bit of some selling off, but nothing too crazy. Uh, what we do have though is a lot of the names like Cipher and IN, you know, coming down about 6% 5% respectively. I like I run here at this 40 area. This is an important support area because there recently here was this kind of triple bottom for IR right about that 40 before we saw kind of further selling pressure back down here into the 33s. Um you see Iran is currently at that 40. We'll see how that support gets tested in the next uh market open. And you see Cipher is kind of hanging out here at the 15. Also has a decent amount of support in the 13s and at the 14s with some consolidation there. And that was the previous local bottom was basically at 14. Uh, so I do like Cipher right here, especially with their recent like 200 megawatt deal. Um, that's expected to be fully energized I think in quarter 4 2027. So doing quite well. Um, in terms of uh, silver, this thing has been flying here. We'll see if we see any type of a rotation from these commodities at all. Uh, cuz silver has just been on an absolute run. I mean, just looking at this uh in the last 3 months here, you know, back in October, this was at $41 and now it's up about 9% of the day, basically 10% of the day at 7160. So, like I said, I don't have any personal exposure to silver right now. Interesting to see for people that invested in it uh especially during kind of we saw the first correction in October or November basically where we saw a large individual drop off of some of the names uh some of these names here. Cool to see for those people that have been long on silver. Finally seeing Tariq in some of the rewards. So, congratulations to some of those longs. Uh let's talk about and getting off the names here because relatively they're all about the same. Like I said, uh we do have Nvidia like I said that showed a lot of resiliency in today's market. Uh crypto still struggling to kind of catch a bit. We saw Bitcoin, what was it over the last few days? I think on Christmas even got a little bit of a bid for a second. I mean, look at this price action right here. It's like what the heck is going on Christmas? You know, Bitcoin goes goes from 87 up to about 89 right here and the retreats right back to uh 87. So, not a ton of crazy things happening. Ethereum still struggling to hit that 3,000 or recapturing that $3,000 level floor. Uh still right underneath that. Not a ton of trading going on there. And BMR sitting right here at $28. One thing that I don't like to particularly see for BMR is that it's under its actual $30 level of support. Even though that the price is highly correlated to Ethereum's volatility and movement of course uh it does have its own kind of technicals and trading. So you know BMR right here at 2810 below 30s you know for those dip buyers out there that are long you know this could be a possible you know obviously opportunity for people that have a long-term kind of time horizon and bullish outlook for Ethereum. What we are seeing though here BMR just staked about 200 million Ethereum. So it's cool to see here Tom Lee is starting to stake BMR. Why this is really really awesome especially for those BMR holders is because uh that brings a lot of revenue onto the balance sheet which can be really good for earnings and can help bring just additional revenue into the actual overall company. On top of that we're also seeing here I like to follow the Bronx Viking right here. He does a lot of posting on order flow and I like I think order flow does have its time and its place in the market though it doesn't all you know it doesn't all always come to fruition. Um, I think it is interesting to see and it's interesting to see the order flow before we see big moves within some of these stocks. What we're seeing right here is large amounts of call volume coming in for the $65 call uh for June 18. So, it's being hammered right now. Uh, big hit for them basically looking at this candle premium right here. You can see at about uh right underneath half a million. So, nonetheless, we'll see what happens. You know, Tom Lee's kind of maintain this. We've seen him go back and forth. I mean, end of the year price targets are definitely not going to be hit for what he was calling. Uh, and this just shows, you know, at the end of the day, you can't, you know, fully trust even some of the top guys in on Wall Street and getting involved into the cryptocurrency community. Um, basically, you got to go with your own gut and you got to be able to make your own decisions because sometimes if you follow and I think Tom Lee did kind of um probably hurt a lot of people in terms of their portfolios. uh but even though historically I think what we've seen is you know not he doesn't isn't always the best with the time calling uh but is more better with the targets you know not you know not when it's going to happen uh but if it's going to happen so that's what we're kind of looking at right now but nonetheless other names that I'm looking at you know Hood right here at 117 uh SoFi right here at 27 SoFi has just been kind of hanging out here I'm pretty bullish on SoFi do have some personal exposure right now I'm expecting hopefully SoFi with all their product roll out to hopefully be catching a bid here But um other than that, I hope you guys have a wonderful weekend. Get some time to mentally relax here and kind of gear up for uh when probably traders and the market's going to get a little more serious next week. Uh especially going into 2026. It's going to be a very interesting year. Let me know what you think, guys, what you guys think down in the comments. Peace out. Take care. I'll catch you guys later."
    }
]