[
    {
        "video_id": "g_cFoSKrUdE",
        "title": "⚠️WATCH IF YOU OWN #PLTR #SOFI #NVDA #AMD #HOOD #TSLA",
        "published_at": "2025-12-27T14:00:06.000Z",
        "sort_date": "2025-12-27",
        "url": "https://www.youtube.com/watch?v=g_cFoSKrUdE",
        "views": 77924,
        "duration": "00:20:30",
        "transcript": "Felix and Winston here. And if you're worried what your favorite tech stocks are going to do at the end of 2025, in the beginning of 2026, then this is the right video for you. We're going to walk you through, let me pull up my list. I've got my little watch list here. Nvidia, Google, Amazon, Meta, Tesla, Oracle, Palanteer, AMD, Hood, SoFi, probably look at some silver stocks as well. Now, how did the market do on Friday? Well, largely I would say it doesn't bloody matter. And I'll tell you why. Let's look at the chart for example of Palanteer. It's down 2.8% here on Friday. Right down some more um after hours I believe. Now if you zoom in a little bit and down here you see the volume bars and that volume number. Let me just get a pen. That volume number shows up here at the top where it says V. Now when on a normal day it's about 40 million 50 million even even 76 million here last Friday and yesterday on Friday it was 500,000. So say if the average is 40 million or even 50 million and on Friday we have only 400,000 then that's like less than a percent of the usual trading volume. Why is that? Well, all of Wall Street's on holiday just like you, right? They're all on their yachts in the Bahamas, you know, out with mistress number three checking out the fourth holiday home. Exactly what you're doing over Christmas, right? So, no one was trading on Friday and even on Thursday and even on Wednesday, you saw less and less and less people actually in the market. So, we must be careful how we interpret this data because we want to discount some of that to come to a better conclusion. So, let's then kick us off with where's me watch list? Here it is. Let's start with the AI boys. Nvidia had a pretty good day on Friday. Am I therefore saying not important? No. Same story applies. Look at the volume. The volume was 3 million. It's usually 150 million or or or more. So again, irrelevant volume. Ignore Friday. What can we deduct from the entire week that we've seen here? Well, where are we? Can you see the yellow line in the middle of my chart? And by the way, the chart I'm looking at here is trade vision if you hadn't realized that by now, which is where we get all the good data from. We get we can look at the dagpool data. We can see what institutions we're doing the last three days on all the major stocks. You can see that live for example. And then for me really the most useful, most powerful thing is that for all the stocks I care about and only the stocks I care about, I can set up live news alerts. So, I just click on news alerts here and then for any watch list I have, I mean it's quite a lot. Um, I can turn on news. So, maybe you want to get NASDAQ news. Maybe you don't care about NASDAQ news. Maybe you only want to get news on, you know, robotic stocks or whatever your watch list happens to be and then they'll pop up the moment it happens, when it happens. Why I'm mentioning to you is because we are running for another day in a bit a crazy Christmas discount. So, you can um you can save a lot of money if you sign up with a free trial. The link is down below. Trade vision. It's literally is a zerorisk thing you can do today is get yourself a free trial subscription and if you don't like it, you cancel it. If you like it, you say, \"Brilliant, Felix, that was a good one.\" So, let's go back to good old Nvidia. So, what are we seeing here? Well, there is almost the sort of yard stick. That yellow line there, that is the 50-day moving average line, and we're above it. So that's a good thing, right? So no nothing bad happening here. But if you zoom and just look at sort of recent highs here, we're basically going sideways, right? We've been going sideways since August. Now, is that a bad thing? Well, look, the longer the sideways action, the bigger the potential breakout. Just looking at some of the data, Nvidia's last generation of chips, the Hopper, still brings in more revenue than any other chip company out there. So, they're just so far ahead, it's kind of hard to really say much about that. Um, AMD slightly different story. Why? Well, AMD, and again, I bought some AMD somewhere down here, sold it somewhere. I can't remember where because it's always automated. Again, you always want to have an automated exit. But that's always my mantra. And we seeing that yellow 50-day moving average line here. It's going up and then it's going down. That is always a warning signal. Now, you might say, \"But Felix, I got married to AMD. We're deeply in love.\" Well, don't marry your stocks. Marry your spouse. Look after your family and your furry ones. But stocks, they come and go. We don't care what stocks we make money with. Don't care at all. I have zero affiliation with any particular stock. And AMD at the moment does not look great. It doesn't. It's um significantly below the 50 moving average line here. That one's sloping down. No real momentum. It's going sideways. It's not terrible, but it's definitely not good. Um what why what are we watching before? Well, there is that gap up here. At the moment, we're still holding on to that. That's quite good. And it might well keep going up. But at the moment it's saying to me, can you please go and find something more exciting to look at? So look at something more exciting. Google. Google is the exciting beast of the year. Now Google, if you look up valuations, cheapest tech stock out there pretty much. Don't quote me on that, but more or less. Um, and people are saying, well, they're going to replace you. I mean, you know, they're going to replace search. And they're not. I tell you why. For example, we literally just launched this um we just launched this indicator experiment. I'm putting a million dollars of my own money into into it just called trend monster. And if you type in trend monster trading, what comes up? Ah, where's my AI result? Normally it pops up in the top here, right? Trend monster is mentioned name specific high capital swing trading strategy used by trad involves investing a million dollars into this utilizing a VIX system. Um ongoing debate amongst traders. Well, we just launched it. So anyway, they they know about it and we haven't literally put anything out about it yet. So what I'm saying is that I think Google has such a dominant market share and AI is getting really very very good. That wasn't the greatest example in the world, was it? But you get the idea that um I wouldn't write them off in any way, shape or form. And at the moment, you see the bottom end of this channel here and every time we bounce off it, we kind of make money, right? Doesn't mean it's necessarily going to happen here, but this is actually looking pretty good. We're above the 50-day moving average line. um very little overhead resistance like only about four people in the world have ever lost money on the stock which is is that sad lot. So, it's just a stock in an upward trend. It just looks continuously bullish and bullish and bullish. And then if you look at say the darkpool flow, which I hadn't done yet. So, let's have a look at that for Google here. And again, I'd ignore Friday because everybody was on holiday. So, we were on Friday here. Let's go back to Wednesday. And well, institutions didn't do much, but the volume was super low. What about Tuesday? A little bit higher. Still not a lot going on there. So, I guess everybody was on holiday all of last week. That's the way I would look at that because not a lot of activity there. So, probably not the greatest week to look at what institutions are doing because they're just chilling on a boat somewhere near you. Now, Amazon is a stock that's been stuck much worse than broke my pen. Uh, let me find another pen. Have a backup pen. Always have a backup plan. That's what I always say for uh stock annotations and everything else. But what do you see? Well, I could maybe also just use the inbuilt trade vision things. Basically, what am I doing here? I'm connecting the recent highs and sort of the recent lows. Doesn't have to be super precise. And what do you see? Stock's done absolutely bagger all. It's trading again where it was in August. It's gone absolutely bloody nowhere. And is that a bad thing? Well, again, it depends on perspective. If you zoom out a bit more, you actually see it's far worse than you thought because we're at the same levels we're at in early 2025, late 2024. So again, you got to ask yourself, did Amazon become more profit profitable? Do they have more subscribers? Do they have uh more market share and more billions rolling in from the cloud computing and so on? And the answer to all those things, in my humble opinion, is yes. So from a value point of view, some of the big stocks are actually looking pretty good because they've underperformed. Amazon looking pretty good here. Now, Bzos has been selling quite a lot. That didn't help a lot, but that looks pretty good still. Now, Meta is one that I'm watching because Meta like all stocks moves in a pattern, right? And the fundamental pattern to the market is just fear and what institutions are doing. And then there is the secondary pattern, which is what individual stocks are doing. And what can you see? Well, it goes up, it goes sideways, it goes down, it goes up, it goes sideways, it goes down. And right now it seems to be potentially recovering, potentially starting to go sideways. Um the question is how far up will it actually go here? So what do we look for? Do we buy it at this point? No. Um I wouldn't buy it at the moment it breaks through like here, you know, it wants to break free. Looks good in hindsight, but it's insanely risky because a lot of the time it sort of does that and then it actually starts to continue to collapse, right? like here for example, it did that and it went down pretty harshly. So, I would always wait for the 50-day moving average line to flatten out and start picking up a little bit here. And that would be the moment I'd want to see some volume support. And there is some significant resistance up here from those buggers who are likely to want to sell. So, I would wait for this to grind its way up a little bit more. But again, it could be a good play because it's such a brilliant business, such a brilliant advertising business. What about Tesla here? Tesla actually looks very good. And again, ignore Friday's data completely. Every short seller in the world tries to start something on that Friday when there's really really no volume whatsoever. Like how many shares were traded? 700,000 Tesla trades were drove. The few previous days it was about a 100 million. So it's really just nobody showed up. Just you and your mom were trading basically. So what's going on here? Well, look, we've we're backed these recent highs, but that's the Friday selloff. Ignore that one. So, we're essentially significantly above the 50-day moving average line, right? We've had a really nice strong rally. We had some pretty significant volume up there as we're kind of consolidating. So, where is it going to hit its head? Well, what if we could see where institutions were potentially buying and selling? Well, we can actually see it. And it's called a resistance line. It's at $500 right now. We're trading at $470. So, it's $30 up potential without hitting our head. How do we calculate that? That's a little complicated, but essentially we take all the all the options positions in the world and on the basis of that we can calculate how the market hedges their positions. It's a bit complex, but ultimately it gives us a pretty good indicator of where we top out or where we bottom out. Now, going back to the AI theme here, Oracle still getting caneed, right? Why? Well, look, it's a heavily heavily heavily indebted company. They're just leveraging hoping that AI is going to pull them up and if it does they'll make a lot of money because it's heavily leveraged but if they don't and we get a bit of an AI lull where we kind of thinking oh might be might be a bit overpromised type thing for could happen for a period then the stock's going to keep keep falling like a like a knife. So am I buying it here? No. Am I buying the dip? No. Do I ever buy a stock because it looks cheap? Absolutely not. And maybe you think that's a bad idea. Well, there are plenty of examples of companies that just made no sense. Um, I mean, that may never ever recovered, right? You know, look up talk to plug investors, right? You have brilliant rally of late, but zoom out a bit and uh people are still down, you know, 95%, 98%. So, just because something looks cheap like plug looked cheap here, right? It looked cheap there, it looked cheap here and here and here and there and then continues to get cheaper and cheaper forever after. So buying something because it's cheap is like the worst world's idea. So Oracle, I'd sit a heck away. Wait for that to rebound. What about Palunteer? That looks much healthier from where I'm sitting. Why? Because you get this beautiful zigzag pattern here. Um sort of zigzags out roughly approximately in the same zone. And we're at the top end of that. We actually broke out of it in the middle of last week. And then again Friday, ignore it. We went a little bit lower. So, this looks like it's set up to actually it wants to keep grinding higher. I would just wait now for it to take out last week's highs because kind of need to do that before we move higher up. But maybe we take one step back actually from the stocks and we look at hood and sofi as well. There is the one thing that we look at and that's what the whole live trading is is all about. Trend monsters is all about and there's a there's a live session for that in a couple of hours from from us releasing this. You want to join me on that? felix.org/training. Um there's a link down below. Join me for that. And people don't really understand the VIX and people always think you shouldn't really teach it to people. That's literally what what institutions think and the Wall Street guys always say, \"Oh, don't the people who won't understand it. Don't don't don't um teach it.\" And that's literally why we built this because it makes it understandable. It makes it accessible in my humble opinion for everybody. and I want to prove that that works because I'm not promising you that works. So, I've put a million dollars of my own money into it and and I'm trading it. And the question is really just can the system beat the market because the logic would show yes it can. We've back tested it. So, the S&P does very well historically. Um, but we do much much much mucher historically on the basis of this back test. But it's only a back test and a back test has perfect hindsight. a back test is perfect execution and therefore it isn't isn't real. So I'm going to do it real and started doing it real this week. I'm going to teach you guys all about that. How that works um what the structure is, what the risks are and and and how you can join the experiment if you if you care to. So if you interested in that, join me on the live webinar on um I think today uh felix.org/webinar and and and you and you get to see it all basically. So check that out link down below head to that. But essentially the simplest way of looking at it is that fear there's lots of fear up here fear and then there is kind of you know happiness down here. That's one way of looking at it. But I think the better way of looking at it is saying that institutions are buying crash insurance. That's actually what that's telling you. And when institutions are buying crash insurance, you might want to think, well, maybe they know something that I don't and maybe I don't want to be in this market, right? And then when we have our happiness down here and institutions have basically sold all their insurance, they're not insured. They're just like, it's all good. We don't need to we're not worried about anything. That's probably the moment where we want to be in the market more aggressively. So that's essentially what we what we've done there with with the with the trend monster indicator, which is a little bit more sophisticated than just looking at the VIX. But the VIX gives you gives you a decent place to start which at the moment is saying you know all in gung-ho that sort of thing. It's not a recommendation but I'm just saying there is no fear. So there's a fairly good chance in my humble opinion which is only an opinion and nothing but an opinion. Um I might well be wrong. Of course Winston has a better insight into those things. Don't you Winston? Winston. Yes there he is. Um he's got connections. You see the likelihood of a rally is rather great in my humble opinion. As I say now, Robin Hood, still not loving it. Still not loving it. And I tell you why. We're below the 50-day moving average line. That's sloping down. That's another no no. And we just didn't have a great week last week. And it was a pretty great week for everybody else. So, I'm not loving it at all. And there's another indicator actually that we have on this which is called MRSI. This one down here. And it tells you how is Robin Hood performing against all the other Robin Hoods out there. So, its competitors. And again indicator that I believe you only find in trade vision. I don't think anybody else has bothered to build it. Um but it's very very useful. So it tells you what is our stock doing compared to everybody else and you can see that it's underperforming right well when the blue line was still up there. Uh you you you get the idea right? So it is underperforming its competitors. We don't really like that very much. Now what about Sofi? Uh Sofi which I do have a position in. I should I should always mention that. So, I'm going to pump it relentlessly. No kidding. We don't do that over here. I just tell you my opinions. And a lot of the time, you don't like them because I'm saying, \"I don't like your stock right now.\" But that's what the the money is telling me, right? The chart is a reflection of the flow of money. That's really all it is. And it doesn't take a genius to work out that it has done absolutely bugger since about September. Right now, bad or good? Well, bad is we're below the 50-day moving average line. Bad is that the 50-day moving average line is going sideways. But we also had a low here which was higher than the recent lows. That's a slight silver lining. But yeah, it's not brilliant. I wouldn't buy it here, but my stop is sitting a little bit lower. So therefore, I'm still in it. And um there's a chance that it'll pop up. It'll take out of these recent highs up here and then we're going to be, you know, going up forever after. That's very unlikely. By the way, all the great stocks, every stock, in fact, has bad periods and good periods, which is why I don't hold them forever. Um, but at the moment, fintech not having a particularly great great great moment. Now, if you enjoyed this little post Christmas analysis, come and understand how institutional money is really invested. And it's ultimately it's ultimately what gives us I think the greatest indicator in the world. And we've done this here for the last 15 years. um of where is it getting dicey as in the red zones uh where is it getting very very bullish as in the beautiful green zones and then we act on those and we only act on those at the little yellow dots so it's typically about twice a month maybe once a week at most and it is just something that an experiment I'm running that was going to take me literally about five minutes a week to do because I only have to look at the indicator on a Friday and then I act on that. Um whether I want to be aggressive or whether I want to be cautious or whether I want to be really really cautious and just sit stuff out. Um and historically it's just delivered this insane insane outperformance. I'm not promising you that insane outperformance, but it's just done massive massive massive multiple on the on on on on um on the S&P. And my promise with the experiment is just that I will share it with my students. I will be transparent about every win and every loss. Very important. Also, the losses, there'll be definitely losses. And we will learn from it. And the architect of this, who I built this with, our head coach Elliot, he's a former market maker. Um, will will lead the teaching and the mentoring so you really understand the market on a deeper level. And I think most people out there are just sort of chasing stuff and kind of being hopeful. And that's worked quite well of late as the market's always gone up in a straight line. But the question is just can we can we make it go up in a you know straight line is essentially there'll always be wobbles. There'll always be be losses and all that. But that's really what the experiment here is. Can we apply a systematic institutional trading system as retail investors and I believe we can but the proof will be in the pudding. So come and join me for the live session at felix.org/ webinar. Grab yourself a free seat. I think five or six thousand of you have signed up, which is super cool. So, I'm excited for that one. All the best. >> This here pisses me off, and I'll tell you why. JP Morgan is warning their institutional clients. Bank of America is warning their institutional clients. Goldman Sachs are warning their institutional clients about the following that nobody seems to really understand. while we're all celebrating GDP data that is just fake."
    }
]