[
    {
        "video_id": "UIlVc7O9RC8",
        "title": "How high will Silver go in 2026? Has it replaced Bitcoin as store of value?",
        "published_at": "2025-12-27T17:43:55Z",
        "sort_date": "2025-12-27",
        "url": "https://www.youtube.com/watch?v=UIlVc7O9RC8",
        "transcript": "Holy crap, guys. Welcome back. Look at this. Silver, almost $80. Insane. Platinum almost 3.5K. Insane. Look at Paladium, massive, massive parabola as well. Although still below alltime high. And the craziest thing is that if you look at all of these assets, you didn't actually have to be a metal expert to understand that they're pumping because on the money line, they've been bullish for quite some time. Look here, gold has been bullish for 11 months on the money line on the weekly money line. Then silver has been bullish for six months, palatium for six months, uh platinum for seven months. So the best thing with following the trend and just respecting the pump basically I mean trend following is all about respecting the pump is that you don't have to be as smart as you have to be following you know precious metals be deep in the industry just look at the trend and here on the min you see that since seven 6 months ago 11 months ago for gold it has been in a bull trend and as you know our money scanner catches all of these trends in real time. So when silver went bullish right here, everyone who you who is using bullmania, everyone who is using the minus scanner got an update. This is very important automatic alert. And the biggest question I get is whether something broke in the trap system in fiat system because this kind of pump for silver is very abnormal. It doesn't happen every day. This is kind of like vimemer republic currency versus silver in real time repeating right now. Let's discuss all of that. And of course, let's speak about crypto. If fiat is collapsing, what is the role of crypto? That's exactly what we'll be speaking about. And of course, guys, let me know what you think about the robe. It's actually my Christmas present. Many of you commented so much about the previous robe I had when I woke up in the middle of the night covering the Bitcoin dump that I actually got it as Christmas present. So, there you go, guys. Your comments become reality. On this note, smash up the like, subscribe to the channel, and please remember that we're here for technology. So, let's speak about silver. Silver is up around 180% since the beginning of the year. Basically, it's almost 3x since the beginning of the year. Think about that. At the same time, we do have massive news from China because China will start restricting silver exports already on January 1st. And as you know, this is a big big hit to the industry because just like Elon Musk is saying, this is not good. Silver is needed in many industrial processes. So the first argument you can make here is that this is a new paradigm that silver will keep pumping because now silver is really a new kind of asset where it's in such demand and you have the supply collapsing because of China and fiat is not really trusted. There's this whole debasement trade going on. So one argument you can make here is that silver is really the new money. It's not just any other pump like we had before which I will soon show you. This is really something new and that's why you should be bullish silver today, tomorrow and for the coming years because this is just the beginning. So that that is the silver bulls. That is those are the silver bugs. They are so bullish on silver even after this crazy pump. Of course the other side of the story is if you zoom out and you look on big massive massive time frames, you will see a um a pattern here. And that's that it's not the first time that silver pumps a lot. Here it pumped a lot. Here it pumped a lot and now here it pumps a lot. So in the past back in 79 it also had kind of a blowoff top. Not too much different from what we see right now. It pumped 300% in uh one year and then uh yeah if you look at this peak all the way here basically 700%. But what followed was a crazy crazy slaughter in the silver price. It went down 92%. And then it took I mean basically until now like 40 years to recover it. So when people are saying that hey you know all of the crypto bros are wrecked silver silver silver bugs make money. Listen for them it took literally 40 years to come back to these highs and close above this weekly weekly open. Okay sorry not weekly the yearly open. This was yearly open. So for them to have a candle that really closed above this candle right here from the 70s and the and the 80s I mean you see yourself they they waited 40 years. So of course when you have such a fall and you see a repetition in today's candle there's a lot of similarities and then look at this pump right here. Now this one took several years so it's not as powerful but let's measure from this year to the peak. It was around 200% pump. Uh kind of like what we see right now. I mean currently this year is also around 200% pump and so this was in uh 2011 that the this blowoff top happened and then it took all the way I mean basically 10 plus years to recover it okay uh so all in all can we see something similar can silver uh see something like we saw there uh and my answer to this is that we don't know we have to look at the trend but I wouldn't say that this time is much different guys because I've been long enough to see when people are saying so many different things that you know now is a new parad paradigm. The latest one was during COVID. Do do you guys remember during COVID? Do you remember Zoom? You remember PayPal? You remember all of these stocks? They pumped so much because people are saying, \"Oh, it's new paradigm. Everything changed. Everything changed. Uh, buy Zoom. Buy Zoom. Buy Zoom.\" And then what happened? I mean yourself. Zoom cannot recover. Okay? [laughter] They they they cannot recover. It's uh it's not a new paradigm. I mean, listen, it's uh is the same like everything is more or less more or less through time the same. I mean especially when people are speaking about new paradigm this and that there are a few exceptions. I mean Bitcoin you can say is one exception but it it also works in cycles with a blowoff top and then another four years of waiting. So all in all uh most likely what's going to happen here is some kind of a reverse uh to the mean and uh whether we're going to continue pumping or not is yet to be seen. I wouldn't short silver. I mean people some people are saying I would short silver if you if you say that this this time is not different. I would never short a parabola because the parabola can still double or triple before it it it blows up. But if guys, if we start closing weeks below 65 uh dollars, okay, be super careful. You have to be extremely careful because once silver pump is over, it's phenito and it may take decade or decades to come back. So that's silver platinum. Uh kind of the same situation. I mean, let's zoom out here. Let's look at the yearly. We have a bit similar situation. Although I mean if you think about platinum never really had this kind of pump like we see right now. But um it did have a pump back here in basically like silver in the 80s and then it took it basically 40 years to com uh in oh sorry not 40 years in this case it came back a bit sooner here uh 25 years and here it peaked in 20 January 2008 and then it was down basically until this year. So my conclusion here guys is that this is not a good time to be following into this massive massive massive parabolas. There's still bullish so there is still upside but at the same time you want to be in early bull trends. That's why we have our system here that alerts you whenever an asset flips bullish over on bullmania.com. That's the only way for you to be consistently profitable when you're in early bull trends not in late bull trends. And the thing you really want to avoid are the bare trends. I mean many people they hold assets in a bare trend. That's the worst worst thing you can do. And now also I showed you the zoom chart before. Look at PayPal. PayPal was also pumping so much into COVID and then what happened? Oh, oops. It wasn't a paradigm shift. It was just another one of these flukes. So all in all, this is not new. What we're seeing here has happened before in precious metals in stocks. When there is too much noise about the paradigm shift, normally the market punishes that in a big big fat way. And Peter Brandt is saying something similar here. This time it will not be different. He says, \"I've traded in six different decades. Every time there has been a supply and demand imbalance in commodity markets, I've heard the phrase, this time is different.\" It has never been different and never will be. So enjoy it now. And as you know, currently we do have a demand imbalance due to this China situation. And I mean, in general, there is an imbalance. And it's not the first time it has happened. As you've seen the charts, it has been many, many times before. And yeah, here are some more charts. This is back in 2010. uh massive blowoff top then dump. Uh back in the 80s, massive blowoff top then dump. Then when you look at platinum, massive blowoff top and dump in 2008, you look at cotton, massive blowoff top, dump. So when you have a supply crunch, obviously it creates a shortterm uh pump. But uh they normally don't last. Sugar, massive pump, dump. Uh you have gold, massive pump, then uh dump. Uh obviously for the long long term if you love gold you love silver it's fantastic XRP massive [laughter] big shout out to XRP dump and listen Bitcoin is the same it's not like Bitcoin is different Bitcoin is actually the same as well it takes a few years for it to come back afterwards but whenever you have a massive blowoff top uh it will create a dump I mean in Nikk Japan Japan in the '9s massive blowoff top and dump and so on so forth I mean yeah he has quite a few charts here and if you're long silver and or platinum I say well done. Congrats. Perhaps this is your first futures uh market trade. Being right is fun. But notice moves can far exceed anything expected and tops come quickly when they come and retracements are almost always full. So look here what you want to do if you want to succeed in the markets, you want to be in early bull trend. So just like we bought Bitcoin back in January 2023 or or like people who are using a bull mania a money scanner got alert here about gold 11 months ago silver 6 months ago paladium and platinum 7 months ago 6 months ago uh this is how you replicate it. You don't have to be an expert. You don't have to be a Bitcoin expert to be early in early bullion in Bitcoin or paladium or gold or metals expert to be early. You have to know when the trend flips bullish. So go to bullming.com watch the free training there if you want to get access. But I mean it's the only way when you look at all the different news all of that is the only way. You have to be in early early bull trends. You have to be out out of bare trends. If asset flips bearish you're out. Promise me that because if you're not man I cannot help you. I can. And here's the most important part guys. Bitcoin is the trade which I'm most excited about because currently as you know it is in bare trend. We have been risk off since October 8th. We've been d-risking since 120s here and then we derisked a lot more when it broke 50 week and then final de-risisking trunch happened when we broke bearish on the money line. So now I have approximately 30% in Bitcoin. I don't intend to sell more because that's my long-term huddle. But guys, in terms of what is going to be the easiest no-brainer trade that most people in the world will miss and fumble, it is when Bitcoin goes bullish next year. I think that towards of towards the end of next year, we're going to see that flip happen. I think Bitcoin will bottom in Q1 or Q2 uh next year and then towards Q3, Q4, we're going to start the parabola to the upside. And guys, this is the best trade. I know it was crazy trade back here in 2023. It was one of the best trades I've ever done. That's maybe why, you know, we here with the robe, you know, with [laughter] cheers. I It was the best. It was the best. And uh the trend is really your friend guys. Once it goes uh bull and it is early early bull trend and you have the money scanner screaming screaming bullish uh for uh for Bitcoin. Now it's bearish as you know. So we're not there yet. But guys, once it happens, oh my god. Oh my. I mean, it's I cannot describe to the the the situation. From a risk word perspective is going to be the best ever because it has all of the narratives. It has the the basement trade. It it has self-custody. It has self ownership. It has the narrative with the Fed printing. It has the narrative with the White House supporting it and so on forth. Maybe the US will have a crypto reserve next year. Who the hell knows? Let's see. it it will have everything narrative wise and then most important because we don't trade narrative we trade the trend but then the trend is going to be the signal the signal for us to to get in so guys that's it Bitcoin is the most exciting trade I see in front of us obviously it's not now now it's bearish and you don't have to trade every day that's another big lesson you don't have to be you know ADHD to clicking buttons like a monkey click buttons don't click buttons every day stop clicking buttons in many cases people click so many buttons they wreck themselves without the need in instead you want the trade to come to you want to be in early bull trends get it into your head early bull trends ideally on the weekly time frame that's what you want to be you don't want to be in late bull trends you also don't want to be in bare trends early bull trends and when Bitcoin is an early bull trend holy macaron that's the only thing I can tell you guys subscribe smash the like and goodbye guys goodbye goodbye goodbye"
    }
]