[
    {
        "video_id": "_DHB7aPL2rs",
        "title": "Trump's SECRET CRYPTO Plans EXPOSED!!",
        "published_at": "2025-12-16T14:00:58.000Z",
        "sort_date": "2025-12-16",
        "url": "https://www.youtube.com/watch?v=_DHB7aPL2rs",
        "views": 98396,
        "duration": "00:22:00",
        "transcript": "Many have assumed that Trump's crypto plan is all about Bitcoin. But what if it isn't? >> What if his entire crypto strategy is actually aimed at strengthening the US dollar? This is the question that has left many investors wondering whether the Trump team is truly supporting the crypto industry or simply leveraging it for their own political gain. My name is Guy and today we're diving deep into what's really been going on and telling you whether what we're seeing is crypto adoption or industry capture. Strap in folks, it's about to get wild. Before we get into it, you need to know that I'm not a financial adviser and nothing in this video is financial or investment advice. This is educational content intended to discuss how Trump is using crypto to strengthen the US dollar. If that sounds good, prove it by punching that like button. and let's get going. Now, did you know that the US dollar dominates 56% of global currency reserves? This sounds impressive at first, given how the euro, the second most adopted currency, dominates just 21% of global reserves. On closer inspection, though, things aren't so positive for the dollar. That dollar dominance has been steadily declining over the years. Central banks, global investors, and even America's own allies have been hedging against the dollar, and confidence in it is eroding. This puts America's so-called exorbitant privilege at risk, making it harder to borrow cheaply and print money without triggering runaway inflation. This gradual process, which has been dubbed ddollarization, has President Trump very worried. Trump has often called the US dollar the quote strongest and most beautiful currency, calling it a vital part of US influence. So, how does his administration plan to address ddollarization? Well, it's quite simple. Reinforce the USD's global dominance and make the dollar great again. All right. Now, maybe a slightly altered version of that catchphrase isn't exactly cutting edge, but the logistics behind it certainly are. That's because the Trump team is expanding the dollar's reach in the digital economy by promoting dollarbacked stable coins with World Liberty Financial, the Trump family's very own DeFi protocol, driving the initiative. For those unfamiliar, World Liberty Financial launched in September 2024, and its team of co-founders are intriguing to say the least. They include Trump's sons, Eric, Donald Jr., and Baron. The president himself is listed as co-founder Emmeritus, meaning he's involved in Spirit, but holds no official role. The other co-founder Emmeritus is billionaire investor Steven Witco, who also serves as US special envoy to the Middle East. like Trump, Witoff's sons, Zack and Alex are listed as co-founders along with Chase Herrow and Zack Faulkman. So, how exactly will World Liberty Financial make the dollar great again? Well, the protocol has several features in development, including an exchange, a borrowing and lending platform, and some kind of app, although the details on these are still unclear at the time of shooting. What we do have already though is a cross-chain bridge and two cryptocurrencies, the WLFI governance token and perhaps more importantly, the USD1 stable coin. Having only launched in March 2025, USD1 already has a market cap of $2.7 billion. That is some serious growth. Each USD1 stable coin is fully backed onetoone by US treasuries, dollar deposits, and cash equivalents. In other words, using USD1 is like using a digital dollar. Its reserves can buy US treasury bills, helping fund the national debt. Simply put, higher demand for USD1 makes it easier for the government to borrow. But here's the thing, 99% of stable coins are already dollar-based. So why do we need USD1? Well, it's actually quite simple. USD1 offers regulatory certainty that's hard to match. As an onshore issuer with close ties to the president's family, World Liberty can uniquely position USD1 as the most US compliant and trusted dollarbacked stable coin for institutions and individual investors alike. Of course, Trump's family ties have also sparked a fair bit of controversy, but well, we'll get to that later. For now, just know that World Liberty Financial is focused on using crypto to strengthen the dollar. And by the way, if you're looking to trade crypto, then you have to check out the Coin Bureau deals page. That's where you'll find exchange signup bonuses of up to $100,000, trading fee discounts of up to 50% and deposit cash backs of up to 75% on the best crypto exchanges. Just hit the link in the description or scan this QR code, which will take you to the deals page. There you'll see all of our offers across a range of exchange partners. Simply click one of the sign up now buttons and that should take you right to the deal. These deals won't be around forever though, so take advantage of them while you can using the link in the description below or by scanning this QR code. Now, you might be wondering how effective this strategy will be. Believe it or not, but stable coins have quietly become major backers of the US dollar. Issuers like Tether and Circle are already among the largest buyers of short-term treasury bills, which they use to back their tokens onetoone and maintain their pegs and their high liquidity. Tether holds over $130 billion in treasury bills to back USDT, while Circle holds nearly $70 billion for USDC. Combined, their holdings even outpace those of some major countries. Just let that sink in. But stable coins don't just boost demand for treasury bills, they also help push the dollar globally. While most stable coins are pegged to the dollar, a whopping 80% of all stable coin transactions occur outside the US. This means that technically traders and investors are effectively buying dollars instead of using their own currencies. So why is this? Well, there are a few reasons. Primarily, it's because the crypto market runs on dollars. Prices are quoted in dollars, liquidity pools are in dollars, and most traders think in dollars. Some issuers like Circle with its euro denominated EURC have launched alternatives, but well, they barely register. Dollarback stable coins dominate in market cap, liquidity, and realworld use. Another reason is that stable coins are ideal for transactions, especially crossber payments. In fact, stable coin transaction volumes surpassed those of Visa in early 2024. And although much of this was from crypto trading, it still proved that stable coins are far superior to outdated systems like Swift that we have today. This is precisely why banks are already worried and why fintech giants are scrambling to enter the stable coin race. For example, there's PayPal, which launched its own PYUSD stable coin. There's also Stripe, which acquired stablecoin startup company Bridge in 2024 for an impressive $1.1 billion. And more recently, Cler launched its own stable coin, Cler USD. So, you get the point. The future of payments is clear, and companies are either launching stable coins, integrating them into their systems, or building infrastructure for stable coin settlements. And the more that USD stable coins are used, the more influential the dollar itself becomes. This is something that the Trump administration is hyper aware of. Case in point, in early 2025, David Saxs, the White House crypto and AISAR, held a press conference basically confirming that was the plan all along. In his words, quote, \"Stable coins have the potential to ensure American dollar dominance internationally to increase the usage of the US dollar digitally as the world's reserve currency and in the process create potentially trillions of dollars of demand for US treasuries, which could lower long-term interest rates. And that's the key, folks, bringing down interest rates. This allows the US to borrow at much cheaper rates, which in turn helps to reduce the national debt. And with all of this in mind, it's perhaps no coincidence that USD1 was launched the month after Saxs made these remarks. Now, there have been questions though asked about how USD1 grew so fast. Remember when we said USD1 has a market cap of $2.7 billion? Well, this is a bigger deal than you might think. For comparison, it took Tether, crypto's largest stable coin issuer, four years before USDT reached a $2 billion market cap. But USD1, it managed that in under 90 days. That's a crazy rate of adoption, right? Well, not necessarily. In March this year, it was revealed that MGX, a UAE based investment fund, had used $2 billion worth of USD1 to invest in Binance. Now, oddly, MGX said their decision to settle in USD1 was based on the assets backing it and its compliance history. A bit strange given that USD1 was brand new at the time. And what's crazy is that MGX's $2 billion deal is the largest investment in a crypto company ever. The largest ever paid in cryptocurrency and Binance's first institutional investment. Definitely a big deal then. But this $2 billion deal also gave the Trump family some serious gains on the side since a Trump controlled entity owns about 38% of World Liberty Financial. But why does all of this matter? Well, the protocol's profits come from the yield generated by the short-term government securities it holds. So when MGX settled in USD1 instead of cash or another stable coin, it not only boosted USD1's market cap overnight, but also gave World Liberty $2 billion in assets to manage. Given that stable coins generate roughly 4% interest per year, the Trump family could earn tens of millions annually, though the exact amount isn't known since the specific details of the deal were never made public. Regardless, critics argue that this is one of the biggest conflicts of interest in presidential history. Bloomberg estimated that in just a few months, World Liberty Financial and the infamous Trump memecoin added about $620 million to Trump's fortune. However, this isn't the only thing critics are concerned about. Many have also questioned Binance's role in the deal. But to understand this fully, we need to go back to November 2023, long before the deal took place. This was when Binance and its then CEO Changpen Xiao or CZ pleaded guilty to bank secrecy act and anti-moneylaundering violations. As you'll probably know, CZ stepped down as CEO. Binance paid a small penalty of $4.3 billion, and CZ later served a 4-month prison sentence between April and September 2024. Around his release in September, World Liberty Financial was announced, followed by the launch of its native WLFI token the following month. Fast forward to this March, where MGX announced its $2 billion investment in Binance, which at the time was in an unnamed stable coin. Later that month, World Liberty unveiled USD1 and revealed it as MGX's weapon of choice for the deal. Most of USD1's supply was subsequently sent to Binance controlled wallets where it largely remains to this day. But here's where things get really interesting. In the same month that USD1 was revealed, some major outlets were claiming that CZ was planning to seek a presidential pardon, which CZ himself publicly denied. By July, investigative reporters were alleging that Binance helped write USD1's smart contract code, although both World Liberty and Binance denied it. In late October, CZ was indeed pardoned by Trump, clearing his federal conviction, even though he'd already served his prison sentence. By November, more details emerged about Binance's role in USD1 and the MGX deal. Questions arose over a potential conflict of interest with CZ possibly using the deal to secure a presidential pardon while Binance deepened ties to the Trump family through World Liberty Financial. Now, naturally, CZ and his lawyers rejected any payto pardon claims and Trump's allies denied any quid proquo. Trump even claimed he had no idea who CZ was and said the pardon had nothing to do with the $2 billion Binance deal. Unsurprisingly, Trump's critics have labeled this as extremely shady. Some of his fiercest opponents, including Senators Elizabeth Warren and Jeff Mkeley, described it as quote, \"a staggering conflict of interest.\" But that's not the only concern. Critics argue the deal invites foreign influence given MGX's ties to the UAE. Some argue that foreign parties could buy favor with Trump through investments in World Liberty Financial, which could shift political decision-making in the future. Okay. Now, so far we've seen how Trump's team aims to use World Liberty Financial to extend the dollar's dominance. But just how far can Liberty push its USD1 stable coin? Well, as it turns out, the protocol has been actively promoting USD1's adoption by working with other DY platforms. The biggest standout here is Ave. That's because World Liberty was launched on Ave V3 on Ethereum using much of Ave's open-source code. World Liberty actively deposits collateral like wrapped BTC, ETH, and staked ETH to borrow USDT, then converts the USDT to USD1 by sending it to BitGo, USD1's custodian, in exchange for USD1 tokens. Intriguingly, World Liberty agreed to pay 20% of all protocol fees to the Ave Dao for its code, plus 7% of WLFI's supply. Safe to say they got a pretty good deal. And if that wasn't enough, World Liberty also made a strategic investment of over $1 million in Ave and other DeFi protocol tokens. But here's the twist. This isn't the first time the World Liberty team has worked with Ave. Chase Hero and Zachary Fulkman, the two co-founders not related to Trump or Witkoff, previously built Dough Finance, an Ave based DeFi platform. They also created Pacer Capital, a trading firm that's no longer operational. Regardless, their involvement in World Liberty's founding is intriguing. Anyway, when World Liberty launched in September 2024, it was exclusive to Ethereum and surprise surprise, the BNB chain. In November this year, though, the protocol began expanding to Salana through partnerships with the Bonk memecoin platform and the Radium DEX. These partnerships position USD1 as a direct competitor to Circles USDC, which controls about 70% of Salana's stable coin market. Capturing even part of that market would boost USD1's growth in a big way. And as we know, this means more money flowing into Treasury bills, further strengthening the US dollar's dominance. And to really help drive this dominance, the Trump administration has pushed legislation supporting both crypto and the US dollar. The most notable here is the Genius Act, which was signed into law in July 2025. For those unfamiliar, Genius is short for guiding and establishing national innovation for US stable coins. And the act sets strict rules for stable coin issuers, including who can issue them, how they're backed, and what disclosures are required. Basically, the only entities that can issue stable coins are US banks, non-bank financial companies licensed by the OC, and state regulated institutions. Foreign issuers must register with the OC and follow regulations similar to those of the US. Unsurprisingly, the Genius Act also requires stable coins to be backed by US dollars, cash equivalents, or yep, shortterm US treasuries. And naturally, this legislation funnels the growth of the stable coin market into treasury purchases, providing strong support for the US dollar. And to give you an idea of what this growth could look like, JP Morgan predicts the stable coin market could reach $3 trillion by 2028. That's almost the entire crypto market cap combined in just a few years. If you still think this is just a happy coincidence, then think again. When the Genius Act was passed, Treasury Secretary Scott Bessent literally said it would quote buttress the dollar status as the global reserve currency, expand access to the dollar economy for billions across the globe, and lead to a surge in demand for US treasuries. And if you really want to go full tinfoil hat, you could argue this was why stable coin legislation moved first, not just because it was easiest, as Senator Cynthia Lumis has claimed. Speculation aside though, it's clear the stable coin strategy is central to expanding US dollar dominance. And this strategy will only become more effective as the stable coin market continues to grow. So then time to answer the question from the introduction. Are we seeing true crypto adoption or an industry captured by politicians with their own agendas? Well, from our perspective, it's a bit of both. Regardless of your opinion of Trump, there's no denying that his policies have given crypto legitimacy that was unthinkable just over a year ago. That said, advancing crypto is clearly just one piece of a much larger political puzzle. While the strategic Bitcoin reserve may have been the shiny new object that won the crypto vote overall, the real political win lies in profiting from tokenized securities and stable coins. A market set to accelerate well into 2026 and beyond. Stable coin issuers are set to be major buyers of short-term treasuries, and rising activity in the stable coin market could even impact the Treasury yield curve and volatility over time. This could influence how the US government manages its national debt. While crypto regulation is still evolving, a clearer regulatory landscape will boost confidence in stable coins and digital assets as a whole. And this is likely to attract new investors and institutional capital to tokenized securities, especially as real world assets or RWAs gain traction on Wall Street. And as stable coin issuers buy more short-term treasuries, this could actually push down short-term yields, making it cheaper for the government to borrow and repay debt. Put simply, it's a solid strategy with very little downside risk. But not everyone is thrilled. Many crypto enthusiasts feel the industry is being co-opted by politicians with Trump administration decisions clashing with cryptocurrency's core ethos. Some argue the long-term consequences may outweigh the short-term gains and not in a good way. For example, when Trump said during his presidential campaign that he wanted every Bitcoin mined in the US, it sparked hype and euphoria. Finally, a president who cares about Bitcoin. But critics quickly pointed out a key problem. It contradicts the very idea of decentralization. Many also argue that the mere involvement of politicians, let alone a US president, defies the cipher punk values that drew so many to crypto in the first place. In their eyes, politicians aren't adopting crypto to free you from the constraints of the traditional banking sector. They're doing it to save themselves. Sure, it might pump your bags in the short term, but at what cost? Cipher punks see crypto as independent, anti-establishment, and apolitical in nature. But now we have politicians launching their own shitcoins, governments hoarding BTC, and crypto policy seemingly driven by those with the deepest pockets. Some would argue that we've lost our way. This is part of the reason why some cipher punks and cryptogs have been selling recently. They're hyper aware that the fate of the crypto industry rests with a politician, billionaire, and businessman with his own agenda. Put simply, this isn't what they signed up for. That said, political and regulatory involvement was always inevitable. If the industry is to truly succeed, self-regulation just isn't enough. To be frank, we tried doing it on our own for over a decade, and the space became riddled with scams, rugpools, and Sam Bankankman frees. Without proper regulation, bad actors will always exploit others greed. So, while we may not all agree with Trump's methods, it's hard to argue against measures that go towards protecting retail investors from losing their life savings. In the meantime, the stable coin strategy will continue to be a key driver for Treasury bill demand. This could be amplified in the future where crypto could even become a critical lifeline for the US dollar, especially if stable coins become the new payment rail that replaces ancient systems like Swift. This is precisely why many investors now have their eye on the payi narrative and you can learn more about that in the video right over here. Okay, now that's about all from me for today folks, but we want to hear from you now. Are we being captured or are we on track for true crypto adoption? Let us know your thoughts in the comments below. And if you're wondering how much BTC you need to retire, then check out the video right over here. Plus, if you want to see which asset manager is finally embracing crypto after holding out for so long, check out the video right over here. Okay, thank you all so much for watching and I'll see you again soon. This is Guy signing off."
    }
]