[
    {
        "video_id": "Nox3VWgHWdw",
        "title": "The Truth Behind Palantir Stock Sell-Off!",
        "published_at": "2025-12-16T04:17:18.000Z",
        "sort_date": "2025-12-16",
        "url": "https://www.youtube.com/watch?v=Nox3VWgHWdw",
        "views": 5304,
        "duration": "00:10:38",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. I hope everybody is doing at least all right out there for a pretty bloody Monday in terms of a market sell-off with these individual names that are just continuing to see a lot of selling pressure and a breakdown. And unfortunately, even though the S&P 500 was relatively resilient today, as we're continuing to see rotation, we see futures opening up down about another 50 basis points uh continuing to draw down and could possibly open up underneath that 6,800 support level. Now, talking about Palanteer, we see an extension of a partnership, which is at least great to see. And in terms of this individual stock, it actually did quite good today in terms of resiliency. It spent most of the day in the green and I was surprised when I was checking just the overall market and the individual names, you know, on the watch list and things like that. You know, Palanteer and Nvidia were both holding in the green for quite some time. Uh, very resilient in terms of an AI trade that has a lot of uncertainty in it. Uh, especially with all the debt, capital expenditures, Oracle, Broadcom, all those things that are spooking the market. So, we're going to be talking about it, breaking it down. Of course, I'll be talking about uh cryptocurrency and what the current sentiment is on the market. If you're a new or returning viewer, hit that like button, subscribe for daily videos. We're trying to hit 30,000 subscribers. Let's see if we can do it. Now, if you pop it up on the screen here, Palanteer, like I said, today was relatively resistant uh and was doing a great job holding this mid 185 area kind of 186 area for quite some time above the 50 and the 200 moving averages. And what you saw here was in the overnight hours or kind of towards the end of the trading session, Palanteer comes down here to 179. Uh, you know, this looks like, oh my gosh, you know, the sell-off, but nonetheless, you know, down about 2% in the overnight hours, Palanteer is still doing quite well considering what a lot of the other AI names are doing on top of the current valuation that Palanteer has. I mean, in terms of trading within this range right here, Palanteer has been doing a good job. We've talked about this multiple times before, you know, trading within this consolidation zone between 170 and 186. So, you know, at these zones right here, if Palanteer is just able to hold and settle in here during this market sell off with these individual names that are down like 30 to 50%. Um, that's awesome. And that's because Palanteer, like I said, carries a high valuation. It's the leading competitor with an AI, you know, software solutions. And in terms of a barometer for the whole AI trade, I like to use Palanteer as a gauge. So for all the AI top callers out there, people saying we're entering into this bare market, you know, with Palunteer still near 180 and with the S&P 500 literally down only.16% at close today. Um, I don't think it's over. I think what we're seeing here is a healthy pullback. We're seeing selling pressure and the bears right now do have control along with the algos that are really pushing some of these individual names down. We'll be talking about that especially with the whole data center stocks that are currently being faded. Uh on top of a lot of other more speculative names that are being faded which I quite don't know why. We don't really have a ton of specific news. Uh we could be talking about a few points that could be leading towards that. Uh in terms of what Palanteer announced today, that was the renewal here of this partnership with DGSI, the Francis Domestic Intelligence Agency. They renew that partnership for another 3 years. Uh so safeguarding right here, Western nations working with intelligence agencies. We know Palanteer has multiple governmental contracts. So it's great to see here um that you see an extension of a very critical critical partnership for another 3 years. So on top of that, Palanteer is still continuing to execute on a rapid pace regardless of its price action. I like it fundamentally where it's doing in terms of a business side of things, you know, and let's talk about the market. Let's get into the nitty-gritty. address just the address the elephant in the room. Uh what are we seeing in the market? One of the big things is we're seeing AI play uncertainty that's really weighing in the market. Like I mean look at things like Oracle here still experiencing a pull down. This is at 181 now down about another 1.6% in the overnight hours. You know this was just at 312 which is crazy to think not that long ago back here in October. So, you're seeing these large large moves and sell-offs and rotations because people are wondering how come these small to midcap portfolios are getting absolutely destroyed, but the index is remaining relatively strong. Well, number one, that's diversification. You can see is playing kind of more of a safe haven for people that just invest into the S&P uh in terms of a long-term outlook. Um, and it feels like everybody hates the AI trade right now. I mean, is that pro, you know, a decent time? Like Warren Buffett always says, when people are greedy, be fearful. And when people are fearful, be greedy. Um, but nonetheless, what you're seeing here is a lot of rotation into industrials. We're seeing into loading up on healthc care shares, consumer discretionaries. We're seeing a lot of consumer stocks that are all of a sudden just getting like 2 to 3% uh boost today. a lot of rotation into these different types of stocks that are not related to the AI trade um that still have a positive benefit from a well operating economy. So in terms of the index, that's what I still like. I still think we can have a possible The big question is the end of the year rally. What's the Santa Claus rally? Is it faded? Did the Grinch come here? Are we not going to get it? Uh you see this chart that's being shared all over AX that I've been seeing here looking at S&P 500 index returns in December from 1950 to 2024 on average. You can see here this move after about 2 weeks of choppiness. You see here about a 1.4% gain saying that buyers usual return in the year- end rally tends to pick up in the second half of December. We'll see if this plays out. Seasonality is showing us that hopefully it does. However, we've already had an incredible year and we're seeing a lot of profit taking as people are locking in their gains and taking cash uh to wherever they want to rotate it to or just to their pocket. So, we are seeing a lot of profit taking. On top of that, you see some uncertainty. I saw today that with Japan saying that's going to sell over $500 billion in ETF in January. Uh vowing hopefully not to let that crash the global markets. I mean, great. So, you know, you're seeing these things across the market. even have Tom Lee, the guy that was just calling 250,000 Bitcoin by the end of the year, not that long ago, now coming out here saying that there's a potential for a 10 to 15% S&P drop in the index in the first first half of 2026 before getting to his year end of 2026 7700 price target. Uh so he's calling here for a mini bare market before another year on rally. kind of the same scenario and technical pattern that we saw uh in the beginning of the year. So you have someone that's been typically from a bullish now calling for more of a correction here and that was very very bullish uh that is making more of a change in terms of a personal perspective. So this just shows you right here kind of how Wall Street everybody is looking at this fading things as we speak. One of the big things that's being faded strong are the data center stocks. You see I ran here that comes down about 12% in the day. Continuing to get absolutely destroyed in the overnight hours right now at $3451. Now this was just literally at $80 not that long ago. This is over a 50% correction that we've seen with IEN. And you're seeing this likewise with a lot of the other stocks. Looking at Cipher right here currently at 1418. Looking at Nebius back under $80 at 7871. and looking at things like core back here at $70.33. So the data center names are getting destroyed. Uh one of the big key things that could be occurring in terms of just liquidity moving around is we had the whole Space X IPO kind of bonanza that really helped push this whole data center in space type of narrative and especially with Rocket Lab and ESTS that experienced a ton of a return in just a short ter. buying pressure and breakout was pretty, you know, quite strong with that. Um, however, I don't think that should just completely disregard the data center stocks that are going to be building on the ground. I think that's the first, you know, we already know that energy and AI powered compute demand is the bottleneck for advancing this type of infrastructure. So, I think we got to build that stuff on the ground before we start talking about space. And that's probably what's going to happen. It's just these kind of narrative shifts that we're seeing right before our eyes. So, that's what we're seeing right now. Interesting to see when will we find a bottom here in terms of bottoming and things that are continuing to go down. Let's toggle on over to cryptocurrency. Uh Bitcoin has lost the 90,000 by golly. This thing cannot catch a break. You see right now here at 85,000 and Ethereum that lost the 3,000 right now at 2900. How does that relate to BMR, which we've been talking about a lot on the channel recently at 3052. So, you know, this was just recently at 42 now down about 12 bucks. uh sitting right here down down about 3052 and continuing to drop it looks like as we speak there's an important support level for BMR here even though this is highly correlated to Ethereum's price. We'll see what happens. Uh one of the bullish things I guess you could talk about for cryptocurrency in terms of a long-term perspective right here is the new private fund here at JP Morgan. They're stepping further into crypto with the tokenized money fund. And so you're still continuing to see kind of this synergy of traditional finance and the uh decentralized sector of crypto that is kind of you know binding together. So you can see big money is making moves even though we're not seeing these short-term moves. Uh they are positioning themselves probably likely for whenever this next run's going to occur. It just depends when is that going to happen? How much patience does everybody have? What's the leverage people are working with in terms of liquidations? the times. You know, there's a lot of interesting things occurring in the market right now, but currently uh hoping to see a bottom here in the near future. I mean, I don't know when it's going to happen. Nobody knows when it's going to happen. Uh however, these names are kind of feeling in terms of a sell-off pretty exhausted. Uh and hopefully that means that we will have a bottom in the near future for some of these individual names. Um however though, they could experience a much farther draw down. Uh pain can continue to bring more pain upon more pain upon more pain, especially in some of these more speculative names with a lot of rotation. Uh so we'll see what happens. Peace out. Take care and I'll catch you guys later."
    }
]