[
    {
        "video_id": "KazRgZkEBP0",
        "title": "I Analysed Every Crash Since 1929. Here’s the Pattern That Will Save Your Retirement",
        "published_at": "2025-12-16T14:30:06.000Z",
        "sort_date": "2025-12-16",
        "url": "https://www.youtube.com/watch?v=KazRgZkEBP0",
        "views": 159372,
        "duration": "00:19:30",
        "transcript": "94% of market crashes follow the exact same pattern. And yet investors keep making the same catastrophic mistakes, losing their life savings while a small group of people get rich. Right now, we're sitting at a critical moment. The S&P just hit all-time highs after recovering from the 2025 April crash when we lost 6.6 trillion in just two days. That was the largest 2-day loss in history. And if you don't understand what's coming next, you could lose 30%, 40%, even 50% of your retirement savings. But if you know the pattern, the one that's repeated for nearly 100 years, you can turn the next crash into your biggest wealthb buildinging opportunity of your entire life. Winston and I spent the last four months analyzing literally every major market crash from 1929 to 2025 about a 100 crashes, thousands of data points and I discovered three patterns that repeat like clockwork. Well, Winston did very large very good at sniffing things out. So today we're going to show you exactly when to buy during the next crash, which investments recover first, and why the popular advice to buy the dip is actually destroying wealth. So this isn't theory. This is what actually happened, backed by verified data. And by the end of this video, you'll know more about market crashes than 99% of investors out there. So, let's jump straight into it. Now, before we get into the patterns, if you want to learn how Wall Street professionals find winning stocks before they explode and how to deal with these crashes, I'm going to run a free training this week and we're going to announce something so cool it will blow your socks off. Um, which we've been working on for ages and it's just super super cool. It's it's it's ready. And all I want to say to you is if you want to make this year the best year yet, you want to make the next year the best year yet, you're serious about your money, and you want to see how Wall Street deals with these crashes and the rallies that inevitably follow, then come and join me at phoenix.org/weinar. There's a link down below in the description. It's free. You can join me there on I think it's Wednesday evening, New York time. and Winston and I will have something up our sleeve that will make you uh skip a beat. So, let me show you what we studied. 107 crashes across nine different markets. The US, the UK, Japan, Germany, France, and a bunch of others that are even less relevant than the last two. Now, to qualify, you have to offend the Germans. I'm one of them. And you know, the Frenchies is just tradition on this channel. So to qualify as a crash in my research, the market had to fall at least 20% from its peak to its lowest point. And this includes some of the famous ones you've read you've read about. You know, the Great Depression of 1929, the worst crash in history, an 89% decline. We had Black Monday of 1987 when the market dropped 22% in one day. We had the dotcom bubble of 2000. And then we of course had the 2008 financial crisis. And we had COVID in 2020 and then in April this year we had the tariff crash literally this very year. Now for each crash I tracked five key metrics. The time to reach the bottom, how long it took to hit the lowest point, time to recovery, it's the next one. Time to recovery, how long does it take to get back to the peak. The sector performance. So which industries fell the hardest and which recovered fastest? Very important. And then how wild was it volatility and what was the optimal entry point? So when would we should have bought for maximum returns. Now you might be thinking why should I care about crashes from 100 years ago. Well here's why. The April 2025 crash was triggered by President Trump's liberation day and it was a new event. We haven't had seen that in a 100 years. But the pattern it was identical to the crashes from the 70s, the 80s and the 2000s. The S&P dropped like 18.9% in just a couple of days and then it recovered to all new time highs or to new all-time highs even by June 2025. And that's a classic pattern we'll discuss. So if you bought at the right time during that crash, you'd have made like 30 40% in 6 months. So the question isn't if another crash will happen, it's when and and and whether you're ready. Like crashes are guaranteed. It's not a flaw. It's a part of the system. But what we discovered is that there are four shapes. And once you understand these four shapes, you'll never look at the market the same way again. And then you join me in the live session on Wednesday, you will be jumping for joy because you'll understand how Wall Street really deals with this. But first, we need to understand the shapes. So the first pattern is a Vshape. And by the way, each of these shapes behaves very differently. So, it's insanely important to understand which one you're dealing with. So, let's break them down one by one. The V-shaped recovery, the market crashes hard and it bounces back very, very fast, right? It's this one here. This is what everybody hopes for, but the truth is that only 18% of crashes are actually recovering that way. So, that's like less than one in five. But people always think this is what happens. It's actually not what happens. Then you have the U-shaped recovery. So the market crashes, it stays down for an extended period and then it recovers. This is the most common one. 6 to 18 months of misery. But most investors can't handle 6 to 18 months of uncertainty. So they panic. So what do they do? Well, they sell somewhere here. Remember they bought up here, somewhere up there. And then you have the Wshaped recovery. It's the double dip. The market crashes. It then starts to recover. It's a fake out. And then it crashes once more a bit harder. And therefore the people who bought here again, they get the second loss because they probably sold here, they buy, they bought here, and now they're selling here again, and they miss out on the whole thing. They're completely disillusioned. And it's it's a really nasty one because it hits people really hard emotionally. And then number four is the L-shaped recovery. The market crashes and it stays depressed for years. And a lot of people also think this is what happens all the time, right? Yes, Japan 1989 is sort of a classic example of that. Took 30 years to recover, but it's only 7% of crashes. It's very, very rare. Now, most investors fail because they always assume it's V-shaped. So, they think it's going to do this, but 82% of the time, the recovery is not V-shaped. So, you're wrong 82% of the time, which is quite a lot. So, let me give you a real example. During the 2008 financial crisis, the market crashed in September 2008. Here's the chart on the screen. This was the beginning of the crash. Crash starts and people thought, ah, it's going to bounce back. It's going to it's going to do this, right? That's what they thought. But it didn't do that. It didn't bottom out until March 2009. So, just think this through in terms of time. This is September 2008. It bottoms out in March 2009, but it didn't fully recover. Well, from that crash point, it was until 2011. But if you're looking at the highs here, that actually took you absolute ages all the way into 2013. So investors who sold in panic during this period here when we were declining well look they they missed out on the whole big beautiful shiny recovery because a lot of people made money right they buy here and then they kept going up and up and up and up. Now let's look at something a bit more recent which is the 2005 crash wherever she is. There she is. Pretty significant actually. Let me just delete all my drawings. April 2025. What happened from the peak? Well, the S&P dropped initially about 10%. In like 10 sessions. So, what happened? Well, the S&P dropped from here about 10% in just six days and then it recovered almost all of his losses literally by the end of the month, more or less. But what most people missed is that this was only possible because the Trump administration reversed course on a lot of the tariffs on April 9th. Without that policy change, we would have seen a U-shaped, so a longer recovery, slower recovery or even a one of these recoveries that would have lasted months or potentially years. So what's the lesson here? Don't assume the next crash will be a Vshape just because April 2025 plus one. It's very, very rare. And you talk to the economists out there. Well, don't because it'll spoil your Christmas. Um, they're talking about a lasting U-shape that could last 12 to 18 months. So, what do you do with this information? Well, simple. You prepare for a U-shaped recover. Don't expect a quick bounce. Plan for 6 to 8 months of volatility. Don't go all in at once. We'll talk about the optimal buying window in the second pattern here. Stay calm during the bottom phase. This is when people panic and sell. Remember, markets don't politely announce we've hit the bottom. It's time to buy. You got to recognize the pattern first. So, what's the optimal buying window? That's what you're all here for, isn't it? That's not what you're here for. Um, put it in the chat if that's what you're here for. Just say here. And I know I know who you are. Pattern number two is most important for potentially making money. The optimal buying window. And it's gonna surprise you because it goes against everything that you've already been told. Everyone says buy low, sell high, right? And the assumption is you should buy at the absolute bottom, the lowest point of the crash. But what my research found is this. The best risk adjusted returns don't come from buying at the bottom. They come from buying when the market is down 20 to 35% from its peak. Just 20 to 35% of its peak. irrespective of whether it's going to go lower. So, you make the most money based on historic data based on my research by buying when the market has fallen 20 to 35%. Not by looking for the bottom. Why does this actually work? Four reasons. You're not trying to catch a falling knife. When you buy 20 to 35% down, this is only for the index, not for individual stocks. By the way, the market has already repriced a lot. There's genuine value here, but you're not trying to guess the exact bottom, which is actually impossible. And the second reason is you still have some capital left if the money falls further. Say it goes down another 40 or 50%. You still have some money left to buy some more. So, we don't go all in at once. That's the second part to it. And this worked with a 73% success rate. literally looking at 107 crashes and created the best three-year returns in the vast majority of these cases. Now, the fourth reason is is that we avoid the emotional trap. When the market is down 50%, fear is at its peak, everyone's screaming, it's the end of the world, right? So, it's psychologically almost impossible to buy. But at 20 to 35% down, scary, but it's manageably, manageably scary, right? you can still think somewhat clearly. So, how do you actually use this? All right, there's practical strategy set up for you. Obviously, we screwed up the number formatting there, but I think you'll be able to handle it, won't you? Can you handle it? I think you can. Right. Step number one is we decide what our crash capital is in advance. That's money you've set aside specifically to invest during a crash. Let's say it's $10,000. So, you don't wait until the crash happens to figure this out. By the way, at that point, it's too late. And then at step two is you scale in when the market crashes. So say the S&P is down 20%, you invest a quarter of that money. When it goes down to 30%, you invest 50% of the rest. And when it's down, say 35%, you invest the rest. Now, some of you, you're good with maths, will have realized I left 10% out. Yeah, there's $1,000 on the table here. And that's sort of for the true capitulation moment. And the point here is it's an psychological game. So if the market now goes down 50%. Part of you is thinking, well, I still got some money left. I can still buy the dip again. And it makes you feel a little bit better. It makes it less likely you're going to do something idiotic like selling your index funds, right? So, it's the the sort of blood in the streets money that's actually going to keep you calmer. So, let me show you what the strategy would have returned in some real crashes. And again, this is based on research. I didn't do this specifically like this. So, I'm not promising it's going to happen exactly the same way in the future. Um, but it's what the data says about history. So if you look at 2008 and you would have bought at 25% down, well, you would have made 78% in the next 3 years, 140% in the next 5 years. If you bought the COVID crash at 30% down, you would have made 68% over the next three years just from the index, right? You weren't gambling in some crazy meme stock. 2025 the tariff stock you would have bought a 20 to 25% down you'd be up 30 to 35% in literally just two months crazy return in a very very short period of time now the third pattern that Winston I discovered is that sectors different parts of the market different sectors different industries they crash at different times and they recover in a predictable sequence I'm always a huge fan of follow the money and see from which sector it's flowing to the other and this is the same thing we did here and the way I like to think about that Think of a forest after a wildfire. Some trees will burn down completely. Others survive and when the new growth starts, certain plants grow back first and then others follow. The market works basically in the same way. Now, this is huge because if you know which sector recovers first, you can position your money to write the biggest gains. So, let me break down the three phases for you. Phase one is the initial bounce. It's the first 30 days after the market hits bottom. want to take some notes or screenshots. And in this phase, tech and consumer discretionary stocks lead the recovery. Now, what's a consumer discretionary stock? It's stuff that you don't need to buy, but you like to buy. So, these are the growth sectors. Apple, Amazon, Tesla, Netflix, right? So, they fall the hardest during the crash and then they bounce back the fastest. Look at April this year, April 2025. Tech stocks let the rebound. The NASDAQ with its techheavy stocks have recovered faster than the S&P 500. IT stocks, communication services powered the S&P gains the rest of the year. Now, after phase one, we go to phase two. This is when financials and industrial stocks take over as leaders. Banks, insurance companies, construction firms, manufacturers. Why? Because they represent the real economy. The banks are recovering. It means credit's flowing again. Businesses can borrow money. The industrials are recovering. It means factories are producing and goods are moving. Right? So the economy is actually working again. And the third phase is the broad recovery. Everything participates. The rising tide eventually lifts all boats. So you get the defensive sectors that held up the utilities, the consumer staples. Those will start to underperform because investors are moving out of those. That's something to bear in mind. utilities, consumer staples, you might want to get out of those after the recovery. And that's basically when you know that the recovery is real. It's not just a few sectors. It's everything that's going up. Now, I want to share something that I think is the most important finding from all of our research. This is the pattern that literally changes it all because every single crash, regardless of the course, regardless of the decade, regardless of the market, had one thing in common. They all recovered. 100% of all crashes recovered. So every crash in history eventually recovered and went on to make new all-time highs. Every single one. So people made money out of every single crash. Right? 1929 that was the worst in history. Went down 89%. Took 25 years to recover, but it recovered. 2008 took about 5 years to recover. Four to five years depending on what you're looking at. 2020 that was pretty quick. six months because the government just went, you know, money printing. 2025 was only three months, but that was a that was a mini crash. But what we're also seeing is these crashes are recovering faster because governments and the Fed are a lot more well, they think we're a bunch of minis and we can't handle a crash. That's basically what's happening. So when the next crash happens, and it will, you won't panic. You won't sell. You remember this has happened 107 times before and 107 times the market has recovered. So, your job is to position yourself to profit from that recovery. When the market crashes, I smile because I know I can make more money faster than if the market was going sideways. And the smart investors will get rich during those those those crashes. Not because they're luckier. They just know the pattern. And now you know this pattern, too. Now, I don't want to scare you, but a lot of people are talking about recessions and bubbles and all of that. I'm actually quite bullish going into 2026, but I thought I'd put them on here for you just so you you know, we cover both sides of of of the story essentially. And most crashes, they come unannounced. That's the beauty of a crash. So, you want to be prepared before it happens, before it starts. So, what do we do? Sorry about my messy slide here. Have some cash reserves, not in cash, but in something that pays you some interest. Look at your tech and AI exposure. Maybe go a little bit more defensive, maybe a bit more metals. go be in good companies, be in companies with pricing power uh that can survive inflation, which I think is coming and write down the three patterns and how they really work. And you just learned that here in this video. And if you want to take this to the next level where we actually go into how do we deal with the market every day, every week actually? How do we deal with the market every week the way Wall Street does? How do we look at the market the way a Wall Street professional does? That's my goal for our live session on Wednesday. You can join me there. Felix/training is the link. Uh it's also down below in the description and you can click on that. You can register yourself a free seat. You got to show up. There's no replays for my lives because people don't watch them and it's an excuse not to show up. So, if you are serious about making 2026 the best year ever for your money and yourself and your financial freedom and your time freedom, then come and join us and I'm excited to see you then. You got some value out of this. Share it with a friend and more people will get to see what we do here. All the best. In September, 86 million bank accounts were frozen in Vietnam. I showed you the story when it first happened, and many of you thought, well, it was a one-off event, a Vietnam specific thing. Who cares? Not."
    }
]