[
    {
        "video_id": "8Y-E5MwP5Zw",
        "title": "ALTCOINS: THIS IS BAD... VERY BAD (SOL/ADA/ETH/XRP)",
        "published_at": "2025-12-16T16:53:44.000Z",
        "sort_date": "2025-12-16",
        "url": "https://www.youtube.com/watch?v=8Y-E5MwP5Zw",
        "views": 20351,
        "duration": "00:15:51",
        "transcript": "Okay, guys, I'm doing it. I will tell you the truth about your altcoins. And this is a video that I really didn't want to do because people ask me all the time about XRP, about Saul, about ETH, about BNB. They want to know what's happening to their altcoin. Will it go up? Will it go down? Is it looking strong? Is looking weak. But here's the thing, people feel very strongly about their coins. They feel so strongly. So, when I tell them something they don't like, they react a lot. It becomes drama in the comment section, this and that. But listen, you deserve to know the truth. You guys have been supporting this channel for so long. So I need to tell the truth about all this. I need to be fully fully transparent because you need to hear a warning, a big warning. Then whether you listen to the warning or not, that's up to you. Now let's set the context first. Context for a discussion. Bitcoin is currently in this bare flag formation. It is currently having a bit of support here at 100 week moving average. But all in all, the bulls have to do something crazy here for us to be bullish. Basically, we need to go above the 50week moving average here for us to turn this around. I mean, at least start turning it around. Now, the path of least least resistance is down for Bitcoin. Why is it so important for Solana for ETH and everything? Because all coins on their own cannot pump. They need Bitcoin to pump. At least Bitcoin needs to needs to do some kind of relief rally for all coins to do something. So, if Bitcoin does not move, your altcoin will also not move. Okay? In fact, it will move but down. Okay? Now with this context, let's look at some charts. Let's start with for example XRP. XRP is extremely interesting to look at right now because it is sitting at monumental monumental support guys. If we start breaking this support this support right here, I mean you see yourself there's not too much air uh there or more correctly, it's a lot of air. There's not too much support. There's a lot of air right here. It has a few moving average uh supports such as for example the 100week moving average at 1.6 and 200 week at one. But when you look at the actual price, there is literally nothing until 0.6. Okay? So there's a lot of air right here and this distance may be closed extremely quickly for XRP. And also just as a side note since October 8th I have no alt coins. I've sold all coins after the October 8th fake out in Bitcoin. We said to risk off that's also when we started to risk off from Bitcoin. If you've been watching this channel, you know it. But I know also many people that are discovering the channel may not know who we are, what we're doing, and really why we have such a good track record. But you should know that we've been playing it fantastically well since October 8th. We've been derisking. So personally, I have no altcoin. I mean, I have no horse in this race really. And uh we've been playing the cycle extremely well. And so personally, I have no horse in this race. I'm just spectating it. And uh from a from spectator view I just see so many people get trapped. They get trapped in their position instead of taking action risking off respecting their portfolio. At the end it comes comes to the respect of their portfolio. Do you respect your portfolio or not? Because it's money you earned. But for some reason when the chart turns bearish instead of respecting the portfolio drisking managing portfolio managing risk people what do they do? They become uh religious. They start thinking in terms of religion. They start saying, \"Oh, but the tech is good, man.\" [laughter] As if that will make you money. Oh, but this, you know, partnership, they have a partnership. Oh, but the founder says, \"Listen, you need to respect your capital. Your capital and your portfolio. It is hard earned money, but people don't respect it.\" So, when I see all of this happening, I have to come out. I have to uh say what I see. So, when you look at the chart, you see the following situation. It is support. Potentially, it's going to get a bounce here. But uh with the context of Bitcoin, it is not the same as it was uh right here when Bitcoin was still in a bull trend or right here. I mean you see XRP tested support many times but all of these times before Bitcoin was in a bull trend. Now Bitcoin is in a bare trend as you can see. That's why the path of least resistance for Bitcoin is down. And if XRP breaks this support, I mean don't get surprised if we go here. Okay? Just don't don't don't get surprised. Don't come back crying to me. It you've been warned. And uh by the way very soon I'll also tell you what to do because many people are trapped and the question is okay what to do. Uh I will soon get to that but that's XRP. That's XRP guys. When you look at the danger you need to know about is that XRP now is at a big fat massive massive massive multi-year support. It's looking weak. It's actually touching the support to the downside. If it breaks that uh game over. If it gets a bounce this this also the problem because okay let's say it gets a bounce uh maybe it goes to the 50week moving average but that's basically the upside here the upside is 50 moving average and then big big resistance and potential retest so from a riskreward I wouldn't touch it that's why I don't have since October 8th I have no alts I'm I'm not touching it with a you know 500 pole I'm not touching it okay so uh that's that let's look at soul soul very similar not as bad because we're not testing the res the support to the downside that much uh but Yes, if we start going to 100 guys, if we start losing 100, which is both this area of support and also it is the 200 week moving average, this blue line right here. If we lose it guys, uh yeah, it's going to be boop elevator here. You see on the chart there is not a lot of support. It's mainly air here. Yes, you can argue maybe like 80 going to be a bit of support. But overall on the big picture, if you don't sugarcoat it, you just look at it straight. You also kind of have a head and shoulders pattern here. Uh yeah, it's not too good. Not too good. The time to get in soul is in case it can cross above the moving averages and flip bullish and then it can go to $1k, which I think it's going to do in the next bull market. Soul is going to go to $1k in the in the next bark. I'm very bullish. Soul fundamentally. I love the tech. I love that they're able to really compete with NASDAQ long term, but I'm not forgizing myself and letting my portfolio go down in bear uh because of the tech fugazi because tech isn't is great. It's not for guys, but you know, from a money-making perspective, it is for guys. And I'm telling you that as a dev, I'm a computer scientist and the first years in crypto in 2013, I made all of the mistakes of, you know, believing in the tech, then the freaking thing goes down 99%. So, the chart is number one for making money. Tech is for long-term, but long-term will not make you money. So this is just like here by the way just like here you remember here we had kind of a similar situation in in the last uh bear as well where uh Solano went from 260 to 8. Okay this is why I I when Bitcoin is in a in a bare trend guys like I showed you uh you don't want to entertain all coins because all coins you see here they're they're ruthless. I mean from 260 to $8 Sana went from 260 to $8. You almost have to tattoo it on your forehead. So you remember Sana went from 260 to $8 and many people bought you know here they thought it's oh but Solana is so cheap it's now 50% down and it did have a fake out fake relief rally and then bam further down. So even when it was down 75% it it then went another 75% down. It was crazy. So that's why this is not something you want to joke with, not something that you want to give too much benefit of the doubt to. Um, instead when Bitcoin is bearish, you need to be risk off. I mean, it's simple. It's simple. And, you know, I love Soul, especially been watching in the bull market. I love Soul. I love what they've built. But, um, uh, yeah, I mean, I work very hard for my money. I cannot let it ride to the downside. So, since October 8th, Saul, no soul. No soul. And, uh, yeah, that's it. That's it. That's it. Uh, we need to be strict, guys. We need to be strict. Uh, next. ETH. Everyone loves ETH. Tom Lee loves ETH. Tom Lee is saying that ETH is going to recover. You know, maybe what I see now is that it cannot get above the uh 50WE moving average guys. It cannot it cannot get above it. It cannot get up. I mean, you see yourself it it it's stuck below. Uh and when you have a resistance, boop, it rejected goes down. So, not does not look good, guys. It does not look good. Do you understand it? When it is like this, it does not look good. Now, of course, any of these coins tomorrow may pump a lot and they may even go bullish, but we have the that's why we follow the system where we know when to flip bullish. Okay, we have the bull flips and uh it is not going to go to 62k like Tomy is saying without without us getting the signal. Okay, and this signal if you think about it, it is lower than when we started to derisk at around October 8th. This signal right here to get b to get bearish to get bullish again. So, anyway, uh keep that in mind. So, ETH, how low can it go? Um let's say that we get rejected here. It kind of looks like that. Then it's going to test the uh the the 200 here uh 200 week and then if it breaks that then going to be elevator down guys towards this lows in 2022 at around 1K. So if E if is at 1K uh don't get too surprised. I mean um yeah this one has a bit more structure than Solana because it has both this 200 week and has this at 1.5. So it has it has way more support but the ultimate ultimate target would be boop to come back here. That's like the worst case scenario. Okay, that may unfold. Uh and uh yeah BNB let's see BNB uh has already now guys dumped a lot. That's why when something is in the bare trend, you don't really want to touch it. Currently still I mean the good thing with BNB at least is that it's above the 50 week. It's using it as support. Uh so if anything BNB looks the best out of all of them because it used the 50we here support. So BNB looks quite strong but just knowing Bitcoin and that Bitcoin doesn't know what it wants to do. It's kind of a question of time before it breaks down. But for now I would say that BNB still looks okay. Still looks okay. Meaning that we're above the 50 week. It's not too bad, but we are in bare trend. So I wouldn't touch it either. Um let's see. AX. AX. AX. Oh yeah. I mean this one. Yeah. Yeah. Yeah, I mean you see yourself bare trend don't touch was very bad. This whole this whole bull market ax was very bad and now it is holding this mega mega mega low as potential support. You guys if we lose this if we lose this support I mean you see yourself it's alltime low. It's going to go [laughter] negative. Alpha is going to go minus minus $10. [laughter] I'm joking but yeah maybe not. Uh what else? Zcash. Zcash. Zcash has been pumping a lot. I mean Zcash is both strong but also a bit scary because technically it this thing it's in bare trend. Okay, so just keep that in mind. But I'm saying it's strong because it's above the 50we moving average. Meaning that it can go back to 50 week and still be kind of considered bullish and then kind of get a bounce and continue. Okay, so it's scary from that perspective. If you are in Zcash just know here we may we may have uh meeting with 50 moving average and it is bearish on the money line which is a very important signal to be careful and not touch it. Sui guys, final one. Sui, Sui, Sui, and then ADA. And then ADA. Let's then quickly add also guys. Sui looks very bad. Bare trend below 50 week, below 100 week. And uh the 200. I don't think we have the 200 yet. Uh it's it's too new of a coin. But uh loss of um this is very bad. Loss of this support right here is very bad. Uh maybe we're going to retouch it and then down. But yeah, I mean it's uh [laughter] uh the next next support is around this area, I guess. 0.7. Okay. So, it's it's going to come there. Uh, I know many people don't like it. And let me know, by the way, should I do this kind of video? I mean, I can also just not do it. Uh, let let me know in the comment section. Do you want me to do this kind of video or not? Because I was debating, should I do it? Should I mean I don't want headache, you know? I want I want some espresso. By the way, guys, do we have any uh people interested in some uh cups? Okay, cuz this one I just got it today. You see, you let me know the brand if you know the brand. I I kind of in this bare market I get a bit interested in this, you know, high-end high-end cap. This is this espresso. Then I also had a few different ones. So yeah, let me let me know if you if you recognize. Let me see if we have this people with taste a bit with a bit of taste for for espresso. So I'm just going to show it here so you know. Let me see if someone in the chat can guess it. Bam. There. I mean this the kind of interest that comes with age. By the way, no homo, but uh if someone told me that Ivan, you would be interested in this, you know, porcelain cups uh in a few years, I would say you are you're crazy. But here we are. [laughter] Maybe it's just not too much to do because again, I'm not touching the alts too much in the bull market was so much happening. All of the alts now we're we're doing bit different research. But anyway, guys, so Cardano finally add Oh. Ah, guys. I mean, below 50 week, below 100 week, below 200 a week. uh getting now to this uh bottom right here uh to this um yeah next support is here. So yeah, if don't get surprised if we touch it and then the next is going to be alltime low. Let's go alltime low guys. Who would have guessed? I mean I mean okay not alltime low but low for this cycle. So hopefully this one works as support but isn't it crazy that Cardano is just you know two eggs basically from its lows. Not even that is the same price as as it was in November 2023 is the same price as it was in uh January 20 I mean it's like the bull market never happened. It's I mean it's quite ridiculous and it's quite insane. It's like in October 2022. What is going on? [laughter] You see this why I think that people really need this video. Guys, finally what to do? What to do? If you want to understand what to do because this is a standard problem people have that they have all these coins they're down a lot they don't want to sell because they feel that if they sell it's going to pump they're going to miss the pump they're going to feel even dumber watch the free training below is you need to learn the mechanical rules uh and bullmania is closing soon like mechanical rules is the is part of bullmania so watch it as soon as possible because we have in-depth training about how to do it free training is right here so click the link below watch the free training about the mechanical rules because this is part of mechanical rules what to do and So if I'm to give you a quick summary, you basically need to start lading out into assets that have bull trend that into assets that are bullish. What assets are bullish right now? And again, not just sell everything because you sell everything. Uh you may just be unlucky and you sell right at the bottom and then boop. That's why you lather out a bit, you know, weekly ladder out or daily ladder out. But there are bullish uh assets. So this is where uh if you are in Bulmania, you have the money scanner commodities. Look at commodities for example. See this one is green. So as soon as you start moving over some assets from a bearish asset into a bullish asset, your life improves instantly. You don't even have to sell everything. Just, you know, move move out a bit into something bullish. Boom. Already now you start making profit. You haven't made profit in five years and now in in one day you have a green number. You haven't seen green number in five years. You're going to be euphoric, man. Or let's check silver. Silver also u u green green green. This is the kind I mean you want to be in this kind of assets. Some people may be saying, \"But Ivan, aren't you buying the top this and that?\" I mean, the problem is that if you are in a bull trend, it tends to continue like you don't know when it's going to end. It just in general, the probabilities are on your side if it is a bull trend. But also, you do it one step at a time. I mean, listen, there's more chance that silver goes goes up than the Cardano goes up, okay? Over the coming six months, look at paladium. You can really I mean, you don't have to pick silver or gold. I mean, they are the most hype. You have also p like do different research. Do different research. There are many of them. And again, I'm just showing you some examples, but the core is that you need to be in assets that are bullish, bullish, bullish. You don't want to be in assets that are bearish. That's why if you watched us in the bull market, we were the most bullish on Solana, were the most bullish on ETH. Why? Because Solana went from 8 to 300. It was in a massive bull trend. We rode it from 8 to 300. The same thing is with many other altcoins. When they stopped being bullish, we of course also stopped being bullish. We respect the portfolio. The portfolio consists of money that was very hard to earn and we're not going to waste it on some religion. Guys, smash up the like. Let me know if you like this video and goodbye. Goodbye."
    }
]