[
    {
        "video_id": "Ph5ihHhx_rQ",
        "title": "Will Quantum Computing CRACK BITCOIN!?",
        "published_at": "2025-12-21T12:45:11.000Z",
        "sort_date": "2025-12-21",
        "url": "https://www.youtube.com/watch?v=Ph5ihHhx_rQ",
        "views": 33490,
        "duration": "00:20:41",
        "transcript": "Quantum computing is crypto's new bogeyman. Once it's powerful enough, people fear that it will be capable of cracking Bitcoin and many other cryptos encryption and stealing your coins. But the conversation around it is a mess. Every time some advancement in quantum computing hits the headlines, panic ensues and you'll find doomsday threads all over your timeline. So today we're going to dive into a recent report that cuts through the noise, defines the real risk, and separates what's actually urgent from what's actually just FUD. My name is Guy, and if you're worried about the future of crypto, this is one video you really need to watch. First up though, I must make one thing clear. I am not a financial adviser, and nothing in this video should be considered financial advice. This is educational content meant to inform you about quantum computing and its impact on the cryptoverse. If that sounds good, hit that like button and let's get into it. All right, so without further ado, to explore this issue, we're working off a report from A16Z crypto called quote quantum computing and blockchains matching urgency to actual threats written by Justin Tala. We'll be covering only the most important points today, but you can find a link to the full report in the description for reading in your own time. Now, as the title of the report suggests, the core idea is that a lot of quantum timelines get overstated. The report urges that we don't need to stress in the immediate term and also that a rushed postquantum migration could backfire. So, what's the bar for a quantum threat to crypto? Well, the report uses a term you should get familiar with, a cryptographically relevant quantum computer or CRQC. This is a fault tolerant, error corrected machine that can run algorithms at a scale that threatens your crypto keys, posing a threat to things like the Bitcoin network as it exists today. And now for a super brief overview of some technical stuff. When you read headlines claiming quantum computing is advancing, you'll often hear reference to things called cubits. Now, a cubit is the basic unit of information in a quantum computer. But most headline counts are physical cubits, raw noisy hardware that errors out. Breaking crypto needs something called logical cubits. These are reliable cubits built from many physical cubits using error correction plus very low error rates and enough stable runtime to finish deep algorithms. And don't worry, that's about as technical as we'll get in this video. Now, unfortunately, as the report points out, marketing muddles things further. Many quantum computing demos often showcase made for media tasks that don't translate cleanly to real cryptography. And when you hear about thousands of cubits, it can mean a different kind of quantum machine that's useful for some optimization, but not the generalpurpose kind you'd need to hit crypto at scale. And even the best public road maps are still about making system performance reliable, not cracking your keys. IBM's road map talks in the hundreds of reliable cubits. That is impressive engineering, but it's still far from the thousands you'd need running accurately and for long enough to do practical cryp analysis. Okay, so what's the report's final word in terms of a timeline? Well, it argues that fears of Bitcoin's core cryptography being practically breakable in the next 5 years aren't backed by what's publicly known today. Even a 10-year window is framed as aggressive. The report's bottom line is that you can be excited about progress while still expecting a long runway, like a decade or more, before it becomes a real hands-on thread. So, next time you read a headline that hypes up a quantum doomsday deadline that's supposedly a couple of years away, be skeptical and treat it like what it is, a news headline designed to get clicks. Now, after giving crypto holders some relief with a relatively optimistic outlook on timeline, the report makes an important distinction between encryption and signatures. Encryption is about keeping something secret. Signatures are about proving something is authentic, like proving you're the one allowed to move funds. Importantly, if crypto holders mix those up, they can end up scared of the wrong thing. But how so exactly? Well, the report dives into something referred to as HNDL or harvest now decrypt later attacks. In a nutshell, this means an attacker can record encrypted data today, stash it, and wait. If a powerful enough quantum computer exists later, they can try to decrypt what they captured years ago. And sure enough, the report stresses that this storing of data is likely happening right now. So if you have data that still matters in 10, 20 or 50 years, you can't treat this as a later problem. That's relevant for things like government communications, medical records, legal docs, corporate secrets, even old identity data. This is why governments are preparing for this reality right now. But the report outlines that digital signatures don't work like that. There's no secret message sitting inside a signature that a future machine can unlock. The risk is forward-looking. If a cryptographically relevant quantum computer shows up, it could let attackers forge signatures or derive private keys from public keys from that point on. But signatures created before that moment don't suddenly become suspicious retroactively. In other words, HNDL is primarily an encryption problem. That's why the internet's biggest players are prioritizing postquantum encryption. First, Chrome rolled out a hybrid approach for secure web connections, mixing the old school method with a postquantum one, so you get protection against future quantum attacks. Cloudflare has been doing the same kind of hybrid rollout on huge chunks of real internet traffic. That's where your browsing, login, and API calls live. The idea is to shrink the window where today's encrypted traffic could become a readable archive in the future. Related to this point, the report also looks at where zero knowledge or ZK proofs stand in all of this. In case you're not aware, a ZK proof is designed to reveal nothing about a secret that it's proving. The report says zero knowledge proofs like ZK Snarks are in a better spot than people assume. Even if a proof system relies on today's cryptography, the privacy part still holds up. The proof doesn't reveal the secret data behind it, even to a future quantum attacker. That means there's nothing useful to record now and crack later, unlike encrypted messages. So old proofs won't suddenly become leaks. Proofs created before a truly powerful quantum computer exists should remain trustworthy for what they were proving at the time. However, it's not all sunshine and rainbows. The real risk materializes after such a machine exists. Attackers could potentially forge proofs that look valid while claiming something false. Anyway, after covering the issue of harvest now, decrypt later, along with the distinction between encryption and signatures, the report considers what all that means for blockchains. Well, to put your minds at ease, it simply states that most blockchains are not exposed to HNDL attacks. When people say quantum will decrypt Bitcoin, that sounds terrifying, but it's usually the wrong verb. On most chains, the ledger is already public. Anyone can read it today. So, Quantum doesn't unlock some secret onchain diary. It just changes what attackers might do in the future. However, the report does flag an exception. Privacy tech that really does rely on encryption to keep details hidden. If encrypted transaction data ends up stored on chain, someone can copy it now and potentially read it later. That means protocols which claim to protect your private transactions forever need to be hyper aware of developments in this space. Beyond the word of caution for privacy tech, the message is a reasonably positive one though. Crypto is not under an existential threat from HNDL attacks in the future. That's not to say there's nothing to worry about, but quantum computing is hardly guaranteed to unwind blockchain ledgers and doom the entire industry. Translation: crypto coins have a future, even in a quantum computing world. And by the way, if you want to make the most of that future, then you should check out the Coin Bureau deals page. That's where you'll find signup bonuses of up to $100,000, trading fee discounts of up to 50%, and deposit cash backs of up to 75% on the best crypto exchanges. To get these deals, all you need to do is hit the link in the description or scan this QR code. And once you get on the deals page, find a deal that suits you and click one of the sign up now buttons. These deals won't be around forever, though, so take advantage of them while you can using the link in the description below or the QR code on the screen. Now, so far A16Z's report might make it sound like there's nothing major to worry about. However, it then dives into some issues that Bitcoin in particular is set to face in the age of quantum computing. So, what does Bitcoin have to worry about? Well, one big thing is governance, specifically governance speed. Any real upgrade to the Bitcoin network needs wallets, exchanges, miners, and node runners to move together. And a postquantum switch wouldn't be automatic. Users would have to move their coins to new quantum safe addresses. No one can do that on your behalf. So, who is most exposed? Well, coins where the public key is already visible on chain. That includes some very early output types. anyone who reuses addresses and some newer formats where a public key is part of the locking data from day one. And this is not to forget the race scenario during transactions. Many BTC spends reveal your public key, then wait in the meool before a minor confirms them. In a world with a serious quantum machine, an attacker could try to derive the private key fast and broadcast a conflicting spend. Early on, that kind of attack could be costly and aimed at whales with huge holdings. Then we have governance issues with abandoned coins. Plenty of BTC hasn't moved in years because keys were lost, owners are gone, or wallets were just forgotten. If Bitcoin is to move to a new format, then what happens to those coins? Freeze them forever? Let them be swept up by whoever has quantum power. Destroy them? All of these options have big trade-offs. But even if agreement is found, the migration is slow by design. Bitcoin blocks only fit so much data, and every transaction competes with normal activity. That means long timelines that can cause fee spikes during busy periods. Needless to say, a careful but expedited rollout is therefore desirable. Now, the report's last point focusing on Bitcoin's headaches revolves around the distinction between signature risk and mining risk. It outlines that quantum threats target Bitcoin signatures, not the proofof work system that secures the chain economically. Mining is based on hashing where quantum computers offer only a limited theoretical boost. In practice, the costs and overhead make meaningful mining speedups unlikely. And even if big miners got a quantum edge, it would mostly shift who wins blocks, not collapse Bitcoin's security model. So while Bitcoin will have to make difficult changes, many of the headlines you might come across saying quantum computing is about to destroy Bitcoin are dramatically oversimplifying things. Now, central to crypto's transition to a quantum proof state are so-called postquantum signatures. On the surface, it sounds like a simple upgrade. swap one signing method for another, ship it, done. But things are rarely that simple, especially in crypto. So, what exactly are the issues here? And just FYI, the report gets deeply technical in this part. So, instead of turning this into a computer science lecture, we'll focus more on practical takeaways. One of the reports big warnings is that moving hastily with overconfidence can wind up breaking things. Signatures are everywhere in crypto. every transaction, every validator message, every multisig approval. If you change them, you change fees, node costs, and the rules the whole system relies on. So, in other words, slowly does it. Beyond that overarching theme, one significant cost is size. Most postquantum signatures and keys are bigger than what chains use today. Bigger signatures could mean bigger transactions. Bigger transactions could mean higher fees, more bandwidth, more storage, slower syncing, and potentially more pressure on smaller nodes. For exchanges and node operators, that can translate into higher hardware and bandwidth bills, which runs the risk of pushing networks towards bigger, more centralized infrastructure. The second cost is risk. These schemes are newer, and the crypto ecosystem is still learning how they fail in the real world. Some previously promising postquantum signature designs have already been broken. If a chain rushes into the wrong choice, it has the potential to end up in disaster. And then there's the fact that a lot of crypto systems also bundle many signatures into one to save space. For example, Ethereum's validator system uses a signature type that lets thousands of validators combine their approvals into a single compact signature. Many quantum resistance signature options don't combine that neatly yet. So devs may need bigger messages for the same safety or to rethink how multi-IG wallets and validator voting are designed. And if all of this sounds confusing to you, trust me, >> you're not alone. >> But the key takeaway is what we pointed out before. Although there's some time pressure here, developers need to be careful about how they develop and implement quantum resistant solutions. Sure, easier said than done, but that's crucial for the future of blockchain tech. So, with a postquantum world slowly coming into view, the A16Z report then provides seven recommendations moving forward. The focus is to take the threat seriously, but don't plan like a cryptographically relevant quantum computer is guaranteed to show up and break Bitcoin before 2030. Again, the important thing is not to rush things and wind up creating even worse problems further down the line. First, the report recommends deploying hybrid encryption immediately, at least anywhere that long-term confidentiality matters and the cost is tolerable. Hybrid here just means you use the current encryption approach and a postquantum one together, so you're protected even if one side turns out weaker than expected. This is aimed at the harvest now, decrypt later or HNDL risks we discussed earlier. Attackers can store encrypted data today and try to crack it later. Big internet infrastructure is already moving in this direction, which is a clear signal that this is not a theoretical issue. Second, the report recommends hybrid hashedbased signatures right now in places where their big size is acceptable, especially software and firmware updates. Now, this is not exactly about blockchains. It's about making sure the update pipeline stays trustworthy in the future. The idea here is that if we ever needed to roll out urgent postquantum fixes, we'd still need a secure way to ship those fixes to devices and systems. If the update system itself isn't ready for a postquantum world, you can get stuck in a nasty loop where you can't safely distribute the thing you need to become safe. Third, the report states that blockchains shouldn't rush postquantum signatures, but they should start planning now. The point is that postquantum signatures often come with real trade-offs, whether that's bigger data, higher costs, harder engineering, or simply more ways to mess up implementations. So, the plan should be to prepare the migration path early. Figure out how new signature types get added and how wallets and exchanges support them. also decide a smooth path for how users move funds over time. This is especially urgent for chains like Bitcoin where coordination is slow and there needs to be a sensible approach to ensure dormant funds aren't exposed. Fourth, privacy chains should treat this as more urgent than others. If a chain's promise is that your transaction details stay private, then stored encrypted data is exactly what attackers can harvest. Now, the report's recommendation is basically that. If performance allows, move now and consider hybrid designs or bigger changes that avoid putting decryptible secrets on chain in the first place. The details vary by privacy design depending on protocol, but the risk is similar. Fifth, the report stresses that we should prioritize implementation security over quantum mitigation in the near term. Here, it's essentially telling devs that bugs will wreck you faster than quantum computing will. Postquantum schemes can be harder to implement safely, and complex crypto systems are always hunting grounds for edge case failures and dumb mistakes, which nefarious actors love to exploit. The advice here is not glamorous, but it's the only practical approach. plenty of audits and formal verification where it makes sense and layered security so that one mistake doesn't become total loss. Now, the report's sixth recommendation is straightforward but important. Fund quantum computing development and talent. It even points out that this is a matter of national security. If a major adversary gains cryptographically relevant capability first, the risk isn't limited to the coins in our wallets. It's everything that still depends on today's public key cryptography. So sustained investment, research centers, and training are imperative even if the timeline is long. And finally, the report recommends that we keep level-headed and maintain perspective when quantum milestones hit the news. There will be endless announcements, whether that's more cubits, better error rates, new chips, or new benchmarks. The point is that the inevitable flood of milestones is not proof that the finish line is upon us, but rather it's proof that many steps still remain. For crypto holders, that means staying calm when those quantum threat headlines hit your social feeds. Although there will certainly be some volatilityinducing quantum headlines to come, no doubt. Now, the report then wraps up by commenting that its author, Justin Tala, quote, won't argue that a cryptographically relevant quantum computer in 5 years is literally impossible, only highly unlikely. But from our view, the good news for crypto holders is that devs are already working on solutions. Incentives are strongly aligned for all crypto stakeholders to work together towards a quantum resistant future, but progress will be made in steps, not leaps. In other words, there's still time. Well, that's the outlook on quantum computing and crypto according to A16Z. But what do you guys think? Is the concern overblown, or should we be worried about a major decryption that sends the whole industry to goblin town? Let us know your thoughts in the comments. And speaking of network upgrades, if you want to learn more about Ethereum's recent Fusaka upgrade, then you can check out our video on that right over here. That's all for now, though. As always, thank you for watching, and I'll see you again soon. This is Guy signing off."
    }
]