[
    {
        "video_id": "QyOT6WKDeKM",
        "title": "Gate Walkthrough: How an Exchange Became an Ecosystem",
        "published_at": "2026-01-22T10:42:14Z",
        "sort_date": "2026-01-22",
        "url": "https://www.youtube.com/watch?v=QyOT6WKDeKM",
        "transcript": "Most people still think of Gate as just an exchange, and that's fair. It's been around for more than a decade, which is a long time in this industry. But over the past year in 2025, Gates's been doing more than just running an exchange. So, this video is brought to you by Gate, so we can take a closer look at what they've actually been building. So, let's dive right into their full stack ecosystem, both trading and web 3, so we know what we can expect from this giant going into 2026. Gate wraps all of this under what it calls its all-in web 3 strategy. As the founder and CEO Dr. Han describes it. The idea is to move beyond just being an exchange and toward a setup where trading, launching, and experimenting all live inside one connected onchain ecosystem. But before we get into those newer ecosystem pieces, it makes sense to start where it all began, the exchange. Not that it needs much introduction, but Gate Exchange gives you pretty much everything you would expect from a global centralized exchange. spot trading, futures, options, staking, GUSD, all in one place. And Gate has always had a reputation for listing more markets than most. By 2025, the catalog had grown to over 3,500 spot pairs and close to 600 futures pairs. What is worth noting is how much Gate has expanded over the past year. In 2025, its user base grew to over 47 million worldwide, and its trading activity rose enough to place it among the largest exchanges in both spot and derivatives. And 2025 was far from calm for centralized exchanges. Volatile markets, stiff competition for trading volume, and rising user acquisition costs made growth a real challenge. So against that backdrop, Gate rolled out a coordinated ecosystem strategy with multiple products working together to attract, engage, and also retain users. First, you have Gate Alpha, the onchain discovery zone. It lets users access new tokens early directly from the exchange. In 2025, Gate Alpha listed hundreds of tokens each month, and some users earned over $7,000 in airdrops just by participating. This brought users early stage crypto without the onchain hassle. Then there is launchpool and launchpad where new tokens really scale. Launchpool lets users stake assets to earn new tokens. Last year it ran around 200 projects with billions staked and Launchpad is more selective with fewer projects but high demand pulling in over 2 billion in subscriptions. These programs encourage long-term participation rather than quick flips. Gate has also distributed tens of millions through its incentive programs like hodddler airdrops, candy drop, and futures points which reward holding engagement and trading activity. And alongside that growth, Gate has been focused on trust and transparency. It was among the first exchanges to implement proof of reserves and continues to publish reports so that users can [music] have peace of mind. Gates reserves are solid at over 11 billion with nearly 500 assets covered among the most extensive of major exchanges. And they also made significant progress on expanding their global footprint. In Dubai, Gate Technology FE obtained a full virtual asset service provider license from Vera enabling regulated spot exchange services for retail qualified and institutional investors. In Malta, Gate Europe received approval under the EU's new Micah framework, allowing it to provide exchange services across all member states under a single set of rules. And in Australia, Gate launched a locally registered platform through Gate Information Proprietary Limited. Collectively, these developments show Gates focus on compliance and building a sustainable global presence. By September, Gate launched Gate Layer, a high performance layer 2 that's a cornerstone of its web 3 strategy. Built for scale with 1 second block times, low fees, and throughput above 5700 TPS, Gate Layer settles back to Gate Chain and uses GTS gas, keeping it tightly integrated with Gates core stack. Now, adoption was fast, surpassing 100 million wallet addresses within weeks. Native products quickly followed, including Gate Perp [music] Dex, offering up to 125x leverage across 400 plus markets, which cleared over 1 billion in volume shortly after launch. Gate also expanded its onchain per footprint by acquiring Aiden, a decentralized protocol processing around 20 billion in monthly volume while rolling out Gate Fund, a zero code token creation tool linked to [music] Gate Alpha. Beyond its core exchange business, Gate has been rolling out new features that change how users trade, hold, and grow their assets. While it continues to compete in spot and derivatives markets, the platform has added products that rethink custody, rewards, and yield. All designed to balance security, flexibility, and usability. One of these is Gate [music] Vault, a next generation multi-chain self-custody wallet. It uses NPC technology to split private keys across multiple parties, so no single entity ever [music] controls them. Users stay in full control with protections like transaction approval, a 48h hour withdrawal delay, and builtin disaster recovery. Gate has also introduced the futures [music] point system, which rewards ongoing trading in futures. Points can be redeemed for airdrops and perks, shifting the focus from one-off bonuses to long-term engagement in the derivatives ecosystem. And with futures soft staking, users can earn passive yield on supported assets held in their futures accounts with no lockups. [music] Funds remain flexible and can still be used for trading or withdrawn at any time, letting traders earn extra [music] yields without sacrificing liquidity. It's also worth mentioning Gates's partnership with Oracle Red Bull Racing. Gate became the team's exclusive crypto exchange partner in February 2025. And one of the main things that came out of that was a digital collectible series called In the Moment. Across the 2025 season, major races like Monaco, Silverstone, Singapore, and Abu Dhabi each had their own digital moment collectible that fans could mint for free. This NFT campaign has now exceeded 32 million mints from over 388,000 participants, making it one of the larger exchangebacked NFT fan campaigns in 2025. And this sponsorship introduced Gay to billions of F1 viewers, accelerating mass onboarding of the web 3 curious. >> It's been a fun year collaborating with Gates. Now, there's much more to Gates here, and we've only touched the main milestones, but it should give you a sense of how the ecosystem is starting to come together. So, looking forward into 2026, we can expect the transition from a pure [music] sex to a full web 3 ecosystem to accelerate. And we know for a fact that the competition among sexes will [music] intensify on all fronts. Trading volume, compliance, and licenses, users, web 3 development, >> [music] >> etc. Gate is definitely one of the top platforms to follow and pay attention to. So, if you end up trying any of these products [music] yourself, let us know in the comments what stood out to you. Bye."
    }
]