[
    {
        "video_id": "8k5lK5Q96r0",
        "title": "What if Ethereum Goes to Zero? [The Terrifying Truth]",
        "published_at": "2026-01-22T18:00:08Z",
        "sort_date": "2026-01-22",
        "url": "https://www.youtube.com/watch?v=8k5lK5Q96r0",
        "transcript": "Ethereum is the second largest cryptocurrency on the planet. That's because its robust smart contracts and track record have made it the top chain for things like DeFi, stable coins, and tokenized RWAs. But what happens to these assets and services if ETH were to go to zero? Well, a recent report analyzes exactly that, and it's safe to say that the answer is terrifying. That's why today we'll break down this report for you in simple terms. and revealed just how worried you should be about this possibility. My name is Guy and you're watching the Coin Bureau. Before we begin though, I'm not a financial adviser and nothing in this video is financial or investment advice. It's educational content intended to inform you about a recent Ethereum focused report. So, if that sounds good, punch that like button. Let's get into it. So, the report we'll be summarizing today is titled quote, \"What if Ether goes to zero? how market risk becomes infrastructure risk in crypto. It was recently published by the Italian Central Bank and we'll be giving you the key highlights right here in this video. We'll also leave a link to the full report down in the description if you're interested. Now, the report starts by looking at the economic incentives behind permissionless blockchains, that is crypto blockchains. They're called permissionless because anyone can become a validator helping to secure the network and earn rewards. nothing you don't already know. One of the biggest crypto blockchains is, of course, Ethereum, which launched in 2015. Now, Ethereum's launch marked a major turning point for crypto after Bitcoin's 2009 debut. Just like with Bitcoin, users can use Ethereum to send the chain's native currency, in this case, ETH. But Ethereum's smart contracts let you do much more. These smart contracts make it possible to create decentralized applications, which is why Ethereum is often referred to as a world computer. These decentralized applications make it possible to provide financial services without any intermediaries, which is truly revolutionary. In any case, the report goes over a few key Ethereum statistics. The report's authors note that there are over 1.7 million tokens on Ethereum alone. In turn, the Ethereum blockchain that hosts these tokens is powered by over 10,000 nodes in more than 30 countries. In this context, a node is a computer that hosts a copy of the blockchain. In other words, nodes simply store the history of all the transactions on the blockchain. Now, the actual processing of transactions is done by validators, and there are close to 1 million validators on Ethereum. Now, the report notes that there are three ways validators can earn ETH. First, newly minted ETH from block rewards. Second, ETH from gas, aka transaction fees. And third, by ordering transactions on Ethereum strategically in order to maximize their rewards, a process called maximum extractable value or MEV. Together, these incentivize validators to join the Ethereum blockchain. As some of you will know, Ethereum validators need between 32 and48 ETH to operate. This ETH is staked and validators monitor each other for suspicious activity. If a bad actor is caught, their stake is slashed and burned, resulting in a financial penalty. So, this system deters misconduct, though malicious validators could still cause damage if enough of them were to collude. That said though, a bad actor would need over 50% of the validator network, known as a 51% attack, which thankfully is practically impossible. The report notes that this would require at least 17 million ETH costing over 56 billion at today's prices. In short, it ain't going to happen. The report references Lido Finance, though, as a case study of validator concentration since its validators account for a quarter of all staked ETH. The report then provides a chart of Lido's profitability from January 2023 to July 2025. During that period, Lido's APR fell from a 9% peak to just 3% as network congestion eased and competition among validators increased. Logically, staking long-term for a 3% yield isn't very exciting, especially since that 3% isn't guaranteed. That said though, ETH's price has risen steadily since January 2023. So, anyone who bought and staked ETH during that time is sitting on some impressive gains. And this ties nicely into the second part of the report, which examines how ETH's price affects validator activity. Since Ethereum's launch in 2015, there have been countless catalysts that have pushed ETH's price up or down. That's why it's important to keep up with the headlines for anything that can impact the crypto market. This can be a lot of work, but it doesn't have to be. You can easily stay up to date by getting our weekly newsletter sent directly to your inbox. That's where our research team aggregates the biggest stories to tell you what's shaping the crypto market and forecast the catalyst for the week ahead. And best of all, it's completely free. So, what are you waiting for? Sign up now using the link below or by scanning this QR code. And now back to the report which notes that in 2015, ETH was trading between 50 and $2. And if you're wishing you had a time machine right now, you're not alone. Anyhow, ETH hit an all-time high in November 2021, though it slightly surpassed that in August 2025, peaking just under $5,000 in both cases. Even after the 2021 high, though, ETH fell below $1,000 during the bare market. Despite this volatility though, the number of Ethereum validators has steadily risen, which the report attributes to two main reasons which go hand in hand. First, it notes that so-called unbacked cryptos like Ethereum are quote driven mostly by investor confidence since there are no traditional fundamentals to anchor the price. Second, whenever the validator pool shrinks, staking rewards rise. Higher rewards attract new validators, keeping validator growth relatively stable. so long as ETH's price increases over time. But here is where things get interesting. The report notes that even a drop in ETH's price likely won't result in a massive validator exodus. That's simply because even during bearish market conditions, validators and investors still have confidence that ETH will recover eventually. But what if this confidence was no longer there? Well, here the report poses a few possible triggers that could cause a loss of confidence in Ethereum. These include internal problems such as Ethereum's governance resulting in slow progress or even regression. Another possibility, meanwhile, is if there's a massive loss in confidence in Bitcoin or the broader crypto industry. Alternatively, a rival blockchain could emerge that clearly outperforms Ethereum across every possible metric, including scalability, speed, cost, and reliability. Outside of crypto, another reason why investors and validators could lose faith in Ethereum, is if there are major macro shocks like escalating global conflicts or if another technology is developed that turns out to be even more effective than blockchain. The worst part is that any of these factors could trigger a chain reaction, pun intended, further eroding confidence in Ethereum. For example, a major macro shock like a war could make BTC fall short of expectations, shaking trust in crypto as a whole. Meanwhile, other sectors like AI might outperform crypto, prompting investors to shift capital there for higher returns. In all these scenarios, the belief that ETH's price will keep rising over the long run would be shaken. And some would argue we're not far off from that. Now, if things get really bad, the only ones still standing would be long-term believers in crypto's potential. At the same time, those in it for the gains rather than the tech will likely move elsewhere, including a huge number of Ethereum validators. And this brings us to the next part of the report, which asks the pressing question, what happens on the way down? Well, if ETH's price starts plummeting, but there's no confidence it will recover, the most obvious outcome is that validators would race to unstake their ETH in order to sell it, not only would this crash ETH's price even more, but it would also result in far fewer validators in the short term. In the report's words, quote, \"No validators means that the network does not work anymore. Users could keep on submitting transactions, but those would never be settled. Assets would still live on chain, but they would be immovable. Now, to clarify, the report points out that this process would be gradual thanks to unstaking periods, but Ethereum security could be hit immediately nonetheless. That's because cheaper ETH makes it easier to gain enough power to run malicious validators. And with more honest validators going offline, attacking the network becomes far easier. Notably though, ETH wouldn't be the primary target in this scenario because it would quickly become worthless. Instead, attackers would focus on other major assets likely less affected by Ethereum's collapse, like stable coins and tokenized real world assets or RWAs, especially if issuers are legally required to redeem them at face value. Anyway, the report notes that if something like this happened, Ethereum's future would hinge on investor confidence in the aftermath. There's no way to know exactly how it would play out. But the crypto industry has repeatedly shown an incredible ability to pick itself up, dust itself down, and carry on moving forward. Then again, the crypto industry has never seen the failure of truly core infrastructure before. Sure, we've had major collapses like Mount Gaus, FTX, and the Teral Luna debacle, but since so much of the industry runs on Ethereum, a breakdown there would make those failures look like merely a bad day at Disneyland. The report reiterates though that there are mitigation strategies in place, but even they have limits. The first is the unstaking process I mentioned earlier. Normally unstaking takes about 28 hours. But this period lengthens as more validators join the queue since there's a daily withdrawal limit. In fact, in September 2024, the exit Q hit its longest ever at around 46 days, almost 7 weeks. Crazy, right? Still, this system buys Ethereum some time, helping to limit the impact on network security, availability, and ETH's price. However, network participants would need to use this time wisely, acting quickly to prevent further damage. Custodians, issuers, and holders would have to cooperate rather than follow their own self-interest to stop the Ethereum blockchain from descending into chaos. And let's be real, the chances of widespread cooperation in that scenario are about as likely as Nick revealing himself as Satoshi Nakamoto. News flash, he isn't. At least not that I know of. But let's say everyone did agree to cooperate. The safest way to avoid the impact of Ethereum's impending collapse would be to bridge assets to another blockchain before the attack. But even then, three problems would arise. First, bridges are notorious for their smart contract vulnerabilities with many having been hacked or exploited. On top of that, these smart contracts might not handle such a massive capital shift. Second, coordinating market participants isn't as simple as sending a quick message. Ethereum is highly decentralized with users worldwide across different time zones speaking multiple languages. Getting everyone to act in unison would be an insane challenge on its own. And third, over $75 billion is locked in DeFi protocols at the time of shooting this video, many with unique governance rules that determine how quickly ETH can be withdrawn. As an alternative, some whales, exchanges, and stablecoin issuers could try to intervene to support ETH's price, sort of like a safety net. But as the report notes, even this would be faced with problems, especially if the confidence crisis was caused by Ethereum being inferior to another blockchain or if problems can't be fixed quickly. Okay, then now that we've covered what could happen on the way down, the question now is what would happen if Ethereum were to hit rock bottom and ETH were to go to zero. Well, the report notes that one possible outcome is that ETH suffers a staggered fall from grace with a few partial recoveries here and there. It explains that the Ethereum Foundation, the nonprofit guiding Ethereum's development, along with large corporate stakers, could buy enough ETH to keep validators running. This would keep the network operational for weeks or even months. However, this wouldn't restore investor confidence, and many would still sell their ETH, likely at significant losses. Not to mention that Ethereum would become extremely centralized. The report also notes that if whales, exchanges, and token issuers moved assets crosschain, it wouldn't happen instantly. During the process, the bridges they use would be prime targets for hackers. In fact, sustained attacks could even cause tokenized RWAS to dep. Think stable coins dropping well below $1 or tokenized real estate trading far below its real world value. And of course, the money locked in DeFi protocols would be pretty much wiped out either due to sudden withdrawals or the massive liquidations of projects or investors that took out leverage positions. Now, in the event that a 51% attack were indeed to happen, the first line of defense would be to freeze assets on chain. This is something that centralized stablecoin issuers already do, and you can learn more about that in the video right over here. The report notes this could help prevent malicious activity like double spending, where an attacker tricks the blockchain into accepting the same transaction twice. That said though, freezing assets would be highly controversial and would only further erode confidence, causing even more long-term damage. And as a final measure, the Ethereum Foundation could intervene with a hard fork. This would reverse illicit transactions, but would also signal defeat, likely driving investors away to alternative chains without the same issues. So to wrap up, the report notes that while Ethereum is used as its main example, these risks apply to any permissionless blockchain with its own token ecosystem, whether that's Salana, Tron, BNB chain, or many others. But because Ethereum has the second largest market cap and is the largest ecosystem in crypto, its collapse would cause the most damage. For policy makers, though, the picture isn't so clear. Some Tradfi players lean towards permission chains where only approved players can run validators and unbacked cryptos aren't involved. This makes regulatory compliance easier, but these systems are more expensive than public chains like Ethereum. However, the report adds that while permissionless chains can be steered by groups like the Ethereum Foundation, they are decentralized by nature and therefore not ideal for tradi infrastructure. Moreover, they add that central banks can't be expected to prop up cryptos issued on these chains. Recall that this report was written by Italy's central bank. And with that, we've reached the end of this report. And we'll remind you that you can find the whole thing in the description below. For now though, you're probably wondering how likely it is that ETH could in fact go to zero. Well, the short answer is not very likely at all. While the report raises multiple concerns worth considering, they're honestly overblown. As mentioned earlier, attacking a major chain like Ethereum would require a bad actor to control over 50% of the network. This would cost billions of dollars in ETH alone, not to mention the costs for the hardware needed to pull it off. This is why decentralization is such a powerful security measure. and Ethereum just so happens to be one of the most decentralized blockchains in the world, second only to Bitcoin. In short, malicious validators aren't breaking Ethereum anytime soon. You may also be wondering if a competing chain like Salana could overtake Ethereum with its speed and efficiency, but there are three major obstacles here. First, Salana has a spotty track record for going offline. Second, it doesn't dominate key corners of the crypto industry like Ethereum does. And third, and perhaps most importantly, Salana's speed comes at the cost of decentralization. That's not to say that Salana is centralized per se, but it's not as decentralized as Ethereum. Salana has a few thousand active validators, while Ethereum has almost a million active validators at the time of shooting. That is a huge difference. And not only that, but investor and validator confidence in Ethereum is actually incredibly strong, at least in recent months. Case in point, Ethereum's validator exit queue recently hit zero, which literally means no validators are going offline. At the same time, demand for ETH staking has soared. If that doesn't spell confidence, then, well, I don't know what does. In fact, this confidence shows up in the charts, too. Sure, the October 2025 liquidations cut ETH's rally short, but ETH has nonetheless been hitting higher lows since the spring. And indeed, ETH has been on an uptrend on its BTC pair since April last year and may be about to break a major resistance zone. With Bitcoin dominance gradually declining since June 2025, this suggests capital is rotating into ETH, albeit gradually. And most importantly, institutions are desperate to tokenize their real world assets. But to do this, they want the most reliable, secure, and liquid smart contract blockchain. It's no wonder then that Ethereum hosts the lion share of RWAS. And as Ethereum rolls out major hard fork upgrades like the recent Fusaka upgrade and the upcoming Glamsterdam, it becomes an even more attractive option for institutional and retail investors alike. And by the way, you can learn more about those upgrades in the video right over here. Now, I could go on, but I think you get the point. Ethereum isn't going to zero today, tomorrow, or anytime soon. In fact, it seems to be doing the opposite. With every upgrade and development, Ethereum grows stronger, and it's only a matter of time before ETH's price reflects this. So, yes, this report was definitely worth the read. And yes, these scenarios are possible hypothetically at any rate. In practice, though, it's probably best to take this report with a huge, and I mean huge, grain of salt. Okay, folks, that's enough from me, though. Now, it's time to hear from you. Are you worried about Ethereum's future or are you stacking ETH as we speak? Let us know in the comments below. If you're wondering where all the retail investors are, then check out the video over here. And if you're wondering which crypto narratives you should be watching closely in 2026, well, you can find out in this video right over here. Okay, thank you all for watching and I'll see you again soon. This is Guy signing off."
    }
]