[
    {
        "video_id": "zDmeyVYy0SQ",
        "title": "EXPLAIN THIS",
        "published_at": "2026-01-22T16:06:35Z",
        "sort_date": "2026-01-22",
        "url": "https://www.youtube.com/watch?v=zDmeyVYy0SQ",
        "transcript": "Globalization and the world order as we know it is dead. That's clear from the Davos meeting and I think it will have massive impact on markets. As he pointed out countries that joined Donald Trump's board of peace, Armenia as Bellarus, Kazakhstan, Pakistan while for UK, EU like France, Germany, Scandinavia, the US is now the enemy. >> Let me put this in words you might understand. Mr. President off >> Macron saying >> what we need is more Chinese foreign diet investment in Europe in some key sectors to contribute to our growth to transfer some technologies >> that choice of shades now that Justin Trudeau landed Katy Perry Macron is clearly stepping up the game. The one thing that everyone seems to agree on from the vibes in Davos is this. >> Globalization has failed the West. >> Larry Frink, Black Rockck CEO, summed up the state of the world quite well. First, he explained why we see the current rise of socialism, which is a fact. New York City, the epicenter of global capitalism, Wall Street, elects a socialist mayor. Prosperity just isn't the growth in the aggregate. It can't be measured by GDP or market caps of companies. It has to be judged by many people who see it, who can touch it, can feel it, and can build their own future on it. That, in my view, is the strongest critique of the last economic era. Since the fall of the Berlin Wall, more wealth has been created than in any time prior in human history. But in advanced economies that wealth has acred to a far narrower share of people than any healthy society can ultimately sustain. I think this is spotto. There's a growing divide between people building capital or trying to which means all you guys here and those who do not which is the vast majority of the population. They earn their salary and spend it and that's it. They feel increasing anger, jealousy, perhaps a feeling of unfairness, and maybe fear for the future. But that's being fixed now with AI. Right now, we're in the era of AI, which we're going to talk about a lot in this week. And I'm going to replay the same pattern. Early gains are flowing to the owners of models, owners of data, and owners of infrastructure. >> I agree with Larry Fink here. The value of assets will just increase. And with that the divide will also increase between those who have and build assets and those who do not. I think the differences in wealth will get bigger not smaller. At the same time I think Elon Musk is also right when he's saying that everyone will get it better. A society of abundance. >> AI has the potential for creating a society of abundance. Dig digital super intelligence combined with robotics will essentially make uh goods and services a few years ago close to pre there will be no shortage of products and services for anyone like basically anyone will be able to have any products as they want. >> If you look over a long enough time horizon you see that is true. An average salary worker anywhere in the world today, even though he maybe feels quite victimized, he or she have luxuries like antibiotics, air travel, movies, communication, fresh fruit in the winter, things that were out of reach for the king of Sweden some 100 years ago. At that time, an average salary worker in Sweden meant working 15 hours a day on the fields, maybe half Sunday off, and eat the same freaking salmon six days of the week while his kids starved to death. The average person in the world has gotten it better. And perhaps AI and AI powered robots will continue this journey for us and give additional quality of life, comforts, and pleasures. But we humans still tend to focus a lot on the differences and I think those differences will increase. In fact, I'm pretty sure of it. But what about increasing socialism and fairness to equalize the riches? The Robin Hood model, take from the rich and give to the poor. It's increasingly hard to implement, guys. I would say that Sweden was one of the most successful implementations of it for decades, but it's cracking there too for reasons I've covered earlier. The problem is that the rich dudes don't want to be equalized beyond a certain point. And the feeling of a community where you take care of each other is declining. I can take myself as an example. I felt fine to pay high tax so that a hard-working single mom can send her kids to good school and good health care and have a decent place to live. I felt proud of that society. I don't feel fine when it turns out they sent my money to terrorist groups, fraudsters, and organized gangs who then also turn around and try to rob me for a double whopper. I'm polarizing the point here, but as a trend, this type of sentiment is definitely increasing. To implement a hard equalization today, you'd need a North Korea or Venezuela or East Berlin where they shot anyone trying to climb over the fence. Otherwise, it goes like in California who tried the wealth tax recently. The founders simply move out. Many countries and regions will try for sure and maybe they can move the needle a little bit but largely you end up with this people just move. And the reason I'm pretty sure that the differences between those building assets and those who don't will increase is Larry's next point which I've talked about for years now. >> The open question what happens to everyone else if AI does to white collar work that globalization did to blue collar workers? We need to confront that today directly. It is not about the future. The future is now. >> Differences will increase. Then he says this. Not with abstractions about the jobs of tomorrow, but with a credible plan for broad participation in these gains. This is going to be the test. Capitalism can evolve to turn more people into owners of growth instead of spectators watching it happen. And that kind of change is truly hard, especially in a world of competing ideologies and assumptions about how the system should work. >> They have no idea how to solve this. The next part of his speech is, \"Let's have dialogue. Let's talk about it.\" Yeah, sure. But that's what you say when there is no solution. There is no credible idea of how to actually fix it. They see the problem just like I laid it out here. So let me tell you exactly what will happen and what that means for my investments. There will be increasing dissatisfaction among the average people who don't build assets. Those people in most western countries will vote to increasingly distribute the wealth tax the rich. Then those rich guys and girls who were paying for everything don't want to be equalized. So they move with their companies. remains then are politicians who have promised a lot more money going out to everyone at the same time as less money is coming in what will they do then will they say ah sorry guys let's tighten the economy let's lower the taxes make our country more business friendly again let's introduce new nondom schemes letting rich people pay less tax than ordinary folks to attract the millionaires back let's put back global trade Let's cut the benefits to the average people who voted me into power. No, never. They will never do that. So, what will they do instead? I get so agitated I got out of breath. But it's very important. This applies to the Euro zone. This applies to the US dollar. I don't think this sequence of events can be stopped now. Remember how Elon Musk got into this super fight with Donald Trump over the budget thing? Not even a politician far right is ready to tighten the budget too hard. Imagine then if the next US government leans more left like New York City. The spending will pick up, the printing will accelerate. And imagine the countries in Europe already leaning more left. Turns out I'm not the only one worrying. This is Ken Griffin, CEO of Citadel, also now at Davos. The area of recklessness is the spending of governments around the world who are all with with little exception all spending well beyond their means. That's the recklessness of this moment in history. This is not a parallel to the 1920s in terms of the recklessness of the of the private capital markets. It's a story of the recklessness of government spending. we could realistically go into a world of drastically increasing inflation. The purchase power of fiat could radically drop. This has never happened in my lifetime in the west, but it happened during my grandparents lifetime in the west. German marks logarithmic scale. It happened during my wife's lifetime in Vietnam. Here is 400%. It happened in Venezuela just now. These ladies are selling handcrafts made of money. Cost cheaper than paper. 130,000%. Since 2016, the overall inflation rate has increased to 53 million%. Even if it doesn't go that bad, a 10, 50, 100% inflation and corresponding drop in purchasing power in a short time frame is a lot. There is one place where we already see this risk reflected in the markets and that is gold. I lay awake last night worrying about this because I do have substantial money connected to fiat. I do take risk but I don't want to risk everything at the same time. So the rest has to be somewhere. And I felt if it's me and Warren Buffett who are idiots, I'm okay. Berkshire Haway has almost $400 billion in cash equivalents which is 31% of their assets. I do have euro. I do have USD. I spent some time today trying to build some risk metric for different fiats. The risk that the fiat currency is inflating badly, meaning that I should get out. Purple is Japan, orange is US dollar, blue is euro, Swiss Frank, red is Chinese, and black average. I'm not super happy with it. I feel the estimated risk in percent is too low when using market indicators to try to piece this together because I think too few people see this scenario playing out that I just described. The risk in fiat to drop purchasing power was definitely higher here during the financial crisis here 2011 and this period here at COVID when the US inflation was definitely also picking up. No one is working. Let's give money to everyone. How do we do that? We print more of it. So the risk for the USD, the orange line to lose significant purchase power in percent was definitely 100%. And same the risk for the euro to lose significant purchase power also definitely 100%. And this is why I'm not so happy about it. I think the risk for that to happen now is too low when looking at the actual economic indicators because the scenario that I painted, it hasn't played out yet. If we had the purple line, Japan, you've probably read that there is financial turmoil in Japan and we see that risk quite high up here. Something that was high risk in the past, but that now comes out as significantly lower risk is the red Chinese and that I think is correct, but it's difficult for me to take practical advantage of that. I don't want to send money to China. I think there's other risks but there is one more here CHF the Swiss Frank let's add that and as you see or maybe it's hard to see if we look at Swiss Frank green line versus orange line the US dollar and blue line the euro it's definitely lower risk now and it has been lower risk basically always the risk peaked here around 2022 where there was banking issues with credit Swiss and all that but it also lines well if you look at A simpler metric, government debt versus GDP in percent. The US over 100%. The Euro area basically 100%. Japan 200%, China 100%. Swiss Frank 36%. And actually the Swedish crown, the SE also comes out favorably here. There's different ways to count this. We don't need to get hung up on the details. Switzerland has definitely done things rather differently in the past and I think better odds that they'll continue to. they have lower debt to GDP ratio than for example the US and I do think this risk analysis from a relative perspective have value. So I will make a conscious effort to move more of my fiat exposure over from USD and euro to Swiss Frank. There is also this chart. This is Swiss Frank versus US dollar and it's an ascending triangle with a very well- definfined horizontal level. So, if this breaks out, this looks very good to me. In the light of this increased fiat risk, if this scenario with the recklessness of governments does play out, here is my action plan. The four specific actions that I will take to protect myself. Number one, build assets. I think you've gotten that from my quit your job video last year. Number two, keep mobility and options open. I think you've understood that, too. If we will get a new Berlin wall built of rules and regulations meant to confiscate those assets from me that I've built, I don't want to be on the wrong side of it when the wall is going up. People only climb the Berlin wall in one direction. People only try to escape from North Korea to south. The other direction will always be open. Number three, which is new. I will reduce my exposure to traditional western fiat currencies USD and euro which I feel carry higher and higher risk to substantially lose purchasing power. Personally, I look more at Swiss Frank, but you make your own choice. Choose safer fiat. Number four is also new to me. I need to more carefully consider how to park funds. I like risk. I've had great success with crypto altcoins. I like tech stocks. But when I'm not in a trade, I don't want to take risk with that money. Now, it seems like there is no more risk-free option. Bonds used to be that nearly risk-free, but I don't see it that way anymore. Now, it's more like if you remember when the stable coins were deping first USDT deped swapped it over to USDC, then USDC digged because their bank, Silicon Valley Bank, went bankrupt. I remember I ran up the stairs to my office to swap it back again. Suddenly, there wasn't any risk-freeish option to park money. It feels a bit like that now with fiat as such. Of course, gold, silver, bitcoin are the go-to store of value, which are hard assets that you cannot just print much more of, but they also highly volatile. Still, I will definitely be more active to try to get more fiat of the accounts because there is no more risk-free anyway. I will rely even more on stocks, metals, crypto, selective real estate, and less on fiat to park money. I know you want me to comment on Bitcoin as well. Bitcoin broke this wedge that I talked about in the last video. Then nothing much more has happened. There are two problems with diagonal patterns. often you can redraw them to another also valid diagonal pattern and it's pretty hard to trade them. So main takeaway now is that the trend is down line is still blue and no clear reversal. Gold silver continued strength and platinum had a fresh breakout just now clean ascending triangle. So in summary, my financial plan going forward is every day get out of bed to build assets, keep mobility, reduce USD and euro exposure out of the fiat currencies. Swiss Frank looks better to me, but overall rely more on assets to park money as there is no more risk-free anyway. Then can as well take smart risk and manage it. There is also step number five for you which I don't need to take and that is to subscribe to the channel. Thank you, T city or not. And don't worry, it's not the bear cap. It says enjoy the moment."
    }
]