[
    {
        "video_id": "x0rQmjd2a8M",
        "title": "Palantir MASSIVE Reversal SHOCKS The Market!",
        "published_at": "2026-01-22T04:30:20Z",
        "sort_date": "2026-01-22",
        "url": "https://www.youtube.com/watch?v=x0rQmjd2a8M",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. And holy Toledo, what a crazy day that we've had in terms of volatility even in the S&P 500 index. And we see Palenter here that has a massive reversal after we saw a huge morning selloff because we got the news here, the tariffs are cancelled. Uh it's kind of like we've seen this play out before in the same situation that is continuing to repeat itself. uh and we see I think a lot of the shorts that got caught with their pants down. We're going to be talking about the big announcements that we have specifically from the administration regarding the tariffs regarding Greenland and that kind of helps knock some of the uncertainty away and puts it back and basically what does that open the door for risk on type more speculative assets uh for 2026 and we're going to be talking a lot about the individual names we talking about. We'll be talking about crypto and how all this is getting crazy. So pop it up on the screen here. Like subscribe we're trying to hit 30,000. Let's see if we can do it on the channel. Thank you so much for watching. Palanteer currently now when this opened guys when this opened at 168 and we talked about this in yesterday's video if this support did not hold that the macroeconomic situation continued to look bad that we could see a further draw down and that's what we saw. However, the recovery just came much much faster than I was personally anticipating. You see Palanteer here that sells off and drops down to like 161. I'm like oof that's not good. If that does not hold, we could see balance here that would possibly be breaking down here, could be seeing the 150s. Uh what you see here though is with that support that was lost basically at that 170 currently. Um you had a lot of macroeconomic volatility that caused a huge reversal here pushing balance here back into more of a bullish area. Uh this is the news. Let's talk about this here. Trump comes out and says based on a very productive meeting that he had with the secretary general of NATO um he says here that they formed a framework for the future deal with respect to Greenland and in fact the entire Arctic region. Now this all came out about 1:00 during the trading session. It says here that this solution um is going to be great for the United States and all the NATO nations. Based on this, he says, \"I will not be imposing the tariffs that were scheduled to go in effect on February 1st and additional discussions are being held concerning the Golden Dome as it pertains to Greenland.\" Basically talks about further information. Thank you for your attention to this matter. So tariffs are canceled. What you see this happens across all the individual names. A lot of I think like I said, shorts got caught with their pants down. You see a huge reversal in the markets here. Palunteer is now back above its 50. could be achieving back above its 200 depending if we continue to see bullishness in tomorrow which futures are looking quite well right now as we speak. Uh as long as Palanteer reclaims kind of this 170 support and if it just hangs out now between the 170s and the 184 area before you do have earnings which is going to be coming up here soon. Now this is February 2nd. Uh we've had 21 bullish earning per share visions in the last 90 days which is also a good indicator. Uh as we know you know Palanteer is in price for perfection. and you got the whole valuation blah blah blah blah blah blah blah and when it does start to sell off you have a lot of the bears that are pounding their chest saying that they were right the whole time and you're always going to have that when you see a draw down here but nonetheless you see you know Palanteer if it gets back into the zone and if you have earnings coming up and the macroeconomic situation looks well um it's been a very very very resilient stock and that's why personally uh don't don't feel comfortable shorting Palanteer with how resilient that it's been um so we'll see what happens tomorrow but currently at 167 I like it it really really recaptured and kind of reattained the support that it opened at. Um, and you see this kind of get swiped across the markets across the whole board. Continuing here, look at the price action on the S&P 500 today was kind of crazy. Uh, we see a drop in the intraday here at 86800 basically and then we see an immediate buying pressure. The market comes up and closes above about 1% today as you see here. Look at this price action. This is absolutely nuts over the last few days here. The amount of volatility that we've had here. Um so we'll see what happens. But what you see here with SPY futures currently up about another 31 basis points. We're currently at 687. Uh so we could have the S&P 500. I think if we see the macroeconomic situation that looks well, it could reclaim that 6900 zone. Uh which kind of brings us more closer to the market all-time highs. Now before we talk about some of the individual names, um this is just talking about of course the whole meeting that we saw with Trump here. Um in terms of tech stocks, you saw Nvidia, AMD that leding to the market comeback as investors really piled into their favorite growth stocks after we saw a lot of the hunkering down as we saw a lot of cash and just kind of people sitting on the sidelines waiting for some of this uncertainty to pass us. On top of that, not just with this uncertainty, you also have that bank uncertainty with the credit card whole thing about the 10% interest rates that they've been taking some beating. Uh right here, they actually rose today after Trump said in his Davo speech that he'd be asking Congress to implement his proposed credit card cap of 10%. Now, this is an uncertain prospect given the lack of support among lawmakers. So, we'll see if this really makes it anywhere. However, the bank stocks actually received a little bit of a momentum during this uh move. One of the big things is he's very unpredictable in the decisions that we make and changes directions very quickly. Uh stock the stock market here no longer assumes that his pronouncements are going to be enforced. Um however, they still do react to that. I mean, look what we've seen recently. We've seen a lot of uncertainty regarding the whole tariffs and the market was down more than 2% yesterday. Uh so for people that bought the dip and kind of see through the volatility and the noise that the administration can make and really stay tuned to the fundamentals in the market uh that's where I think the theme for 2026 still remains strong of course unless we have some other crazy thing and that's just unpredictable at the point. So you know I can't sit on the sidelines too long and I wasn't shaken out in any of my short-term moves by the recent volatile you know volatile events. Uh but what you see here is Zetta had a nice dip into the 19s and this is a big retail trendy name. Uh a lot of dip buyers came back in here and you see Zeta right now currently in the overnight hours up about another 2% another 43 cents right now at 2088. So we'll see what happens with this but nonetheless back above its 50 back above its 200. Zetta looks like it is getting a nice move and a big uh technical guy that I follow on X-ray here Chris says that you know you really couldn't ask couldn't ask for more of a textbook breakout uh with a retest of the last you know the draw trend line downtrend line on Zetta RSI is holding right up as a support where he's where it's needed to be. So you have that retesting before we saw that breakthrough um and that holds and you have the dip buyers that stepped in. So right now I do like Zetta in terms of the short short term and even in the long term and that kind of correlates here with path. Path um is up about 7% in the overnight hours right here at 14:30 right now. Um I do like the agentic AI move for 2026. And then you see a little bit of a bid coming back here for the data center names. Looking at Nebius. Nibbius is back over 100. Cipher back at 18. You see I here back at 54. This had a nice dip basically into the 50s. Uh, so I like these moves and you basically have this a kind of homogeneous move across the whole market. Um, so what does that mean going forward? I think we're going to be entering more into an area where speculation could continue to evolve. And particularly recently, I've liked this drone uh company right here, Andas. I think they are getting a lot a lot of attention. Uh they had a nice dip down here to 12 and were able to come up another dollar after the whole uh tariff basically disregard and was now here at 13. What I like about this is this is starting to hold a lot of support here at the 12 basically and even at the 13 right here. So I think if it can reaccumulate that support at the 13, you can see multiple multiple touch points right there holding that area. Um, in terms of some of these individual names, you know, and assets and starting to see a little more of a bid that's coming back into these, uh, individual names that we've been tracking on the watch list. Uh, looking at cryptocurrency right here, Bitcoin at 89,000, right under 90,000. We'll see if it recaptures 90,000. I mean, crypto, I don't have any exposure right now cuz it's just been kind of just hanging out there. It's really not been doing anything crazy. We'll see what happens. Uh, Ethereum, though, back above 3,000. Oh my gosh, thank God. uh you know because this thing was just at 32 you know 3,300 basically and we see it sell off was under 2900. I got scared for a little bit for the crypto holders and especially the BMR shareholders right now. Um what you do have here with BMR though in terms of a technical uh perspective the bulls were able to hold this 27 area. You can see right here a decent amount of support and a nice bounce right there um right now at 29. So, I think Ethereum and Bitcoin, what they they really need right now is the Clarity Act to bring more certainty regarding regulation. I think that could be a big mover for the crypto markets cuz right now they're just not making a ton of moves. Uh but we'll see what happens. Other than that, uh looking at some of the other names, we'll see what happens. Uh right here, like I said, IWM, the Russell 2000 is doing quite well. I like where it's at right now. This is keeping me favorable for the short term for a lot of the small um small names that I'm personally in uh for the whole fundamental theme of 2026. Peace out. Take care. Let me think let me know what you think all about all this down in the comments and I will catch you guys later. Have a wonderful night and of course be careful out there with this unpredictable world that we live in."
    }
]