[
    {
        "video_id": "_1vWwaGfhEE",
        "title": "2 signals when to buy BTC. #shorts #bitcoin #btc",
        "published_at": "2026-01-22T17:59:23Z",
        "sort_date": "2026-01-22",
        "url": "https://www.youtube.com/watch?v=_1vWwaGfhEE",
        "transcript": "As you can see right now, Bitcoin is at around 89, but let's see if it's if it breaks down or breaks up. If it starts breaking up and closing weeks above here, then likely we're going to go and test 50week moving average. Otherwise, we're coming to the papa right here at the 200. You see, for us, the next decision point is going to be either a 200 or 50 week. And you should be excited, especially if you have some dry powder because 200 week is like, you know, I mean, in one way, you can think of it as free money. One month return after buying at 200E moving average is already 8%, bigger than S&P average per"
    },
    {
        "video_id": "2Ex1OHVAsa0",
        "title": "BITCOIN: ON THE BRINK..... (this will get ugly) 🚨🚨🚨",
        "published_at": "2026-01-22T10:05:16Z",
        "sort_date": "2026-01-22",
        "url": "https://www.youtube.com/watch?v=2Ex1OHVAsa0",
        "transcript": "Oh yes, oh yes, oh yes. Guys, welcome to another episode. And as you can see right now, Bitcoin is at around 89. But what happened yesterday was quite interesting because basically Bitcoin has now formed this sideways range between approximately 86 and 93 because yesterday Bitcoin went all the way down here to 87ish. Then we did have a bit of a rebound. But what's very important here is that we're basically on the brink. That's why the name of this video is tick tock. You see in the in the picture Tik Tok if we guys if we start breaking down below here you know we're coming to papa I've been tweing about it as well you know Bitcoin is going to come to papa in one way or another and for us we're very calm we've been in the ban for quite some time we started to derisk here in on October 8th and this is by the way in comparison to something like Tom Lee followers this is crazy because now Tom Lee is saying that there will be market turbulence And in 2026, the same Tom Lee that was saying that he was super bullish on it. It's going to go to 10K or whatever, he said. This is the problem with you following news, influencer, this and that. Instead, just follow the chart. Follow mechanical rules. We've been preaching just looking at the chart. The chart tells you if it's weak, if it's strong. Whatever is happening behind the scenes doesn't actually matter. And what's interesting is that both Tom Lee, but also Bitwise and a lot of other this, you know, so-called institutional investors speaking on TV, they've been forging you. And many of them are now actually also turning a bit uh bearish. And I was I mean it's very late now. It's very late now. It's super late. But this guy Luke Groman coming out saying, \"Hey, you know, don't bet on social investors pushing prices up a lot.\" This I mean many of them are now coming out and of course for for many people it's too late because look at the odds. What has als been doing since October? You see yourself boop very very much down. And again it's just another confirmation that chart is king. Plebe read the news. News is late man. It's late. All of the players, all of the insiders, they make the moves before the news. Okay. Tom Lee, he says he's bullish. What happens? He gets compensation in Bitine. Big fat compensation. Then he says, \"Okay, be careful, guys. Be careful.\" Because before compensation was approved, he needed to hype up. You know, the mission is to get ETH up, get ETH accumulated. Now he has compensation. Okay? You know, now he's reasonable. It's crazy, guys. It's great. I I keep I I keep being blown away by the market, how the market basically fleeces, you know. How do you say skin or fleece? I how to say you know the the the average investor like he got fleeced. He got fleeced in such a crazy way. It's insane. And then the guy comes hey guys you know expect turbulence. Expect turbulence guys man. Yeah EU tariff pause will yeah you see here it's quite insane guys. What is the conclusion? conclusion is to follow the price, follow the mechanical rules. Uh currently we're in a regime where Bitcoin is mainly bare. So we are risk off at the same time on the daily. You do see some bullish flips. I mean it it happens a lot. Just look during the last one week. Let's see what's bullish in the last one week. You have this bra in crypto river. I mean there's still money to be made especially if you can use leverage. There's still money to be made but again only short term. Only only short term. If we look at stocks, let's see what's really bullish in the last week in the stock market. You have this uh some kind of uh not too too much of a penny stock. 1.6 billion market cap. No idea what it is, but it is up almost 200% since 6 days ago. Okay. So, okay. Basically, it was a penny. It kind of still is a penny stock. But can you trade volatility? You can. You absolutely can. You have this Namib something something from Australia. What is it? It's Australia. There you go. Oh, no. Cayman Island. Came from Cayman Island. Straight for Cayman Island one day ago. Bam. 100%. Lisata from this is real. This is 35 million. This is a real freaking penny stock. Okay, there's always some volatility somewhere and you have to see it for what it is. It is volatility. It's tradable volatility. Do you bet your retirement on it? Absolutely not. Can you trade a very nice daily swing trade? Absolutely. With leverage is very very nice. So, it's it's all about what you make of it. But on the big big picture, Bitcoin is better. uh we we're waiting for a resolution here because now this uh this sideways range is quite established especially with yesterday's uh week here. So yeah, let's see if it's if it breaks down or breaks up. If it starts breaking up and closing weeks above here, then likely we're going to go and test 50week moving average. Otherwise, we're coming to the papa right here at the 200. And guys, let me know if you're excited for the coming to Papa because you should be excited. You should absolutely be excited especially if you've been watching us, especially if you've been following us. Uh I mean our track record since October 8th has been very very good. And we also I have this uh website now boom.com/ivan. You can see the track record with the expost as proof. You see for us the next decision point is going to be either a 200 or 50 week and you should be excited especially if you have some dry powder because man at 200 week is the it's such a no-brainer to buy even if there is a fear even if people are freaking out whatever is happening in the world bitcoin at 200 week mama mia it's a it's like godsend it's like godsend why because from a riskreward perspective you know that likely we're setting up for a multi-year run likely we're setting up for a multi multi-year bull market and you buy there in a in a in in such a nice way where risk reward everything is about riskreward. I mean just everything is riskreward and nothing is for sure. So what can we do as traders? We can maximize the riskreward. We can make it as good as possible. And 200 week is like you know I mean in one way you can think of it as free money. If you just wait a few a few months in most cases you're going to be very very fine. And uh this is exactly why we have this simulation. Six one month return even one month like on average one month return after buying a 200 week moving average is already 8% bigger than S&P per year per the whole year. And here normally you get it in a month after uh 200 week moving average 6 months already 53 one year 200. Okay. So this is the kind of stuff we're talking about. And yeah the we're not going to fade it. We're not going to fade it. And that's why personally I'm excited if Bitcoin goes to Papa. I'm very very excited. So let's see what's going to happen. Uh next there is a lot of fear and greed in real time changing. Yesterday Trump was speaking about that they need to take Greenland in Davos. Then he said maybe we're not going to do tariff. So the price went from uh 88 to 90. So people tracing this they get chopped up like uh like like a carrot. You know you're on a chopping board. Chop chop chop. Market chopping you up like never before. If you have no plan, no strategy, you just tra trade based on vibes. Uh and and the the most important thing is to keep the big picture in mind here. And this is the big picture, okay? Nothing else. Uh but it was crazy yesterday with Trump. He was kind of confusing Iceland and Greenland. Did you guys catch that? He was speaking about Greenland, but then he was like, \"Yeah, we actually need to take Iceland.\" Everyone loved me before I started speaking about taking Iceland. And then he spoke for like 10 minutes about Iceland. He's going to take Iceland. So, uh I mean it is it is pure entertainment value there. Uh Marcus, they don't like this entertainment. They they don't they don't. And um uh the good thing is that with Trump you will you will not have super bad like it's not going to be Armageddon. It's going to be this swings back and forth back and forth. Meaning that you know today it's super bad. Tomorrow he's going to say we kind of made a deal. Then in three days he's going to say oh deal cancelled. So this is what we said a few days ago with Trump. It looks very bad. Then he says okay we'll make a deal. Blah blah. We'll make a deal. Then okay no deal. No deal. No deal. Then bearish again. Imagine you trade based on that. you would you're you you would go gray hair very quickly and your portfolio would go to zero very quickly also. So you need to look at the chart the mechanical rules and all of that. But this interesting look here I don't know that they'd be there for us. They're not there for us on Iceland that I can tell you. I mean our stock market took the first dip yesterday because of Iceland. So Iceland's already cost us a lot of money. But that dip is peanuts compared to what it's gone up. We know that they this was yesterday. He started to confuse Greenland and Iceland. He meant that since he started to talk about Greenland stocks went down. But yeah, let's see if they take Iceland as well. If they get like two for one package or something. Uh next, uh let's look at what's happening on the regulatory front because as you know, there is a deal being worked on here with Democrats and Republicans when it comes to the uh crypto market bill and um there is no progress. there's going to be uh likely either a bad bill or or a no bill, but there's no deal with the Democrats on the crypto bill currently. Uh Coinbase, as you know, they don't like the bill. They said we we don't care about the bill. So, what did he say? While differences remain on fundamental policy issues, this bill builds on our bipartisan discussion draft while incorporating input. Yeah. Yeah. Yeah. So, bankers want to ban crypto yield basically. Okay. Republican bill includes crypto death protections. a crypto attorney known online as this guy uh said that the bill creates a path for D5 to steer clear of CFTC regulation. This is super important. We need to have dev protection. So when you build a code, you build a D5 protocol, you know, you're not going to be charged for running like a money transmit or something. It right protection for DeFi software developers and certain source providers from liability under CFC rules. Very important. The bill also amidst any regulation of stable coin yield. Okay, so basically we need the Republican bill here. The Democrats they are pro bank they're pro bank they're pro anti crypto so we need the republican bill 100%. So as that fits under the resition of the bank committee, Bill Hughes a lawyer a lawyer at Ethereum software solutions provider elaborated in some the digital commodity intermediaries act does not regulate self-castive wallets does not regulate non-custodial D5 interfaces regulates um regulates any platform that takes Cy or control or controls execution. So this is what we want. Anyways, let's see what's going to happen. But we we need death protection for sure and we need stable coin yield because you need to be able to get yield from a self-custodial wallet without going to a bank and for that you need stable coin yield. I mean it's very clear if they ban stable coin yield is going to be very bad and very good for banks. So in reality it would be better without any bill just like Coinbase says. If they ban stable coin yield better that there is no build. But let's let's see what's going to happen. Let's see what's going to happen. Um I mean to me this bill is less and less important because they make it they made it worse. So even if it passes, it's not even that good. So what's the point? What's the point? Uh now guys, when it comes to Trump, here's another reason why this bill uh is having some issues to be passed the way crypto wants it. And that's because you have Trumpcoin, you have Millennia Coin, you have all of these different things. And also now he has another coin. So basically, Trump media announces shareholder token drop. Trump token reacts by dumping obviously but because there's going to be another coin that's that's gonna compete with the Trumpcoin. So yeah, let's see guys. Basically they are having another coin. Now also the firm will use cryp.com chain to mint and custody the tokens and will share them periodically with DJT holders. Uh this is the stock. I guess uh so if you have the stock you're going to get the coin. However, since the token won't be tradable and isn't isn't equity, this implies it will be a new coin different from Trump memecoin or Trump familybacked world liberty financial. So, yeah, the memecoin is dumping and Trump is going to have another coin. The multicoin ecosystem is very bad, guys. It's very bad. Someone asked me about what I think about Knightcoin. This Cardano multi-ecosystem coin, multicoin ecosystem, I don't like it. When you have many coins, it's it's normally very bad. And yeah, now Trump is going to have this is his going to be. So they have Melania, they have Trump, they have World Liberty Finance. Now they're going to have a fourth coin. Okay. Uh let's see. Let's see. Let's see. But uh are there investors rewarding this behavior likely? So if the investors are buying, he's going to issue more coin. I mean, it is what it is. U next next. You have Colombia professor, a boomer sour kind of guy, I guess. Um I mean these professors in most cases they don't know anything because professors have always been super bearish Bitcoin, super bearish crypto. They've been so you know anti-crypto in their in their views. Uh so academia has treated us very unfairly like Donald would say that's been this has been very unfairly treated by the academia since its inception. And you know sometimes you're just too smart for your own good and maybe that's what professors are. A lot of them are smart people but what is smart? I mean that's another thing. What is smart? If you can do PhD paper, are you smart? I don't know. Smart is maximizing some kind of result. Like what do you want to maximize? They're not that great at maximizing their own wealth. Maybe they're great at climbing the the academic ladder. And by the way, if we have professors watching it, big shout out. Big I mean, if you're here, you're you're different. But I mean, you get the point. So when some professor says anything about any kind of investment, automatically I put it in a non-rusted bucket very quickly. Very, very quickly. Why? because you understand that they normally don't make any gain and uh yeah some of them maybe have some company or some business that's better at least they do some kind of business they they're contributing to to the economy but most of them they are chillaxing they're doing some reports some education guys again again big shout if you are professor obviously we're over exaggerating here a lot but it's true man it's true it's true I haven't seen any professor since 2010 bull now of course when black rockck is in now they they're changing now now many of them are fli But anyway, so now he is saying New York structure transaction plan reads like vaporware. Like what do you know about that? I mean literally. Anyway, um New York and the plan to enable blockchain backed um trading 24/7 trading. So let's see this guy. Sorry to interrupt the laughest over announcement, but this is like vapor. It has another corporate fantasy mas masquering as innovation. I'm happy to be proven wrong, but everything they've put so far leaves out the crucial details. Which chain? What primary language? Yeah. Yeah, it's true. True. I mean, there there's no answers, but uh listen, New York Stock Exchange for them. It's not about making a fake announcement and like riding some pump, you know, that more more people buy their stock or whatever. They have a clear incentive to do it. They have a clear incentive to go 24/7. You're going to have more trading. You're going to have deeper liquidity. You're going to have more fees and so on so forth. So, I don't doubt that they're going to have 24/7 trading. I don't doubt it. Everyone wants 24/7 trading. It's in everyone's best interest because traders, they want to trade 24/7. The only people don't who who who won't like it are the lazy bankers who need vacation and who need to be off on weekends and who need to go home at 5:00 p.m. They they won't like it. They won't like it. The lazy ones. Otherwise, like the platforms, they love it. They love it. They have fees coming 24/7. Who wouldn't want that? Uh traders love it. Companies probably love it also. They pro probably love it also. So, uh, in reality, I don't doubt that they're going to do the the 24/7 trading. So, to call it vaporware, I don't know. I don't know why likely it's going to happen. It's going to happen in a big way. We're going to have loads of people going to have 24/7 trading. And that's also why we have here in in bulmania.com. If you are part of the Bulmania program, you have all the stocks here in real time. You can see everything. You can see everything. See everything was happening in any country. I mean, you see here all the countries. Bum bum bum bum bum. We we we track stocks in all countries. So you have 24/7 uh pulse. You have uh your finger on the pulse. Okay. And uh that's that's important because very soon they're going to be trading 247. Okay. It's going to be like uh like stock like crypto. Crypto and stocks is is going to be the same. Memecoin or penny stock is the same is the same. I mean in many cases it is kind of the same already. Penny stock they forgot about something stock pumps then it goes to zero. Crypto kind of the same. The only difference is the access. Uh crypto you can access with a self custodial wallet. Just go to DEX stock you cannot. But in other regards is it's very similar. Now it's going to be even more similar. Now it's going to be even more similar. By the way, uh Germans, German, do you have any Germans? If you want to buy Ryan Metal, you can do it here. And guess what? It's up to since two weeks ago 20%. I mean, you see it's a Ry Metal Metal the metallergic metallergic company. big fat metallergic company up 20%. You look at your meme, you look at your coins, how many of them are up uh uh 20% in the last two weeks? Zero. Likely zero. Okay. Likely they're down also. So this is the thing. Metallergic semens. Semens. Let me know if you love semens. Well, it's up 21%. Now we're just looking at Germany. This is interesting. You can you can like click on the country. You can just see what's happening. So Germans are making bank here. I mean what can I tell you? It's a buyer AG. What are they doing? I have no clue. I have no clue. So, this is the thing with it being 360, crypto merging with stocks, stocks merging with crypto. Obviously, there are many cryptos that are pumping also if you have the the tool here to see when they are uh flipping. So, for example, you have Dusk up 300% since three weeks ago. Um u you have a people asking about axis since two weeks ago. We're tracking it up 170%. So absolutely you you can still make a lot of money in also community member that just waits for the pump even when it's bare trend you wait for five years then you get one week of glory time it's different man like it's two different philosophies so can you make money trading short term yes but B360 you know a week ago crypto was uh mainly down like you know few weeks ago it was mainly mainly down then it you had precious metal and stocks. Now you have cryptos since a few weeks ago as well. So guys, 360 360 guys, welcome everyone who is watching live. Let's do a bit of introduction. Although we're kind of close to Q&A already. Uh let know how you're doing this fantastic Thursday. Smash up like let's get to 4K likes. Um Simmons, Simmons, is that how you say it? Plumbers here and all Simmons Semens guys. Smash a big shout out to Guzman four times something today. And if you don't have Bullmania, you basically don't have access to any flips. You don't know what the hell you're doing. I mean, you're like chicken without the head basically. So go to bullmania.com, watch the free training is the first step to get the tools, to get everything. Do it right now. So at least you get this opportunities. I mean, without this opportunities, this market is uh is very tough. Very tough. With this opportunities, you get easy mode. That's number one. And number two, go to bullmania.com/ uhsubscribe is also in the description. get our free newsletter. It's super nice. Every day you get a short newsletter what's happening. Super super easy to read. It takes like 20 seconds to read and you're updated. So even if you miss a stream, you don't miss the what's happening in the market. And then the third thing, go to bullying.com/partners is also in the in description below. And here if you want to trade stocks, you can do it on Pionex. You get nice signup bonuses. You can copy the bots by buy bitunix weeks. You can go long, go short, use leverage if you want for crypto and for stocks and for precious metals. And on this note, let's proceed with some more news and then we go to Q&A. Oh, by the way, let me check this. So, apparently the reason why the crypto bill is stalling is because there is some kind of what is it uh rural America like how do how do they fit rural let me say rural what's happening here? The banking remained adamant opposing stable cocoin rewards as a risk to his community banks and rural America. Man, that's some creativity. That's creativity. So community. So basically they're saying that if stable coins can do yield, it's going to wreck community banks who don't do anything and it's going to wreck rural America. Now guys, if you are from rural America, make some noise in the comment section. Let me know if you're in some ranch in god knows where, you know, in some hall. Big shout out to your hall. I I think it's beautiful. Like nature- wise, all h halls are beautiful. But you get the point. Like rural America, you're out of nowhere, which is, by the way, a good good thing to be now. You know, you're remote. You can trade. You can be anywhere cheap. Everything cheap, everything nice, beautiful, field, forest, waterfall. Very nice. But anyway, let me know if you agree with this or or you disagree because at the end of the day, like why do you want to use a community bank? That's by the way a very strange thing that I discovered when we hire some people from the US. I asked him, \"Okay, what's your bank? We need to send payment. What's your bank?\" He gives me some random ass bank like community bank. I've never heard about it. It has some weird, you know, sort code, big code. And I was like, I was expecting he would give me like JP Morgan or something, but no, he has some, you know, god knows where this thing that I've never heard about. It seems to be like a like a US only thing with this community banks. So, uh they're not needed. You you don't need community bank guys. Like it's it's unnecessary. Just download wallet if you're r rural farmer Alabama, Arkansas, where the hell you are. Pull out phantom wallet. Boop boop boop. You have yield there. It's very nice. So this argument like is I just pulled up because I saw it in the in the in the in the title. I was like how they going to fit a rural America in here. Okay. But apparently they're afraid that all of the millions and trillions of rural community banks and guys by the way if you are from Europe you may not know it but in the US like they have like a million of them. You would think that you know each country has maybe like five to 10 banks and they have branches everywhere. No no I mean these guys they have a million of like different ones fully unknown fully unknown to the average person. Uh so as such the shift to housing policy may be seen as a way to buy more time. Okay, I don't know what all they're speaking about. I'm in favor of reaching a solution and facilitating compromise so as we can get structure bill passed, says David Saxs. Well, I mean, I think he should be just pushing for crypto. He's the cryptozar U. So, and this is obviously a Fugazi Fugazi argument. After delaying its markup for two weeks to secure bart support, the Republican Senate Agriculture Panel is reportedly ready to move forward without input from Yeah. ED them. I mean, listen, they're stopping the progress here. They're they're stopping the progress. So just move forward. This remain fundamental policy issues. Yeah. So how you going to fix it quickly? You either have control here and Republican Republicans just push ahead or we have no bill. It is what it is. If there is differences on fundamental policy issues, it means that either they can push through it without the other party or there is no bill. That's it. Although it's unfortunate we couldn't reach agreement. I'm grateful for the collaboration. Just get it. Get it. Get it over. If we can have stable coin yield. If no stable coin yield, don't get it over. But let's let's retry in the future. Now guys, uh BitGo is going to go IPO. Um why is this good? I mean it's good. So there are more crypto companies because company is in many countries treated differently from a tax perspective than holding crypto ETF even. So having Coinbase, having Bitco like having a basket of crypto companies as a proxy to Bitcoin and and Micro Strateg obviously also plays a role is good. So let's see how the IPO goes. And uh yeah, so let's see. It's going to be be Thursday is today. Okay, so they're IPOing today. Bit go. There we go. Now, Ripple uh let's see, they have some growth in the stable coin. Yeah, you can read yourself. Uh new research research, US inflation researchers challenging Bitcoin boost disinflationary best. So, this is going to be super important. How will inflation uh continue moving ahead? Now again some um um B Pearson institute is is this some economy like is is is this someone who is trading or just philosophizing the researchers say Trump era tariffs tighter labor markets possible migrant protection large fiscal deficits and easier financial conditions could outweigh productivity against strong AI. So let's see what's going to happen here with inflation. But obviously if inflation becomes high, the Fed will have tougher time cutting rates and uh this global liquidity expansion will be tougher. Now Trump is going to put a person that he thinks he can control. But just like Trump said yesterday during his speech, he said that you know he appointed Powell and he said that these guys once they get the position they change. So Pavle was supposed to be Trump's guy, but then he became rogue because once he's there, Trump cannot remove him. So he now needs to put in a guy who can print and hyperinflate or whatever they have to do to bring economy back without any opposition. How can he do that? Let's see. Let's see. I mean, he may need to be a bit creative there. He may need to Yeah, he really needs to control the guy. Not just that you are point and you hope he's going to be okay but some levers of control. You can think yourself what like how he can do it. But uh yeah I mean it's uh it's been done before in politics. Okay. It's been done before in politics. If they flew to some famous island maybe that's that's one way but I mean if I'm to guess how Trump is thinking probably something like that like how to get someone maybe he was on like so he really follows the instruction. Yeah. Because otherwise you know this pow he got in. What happened? He changed. He fully changed. So let's see guys. I don't know what you think, but I think Trump now is going to be very very careful who he puts there because if inflation is back and uh Trump cannot control the interest rates and now the guy wants to be conservative and responsible Fed share this and that, Trump is not going to have any control. And listen, this is not I'm not saying what's what's best for US dollar or or long-term. I'm I'm just saying like for crypto and everything, we need the printer. Okay? We need for Trump needs the printer. Uh I mean obviously you need to be responsible if you want long-term success for the country that no one is responsible. So let's just forget that. Let's just see the fastest way to printer. Okay. So and Trump wants the same. He wants the same. So guys, let's see. Let's see what's going to happen. Uh Thailand know you are in Thailand. Let me know uh how how it is in Thailand. You love Thailand. You you're great. You how is the dating scene? You never know what you get. It's like a a black box kind of uh that you you will unbox later on. Let me know if you have that experience or not. But the good thing with Thailand is that they have plans to do ETF rules to do ETFs in Thailand. So now when you go to Thailand, you both get an ETF and then you have a black box that you can unwrap and see what's going to happen. Guys, that's it. Let's go to Q&A questions, answers, debates, discussions. Big shout out. Thailand sounds like Iceland. I know. I know. So Trump may confuse it as well. Let's go to Q&A, guys. Questions, answers, debates. Let's go. Let's go. Let's go. SK pri price in Seeker wallet is stuck at the same price which while at exchanges maybe it's a UI bug. Maybe Ju just look at the coin gecko. You're going to see it. Um maybe it's a UI bug bug. Ivan, do you trust so much on the banks and sensory systems? I don't trust them. No, I don't trust them. Uh, no, not sure what you mean. I mean, we need the stable coin yield for example. So, you don't need to use a bank. So, you can you can never trust them. You can never trust them. Um, man, that Trump destroyed the whole crypto market. Well, the thing is there it's just too crazy. I think the market just finds us a bit too crazy, which should theoretically be good for crypto when you have a crazy ruler, but uh crypto now is traing more like innovation and less like gold than the silver. I mean, it is what it is. So, yeah, that's very important. Don't forget to pump the bit. Let's pump the beat. 100%. Thanks for reminding me. Before I had like a clear uh I I I I had a clear like muscle memory to turn on. Now I forget sometimes. Okay. Here's the bit. Here's the bit. Let's pump the beat a bit. Ian, tell us about your worst. Oh, guys. I mean, uh, yeah. I mean, the reason why I can speak so clearly about all points, the reason why I tell you about the mental prison holding all coins down is because I've been there. I've been there. And the amount of money I lost, I mean it's uh let me let me see how many figures it's three three I mean it's in the high seven figure like at the peak of u of my losses I was down in high seven figures uh in a in bear and uh it really I mean it forms you as a person like never before. So what and it's always possible to come back. I mean I've been in crypto since 2013 like I've been there everywhere everywhere. uh and uh you start to respect capital more. I mean after such a loss um you you you start to respect capital way more. Uh you start to really consider what the hell am I doing here? Because obviously you start to respect money. You value it more. It was hard to make it and now you know we're down so so quick. It's a matter of weeks it can be down so quick. And what did they do at that uh point? This was I mean it was long time ago now but uh the scars are there. I I know myself that year was probably the worst year of of my life like just emotionally uh because I never had to deal with something like this before. I and you know it's like on a nervous system level you have scars like you have scars obviously now it's I view it a bit differently but still the scars are there and I remember like every day I was waking up checking the portfolio checking maybe stock market is going to pump today I was hoping maybe stock market is going to pump so bitcoin pumps hopefully stock market pumps so bitcoin pumps and then stock market opens it doesn't pump or it pumps and bitcoin dumps okay all the alts all the alts uh let's check different ICOs like what's happening guys was I was writing guys what's happening any update any update it's quiet like some some guy tells me don't don't why are you spreading fud like people started attacking me you know I'm I'm asking hey guys what's happening what's happening any updates and then you know the so-al community members they start attacking me hey why are you spreading fud get out like it's it was crazy man it was crazy so um I know all of it that's why we have bulmania.com because my mission in life I mean literally I'm not I'm I'm not over exaggerating my mission in life is to teach people to be saved from all of that. So watch bullmayer.com. Um I mean our whole program with the tools with not being in a bad trend is those lessons is those lessons and you know the saying is that it's good to learn on your own mistakes from your own mistakes but it's best to learn from other mistakes. Uh because that year uh I mean the good thing with crypto again if you persevere if you survive it's not going to be pain for like a decade. It's pain for me it was pain maybe for 18 months. Uh but then you know as soon as crypto starts trending up now there are opportunities done now know there are new trade setups and so on so forth and uh yeah the good thing you need to stay in crypto that's that's it stay in crypto because that's where you make money that's where you lose but that's also where you make it back so yeah it was uh crazy it was crazy and uh I mean still I'm thankful that I that I had it because I mean who knows maybe in uh so For me it was um high. Let me just bum say three three. Yeah. So it's high seven figures meaning that high in millions like high millions but it's below 10. Uh you know in in the future maybe I I will have an issue if I don't if I wouldn't learn the lesson maybe in the future I would do the same mistake but now it would be high nine figure. Okay. Or maybe even more. So of course I'm thankful that that it happened but uh man it was not fun but it was good that it happened and it happened like relatively early in my life. Uh so you you understand yeah you cannot like it's no one tells you this. No one tells you this if you don't if you just watch like YouTube or Twitter like you cannot for for real learn that that's why we have that's that's what made me create bull at home because what happened to me it happens to every like even now it happens to everyone even now like since October 8th I know many people did not listen it happens to everyone and then one guy wrote yesterday that the the October 8th call saved him uh let's see where is it is Is he here? Here, here. Like this guy wrote yesterday that October 8th call saved him. And um yeah, bare trend is very serious guys. I mean it is what it is. But you will make it back. If you stay in crypto, you will make it back. And the speed of how you make it back depends if you have the systems, the knowledge. That's why, you know, we have booming.com. Go there, watch the free training. So yeah, it was crazy. And that that's also why you know you start valuing money more and uh also I'm more uh I'm more okay to spend money now as well because before this was like in you know 20 17ish times. I mean before I was uh you know always save save save save invest invest invest but okay then if you make a mistake in dollars the loss is so big you're like man why didn't I at least spend spend could have spent it on something obviously you need to save you need to invest but um it puts it a bit in perspective also anyway so that's that did you ever hear about the 1980s in the US They hired all the PhDs and professors to start hedge fund and they almost single-handedly crushed the entire I haven't heard. What did they do? What did they do? Ivan confessions. Exactly. Exactly. No, I mean I should share I should share more of the of the journey. Did you buy property with the winds? So at least I did that but it was also not too great. Uh because uh then I decided I want to move. So this was in Sweden. I b I bought like guys I I had like seven houses. I thought I would be like real estate guy Airbnb like I thought it was smart. Now what did they go down 70% or 90% like all coins? No. So at least that was good. But the problem guys then when I decided to move from Sweden man I felt like it's a such an anchor. Uh I would have moved faster even if I didn't have the anchor. And you know real estate it's always easy to buy. You can buy and if you have money you can buy like next hour you can be owner. Then you realize okay how the f do I sell that crap. Oh my god. That that that was a different story. That was a different story when they decided to move to move out. Ah yeah that that that's a crazy anchor. So I don't like real estate guys. I'm not a big fan of real estate uh because it is an anchor and many countries have real estate as tax residency test. So I could not check out from Sweden as tax resident before I sold all of them. It was crazy. It's crazy. It's crazy. So yeah, no more for me. I I I didn't like it. Also, man, it was like, you know, stocks go up more. Uh crypto goes up more through time. uh you need to manage it things. So, you know, I didn't have too much real estate before. So, I I didn't even own a house before. You understand? So, obviously, I totally underestimated how much work a house is like real estate is. I thought, you know, what can happen? I I guess if something happens, I call a guy, he fixes it and that's it, man. Yes. Okay. Maybe he fix it. But what if he doesn't arrive? He's late. He there's more issue. You need to keep keep track. Okay, maybe I should have management firm. Okay, but now they they take a cut and now they they need to manage them and now you you know they are on vacation and this and that and holy. Yeah, it's not good. It's not good. Uh obviously if you're black rockck it's different like if you are a big investment fund is different but if you are you know this uh you have a few houses here and there I don't like I don't like it. It's very bad. It's very bad. Then go to it's better to be in in Marcus. It's better to be in Marcus. way better. Way better. So, basically with with my real estates, what happened? Uh, I bought like seven houses. I made mistake. They were expensive because I thought, see, here's another mistake I made. I thought because they're kind of premium and you know, they were next to lakes, like they were super nice, but I thought, okay, because they're like a premium, it's going to be easier to rent, which was true. What I didn't think about is that if I have to sell, holy crap, it's going to take a long time and I just wanted to get out from Sweden as soon as possible because it's I mean it's it's crazy. But um so basically I had to take a loss on them. Uh not like an altcoin loss, but you know it's between 10 and 20% I had to take a loss but for me it was worth it just you know to remove the anchor. It's a lesson that's it. I'm out. I can breathe and I can move ahead. So uh yeah real estate for me was very bad. Not saying that it's bad for everyone, but I just don't like anchors. I didn't I didn't I didn't know that about myself before, but I don't like that I cannot move, that I cannot, you know, wake up tomorrow and say, you know, I'm out of here because laws change, countries change, taxes change, everything changes. They can change everything so so fast. Today there's no wealth tax. Tomorrow there's wealth tax. Look at Norway. Today there is no exit tax. Tomorrow there's exit tax. Look at Norway again. Today they are a bit more capitalistic. Tomorrow they're a bit more communistic and you have no power. If you have real estate, they have you by the balls. Okay? In a tight grip. I don't like that. I don't like that. Anyway, that's it, guys. That's it. AI can substitute the plumber. Yeah, maybe when there is this uh Optimus. Optimus when when we have Optimus, maybe it's worth to having a real estate empire. And again, if you are like your Black Rockck, you're really big, then real estate makes perfect sense. Why? Because number one, you're a massive fund, so you can actually have opinion when it comes to policy. Number two, you are big enough to not, you know, worry about anything and you have everything is managed by itself. But most people, like in our audience, when they ask about real estate, most people they have maybe they have a few million, maybe have they have a few hundred thousand. So for them, real estate empire means buying a few Airbnbs and then being a slave to them. And I can tell you, I have the experience. It was very bad. It was very bad. I don't even remember how I pulled it off. Like thinking back, I had to manage them. And yes, we at some point we had management company, but still you still have to manage the management. It's it's never like Bitcoin where or staking where it's just does the work. Okay. So now you know with the money you do risk are you in cash or have you bought stocks? So I have I have a smaller portfolio for trading the daily uh daily flips but most of it is is just waiting to get back into uh crypto around the 200 a week if we go there or back if we're above the 50 week. Real estate is mega anchor 100%. My house has almost doubled in 10 years. Yeah. So there are such cases and the uh the time to buy house was in early 2010s when it was low interest rate negative yield this and that and that was my thinking when I bought my seven houses. The problem was that I bought them like in early 2020s and it was way different. It was way different. Basically I bought the top and uh it was down only since and increase interest rates. But I also thought but also see here's another thing. I thought I'm buying them for the long term. I thought when I bought them that it's going to be 10 to 20 to 30 years and I thought that there's no way to lose money because it's real estate like in 20 10 20 30 years it's it's going to be up only and it's true the but what I did not consider is that suddenly I will want to switch countries. I thought that uh you know when you develop yourself as a person you also learn what you need what you value. When I bought them, I didn't think that I I just want to check out. But then I woke up. I said, \"Holy crap, I don't want to be here anymore. How to CHECK OUT?\" OH MAN, I HAVE SEVEN OF THIS HOUSE. So expensive. How to sell? Calling the real estate agent. Agent. Here's the scam with real estate agent, guys. Real estate agent. Super bullish. He's like, \"Yeah, I will sell quickly.\" Okay, that's a scam. That's a scam. He knew for sure he cannot sell quickly. And he said, \"Yeah, yeah, yeah, yeah, yeah, yeah. Let's sell uh which price you want.\" I told him the price. Yeah, for sure, for sure, for sure. Then he puts it out crickets. Then he say, \"Yeah, we need to lower the price.\" So now, now having experienced I the strategy is simple. Be the scammer and tell the seller that you're going to sell very fast what price he wants. Just said yes. Then you you said you tried is it not work? Now you decrease because for you as real estate agent, you don't care if seller is at a loss or not. You you don't care. You don't care. You just tell him to decrease. You tell him, \"Hey, decrease more.\" There is no maybe Oh, I have this guy, but you need to decrease. So, basically, he just wanted over the line and I also want just want to check out. So, kind of a incentives aligned that, you know, just get rid of it. But yeah, it was not a good investment, not good experience, not good anything. So, uh if you want real estate guys, buy rate, you know, rate, real estate investment trust. Let's see. Um, let's actually see. Oh, by the way, all of the real estate, guys, let me see if we track any ETFs based on that. There we go. Guys, guys, guys, in Bull Mania, if you want real estate rate, rate, rate, rate, buy rate. Okay, they don't pump too much, but you can say you're a real estate guy, but at least this one you can sell quickly. At least this one, boop, you're out. That's it. Buy rate. buy rail, buy rate. That's it, guys. In another world, maybe I will be real estate uh agent. I I know their playbook. I know their playbook. I'm gonna call I'm going to say we're going to sell it for $1 trillion. Then I'm going to say, \"Ah, there's no buyer, guys.\" But we and then of course they sign we sign agreement that we're going to work for like three months at least and then say, \"Yeah, but we or even if you I think I think my because I had different ones for different houses. I think some of them had that, you know, we try at least not two months. Some of them didn't even have that, but you know, switch to a new guy like it's ah might say another to fill out more forms. Uh anyway, but guys, there you go. If you want easy money, you should be real estate uh agent and and do the strategy. You can thank me later. If you are real estate agent, let me know in the comment section. Let me know how you sell. How you sell. Did you claim your SKR and what are thoughts on holding and restaking it? Yeah, so I claimed it. I ris I rest it. Exactly. I restaked it. Why? Because my uh philosophy when it comes to airdrops is that I don't sell them because I don't want to, you know, just cheating on the on the team something I got for free. So I haven't sold my Pangu airdrop. I haven't sold my SKR airrop. Um I think SKR made 20x in the bull market. The Kudel knows it's a it's a small cap alt. It can do anything. So I would rather have that lottery ticket. What will happen to it? So, I just claimed it. It said it said stake. I I said, \"Okay, stake.\" So, I staked it, but I got very little, guys. Like, even if it's 20x, it's not going to be a lot because I didn't poke around with the phone too much. I think I like 5k. It's like $50 towards it is is nothing. So, for me, just maybe it's 100x. Who the hell knows? I I I just have it. Let me know how much you got. I I think I got like like the lowest because I didn't have time to poke around in the phone. So, I just uh opened the phone, I checked it, and that's it. And for that, you get 5K. Tanya is in real estate. She's not here today. Yeah, she she's in a good uh spot. I'm a real estate agent business in Spain. Costa del Sol. Yeah, I mean there you have a lot a lot of whales. A lot of whales. Marba buying selling. Yeah, I watched this very nice Netflix show. It was I think it was Netflix like it was a Swedish guy real estate real estate guy and he was working in Marba and they were selling like 30 million houses and all of that but it's a hustle man you see in that video you see it's a freaking hustle to sell that so when things become if you okay let's say you really want to be real estate guy I would buy like super average price apartment super liquid you can sell it in a in a in a millisecond because I also had a few apartments and and They were quite quick to sell because you know a normal person could buy them. My houses you you could not be a normal like you you had to be a bit uh whalish whalish and uh man that was very bad. But the apartments I actually kind of was break even maybe even profit if you look at my rent income uh very very much not profit if you compare to Bitcoin during the same time. And the apartments they were you know they were still good. They were still good but like a normal per person could still buy them. If you have like good job you can get mortgage you can buy it. No problem. No problem. It was also good area this and that a lot of need a lot of need um a need for need for them. So yeah that was kind of a case. So if I am to restart let's say that I have a gun to my head I need to be a freaking real estate guy. I would buy apartment uh maximum few hundred,000 bucks so average playback can get mortgage and buy from me if I if I change my mind. Okay that that's very important. That's very important. That's okay. But it's okay about land in the metaverse. Digital property even worse, man. Exactly. Exactly. The only thing worse than physical real estate is digital real estate with a land in the metaverse. Yeah. Yeah. Thanks for Thanks for calling me that. It could have been even worse. That's true. That's true, guys. Okay, guys. That's it. That's it. Thank you so much for being here. Big shout out to Guzman for time helping us today. Smash the like. Subscribe to the channel if you haven't yet. Go check out check out bullmania.com. Go to uh bullman.com/subscribe. Like all of these links are in the description. So just just check there. I will just tell read out loud. bulmania.com/subscribe for free newsletter. For all all the exchanges, you go long, you go short. You can make money when it pumps or dumps leverage up to 100 days. Be careful. But you can use it for stocks, for gold. Bum, bum, bum, bum, bum. Guys, see you tomorrow. Big shout out to Guzman. Bye-bye."
    }
]