[
    {
        "video_id": "6o455uM04P8",
        "title": "Zeta Stock MASSIVE Reversal SHOCKS The Market!",
        "published_at": "2026-01-23T04:40:17Z",
        "sort_date": "2026-01-23",
        "url": "https://www.youtube.com/watch?v=6o455uM04P8",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope you guys are all having a wonderful day. We're going to be talking about the market as we continue to see some resiliency and good economic data that is helping to push this market higher with the S&P 500 now above 6900. Again, we're continuing to see the bulls that are buying the dip. Now, talking about some of these reversals that we've seen within the individual names we've been talking about on the channel, some are getting kind of quite attractive. We'll be talking about some of the major themes and some of the big names that I have on the top of my watch list right now. Uh, with one of the big key players being Agentic AI, what my favorite ticker symbol is for that. We'll of course be talking about Palanteer as we've had and talking about some of the other important data center names and one of them that's going to be releasing their earnings quite soon. also looking at that macroeconomic data. What does this mean for interest rate cuts and we'll finalize with crypto? Did it make any moves? So, if you're a new or returning viewer, hit the like button, subscribe for daily videos. Let's pop it up on the channel here. Let's talk about Zetta. Now, Zetta, we've been covering this not as a main focus, but kind of on the watch list. Uh talking about the major theme for 2026. What is this going to be the theme in terms of a niche within the AI industry? And a lot of people are talking about Aentic AI and that's basically the favorite retail ticker for Zetta. Why I particularly like Zetta right now and recently from its technical action in its type of pricing behavior is that we've had a nice reversal that's been triggered on Zeda. Now Zetta as we know has had recent partnerships with Open AI. And just looking right here, I encourage you guys to look at their new product Athena right here. That demand is probably going to be uh upscaling at a rapidly quick pace. Looking at some of these demos here on what this type of a gentic AI platform can do is kind of similar to what kind of palenteer can do with AIP and what we saw it do over the last few years. So that's why Zetta is becoming a very very attractive stock to me personally. And what we've seen is Zetta had a nice breakout after we saw its um partnership with OpenAI. And that's where we saw Zeta that even pushed up here to about 24 sitting at about a $5 billion market cap right now. So uh you know not it's a decent cap stock but nothing too crazy. Still could be really early in the game depending on how this all plays out. Now, Zetto, what we had here was a downtrend recently. Now, this downtrend, what I like is that the downtrend line and right at the 50 basically at the 50 uh moving average got tested with a very nice bounce right here. And specifically since that bounce right at that 20s or just slightly below right here, you see a nice reversal right back up to the 22. So, personally, I like this. I think we could see a move passively back here to the 24s. And then the big question, you know, is what's going to push ZA? Is that going to be individual news within itself or are we going to see the macroeconomic situation that continues to look bullish? Once you get that push through the 24s, you know, is that where we enter into the breakout room, you know, and of course, none of this could happen. We could have huge big changes within the macroeconomic situation. Uh, you know, these setups are only as good as our follow-throughs, but that's where we're sitting at right now. looking at the economic data and how this relates to interest rates. You know, long story short, we're probably not going to be getting another cut at the next meeting. That's because we got a quarter 3 uh GDP beat here. You have consumer spending that's in line. One of the big things here, you have the jobless claims that actually beat and continuing jobless claims that is beat too. So, the labor market is really resilient. On top of that, the GDP is looking good, which keeps me bullish that hey, these whole kind of stipulations and uncertainties that we've seen with the weakening labor market data, we're finally starting to see a little bit of a relief from that. And if people continue to have jobs, are going to continue to spend money, which is good for our economies and especially good for the earning season. So, right here, economic growth is continuing to defy expectations. There's little need for rate cuts right now. I would agree. the market uh kind of basically priced this in and didn't really react like crazy uh in terms of we're probably not going to get the rate cut. So that's fine. Uh I think that's fine especially with what the current economic data says. We got the S&P 500 here above 6,900 and up another half a percent. Things are looking quite well. You see IWM right here also at 270. I like here where IWM sitting at and this has been doing nice. Uh in terms of the futures right now, SPY futures, the overnight session up about another 20 basis points right now at 690 on the SPY. Now, right here they say little changes. One of the big things, you know, that brought optimism back into the market here, of course, was when Trump had called off the whole tariff thing. Uh talking about tariffs on imports of the eight European nations that were set to start on February 1st. Uh also talking about the concept of a deal regarding all the, you know, Greenland drama. Nonetheless, you know, with the administration, you're going to get going get to get a lot of noise headlines here that are going to cause uncertainty, going to cause fluctuations in the market. But nonetheless, I like the current fundamentals of the economy and the fundamentals of the stocks that have been looking at are continuing to remain strong. So, you got gold, you got silver, you know, doing very well. There's a lot of risk on assets that are starting to catch a bid. And just looking at some of the names here, you know, we see that with Cipher today. Uh, Cypher did quite well holding above its 50 now again at 1753 and you see Iran here at 53. Now Iran had a nice pull back to the 50 that we saw before we saw a nice reversal. Now Iran, they will be releasing their quarter 2 uh fiscal year 26 results on Thursday, February 5th, Eastern time. That's going to be coming up here soon. And you're probably going to be expecting a lot of volatility around IEN and especially depending on how those earnings play out. That's going to have a big impact on the volatility and the movements of the other data center names. We're talking about Cipher. We're talking about Corweave, Nbius. Now, Nibbius is under 100 again. Once Nibbius I think can hold this 100 kind of psychological support area where we've seen some key reversals being triggered before, uh that's where I think Nebius could have that next move to its next leg higher. On top of you know what we talked about with Zeda here having a nice reversal. Path also another agentic AI name is also kind of catching a bid here and is above its 50. I like path right here comes up and currently right now in the overnight session at 1525. This came up about 7% today and over 7% with the overnight moves. You know and path was recently down here yesterday in the 14s. It even dipped into the high 13s. So, the fact that we're seeing a nice reversal in a lot of these agentic names um is keeping me bullish in terms of this top theme that we're seeing. And also, let's talk about Palunteer, of course. Now, Palanteer is hanging out right here at 166. This is an interesting area. I would like to see Palunteer recapture the 170 support level in the near future. I think that's an important zone because Palunteer likes to consolidate between the 170 and the 184. Uh they also have earnings coming up here. So earnings could be a catalyst that could help push it. However, those earnings are pricing Palanteer to perfection. So they have to come out with some slam dunk earnings. Historically they have though. Um so right here at the 166 just kind of hanging out here. One big thing you know that's important to recognize is that a lot of the big banks and analysts all have over $200 price targets for Palenteer. Bank of America at 255, Cityroup, Truis all at 230 220. So, you know, these big game players are predicting Palanteer has a move to go higher. Um, depending, you know, in talking about its resiliency, I wouldn't be surprised. This is a hard hard stock to short. Um, not saying there isn't room for a leg down. If this breaks down, you could see a possible testing here of the 150s, but I like Palenteer here. We'll see what happens. I do think though that it does need to recapture that 170 support zone in the near future because if we get any big changes in the macroeconomic environment, that's where you could see a further breakdown. Talking about cryptocurrency, Bitcoin not making many moves. Sitting here at 89,000. Ethereum below 3,000. Also not making a ton of moves. Uh Ethereum I think needs to recapture this 3,000 zone. Uh hopefully we need Bitcoin to recapture this 90,000 zone cuz they're just stuck here. They're not making any moves. So, I don't have any current exposure to any crypto right now or looking at BMR. I mean, BMR is at 29. It's had a nice double bottom here at the 27. I'll personally be keeping an eye on BMR. You know, I talked about possible exposure at the 27. Never took any trades, but we do see that nice reverse. So, I don't know. I just want to see Ethereum make some more brighter moves. You know, in terms of talking about this, this is an interesting tweet that I saw. You know, you have these big institutions, Black Rockck, JP Morgan, 35 other firms building on Ethereum. We know tokenization is a big big initiative by Wall Street uh trying to kind of bridge and create the synergistic effect between traditional finance and DeFi. Um so once this takes off, I think it could ignite quite quickly. It just kind of happens, you know, not a matter of if I think it will, but it's just more of like when. Uh so and with Ethereum that's just been stuck here in Bitcoin, I don't know, just personally, it's not the most attractive name for me right now. I really like the data center names. I like agentic AI. still continuing to develop, you know, some of these real world technological changes that are accelerating at a rapid pace. That's what's keeping me bullish and I think is helping to keep the market up generally um in terms of resiliency across the board. Let me know what you think down in the comments. Peace out. Take care and I'll catch you guys"
    }
]