[
    {
        "video_id": "uvaYpUPLiaU",
        "title": "Cathie Wood &amp; David Sacks Make INSANE Predictions",
        "published_at": "2026-01-23T16:04:49Z",
        "sort_date": "2026-01-23",
        "url": "https://www.youtube.com/watch?v=uvaYpUPLiaU",
        "transcript": "I've got a spicy show for you today. Firstly, a clip from Kathy Wood who makes a prediction. That sounds pretty crazy. And then David Saxs breaks down where the US is actually standing against China in AI. And then I've got a bonus clip at the end of Kathy on Tesla. So stick around and enjoy that one, too. >> We also um have your 2026 outlook. And what's interesting is you note that this is an important economic historical moment. How so? Well, we are in a technology revolution. Uh, and many people thought that the internet was a technology revolution and to some extent it was. Um, but today instead of just one major platform evolving, we have five. So robotics, energy storage, AI, blockchain technology and multiomic sequencing in the life science space which might which we believe is the most profound application of AI healthc care. Uh and so this boom, if you look back at the railroad boom, uh the amount of investment uh that that uh that we saw back then was about 6% of GDP at its peak, 5 to 6%. Uh the internet boom was more like the auto boom in the early 1900s. Uh was more in the 3 to 4% of GDP range. >> We believe this uh this five platform innovation uh strategy or or or boom uh is going to move to 12% of GDP and we do believe also that uh productivity growth will accelerate to the 4 to 6% range and be sustained there. Normally we see a cyclical peak around there and and then it falls back. We think it will be sustained and we think that by the end of this decade real GDP growth could be averaging uh more than 7% per year. And I know that sounds shocking given that we've been at 3% for 125 years. Um but it is the history associated with technology revolutions. A step change up in GDP growth. the productivity increase, the GDP growth that that you are forecasting as a result of these disruptive technologies, to what extent is that the result of fewer people doing more? My question is about job losses as a result of this technology because if everything that investors are betting on when it comes to this AI revolution comes true, it means that companies aren't going to need as many people to do a lot more. What does that look like? Well, uh GDP growth at 7% plus per year tells you there's going to be a lot of economic activity, more economic activity, uh uh on a from a sustained growth point of view than we've seen in quite some time. The history of technology is it's a net job creator. uh in the early 90s when developers were evolving the internet, we could not have imagined Uber or Airbnb back then. Uh and I think the same is true now. We cannot imagine the kinds of jobs uh that are going to exist in the future. And the other thing that we're excited about from a job creation point of view uh is we're seeing new worlds being created. And by that I mean most of us think about earth. Uh but now uh we're moving into space. Even data centers we think Elon uh leading that charge will start moving into space and we won't have the not in my backyard and the bureaucracy associated with data centers. There are going to there's going to be huge job creation around the space exploration and all of the opportunities out there. And then the other one and you'll find this in uh our digital assets section of big ideas uh is the digital world immutable private property rights. >> Uh we know from economic history the best way to lift people and countries out of poverty is with private property rights that are immutable. Well, that is now moving into the digital world for the first time thanks to blockchain technology. So, we're not worried about job creation. But for those who are because there is something happening uh that I know is concerning to many people, >> uh the the unemployment rate for 16 to 24 year olds, right, >> has moved to 12%. 12% big increase. Uh and what is that saying? That's saying that entrylevel jobs uh are not being created the way they used to be. To those people, I say, you know, you must have in your mind an idea for a new business, something that frustrates you, uh an unmet need. Well, now you can go to Chat GBT. Uh, you can go to Grock and you can have an assistant help you build out that business. Just interview for jobs, but also think about new business ideas. I think we're going to see entrepreneurial explosion here. >> Five technology platforms converging at once could drive more investment than the railroad and internet booms combined. Kathy is making a structural argument here. She's saying, look, the railroad boom peaked at about a 6% of GDP in investment. the internet was at maybe 3 to 4%. But right now, you've got robotics, energy storage, AI, blockchain, and genomics all hitting maturity at the same time. Each of those would be a major economic event on its own. Stack them together and you get to her 12% number. The 7% GDP growth prediction is when most people check out. We've been stuck at 3 three and a half% for over a century. But that's kind of Cathy's point. Technology revolutions create step changes, not just incremental improvements. You can't think of railroads in terms of growing the economy because they literally rebuilt the economy. And if AI alone can boost productivity by 20 to 30% over the next decade, which is actually on the conservative end of some estimates, then her predictions start looking more realistic. Kathy also mentions chat GPT and Grock as business building tools. Starting a company used to require capital, connections, and a team. Now, someone with a good idea can prototype it in a weekend. You can generate marketing copy, write code, handle customer service, do legal research, all the stuff that used to require hiring people or paying consultants. That's going to unlock a lot of businesses that would never have existed. The job creation piece is where Kathy will get a lot of push back, but history's actually on her side here. Every major technological shift, steam, electricity, computing created more jobs than it destroyed. The jobs just looked different. The question is whether AI moves fast enough. If you're a beginner to AI and interested in deep diving, I built the course I wish I had access to when I first started researching the niche. It breaks everything down in a simple and easily to digest way and covers everything from different types of chips to physical AI, even data centers in space. If you join today, you get lifetime access and the price will be increasing as we add new modules, which we're thinking about doing soon. Back to the video. So, that was the optimistic case for what's possible from Cathy. Now, here's David Saxs on why we might not get there. David Saxs has been inside the policy conversations in Washington, and he's got a really clear view of where the US stands against China. The answer is nuanced. America's heading on almost everything that matters, but there's one factor that could cost the West the whole race. Check this out. >> Let's talk a bit about China and where it is relative to the United States. Are we winning? Is it about chips? What's the race specifically really about? >> Well, I I I think that in general, we're ahead of China. There's different layers of the stack. So, you've got the the the models, then you've got the chips, and you know, then you've got the chipmaking equipment, you know. So you go down the stack. I would say that the deeper in in the stack that you go, the greater the American advantage. Um I think on models most people would say that we're our models are maybe 6 months ahead or so plus or minus of the Chinese models. You look at chips maybe 2 years ahead. You go to the semiconductor manufacturing equipment, it could be like five years. So the US does have sign significant advantages. There there's only maybe a couple of areas where I think China has has an advantage. Um one is on energy production. If you look at the their grid, their grid has roughly doubled in the last 10 years, whereas ours has only grown by about 2 to 3%. Energy production in the US has been a relatively sleepy industry before AI came along. And a lot of that had to do with regulations and the antipathy of the previous administration towards energy production. Obviously, President Trump had a very different view on this. I think he was preient on this issue. You go back 10 years and he was talking about we got a drill baby drill and um and I think he understood that energy growth was the precondition for economic growth and it's definitely the pre precondition for this uh AI infrastructure growth. So this is an area where again we have to basically expand our energy production. Um and I and and and and so I think that is an area where we need to catch up. The other area where I would say you know I I don't know if I would call this an advantage exactly but if you but you could argue that China has the edge in what is what's being um called AI optimism. So there was a a polling done by Stanford across countries and they asked the citizens of all these different countries uh do you feel that the benefits of AI will be more beneficial or more harmful? And if if you thought that it that overall be more beneficial than harmful they call that AI optimism. Well in China AI optimism was 83%. So 83% of the population feels that it's being more beneficial than harmful. That number in the United States is only 39%. So for some reason people in China are more optimistic about AI than in the United States and you generally you generally see this that uh Asian countries are very high on AI optimism in the western countries are lower and I think it's a interesting or open question about why this is. I think there's a few possible explanations for it. I I think that um first of all the the media tends to focus on the doom and gloom stories with with AI. the fear >> the fears um and we can talk about some of those fears and uh and and how you know whether we think they're they're real um but I think the media has a lot to do with it. I think that the the way that Hollywood has portrayed AI over the decades, you know, with whether it's the Terminator or 2001, uh, has, you know, has portrayed this dystopian view of the future. And I think that plays into people's thinking. And then, frankly, I would say that part of the the fault lies with our tech leaders who haven't necessarily done a great job describing the benefits of AI. In fact, when they're talking about, you know, AI eliminating 50% of knowledge workers, that doesn't sound like a, you know, very utopian scenario. That sounds dystopian to most people. And so, I do think that unintentionally some of our tech leaders have played into this um AI pessimism. And the reason why I think this could be a disadvantage for the United States is because, again, it's feeding into this regulatory frenzy. We're seeing again 1,200 bills at the state level. And right now I think, you know, we are winning this AI race. We're ahead in all the key dimensions, chips, models, and so on. But we could shoot ourselves in the foot. You know, if we end up overregulating this thing to to death, we could actually cost ourselves this AI race. So, I do worry about this question of AI optimism. >> America leads China on chips, models, and equipment, but 1,200 state level AI bills could hand them the advantage. David Saxs breaks down the stack really clearly here. Models America's maybe 6 months ahead. Chips perhaps 2 years, semiconductor equipment 5 years. The deeper you go, the wider the US lead. And that's actually great news because the foundational layers are hardest to replicate. China can iterate quickly on models fairly fast, but catching up on chips manufacturing takes years of investment and expertise they might not yet have. But now we have to touch on energy. China's grid doubled in the last 10 years while the US only grew around 2 to 3% which is actually a shocking comparison. AI training requires insane amounts of power. If you can't power the compute, you can't train the models. The AI optimism gap is huge though. 83% in China versus 39% support in the US. David Sax blames media, Hollywood, and tech leaders. When your cultural reference points for AI are the Terminator, you're going to be a bit skeptical. And yeah, taxos talking about eliminating 50% of knowledge workers probably isn't helping too. But public opinion drives regulation. If voters are scared, politicians respond. That's how you get 1,200 bills. The real risk David Sax is flagging is the US isn't going to lose this race because China out innovates. The US could lose if they regulate themselves into paralysis while China moves fast. We've seen this pattern before in other industries. Europe has basically regulated itself to death and out of the tech race. There's a window right now where the US is clearly ahead, but that window closes if every state passes different AI rules and companies spend more time on compliance than building. China doesn't have that problem. Their government decided AI is a national priority and they're moving. Before I jump into this bonus clip, if you enjoyed the video, please consider subscribing and please enjoy this bonus clip. It's a banger. Well, and you know, speaking of entrepreneurial explosion, I think about, you know, how long you have certainly been with Tesla and a backer of Elon Musk a long time, and I think about, you know, when we first talked and you likened him to to Mr. uh Einstein, Albert Einstein. But I just wonder Elon at at Davos uh earlier today and he talked about the car makers fortunes will be increasingly dependent on humanoid machines. Kathy, how are you modeling this? I mean into the thesis of Tesla and is that where the growth is more so than EVs for Tesla going forward? Without a doubt. Uh we've always said Tesla is not an auto company. It is actually the convergence of three of the platforms I mentioned. So robotics, energy, storage, and AI. Each one of those technologies, it has its own scurve. Uh and now they're feeding each other. And we're seeing that in robo taxis. Uh robo taxis we believe will account for 90% of Tesla's valuation by the end of the decade. Uh we're in print at 2600. That includes nothing for optimist uh robots and we're beginning to understand how quickly uh Tesla is moving on that front. Why? Because it's the convergence of the same three technologies. robotics, energy storage and AI. Uh so uh I think that price target obviously if if Optimus is successful and and we believe it will be. We think that uh humanoid robots is evolving into a $26 trillion opportunity. Half in the home, half in uh in manufacturing plants. >> Picture this. A potential client searches for what your business offers and your YouTube video appears. Before they've even booked a call, they've built trust with you, turning them into a warm lead. That's why our clients are hitting $100,000 months because YouTube turns attention into authority. If you run a business, book a call. and I'll show you exactly how to make this"
    }
]