[
    {
        "video_id": "TnkVDoMphuc",
        "title": "Bitcoin feels quiet. Similar phases mattered in past cycles. #shorts #bitcoin #crypto",
        "published_at": "2026-01-23T20:49:28Z",
        "sort_date": "2026-01-23",
        "url": "https://www.youtube.com/watch?v=TnkVDoMphuc",
        "transcript": "Welcome to another episode and as right now Bitcoin is still in this range and people have been checking out. I see more and more people leaving crypto somehow checking out. But the thing is this is the calm before the storm. If you look at what we saw during the last bear right here, we're currently kind of in this position right here. And if you look at the chart, you see something very interesting. And that's that if we measure the distance from the peak to when we visited the 50 book moving average last cycle, it was here in February. If you measure the same distance basically from this peak right here to this pump to the 50 moving average and then you apply the same logic here, it could still mean that we have time until middle to late February to come back and touch the 50 moving average which is currently at 100K. So this dream of 50 moving average is still possible very very possible."
    },
    {
        "video_id": "-moAWQq1QcM",
        "title": "BITCOIN: CALM BEFORE THE STORM... February will get crazy",
        "published_at": "2026-01-23T10:16:37Z",
        "sort_date": "2026-01-23",
        "url": "https://www.youtube.com/watch?v=-moAWQq1QcM",
        "transcript": "Oh yes, oh yes, yes, yes. Guys, welcome to another episode. And as is right now, Bitcoin is still in this range and people have been checking out. I see more and more people leaving crypto somehow checking out. But the thing is, this is the calm before the storm. If you look at what we saw during the last bear right here, we're currently kind of in this position right here. And if you look at the chart, you see something very interesting. And that's that if we measure the distance from the peak to when we visited the 50 moving average last cycle, it was here in February. If you measure the same distance basically from this peak right here to this pump to the 50 moving average and then you apply the same logic here, it could still mean that we have time until uh late February uh middle to late February to come back and touch the 50 moving average which is currently at 100K. So this dream of 50 moving average is still possible very very possible and this is why this con before this before the storm will not be here forever. I mean at some point we will have a resolution here. But looking at how many people are leaving crypto, it to me it makes perfect sense. I mean people are very tired. People don't know what's going to happen. Some of them check out. Some of them try to come back later on. But the thing is this time of quiet this time also of this bear time. It's not going to be here forever. At the end of the year we likely going to have a bottoming out just like we did see in 2022. and up only up only at the end of the day that's the that's the big picture I know many people are demotivated this and that and listen it is what it is we are in bare trend there's not nothing I can do to change it myself but we can still have the big picture in mind and that's quite important looking at the overall market you have basically sideways some of it is a bit down a bit up uh nothing really has happened in the last 24 hours let's check ETFs let me refresh here on the ETF chart what we have because in the in this day an Asia ETF and the Michael Sailor are the only ones that can really move the market. Uh, and the Michael Sailor has been buying as you know and ETFs they're dumping. We did see another dump yesterday at minus $32 million in the ETF and total January account currently is minus3 million. So, we're back to red in January. And uh, if you look back at December, we had the minus 1 billion. So, being at zero, basically - 13 million, basically zero. still better than than in December, still better than in November where we had 3.4. But here we back into the red numbers. So institutions are dumping like there's no tomorrow, at least for now. Let's see if it will change. Uh looking at hyperlquid wallet positions, the gigachads are bearish. The big brains are slightly bearish. Uh Don Pros are slightly bearish. Um and then everyone else is bullish. little ouches those that have lost from 0 to 10k in their portfolio on hyperl they're bullish uh other holders 100k to minus 1 million - 100k to - 1 million loss very bullish and wrecked plebe minus 1 million loss or more are also very very bullish and looking at historic data here it's kind of consistent nothing really has happened here during the last uh days very very consistent with the most uh highest P&L wallets consistently bare bare bear bar bear and the lowest P&L wallets are bull bull bull bull bull is at some point it's going to switch at some point these guys are going to be more and more bullish and we're going to flip the pancake but uh now it is the way it is looking at performance by year looking at the midterm year basically the same performance as uh last midterm years 2022 2018 2014 you see the green one basically the same looking at the average also basically the same following it exactly so for us it's very important to stay uh disciplined. Uh if you look at the trend here for uh for Bitcoin, let me go here to the uh market cap. If you look here at the trend, we're still in bearish trend for uh for Bitcoin, for ETH, I mean for for most uh for most assets. So the point here is to be risk off. That's very important. Uh we're still risk off. Looking at the daily what has been pumping a lot. Uh here you have Bitcoin still in daily even daily is bearish if bearish but let's see what has been pumping. You have some of it some of it some of this old coins. People have been commenting about axi let know if you are in axi in axi pump. People have been asking me to comment on axi. Uh well since two weeks ago it is in bull bulla bulla bulla and up almost 200%. Again, just like with other altcoin pumps, this is not going to be pumping forever if Bitcoin goes down. So, if Bitcoin breaks down here, you have to be super careful, but that has been going up. Rain up 165. Ryzix, I I saw some Ryzix people saying, I got a comment on Ryzix. Well, since 4 days ago, Ryzix is in a bull trend. If you had the money scanner, you saw it. And yes, indeed, it's up 161% since then. other other holders, they love Midnight since a month ago when it went bullish on the on the daily. Midnight is up 101%. So yeah, big shout out to everyone who is making short-term trades here. You have secret, I guess this is the the privacy chain 67%. Uh so is it possible to make money? Absolutely. Look here layer zero 65%. Uh the question is what's in store in terms of the big picture? And here we have to look at S&P guys. If SNP starts going down here, u this is going to be not good. We really have to monitor it very closely because I don't really like that we have this kind of fake pump above the previous all-time high here and then no follow through. Uh normally this is uh this is weakness normally. I mean here you had kind of similar. You had this pump then technically alltime high but no follow through and then boop boop boop boop it collapsed. And we also have Charles Hoskinson coming out saying that we may see a big fat recession based on all of the tariffs and all of the trade partners leaving the US. So listen to this. >> How likely is it do you think that we get knocked into a recession and and how soon could that come? If >> the AI bubble bursts and if Europe has retaliatory tariffs followed by people deleveraging their their exposure to the US, they lower their direct foreign investment. and they start investing in China and China starts investing in them. Like for example, the UK now has the largest Chinese embassy in the world I think they're they're building and um Canada just announced trade deals with China. So you're seeing a lot of historically super close partners like we've been partners with them for over 200 years basically just decoupling from the United States and starting to trade with other countries and people say oh well good riddens is okay well if you lose like half of your trading partners over a 3 to 5 year period your consumption goes down we're mostly a consumption economy uh this is going to be pretty catastrophic to us as a uh as a country so if these things continue I don't see how we don't get knocked into it but there's a lot of things US government could potentially do to stave it off. >> Yeah. So definitely keep an eye on the S&P guys. If S&P starts showing weakness, if S&P starts going down here, uh crypto will not like it. Not at all. And also Bitcoin is in a very interesting position where either we go to a 200 week and we buy like there's no tomorrow or we have some pump and it goes above 50 week that would also trigger the buy signal. But the interesting thing is that stock market has been going up, gold has been going up and any of these uh markets going down sadly could mean that Bitcoin goes down even more. If stocks go down, what's going to happen to Bitcoin? If gold goes down, what's going to happen to Bitcoin? So, this is the curse of being in a bare trend because when Bitcoin is in a bull trend, Bitcoin does not care about stocks or gold. What what hell they do? Bitcoin just pumps and pumps and pumps. But being in a bare trend, you don't get the good catalysts. For example, when stocks are pumping, Bitcoin is not pumping. But you do get the bad catalyst. When, for example, stocks are dumping, Bitcoin likely is going to get pulled down as well. Gold pumping, Bitcoin is not pumping. But if gold is dumping, Bitcoin might get pulled down as well. So that's why I'm very very serious when we are looking at an asset in a bare trend because there are many curses that that come with that. and um being not being not being able to capture the bullish catalyst but being forced into all the bare catalyst is one of this curses we get and again at some point it's going to go bullish again. You see here the money line is going down in terms of when it flips bullish. At this point we are at one uh 100,14K. You know just a few weeks ago it was here at 120. So the bull flip is coming down very rapidly. And uh yeah within the coming uh weeks within the coming month until March it could very well be at around 100k. I mean once we really start uh start going down and once the volatility really goes down in terms of basically the the more time we spend at lower levels the the more this thing goes down the more the flip level will also go down. Um so very very soon we will be seeing this um this lift level go down a lot and then once the new bull starts we're going to have all of the uh all of the blessings and the blessings of of the bull trend is that uh you get all of the upside you get very little downside all of the bad news don't matter only good news matters that's when you are in a bull trend so that's number one number two uh we need to look at really what's happening with the US dollar and the whole world econ economy kind of continuing with what Charles has been speaking about with the recession. Ray Dalio is coming out saying that listen, everything's going to change. Everything's going to change. Dollar dollar is going to change. We're changing the whole system uh on the fly. Listen to this. >> In your mind, is this the beginning of the end for the precience of the US dollar? >> Um it's the beginning of the end of um the monetary system as we know it. It's not just the US dollar, it's the fiat monetary currencies. So the UK, the euro, Japan, China all have similar debt problems and so on and are dealing with the same interreationships which is the reason you're seeing gold being chosen by the central banks. They want a a currency. Gold has always been the main currency and it's the only non fiat currency. In other words, not the currency that can't be printed that they want. And so that's why you're seeing central banks move and sovereign wealth funds move to gold and that's the nature of the shift of the monetary system. >> So gold up and up and up and up. Bitcoin not really up. Doesn't mean it's not going to be forever. When Bitcoin is a bull trend, you will have the the upswings as well. So we're waiting for that. Guys, big things are happening on chain. you know that we've been preaching the 360 approach with the stocks with crypto with commodities and everything being in all markets and monitoring all markets and by the way to the money scanner we just added a bunch of German stocks even more I know I me I mentioned the Germany yesterday but now we've added even more so you have uh Volkswagen BMW like all of the all of them that are listed in Germany be before we had German stocks listed in the US now we have German stocks also listed in Germany at the DAX um within the DAX index. Then we also added the French uh stocks as well that are listed on uh French indexes. So if you want to invest in L'Oreal, you see that it is in a bull trend on the daily since two weeks ago. What else you have here? BNB paribas. What the hell? 28% Boomer bank since two months. See this is the power of the money line. You see what's happening? SLB no clue what it is but three since 3 weeks ago 24%. Let me know if we have some French people in the chat. Do you recognize this? Nia NG 33% since four months ago. Very very nice. And this is just on the daily. Society general the big mega bank also up 25%. So banks are having a bit of a a bit of an upswing here. I mean B&B pariba societal how you pronounce orange. This is telecom right? I recognize orange when traveling. You get the orange SIM card or what it's called. And then CA general. What is this? Is this the Michelin guy? Why is the Michelin guy here? Is this the Michelin guy? Anyway, the Michelin company since three weeks ago up 10% since the flip and so on so forth. Also, we added Italian. Italian. You let me know if you're from Italy. Italy. Italy. Italy. Uh here you have all kinds of stuff including Ferrari, which is not doing too well, but you still have it when flips bullish. you can check it and so on so forth. But why am I mentioning all this? Because now on Solana you can trade a lot of them, a lot of the stocks uh on chain. So they added another 200 tokenized US stocks and ETFs on Solana. So and this is by Ono Finance. Listen to this. Let's see if it's an ad or what? Global market. Yeah. Anyway, it's it's an animation, but you you basically now go to a DEX and you can trade all of them. Let's see how many is it? Do we have a list? A full list somewhere. U I saw another tweet with a full list but it's like a lot. It's a lot. It's a lot. Now the slipage on them is quite big. I know some people in our bullman discord tried trading them. The slippage is crazy. I mean there's not a lot of liquidity but uh number one likely is going to be improved with more liquidity added because this is basically a a free opportunity. If there is slippage and and no liquidity, if you're a market maker, it's like free money for you that you can make if you actually provide liquidity to to the to the assets. Oh yeah, here is all the lists. You have IMB, Visa, Nike, Bam Bam, Bam Bam Bam, Nike, how you pronounce Nike, Nike. You have Boying, Costco. You can go Naz buying McDonald's. You eat the Big Mac, you can buy McDonald's. All of them you can buy plus 150 more. And non-custodial, which is most important on a DEX, you can now trade all of this. So of course tokenization is happening. Uh a lot of it is going on on Sana because that's where it's easiest for everyone to buy and trade. So our our bullishness on Sana tech is still here. We're not bullish on Sana asset because it's in bare trend and we make no discrimination. We make no exception. If you're bearish in a bare trend, we're bearish and Sana can go down 90% easy easy mode. In fact, if Sana loses $100 uh support, it's going to go to $30. There's nothing in between there in terms of support. But in terms of tech, I still think it's the best. I still think that it's it is the place for onchain finance and once it flips bullish we're going to be bull bull bull like there's no tomorrow. Okay, very important. A lot of it is on Salana. A lot like most of it is actually on Salana and they need to fix one thing and that's the uh and that's the uh per markets the entries per markets and that's their main focus now. How to get people from hyperlquid into Zana. They still haven't managed. They're discussing it. Listen to this. >> Trading trading and per. we're behind here and uh and we're not going to allow that to remain this way. Um so long should be the best place to trade anything with leverage um as needed as well. And there's a whole bunch of talented teams that are working on this. The folks at Lips Labs with Phoenix, Bulk Trade, Flash Trade, many others. I apologize if I miss, but there's there's just there's tons of people who are saying, \"Hey, Salana should be the best for this. We have so much liquidity with so many spot traders like should do that better. >> Yeah. I mean this is the best. I love when you have a project that says listen we suck at this. Let's fix it. Okay. It's very rare. It's actually very rare that you see it. In most cases just for guys how great they are and how dumb everyone else is who doesn't understand the greatness. Let me know if you recognize that. I mean there are many projects like that who think that they are the the [ __ ] and then that everyone else is so dumb they don't get it. They have like one transaction per day on their chain. But it's because not because the chain is bad guys. It's because everyone is so dumb, you know. Everyone's so dumb. They don't understand. So from that perspective, man, I love Solana from that perspective. And uh to be fair, to be fair, people have been saying that this is like m you know this Macron thing. It's like Vitalic. It's like Vitalik explaining ETH to everyone. Listen to this. sometimes is too slow for sure and is to be reformed for sure but which is predictable loyal sometimes is too slow and this is e by the way there is value in that there there is value in being slow and predictable but this is exactly exactly the e guys >> sometimes is too slow for sure and needs to be reformed for sure >> for sure >> but which is predictable loyal. >> Yeah, it's almost like ETH hired Macron to say it. It's exactly exactly their narrative. There is room for that. Also, I think there is room to be a bit of dinosaur, a bit of, you know, slow and you don't change. So, you have this kind of Bitcoin kind of thing, which is ETH. It's not Bitcoin, but you understand it doesn't move too much. It doesn't do anything too much, but it's there. You know, it's it must be reformed for sure. It's low for sure, but it's predictable. It's So, I think there's room for that. And then there's room for innovation to basically go and run and explore everything that's happening and that's Solana. And then everything else where people are forging how great they are without any users without any anything to show for that's for guys man that's for guys that's big fat for guys. So that's my stance on it. Let's see what's going to happen. Um again this this stance doesn't really affect the investments because we look at the trend what's happening with the trend and the trend for soul is sadly bar and we don't discriminate because portfolio goes down no matter if it's a good asset that goes down quality asset that goes down it still goes down it's negative in the P&L so P&L we don't discriminate if you have a bull trend doesn't matter if it's a [ __ ] asset it's a bull trend and P&L therefore goes up so we don't discriminate very simple we don't marry the bag although from a tech perspective, we can enjoy we can enjoy the narrative. We can enjoy the actual use case being delivered. I mean that's that's also why I love sold from that perspective that you know now I can connect my phantom wallet to a freaking DEX. I can buy all these you know stocks McDonald's you can buy anything you can buy anything. So we can be use case enjoyers without holding the crap in a bare trend and then we can jump back in a bull trend with extra conviction because we're also use case enjoyers. You understand me? Let me know in the comment section if you understand. Now let let's uh check what CZ is saying at the Davos World Economic Forum. >> But right now in the crypto space there's really two proven uh industries like exchanges and stable coins. Those are large businesses. I'm really excited about three new more. Uh I think uh tokenization is a huge one. I'm talking with probably a dozen governments about tokenizing some of their assets because this way the government can actually realize the financial pro uh financial gains first and use that to develop those industries extractions um you know uh the the trading markets etc. Um payments is something that we have. >> This this one is important. I don't think anyone really registered what he what he said but he said something very important. I mean let's say you're a government I don't know you build some kind of plant you you need to raise debt to get uh to get uh you know investment to build but maybe it's some infra project maybe it's infrastructure maybe it's some power plant maybe I mean it can be anything. Now what you have to do now you have to issue uh treasury you have to issue debt to do that. What if you could tokenize that project specifically and offer that as an investment? I mean, that's kind of a new thing. I haven't really seen it too discussed too much except for what CZ is saying, but it's true. It's true. Instead of just doing a general bond, okay, let's tokenize let's tokenize the actual thing that we're that we're building and the share profit in the future. >> Have not really conquered in uh well have not really started in crypto. We tried but it doesn't nobody really pays in crypto. But I think now we're seeing the convergence of traditional payment methods being on behind the scenes being supported by crypto. So the the spenders swipe a card, crypto gets deducted from their account, the merchants gets US dollars or euros or how whatever they get. So now when we have those bridges, I think payments is going to become pretty big. The third one is what you guys all mentioned is AI. Uh the native currency for AI agent is going to be crypto. >> That I mean that that one is interesting. I haven't seen AI pay too much and I mean currently they pay just uh they don't pay basically they don't pay there are not too many use cases where they pay for stuff and if they have to pay it's uh basically that you prepay and then they get tokens like maybe some API token but theoretically could it be that in the future they can pay themselves and they do transactions themselves theoretically yes I mean theoretically it makes sense what's practical let's see what's going to be practical now guys shifting gears a bit we have an interesting kind of news from Europe where Europe is going to launch its own platform to compete with X. It's going to be called W. Okay. Mandatory ID verification will be required for all users. It's going to be hosted in Europe. Will be fully compliant with strict EU privacy and data protection laws. The beta is being launched during the summer. And uh yeah, there you go. There was a community note here saying basically that the government will not directly run it but it's always like that like in Russia there is also a like governmentmandated uh social media messenger I think it's called max is also technically not run by the government but practically it is yes it's a company that runs it but they being told exactly what to do the same thing is here man it's going to be like you know Chinese we chat EU have their own they think that they're somehow different but you see when it comes to actual implementation of free speech actual implementation of something like this. I think they're following the same trajectory. So very soon guys, we will have to switch to W probably or go to re-education camps if we still use X. I thought it was quite interesting because man, it's it's getting quite crazy with the free speech. On the flip side, on the flip side, there's a bit of positive announcements from the Davos regarding the EU. Let's see if this wors actually become reality. But they're realizing, hey, we're too slow. Uh, for sure we need to be reformed for sure. And now also the German counselor is saying, hey, listen, we've wasted a lot of opportunity. We have to change. Listen to this. Both Germany and Europe have wasted incredible potential for growth in recent years by dragging feet on reforms and unnecessarily and excessively curtailing entrepreneurial freedoms and personal responsibility. We are going to change that now. Security and predictability take precedence over excessive regulation and misplaced perfection. We must reduce bureaucracy substantially in Europe. The >> Yeah, I mean it's true. Will it do something? Let's see. I mean, Mario Dra said this already over one and a half years ago or was it one year ago? Mario did the report saying exactly this. Um, now uh let's also check this very interesting statement from uh one of the people in the French central bank. As far as I know, this is an example of no experience, no knowledge, but a lot of opinions. Listen to this. >> Governor, you have to address this. Is the euro in danger from a Bitcoin standard? >> No, I am a bit skeptical, Brian. Sorry to say it about this idea of the Bitcoin standard. This is the boomer, you know, the boomer zaros laughing looking. I am sorry. this this idea, you know, Bitcoin the French the drinking some coffee man. It's great. I love it. I love it. And the bumazaros who think that they know something or they're on the high horse is my favorite, man. It's my favorite. Listen to this standard. >> No, I am a bit skeptical, Brian. Sorry to say it about this idea of the Bitcoin >> Bitcoin. know this this idea of the standard we left the gold standard uh but the gold was only a technical mean what is important is what you say but that monetary policy and money is part of soity and we live in democracies and I think the public role is key and if we lose that really you lose a key function of democracy That said, I always keep repeating that money as long as it exists for centuries has been a public private partnership. You need a public anchor whatever its form is. Remember in silver and gold were sovereign assets. So it was on the public side and then you had bank nodes and you will have CBDC. But anyway, the most important part of payments is in the private sphere and this is the development of tokenized private money. But this tokenized private money must be regulated to inspire trust confidence. >> It's fascinating that you say that Brian you mentioned a complimentary role that you could play. >> So I think that uh crypto is very good for fiat currencies. Um it's very good. Bitcoin is a good as a check and balance on deficit spending because when there is a lack >> Yeah. I mean he basically says that uh with Bitcoin the governments need to really be responsible and otherwise there is there is a other way out. I just find it fascinating this banker guys some of them have switched. I mean you have Black Rockck you have the biggest funds in the world. You have the biggest banks in the world switching. But then there are some especially in France I mean sorry to say if you are French big shout out to you but French in general they're big backers when it comes to tech. They're not super technical. I don't know if you guys still have do you even have good like internet reception if you like travel on the road outside of Paris? Maybe not. Maybe now you have I don't know. But you know in general it's a bit it's a bit backwards. It's a bit backwards. You look at Lagard another example like it's it is not the best place for like for thinkers in terms of tech now. Sorry to generalize. Sorry to generalize a bit. We have to do a bit of generalization but you know it's true. Like deep down you know it's true. There's no need to get upset. No need to write in comment section. Put down the baguette. It's okay. It's okay guys. It is what it is. Uh now uh in terms of AI, you know, we use AI a lot. Let me know if you love AI. Apparently AI is now uh let me show you something. So this is another crazy news with the open eye trying to get a cut off everyone's ideas when they use AI. But here here here this is important. AI open AI chair is saying that AI is probably in a bubble. Okay. Expects correction in coming years. So that's another reason to really look at S&P 500 because if we actually see a downturn a downturn in all this AI excitement it will put pressure on big tech and big tech is most of u of the US stock market basically when you go to stocks here and this is these are global markets but let just check here in terms of um uh look at all and let's see all countries so all uh of the assets we currently uh track are around 100 trillion. This is this is like all stocks in all countries. If you look at only MAG 7 which is like big tech and Tesla and uh the seven of them they are 25%. Okay, so they're the biggest the biggest u sector in in all global stock markets. And when you look at S&P this is even bigger because S&P doesn't include all of the non US companies which we do here when we do this calculation. So this is important in case we have an AI bubble pop in terms of investment interest. Not that AI itself is for guys. It's not I mean I we use it every day. You probably use it every day. It it really is a fantastic tool and uh God knows how good it's going to be in the coming in the coming years. If you are a developer, you should be very very careful here because you your skills may not be needed if you don't use AI. Very important. But anyway, that can still be true that it's useful. But the investment side of things could collapse because investments kind of things, they can just collapse because now it's still useful is great, but we thought it's going to be this big. We thought that it's going to be this big. So, we invested all the trillions and we thought it's going to go this big in the coming 10 years, but actually in the coming 10 years, it's just going to go here. It's still great. It's still going to improve a lot, but we thought it's going to improve this much. So, we invested based on this. Now, we think it's going to go this much. So when you hear about open AI bubble like bubble this bubble that AI bubble it doesn't have to mean that AI is fugazi. It just may mean that people got over excited and projection projections were too big. Just like bubble was not the failure of the internet. um AI bubble will not be failure of AI and uh in AI you actually have way more real use cases and real uh real uh uh e effectivity how to effectiveness global effectivity effective like companies become more effective more efficient you have more efficiency gain from AI probably in from all of the companies because had to build out all of the bandwidth there's so much work to be done so people got overly excited too quick but then to build out all of the bandwidth fiber optic cable to make make it all work. It took decade. Um, with AI, it's way faster. I mean, it's way faster. You have instant distribution. All of the internet is always done. So, AI can distribute way faster. So, likely it's not going to be as bad as.com. But, could we have, let's say, 10, 20, 25% drop in S&P because of this disappointing uh numbers in comparison to projections? Could be, could be. So, we need to be prepared for that. That's why we are looking at S&P 500 chart. And if this thing starts um uh breaking to the downside here, we we need to be prepared. I mean, Bitcoin is not going to like it. S&P is not going to like it. Not too many assets are going to like that. And also what the crazy thing is that Open AI apparently they plan to take a cut of customers AI aed discoveries. I don't know how they're going to do it. Maybe she said something dumb without thinking. Maybe she didn't mean it. But this lady who is the OpenAI CFO, she said in Davos that they will take a cut of the IP the AI helps to create, which is in my mind a bit of a desperate look because what do you mean? Number one, they scraped all of the internet to create the AI. So they stole everyone's IP anyway. Okay, there's a lot of losses. Likely loss is not going to go anywhere, but you understand. But now they're going to take a cut of all of the discoveries. get out of here. Meanwhile, you have Claude running circles around them. Meanwhile, you have Gemini running circles around them and so on so forth. So, let's see what's going to happen if they if they will be able to take a cut or what they going to do, but uh they're in a in in trouble financially. They are in trouble. Open AI, they also have the Elon Musk lawsuit because as you know, they converted into a company illegally from a nonprofit. You remember when uh Sam Alman said that he he works at OpenAI for free because he loves it. Listen to this. >> Okay. You make a lot of money, do you? >> I make No, I paid enough for health insurance. I have no equity in OpenAI. >> Really? That's interesting. You need a lawyer. >> I need a what? >> You need a lawyer or an agent? >> I I'm doing this cuz I love it. >> Then he turns up in a $4.6 million car. And by the way, I have no problem with people having expensive things and flashy things, but I do not like when people are trying to be this, you know, u what was Sam Oldman? He was altruist. What was Sam old man's thing? He was like this super altruist. Like the same thing here. Like if he said this, I love nice car, nice watch. I that's why I do AI to to be able to buy. Fantastic. I mean, good for you. You do fantastic. But when they're like, \"Oh, no. I don't care. I do it because I love it.\" Man, when someone says that Yeah. Yeah. Yeah. Yeah. What was Sam Alman's thing? He was also altruist. He was also altruist. He said was what effective altruism. What did he do? Uh you guys in the chat tell me what was some old man. But it was also for guys. You know they all all these guys who say they don't they don't like money. They they want a lot of money under the underneath this I don't need money. It's it's all fake. It's all fug guys. So I get actually even more concerned when someone says that they they don't want money. Like I I get even more concerned because it is unnatural. It is like weird and likely it is a mask. Okay. I would rather have a dude tell me, \"Listen, I have this financial incentive. I want to create this and this and this for this and this reason.\" Okay, then then I understand. When someone is, oh no, we do it for free. What do you mean for free? Get out of here. Get out of here. Oh, also before we go to Q&A guys, let's see if something happens here with the peace. Likely not. But uh yeah, they have a meeting now. the Merkans and uh they are in Moscow. >> So good to see you. So good to see you. >> Whit Jared. >> This is Josh. >> And this is Josh. Who the hell is Josh? >> This is Josh. >> This is Josh. Oh yeah, this is Josh. That that that's diplomacy, guys. That that's official ceremony. That's diplomacy. That's real diplomacy. So now Putin knows him as a Look at this guy. This is This is Josh. >> This is Josh. Fantastic. Fantastic. Let's see, guys. Let's see. Let's see. Let's see. Yeah, exactly. Point finger. Exactly. Point. By the way, by this guy, he's Josh. Exactly. Don't worry too much about him. It's Josh. Guys, let's go to Q&A. Big shout out to Guzman who is timestamping us today. It is indeed time for a bit of beat right here. Big, big shout out to Guzman. Smash up the like. Let me know where you are tuning in from. And as always, as always, check out the link below for exchanges I use. If you want to go long, if you want to trade stocks, if you want to take crypto, if you want to trade gold, silver, go to Bionex. You can copy the bots uh the automatic trading bots on Pionex and explore the US stocks by participating in the stock trading composition here on Pionex. Of course, you can trade the crypto here also. Buy bit, you can trade crypto, go long, go short, big fat leverage, trade stock, big fat leverage if you want, long or short, gold, silver, anything, anything you want is on buy bit with leverage if that if you're into that. Manage risk of course as always. Bit unique the same but a bit less KYC. you want that great weeks the same maybe even less KYC great although both of them are adding more and more KYC so uh you you can check it how it looks now but normally they have a bit less bluffin these guys I think they have the least although you need to check yourself so yeah check it bluffin but also go long go short all of that great stuff uh check out bullmania.com bullmania.com if you want to learn trading for real it's a free training you can you can check about the mechanical rules basically mechanical rules allowed us to have such a nice track track record. Since October 8th, we've been derisking. You can go to booming.com/ivan to check all here with all of the proof with expost and all of that. And on this note, let's go to Q&A. Let's go. Let's go. Let's go. First, a question is about Pionex. Does it produce a tax report? Guys, I don't think they do tax report. It's uh these guys especially this a bit Asian exchange like they're not the best at export stuff. You you will be able to get all the exports but you know they prioritize more trading then the export is a bit secondary for them but you can get the export. You can get the export of transactions for sure for sure. Uh but then that's not a tax report. Then you have to do the tax report based on the export of transactions. I met Witkov a couple of times in Hamptomed. You have no idea what good he does for people. There you go. There you go. Someone knows Whit. That's That's perfect. That's perfect. Yeah. I mean, he seems to be like a nice grandpa. Smiley. This is Josh. Great. Um, increasing buzz around the quantum computers are scaring people. Are they scaring people to gold? I don't think they're scaring people. I mean it it is a real concern that that uh crypto has to fix. I don't think anyone is scaring people. In fact, it's I think it's bad faith to say that if someone points out a real concern that is, you know, scaring people, scaring people. What do you mean scaring people? In reality, we have a real uh problem with old addresses. For example, Satoshi addresses where there's a lot of coins and they're not hashed. So, non-hashed addresses are theoretically vulnerable to a quantum attack. modern addresses which are hashed, you know, your Bitcoin address, it's a hashed public key. If it is hashed, it's not vulnerable. But these old ones are vulnerable. So, uh people say, \"Oh, but there's no need to worry. It's going to take still maybe 10 20 years for quantum.\" Yes, it's true. But the thing is, Bitcoin moves very slowly. It took it like 10 years to resolve the block wars. You remember the block wars? It took like years and that was like a small parameter to to to fix this quantum vulnerability in Bitcoin. like the amount of planning, the amount of debates like it's going to be so crazy timeline like we probably need 15 years to do it. Okay, we need 15 years to do it. So I in my in my view they should be focusing on it right now. They should be starting f taking seriously now. They should be creating a plan now. Uh because it's going to take time. Yes, quantum going to take time but man to to to protect business is also going to take time. How you going to migrate the coins? So there are so many questions that are unanswered. Let's say you have Satoshi coins. What do you do with them? If if the user has control over the address, they could move themselves to a protected address. But if the user no longer is around, how do you do do we freeze coins? Do we move them ourselves? But where to move them? Where to move them? If we move them anywhere, Satoshi doesn't have the access anymore. So anyway, all of these questions will have to be answered. There is no clear answer. There's no good answer. So it's going to take years and years and years to figure it out. Also all of the quantum tech is new meaning that it's not fast to build. It is bleeding edge research in many cases. So this this um system that uh that we need to implement in Bitcoin is also going to be new meaning that you need to be super careful. New tech, what are the bugs? What are the threats? yada yada yada. Again, look at how long time it took to figure out like the block wars with the segment. It took like four or five years. And now this is maybe hundred times more complex. So no matter if quantum uh threat is not imminent, I think they should be starting now. They should be taking it seriously now. They should be doing plan now. So I think it's fully fully real. Uh I don't I don't know why why they're not taking it seriously. It's they put JPEG on chain but uh this they should take seriously 100%. Also another argument I don't like is when people say oh but it's not a problem because if quantum is really an issue then the whole internet is going to break. Not really, man. Not really. Like, there's people are saying the banks are also not going to work. Not really. I mean, the banks can click a button and all of their online systems will be shut down and then the quantum threat is no longer a threat. You need to go to your local bank and uh that's it. You just have more inconvenience. Bitcoin, on the other hand, has no one button to click. There's no way to stop it. So, when a quant, let's say a quantum attack does happen, there's no way to react to it in real time. There's no way to, you know, just, okay, shut down until we figure it out. There's there's no no such thing. So banks will be able to react in real time. They can shut off. They can uh remove online access, online service until they figure out what else to do. Crypto cannot. So crypto needs to be ahead. And uh yeah, that's that's what I'm thinking. And also Cloudflare, look at what Web 2 is doing. Cloudflare is already preparing quantum. a quantum just see what what they published. Yeah, I mean you can just read about what they're doing. There's they're protecting most of the web two traffic. So they have postquantum crypto solutions. They they do you know and shift first cloud native quantum. So they work a lot. They they work a lot w with it. I think cry crypto should too. I think crypto should too. I don't know what can be more important. I mean they do all kinds of like NFT stuff. Why? I don't know man. This microphone, by the way, I need to I need to have a screwdriver here. It's going to break at any point here. Has kind of unscrewed itself. Anyway, what can be more important than securing? And by the way, like you say, because they're not addressing it, part of capital is also not flowing into crypto because like if you want to have a peace of mind, this quantum thing is something that will not give you a peace of mind. Okay? And to say, \"Oh, don't worry. Don't worry. It's fad.\" Man, it's not going to it's not going to calm people down. To say, \"Oh, no. It's only fad to scare you away from Bitcoin into gold.\" Which is what many people are saying kind of like you allude uh all alerted to. Is that how you say alluded to or alert to? I don't know. Anyway, as you kind of allude to alluded to, is not going to give me peace of mind. Like, let's say I'm an investor. I want to put a few billion somewhere. I have gold as an option, which by the way pumps more than Bitcoin nowadays. Okay, look at silver. I have silver and then I have crypto which number one doesn't pump because it's in a bare trend but also it has this quantum thing which I'm not even like I don't know what what else happening there. What I mean imagine if you are planning long term let's say you're a wealthy a bit older person you're thinking what if I pass away will I I will not be able to handle this thing in real time with Bitcoin quant. All in all, guys, Bitcoin needs to be able to say, \"We're quantum secure. That's it.\" And uh that's that's the end state. I want Bitcoin to say, \"We're quantum secure.\" And uh don't worry about anything. It's secure for centuries. Just caught the light show. Does the Claract passing open gates to crypto therefore starting a flood into the market? I mean in some ways yes you will be able to have more institutions and banks and service providers that will be able to offer crypto. So that's good. The bad thing with this uh clarity act is that you will not be able to offer stable coin yield if you are a crypto exchange. So let's see what's going to happen there. In reality it's a it's a bill for bankers because bankers can now offer crypto but only they can offer yield. You understand? Because stable coins in this recent version they cannot offer yield. you need to have a bank to offer yield. So basically banks they they're the only ones who can offer yield and now they have all of the permission and all of the rules how to do crypto. So it's it's a pro bank build right now. It could be pro crypto also if they get all of the dev protection. So if you're a dev you're you're not in trouble if you do a D5 protocol that then is used by Kim Jong-un to transfer funds. That needs to be in place. That would be very good because then devs can dev without being worried for like being money transmitter or Kim Jong-un helper or or so. That's number one. Number two, if they can still get that we can have defi yield, fantastic. Uh, and listen, defi still defi will still have yield. It's just not going to be for us clients. That's the only thing. Silver good short play when bearish on mining line. Anything that's bearish on mining line is a good um uh is a is a good short. Uh then it all depends on which uh time frame. For example, on the daily, silver is still bullish. And on the weekly, silver is still bullish. So, anything that goes bearish, it's a it's a good riskreward to to short 100%. We I mean, I I I just had a guy in Bullmania who said that he made so much money by shorting the crap out of Zcash based on I mean, it's good that he asked about shorts. Let me see if I can play you this. Big shout out. big big shout out to uh to all of the members who shared success. But this guy, he he used the shorting strategy. Listen to this. >> I actually made uh the Blumenia yearly fee back in just one plate and um that was shorting Zcash uh using the the money scanner that Blumenia offers. >> Guys, he's very quiet. He's very quiet. He's very quiet. But what he's saying is he he shorted the crap out of Zcash when it turned bearish on the money scanner. You remember Zikash was pumping. That's Richard. That's Richard Whit could not make pulse pump. He had to make extra money by learning trading for real because his philosophy about trading is very bad. It's very wrong. He is all about holding stuff to zero. And uh yeah, he made it all back by shorting Zcash. Uh my biggest win in crypto so far has actually been joining Mulmania and I really mean it because it's it's just a great community and also if it wasn't for Ivan's uh expertise and foresight I would have lost tens of thousands of dollars on the 10th of October. >> There you go guys. Big shout I mean all of you guys who leave testimonials in Bulmania. Thanks a lot. Because it kind, you know, it's one thing if I tell how great Bulman is, but people know I'm biased because I'm creator. If someone else says says it, then it's different. Then it's different. So yeah, thanks a lot. This is not Richard Hart. Thanks a lot, Richard. This is not Richard Hart. But yeah, that's that's um that's very important. When something is in a bare trend, it's a good riskreward shorting. Like listen, it's not a guarantee. Nothing is guarantee. If something is a bare trend, it's not a guarantee that you will make money if you short it, but it's the best riskreward you can ask for. Okay, there you go. To get Bullmania, go to bulmania.com and watch the free training first. You're going to get all instructions there. bullmania.com and then watch free training. That's it. That's it. Uh in 2022, I was certain that web3 gaming will become huge and is here to stay. But where is it now? Pretty much dead. Exactly. So, you need to follow the price trend. trend decides uh it's like someone asked me today about Tesla and whether Tesla is gonna grow into you know this trillions and trillions and it may and it may and it is in a bull trend so as long as it is in bull trend fantastic but always when we try to predict the future it's it's hard to get the all the facts correct you may have a big prediction for example now people are predicting that Tesla is going to is going to be like you know the number one company with all of the robots and all of that and it seems by the way it seems that this is correct. I mean it's up 41%. It's still in a bull trend since the since the since the weekly flip. So currently it the bullish scenario seems to be correct. Uh but let's say this thing turns bearish I would be riskoff for Tesla also even though they're you know number one AI this and that like I just don't know for sure if they are number one AI like how can I know it? How can I know that it is really better than all of the Chinese stuff or or you know all of the comp? I have no clue of knowing that and also let's say they are really the best but what if the timeline is wrong now people are projecting 2030 what is 2040 there are so many assumptions both when it comes to the facts like fundamentals but also so many assumptions when it comes to the timeline so way better approach when it comes to deciding where to place the money is just look at the price if the price is trending up I mean clearly something is happening I mean clearly uh you know maybe they are best in in the world for AI and robot otics and all of that. But if the price is bearish, it can go down a lot. Like even great companies can go down a lot and the same company depends on where you buy it. It can be the difference between being a bad investment and a good investment. So the fundamentals actually don't really matter because this the same company can have great fundamentals. If you buy in a bare trend, you're going to be b down. this you buy the same company with same fundamentals but at the beginning of a bull trend you're gonna have totally different outcome so this is very important and just like you say about web3 gaming to connect back to web3 gaming it is like that yes web3 gaming may still be big but maybe the timeline was off instead of being big in 2025 like people projected back in 2022 maybe it's going to be 2035 and maybe it's not going to be this project that we thought you know sandbox and all of the other kind of hoff I don't want to say scam it's not scam but you understand like what the hell yo what the hell this central land one player I mean that so instead of them maybe it's going to be another maybe it's going to be Roblox people discussing Roblox a lot maybe the ad crypto is going to be like who the hell knows so analysis can be correct but all of the assumptions can be wrong if you zoom out and then you can still say that analysis was kind of correct but for you as a trader investor it's it's not useful the only thing that's useful is mechanical rules it is the trend so yeah hope it clarifies Litecoin when moon still 2017 price. Yeah, the silver what is it? Bitcoin is gold like Litecoin silver. It's a meme. It hasn't really worked since around that time like 2017. I feel that's when it kind of broke down because then you had another alternative which was ETH. So ETH kind of took Litecoin's place as silver to Bitcoin as gold. So when people buy crypto, they they want to, you know, diversify diversify. They buy Bitcoin as like the main thing as gold and then they buy ETH as silver and then uh yeah and then Litecoin. No one cares about Litecoin. Metaverse was the wildest prediction and it never played out. Waste of money. I made a 10x on mana in just hype. That's the correct way to do it. And you know it could have played out. is just everything is probabilities. Being there in 2020, 2021, seeing Facebook renamed to Meta, investing billions and billions, tens of billions, maybe even a hundred. Can someone check how much they invested in metaverse? I mean, it may have been hundreds of billions. It was more capital than it took for the moon mission. It was the biggest capital allocation in human history. the metaverse for Facebook, guys, with Oculus, with all of the VR. I read that it was the biggest capital allocation in human history. Bigger than the Manhattan project and the nuclear bomb. It was bigger than moonlanding. It was bigger than everything. Okay? And so it had a percentage chance to play out. But as soon as it doesn't as soon as you see okay trends are turning against it you have to be very very objective and u and not go against against that. Okay. So looking back it's easy to say it was wrong but being there it was just a probability that u that we had to bet on and adapt to. And people who got really wrecked are those that believe the story not realizing that it's actually a probabilistic story. I mean the story makes sense but we don't know maybe it's going to who the hell knows. It's all about betting, position sizing, and then exiting in case it goes against you. So yeah, that that that's the way to see the markets. Everything is a probability. Anything can happen and um all the all how you uh how you place your capital and how you get out in case it goes against you. And it's not really about, you know, how many times you lose and how many times you win in trades. It's all about how much you lose when you lose and how much you win when you win. I mean, please remember that because everything is probability. So your success will not be dictated by the number of fails. It will be dictated by how big the fails are and how big the wins are. Okay? So you cannot let small mistakes turn into big disasters. And trust me, I've been there. I've been there. You you buy something, it goes down. You buy the top, you you ask in the telegram, guys, what's happening? Is it okay? The telegram tells you it's okay. It's okay. It's okay. By the huddle, huddle, huddle, huddle, huddle. Okay. You huddle. Bam. Another 20% down. You ask, hey guys, what's happening? Is it still you still bullish? Bush bush bush huddle. Buy the zip. Buy the zip. you know it goes down 90%. So you you made a small mistake into big disaster. I mean how long have you been investing? Since 2013. So my uh really entry into investment world was Bitcoin and crypto. So yeah since 2013 a lot has happened. A lot has happened since then. And uh I mean I was I mean 2013 I was not even uh I was not even uh 18 then. So I the only thing for me to buy was Bitcoin. What to get was Bitcoin. I could that's and that's how most uh teenagers nowadays get also their hands on investing. They cannot get freaking brokerage. You can get uh you can get uh phantom wallet and now you can trade all of the songs without uh brokerage. So yeah that was crazy times. That was when Litecoin was the go the silver to Bitcoin's gold. Metverse was a violence prediction and you already read that all gaming coins are trash. Well, currently they are. Well, on the daily time frame uh Axi Infinity is not trash on the daily time frame. So, when it's uh bullish, it's not rush. I mean, it's rush now, but uh if it keeps pumping, it's uh I mean, you see yourself. Let's actually see the long-term chart. On the daily, it is bullish. And let's see what what it has done here. Let's go to weekly chart for AXI. Yeah. Oh my god. Yeah. Oh my. Yeah. It's not good. It's It's very bad, guys. I mean, even this pump even this pump, I I wouldn't be too too excited here because it's like testing, you know, this previous alltime low here. You see here it was like the starting price here kind of so just testing it. Yes, it's bullish trend. Yes. But you you you can technically trade it. I mean here was it is a tradable opportunity. You can especially if you use leverage you can trade it. I mean ever since this flip it's already up 80% so 60%. So it is tradable especially when it goes so low and you know even to come back to a major resistance it needs to go 100% up. You understand? is in a big trouble. But it is tradable. It's tradable. It's tradable from that perspective. You can say even it's interesting trade to make because it had to pump 100% just to get back to like a significant resistance. But yeah, guys, it's not good. I mean, you see yourself. It's not kind of testing here. So, there are two scenarios. Again, everything is probability. We don't know what's going to happen. We can just adapt. Let's say you enter trade here when the money line flipped the bull. Um, you have two scenarios here. either it gets rejected or you know maybe we continue. So you need to adapt accordingly. Um if it goes bare on the daily let's say imagine if it goes bearish on the daily I would take it as a signal to the risk. Yeah this is the problem with all guys in this cycle they didn't even go that high. They just went here but the previous cycle with the metaverse mania holy crap guys. See this is the problem. This is everyone. I mean someone bought up here. There were trades happening up here and now it's down how much? Oh yeah 99%. This is the problem with believing in metaverse, believing in gaming but not following the trend, not following the mechanical rules just buying a narrative uh like a plebo. I mean that's that's a problem. That's a problem. You cannot buy the narrative. The narrative and by the way the narrative may still be correct. Webster gaming maybe is going to be massive and by but instead of again instead of 2025 maybe it's 2035. So for you it does not matter. So being a believer in fundamentals being a believer in the coin being believer you know like Justin Bieber believer how you say you belie you may even be believing in the correct thing but your portfolio will still go down 99%. You understand? Pera just made a deal with F1 McLaren says the dawn. Will this have any bullish? I mean you tell me. You tell me where is it? Where is it? You see it here. Like guys the news what? The news do you understand? They don't matter. The news don't matter. You look at the chart like you see anything where is it okay especially now that the news has happened okay now it's even public so you mean that now it's going to start going up when it's already public man it's bad hopeium it's it's very bad lowgrade hopim you have you have there very bad so I would say the market doesn't give a f about that partnership even insiders didn't buy or depending on when it came when did it came come out when did it come out the maybe insiders tried to buy here but yeah but even this this pump wasn't that big so even insiders did is not really so guys uh yeah I mean you see yourself the market doesn't give a f about that McLaren what it is and also you know all of these sports partnerships they're not that impactful like you know many coins have had Manchester United part like it doesn't like I think it's proven now that all the sports stuff it doesn't pump anything we've had many of them it's not the first one just ask to give you all of these sports partnerships they don't give anything they don't give anything especially in the bad trend like no no one gives an F maybe in the bull trend it will give a bit of a pump because it's bullish and then yeah but now you know no one is uh caring and you look at the price chart um see the news here's how the news works when the news is released, it's already too late. You normally see chart moving up before the news. I mean, maybe that's what happened here. I don't know when the news released, but you know, maybe that's what, you know, you you had the insiders trying to position themselves and then when the news is out, it's out. So, yeah, insiders sell the public knows about it. There's nothing more to be excited about. Like the news being out, it's bearish. Normally, it is like that. When the news is out, it's already bearish. The fact that news is out is a bearish signal. You understand? Because what now? Okay, it's out. What now? What? What now? What? What? It's out and that's it. If this news cannot pump it, what what does Hideera have? What do they have to do to pump themselves? Like if even macar and F1 don't pump like what you see. So normally uh if you are allocating you want to be before news or you want the anticipation of something you want to speculate on some anticipation it would be way more bullish if you said hey listen I think they're going to do McLaren there are rumors they're going to do m now that's bullish rumors are bullish that's why it is you know buy the rumor sell the news because speculation is bullish because people's imagination go wild you know McLaren wow maybe who is McLaren guy like I don't know Schumacher I I don't know F1 is I don't watch it. It's like it's not interesting to me. But you know, let's say Schumanker, who the hell is the Schumanker of McLaren? You know, if you say there's a rumor, people think, hey, maybe he's going to tattoo Hideera on his ass or something. You understand it? People think, man, what kind of partnership is it? Maybe he's going to tattoo Hideera on his forehead and his ass is going to be so bullish. So, you see, people get excited. Maybe they even buy the chart when it's a bit of rumor when it's already announced. Okay, so what happened? They're gonna put a sticker on the car. Okay, that's it. Okay. Okay. I mean, I guess it's Yeah. Let's move on. Let's move on. Where's the rumor? Yeah, there's the rumor. Let's go to that rumor. Maybe there is going to be something exciting. So, the money goes somewhere else. Anyway, you understand? Yeah. Or you don't understand. Maybe you don't understand. Anyway, if you don't understand, smash a like anyway. So, at least something happens. But yeah, let me know in the comment section whether you understand. sell the news did not work on silver. We I mean we don't know what the real news is. What is the real news? Where there's no news yet about dollar going losing status of world reserve currency. So with silver no there's no news on silver like you know the there's a lot of anticipation silver going up central banks buying what do they going to dish the dollar Trump is making so much chaos they're going to dish it. So there is you know there there's anticipation. What's going to happen? What's going to happen? when there is anticipation there is speculation it's it's very good so there there is no news that basically removes excitement from silver there is no such news that would be like if I I don't I cannot even think what that would be like some news that removes excitement from silver like it's yeah I don't know what that would be even but there's a lot of speculation and uh something is happening under the hood where uh under the surface where um you have ECB European like pension funds dumping dollar and on so forth. But guys, I I think you smash up the like, subscribe to the channel. Big shout out to Guzman for time us today. See you all Monday, guys. See you all Monday. Enjoy the weekend. Hope you enjoyed the show. Fantastic to have you here. It was great hanging out together yet again. Always fun. And yeah, thanks for being here. Thanks for being here with us. Many people have left because it's a bit shaky this and that, but they're going to be back at some point. And uh you guys are here. You guys are keeping your eye on the pulse of crypto and you will be rewarded when we go up again which will happen at some point. We will enter bullish trend sample guys. Thanks a lot and see you on Monday. Goodbye. Goodbye."
    },
    {
        "video_id": "WN4zH4pphEI",
        "title": "Solana tech is elite, but we follow the chart, not hype. #shorts #solana #markets",
        "published_at": "2026-01-23T17:12:14Z",
        "sort_date": "2026-01-23",
        "url": "https://www.youtube.com/watch?v=WN4zH4pphEI",
        "transcript": "Of course, tokenization is happening. Uh, a lot of it is going on on Solana because that's where it's easiest for everyone to buy and trade. So, our our bullishness on Solana tech is still here. We're not bullish on Sana asset because it's in bare trend and we make no discrimination. We make no exception. If you're bearish in a bare trend, we're bearish and Sana can go down 90% easy mode. In fact, if Sana loses $100 support, it's going to go to $30. There's nothing in between there in terms of support. But in terms of tech, I still think it's the best. I still think that it's it is the place for onchain finance and once it flips bullish we're gonna be bull bull bull like there's no tomorrow. Okay, very important a lot of it is on Salana. A lot like most of it is actually on Salana and they need to fix one thing and that's the centrist per markets and that's their main focus now. How to get people from hyperlquid into Sana. They still haven't managed. They're discussing it. Listen to this. >> Trading trading and per. behind here and uh and we're not going to allow that to remain this way. Um Solana should be the best place to trade anything with leverage um as needed as well. >> I love when you have a project that says, \"Listen, we suck at this. Let's fix it.\" Okay, it's very rare. It's actually very rare that you see"
    }
]