[
    {
        "video_id": "BEdgJ6hMNz8",
        "title": "Layer 1 Hate, Perp Dex Meta & Fogo Chain's Launch | Robert Sagurton",
        "published_at": "2025-12-15T18:00:13.000Z",
        "sort_date": "2025-12-15",
        "url": "https://www.youtube.com/watch?v=BEdgJ6hMNz8",
        "views": 4280,
        "duration": "00:53:36",
        "transcript": "Bitcoin's cool, but it doesn't really work for transactions. It's too slow and expensive. This is why we're building Fogo in a decentralized way, which isn't easy. I think everything is better in a decentralized tokenized world. >> What was the biggest structural issue in crypto that led to the October 10th liquidation event? >> You have to protect the exchange first. You don't want to wake up and like have all your capital gone, right? And so, if that means like taking out the winners and liquidating the winners, fine. Do you think that altcoin price discovery will return? And do you think that sentiment in crypto itself right now on the trader side, the holder side, just the general industry will be able to recover from this? >> I think it's up to us to recover from it. Like it's up to the builders to get us out of this. If you're waiting around for somebody else to either blow up or fix it, then that's not the right attitude. >> You said there are things that you guys are building out. What exactly are those that is not in the market right now that you think Fogo will will address? >> Usually for them, that's an issue is speed bump. there's some kind of last look even if it's not really toxic like it's getting rejected let's say and so I think we're going to be a little friendlier to the high frequency kind of trading liquidity providers >> what does decentralization mean to you for Fogo and what are your non-negotiables on the decentralization spectrum >> this isn't going to work for everybody so for those people I'd say like don't use Fogo if that's not acceptable to you there's a lot of slow expensive chains to use more decentralized than Fogo and go at it having an L1 with independent validators and consensus is kind of my non-negotiable. >> If I interview again in two years, what three numbers should I bring up to judge whether Fogo delivered on what you're promising today? >> TPS, real AI adoption, and block times. >> You met one of the earliest incarnations of the XRP army on the FX desk. Is he still a whale? Is he still out there? Is he did he sell? Good morning, afternoon or evening and welcome back to another episode of the Coin Bureau podcast. Now I would like to welcome our guest today. It is Robert Sagetton. He is the co-founder of Fogo Chain, one of the most exciting up and cominging layer 1's. And he also has extensive trad Morgan Stanley, Jump Crypto, among others. So, Robert, a very warm welcome. >> Yeah, thanks for having me, Nick. >> My pleasure. So, before diving in, guys, few quick disclaimers. Nothing in this video is financial or investment advice. Please consult the disclaimer in the description for more information and consult your financial adviser before making investment decisions. Now Rob, just a bit of intros for our audience into you and your background because as I mentioned, it's quite extensive. Tradfi on the buy and sell side, high frequency trading, jump crypto, and now Fogo. Can you just give us a bit of a background on yourself and and how you got into crypto? >> Sure. So, right out of college, I started on a foreign exchange trading desk at JP Morgan. And at that time, electronic trading was just coming about. So my first project was to implement this electronic foreign exchange system to these traders that had no interest in any kind of technology. All FX trading at that point was just done over phone and these kind of kind of terminals. And so yeah um started out trying to kind of electronify that market and luckily ran into some highfrequency traders. Jump was actually one of them who were kind of eager to also electronify the market cuz you know they had the advantage there and then my career just kind of grew from there. So I stayed in electronic foreign exchange trading and prime brokerage was at JP Morgan Morgan Stanley State Street and then one day one of those FX clients came in and told me about Bitcoin. So that was 2013. They also were pretty early on Ripple later on. So they I remember they were like you you know I have a billion of this thing XRP like if that's ever worth something and I remember getting a good laugh of this and I always often think about that today. This person told me about Bitcoin and I started researching it and just went all in on crypto and then I ended up with some old FX friends who had R3. Um R3 is the quarter blockchain. They're actually now integrating with Salana. And so I did a brief stint at R3 was the country manager for them in Brazil which I've had this long history of living and working in Brazil and that's when Jump Trading called me up. At that point they were just starting a OTC desk and that was the the goal. So they asked if I could come help run that and came in started and actually that was like the worst time of the market. It was around 2017. We had this really deep crypto winner. we're trying to build up this OTC desk and then some of the exchanges started reaching out because they were having real issues with launching tokens that were kind of doing what memecoins are doing now like running up and and just falling off a cliff like what we call sugar high and they were like hey we know like Jump supports IPOs for market making could you guys like step in and like do some liquidity provision for these launches and this is when that really didn't even exist and so Jump was one of the first there was others too I credit wintermute for being being there as well And that allowed us to start getting involved in these projects. And then once we became market makers, we just started doing more for them. You know, they they needed other things that became way more interesting than just kind of like scalping and trading. And so yeah, I was there. I jumped from 2017 to 2023. I left on very friendly terms, was advising for projects, and then came up with this crazy idea to launch yet another L1. >> Another L1. Yeah, we get to that in a bit. I'm just curious. And so you met one of the earliest incarnations of the XRP army over on your desk in the FX on the FX desk. Is he still a whale? Is he still out there? Is he did he sell? >> I remember him selling like I think he sold that like a 3x when he you know when it was like very small. So I'm sure he's kicking himself right now. >> Yeah. Given at that stage 2013 2013 2014 he must have missed out on a lot of gains. But it is what it is. So that background obviously informed a lot of your thinking on the current crypto trading landscape. I'm curious in terms of what we see now crypto trading and the venues people can trade crypto on. How would you compare it in terms of how far away it still is from the how efficient and fast well structured and the traditional financial markets are and what traditional traders expect? >> Yeah, I think hyperlquid and lighter have gone a long way to close that gap because the way I see it, you know, we started with Bitcoin and then there was people that were like, \"Yeah, Bitcoin's cool, but it doesn't really work for transactions. it's too slow and expensive. And so Ethereum came along which was faster and cheaper but still kind of didn't work. And then Salana even took it further and it did work for transaction trading. But if you asked a trader to look at global consensus and try to work with that for onchain clubs for example like it just still doesn't work. It's still not optimized. And so I credit Jeff from Hyperlquid for looking at global consensus and saying you know what these block times are too slow. there is advantages to colo and taking a limited set of validators and colloing them next to you know Binance where where the price discovery is for PERPS and that really changed the game all of a sudden there was this per stacks that was really optimized and I think like everybody is paying attention to that now and so and it's just a different way of thinking he started with the premise of I'm going to build you know this platform it started as you know perex and not L1 but I'm going to build this platform form. I'm going to purpose build it to be optimized for trading and consider where price discovery is and where the validators are, which was very different from anything that happened before. And then we see lighter now, Vlad, who comes from that world as well, you know, kind of do the same thing. And when you have an L2 and a single sequencer, you can be even more optimized. So, I think we're finally getting there and we're finally focusing on the right things. And obviously, that's a big focus of Fogo. It started out as us being frustrated by the slow block times and not knowing where we can collo to, you know, be able to make good markets and not get run over as a liquidity provider and all those things that go into being like a platform that protects LPS or just even an experience that looks that's familiar to us. That didn't exist and that's why we started building Fogo. Like we wanted to be able to sit in front of traders and be able to explain how they can connect and have it be familiar to them. like you can colo here you have cancel priority here's how the sequencing works and so we're trying to close this gap as well >> cool so just for our viewers information colo means collocation at the same data centers and servers as the exchanges the validators will have their servers there as well just for their information we will get on to fogo and and perex landscape in a bit I'm just curious now because obviously it's been a bit more than a month since that ill- fated day that is only known as 1010 which you you know, impacted a lot of surprisingly on the on the perpex side, a lot of the perex is managed well, but it was, you know, a really big liquidation event. And I'm curious to get from your perspective building out a chain optimized for efficient, fast, efficient trading. What was the biggest structural issue in crypto that led to the October 10th liquidation event? And uh do you think that it could have been better or worse if bigger proportion of crypto trading happened on decentralized venues? >> I obviously think it's going to be better. You know, this is why we're building Fogo in a decentralized way, which isn't easy. It's much easier to build a centralized exchange. So, I think everything is better in a decentralized tokenized world, if only for it being transparent. So, the reasons, you know, like I'll leave that up to smarter people. One of those smarter people is my partner Doug Kolkit and Ambient. You know, after that event, he put out a long post on how ADL works that went viral. You know, from my perspective, you know, we're layer one, right? And so we're going to have the perp dex is separate. And from my perspective, you know, I want to see the smartest people building perplexes on Fogo that understand exactly what happened and is addressing it. So like that's my that's my goal and I I take that box and I leave it to him. But what I would say is one of the my biggest takeaways is you got to see how every deck handled and whether they protected the exchange or they protected the user. So the different ways, you know, like Hyperliquid handled liquidation versus Perexes on Salana and and the ones that went down and didn't go down. So, you know, in a way, I like to see those those data points. I mean, it's it's it sucks to see so much damage done, but we kind of need to see those data points and see how each of the decks reacted and like what we think makes sense. It's like, okay, you know, the users got hurt or actually these users did pretty well cuz they they got taken out at like, you know, a good position where maybe they wouldn't have gotten taken out otherwise like and these this exchange survived. So for me, you know, I don't think about like why it happened as much as what are the data points that we can learn from so that we can debate what's the better model and how do we like how do we want to implement this and you know I credit like my personal opinion is and I credit Arthur Hayes for being kind of pioneer of this is you have to protect the exchange first. That's one of the kind of big advantages here is like you don't want to wake up and like have all your capital gone, right? And so if that means like taking out the winners and liquidating the winners, fine cuz like that is an advantage over centralized exchanges. And what happened with FTX is that you know these models should be able to protect the overall capital of the exchange and if it's a if it's a little bit of pain for like the winners for example then that's fine. So you know that would be my take away from that. >> Okay, got it. And do you think that the market will recover from that event because I've seen a lot of spec we've seen the speculation around okay big guys are taken out liquidity provision is dropped because some certain people were hit. I'm curious do you think like your sense of sentiment and also being in the industry yourself do you think that it's going it's slowly working its way out? Do you think we'll recover from it properly? Do you think that altcoin price discovery will return? And do you think that sentiment in crypto itself right now on the trader side, the holder side, just the general industry will be able to recover from this? >> I've seen a lot of these events, so it doesn't shake me. And I think it's up to us to recover from it. You know, we're thinking at Fogo like what's a thing that we can put out that's right for this current mood of the market. Like maybe now like a game that's free to play is like more appropriate than putting out like another purpose for example. And you're going to see more from us. So I think it's up to us. like it's up to the builders to get us out of this. We're not like if you're waiting around for somebody else to either blow up or fix it, then that's not the right attitude. And the way we get out of this is like we build useful tools that work in every market and aren't so susceptible to kind of the speculation bubble. And so that's how I think about it. No, I don't think I don't think it's a killer moment at all. I think there was probably a lot of leverage in the system and it it cleaned a lot of people out. I believe if you look at like where we are in just the amount of solutions, the amount of TVL, the amount of real things happening versus a couple year years ago, it it's significant and that gives me real faith that like there is a real foundation there and you know some leverage positions like being blown out in the short term like doesn't affect that. >> Okay, moving on now to something else that's right. It's hot meta and that's hating on our ones. seems that's the sentiment right now and Fogo is a layer one chain and we'll get more onto that in a bit but first I wanted to talk about this general attitude towards new L1's in the market right now and this hostility to new launches and you know I'm curious firstly why do you think that is and to a degree do you think this is potentially justified so that many people think oh okay well do we need another layer one do we need this altcoin dilution you know what does it mean for altcoin season and then there's those who say oh well the do we really need another iteration of another high speed blockchain when we are not currently using the ones we've got and all that. So that's the arguments out there. I'm just keen to see from your perspective because you obviously have opinions on this given that you've been sharing it openly on Twitter and we've all seen Keshi's post about it. So I'm curious to get your take on this. >> Yeah, he just did a read of this. He's a real good uh speaker. He had his like bedtime voice on reading his post and I just watched it actually. So it's good. So hat tips him. I thought that was a very well thoughtout post. So I think the first thing is do we need another L1? To answer that question, you have to think like are we happy with the current state of things? And I'm not like I don't think the adoption is there yet. when I can take a trip and every single person I encounter has used a blockchain or a token and that trip like from the check-in person to the flight attendant to the pilot to the immigration person if they've all used a blockchain and crypto or a stablecoin then I think like we're there cuz you know for example in Brazil every single person is using Pix. So this is a 24/7 payment system that was put out like well after crypto was launched or blockchains were launched and the they've gotten adoption from the whole country and so that's the kind of adoption I think we need to aspire to and if we haven't aspired to it it's because this current solutions aren't good enough and that includes both the solutions and potentially the go to markets and business strategy. So we start with that and then the hate is just a function of you know like this is innovation. These new solutions are all the the premise of all these new solutions is the current solutions are missing something. There's gaps. Something's broken and we're fixing it. And that's the premise of all innovators. I said I put a post out like I'm sure Sears hate hated Amazon.com but like did Jeff Bezos care? and are we better off because he, you know, he built amazon.com and you don't have to go to Sears and get told like they're out of stock. And so, you know, I don't care about the haters. But I will also say I think it's a function of there's a bit of envy because one of the unique properties of these decentralized chains chains is they can't really iterate fast enough. That's kind of the point of decentralization. And so you have all these people, they're trying to work on on fixing some of these problems. They've got these big large decentralized stakeholders that it's kind of like hurting cats to get them to do anything, even upgrade a client or fix inflation. And it's just really challenging to to iterate even though they want to just fix things and they want to go back to our position where like we have a blank slate to do whatever we want, right? And so when they're like doing that hard work to try to engineer around this decentralized mature chain and they see, you know, guys like us come up and we have this blank slate and we don't have to deal with that and we're able to get things done easy, there's got to be a little like envy there and especially if you know all the attention is going to, you know, people like us and Monet and I get that, but I don't think that should stop us from innovating or progress. And I also think that one of the things they should do is be honest about that. Like, okay, look, look, we're in a situation where we just can't iterate as fast as the new entrance. Given that, what's the strategy? And and I give Ethereum credit. We're kind of realizing that like look, we can't scale the L1. Like, let's just admit it. Like, that's part of the decentralization story of Ethereum. So, given that, what should we do? Let's lean into L2s. Let's scale the L1, you know, let's scale Ethereum outside of Ethereum into this L2 model. and we'll create these stages so we can decentralize them. And so even though I'm not a big fan of of L2s and delays and finality, I respect the fact that they were honest with their limitations and came up with the solution to kind of overcome them. And so I think a lot of it is a function of of that frustration that comes with just being a mature chain. >> Yeah, it's a very good example you lay out there with regards to CS and Amazon. And also I guess from the dilution perspective people who think about oh okay we do we really need space for another token in the market right now. I mean if you look at the Russell 2000 all these big companies or even just the general company landscape on an equity side you're telling me a new company can't uh can't start a business can't issue shares can't go and attract capital without taking away from someone else. It's like this whole concept of like a zero sum game. It's not if you've got to grow the ecosystem right. >> Yeah. And you know, I'll give another example because everybody's on the Zcash kick. Like the founders of Zcash looked at Bitcoin and said, \"I want privacy.\" And so they forked Bitcoin core and they built this awesome privacy layer 1. You know, Zcash is the fork of Bitcoin and a layer 1. And like once there was more than one blockchain, there's going to be hundreds. And if you're a fan of like privacy, like the only way for that to be accomplished is to do it in a completely different environment by forking something else. And so I think people are starting to come around to these kind of purpose-built L1s. That's what we are. And probably the irony, you know, we we're purpose-building this L1 like for trading. We're all traders. But then, you know, things happen and next thing you know, like somebody else finds a use for it. Like a game that maybe didn't work on a less scalable blockchain works better on Fogo and all of a sudden, you know, gaming is higher than trading volumes. So, and which is fine with us. But yeah, I think you know in general I think people are are coming around to the fact that if you really want to be successful at a a specific use case and trading is ours like you need to purpose built it build it from the ground up with all of those things in mind like latency and sandwich attacks. And once again if you don't do that it's very hard to fix those issues after you launch if you're decentralized. >> Yeah it's true. That's true. Okay. So, I guess you you make good points here and and this is the case we should continue innovating, but there have been examples over the past year of launches that have been extraction events that haven't really gone to plan that people do rightly point to. So, I'm curious from your perspective, what separates a credible new L1 launch from something the market should rightly reject? >> Yeah, I hear that a lot and you know, like, hey, people love to give me examples of L1s that just fell flat. And you know, I'll say like there's a lot of people that got divorced as well, but that doesn't mean like you shouldn't get married and you can't make the right decisions and have a very happy life. And you know, yeah, there's that's just a reality. But you try to be smarter and you try to make better decisions. I don't know. I think what are the differences in terms of what we're doing at Fogo to make a better L1? Given my experience at Jump, I think I babysat 400 launches of tokens. Um that was like the height of DeFi summer those years and so I saw people try a lot of things and make a lot of mistakes and do things right. I mean the first my first partner was Robert Lechner at Compound. That was one of the first partnerships we had for market making. So that was like the very start of it and and so the the combination of that experience like seeing all these projects make different decisions and have different results with the combination of tradi and building exchanges there foreign exchange exchanges you know seeing like affiliate programs being done in FX for example or leverage you know CFD platforms that means that as we're rolling out FOGO there's probably 10 critical decisions I'm making every day that lean lean on that experience that I wouldn't make if I didn't have that experience or I wouldn't know that that's important. I mean, and there's things I'm like, man, if I didn't get if we and then and the team in general because I've got Mike Cahill who also has that experience. I have Doug Cole Kit from Citadel and then a great team that also is from crypto and yeah, the amount of decisions we're making given that experience I think is kind of unprecedented. I don't think like there's another team with that experience to lean on. And I think it's going to make a difference. Like we're gonna find out very quick and you won't know why. Like it'll be like hey like games really work on Fogo. Like why why did they not work elsewhere but they work on Fogo? Well like we think we like really thought through why they didn't work elsewhere and we fixed it and we created a guest experience for them for example. And so in my mind that's why I think Fogo is going to be different. like we're not following the playbook of others cuz we're thinking really big and we're leaning on that experience and and we think we're making more than we're looking at this as way more than the technology and the solution and the business around it and the strategy and the partnerships we do and the BD deals we do. We think that's going to make a huge difference. >> Yeah. No, I get it. Um we we'll get on to that in a bit. I I'm just curious then in terms of this sentiment that we see in which I think also is slightly unjust. Do you think that this is part of this is just because of markets, right? I mean 10 10 what's happened with alts and do you think that this would change if we do go if we have a bull market if we do see alts recovering in some cases just is this is part and parcel of of the sentiment that comes from people being down on their portfolios. I guess I don't think too much about it because I want to think about the sentiment of the users that aren't currently here and think bigger than just all right we've got this cult community of crypto and they're like not feeling good how do we make them feel better I don't know all right like they can feel however they want if we really do this right and we create things that onboard normies and I I look at like worldscoin as one great example of that you know they were able to like onboard I don't I don't know how what they're up to now, but they created this proof of personhood that anybody with eyeballs could onboard to and now all of a sudden they have a wallet and it's a really cool experience. You have like an ID and you have a wallet and you get these airdrops and that is kind of inspiring to me. So I think about like we're not stuck with just the current crypto community and their sentiment. Why don't we try to build stuff that attracts like a whole new fresh excited group of people and capital that you know this is the first time they're interacting with blockchains and tokens and if the current crypto community wants to still like talk about how bearish things are and how bad things are you know it's up to you but so I guess it's in short I'm saying like I'm thinking bigger than the current community. >> Yeah that's a fair point. Look, I mean that the addressable market is way is the billions of people who don't you actually use blockchains right now and they don't use it for reasons that you elucidate in terms of UX and and other factors scalability >> and it's not only the retail people it's the institutions I mean there's very few institutions like Jump that got in front of this and got involved early and now they're more regulatory friendly environment and they're also like this is going to be the first time for them for a lot of them and you know they will be looking at 1010 and studying it and saying like, \"Hey, you know, how do we risk manage another 1010?\" So, like they're not stupid. Like, they're going to be looking at the good and bad of the history of crypto and trying to manage the risk. But that's, you know, another addressable market that is now ripe to come in because they're feeling more comfortable with regs. >> The the backdrop is incredibly bullish. People just need to not lose sight of the forest for the trees. Don't throw the blame at at Monad. just uh so you mentioned there of course a fog is an L1 and you mentioned you potentially you have concerns with L2s and you talk about it obviously you many tweets on this as well you noted recently that most L2s still operate with single sequences which of course limits decentralization and specifically for perexes that rely on fast reliable execution how big of a limitation is this >> for an L1 versus an L2 >> yeah I mean it's well L2 is in terms of the architecture of an L2 for perexes right and for trade in in a decentralized way. >> It's harder. It's harder to build an optimized exchange when you have to consider consensus by multiple validators versus building on a single sequencer. It's definitely harder, but there's things you can do to close that gap. So, for example, you know, our validators are going to be collo, the oracle is going to be colloccation, right? The sequencing of the blocks are going to be essentially advantageous to the perplex. The perplexs will also be collo. On top of that, there's still latency, right? 40 milliseconds is still kind of too slow if you think about like the matching of a centralized matching engine. And so there's other things you can do to protect traders. So, for example, Doug is building ambient with dual flow batch auction, which is a really fair way to fill orders. And I think there's also a slight kind of speed bump that like accounts for some latency, but essentially, you know, there's going to be a slight disadvantage. You know, maybe that gets cut down. There's a lot of things in the works that are going to potentially put L1's with consensus on a level playing field as L2s, but it's worth it cuz, you know, for me, like an L1 where you have you have 1.2 second finale, which is our finality. So you can withdraw your funds like in roughly a second and there's not this complicated story of having two layers. So an execution layer and a settlement layer and how you're protected. You know, I always think about if I'm if I'm sitting in front of a trader at Citadel and having to explain this L2 story and how L2s inherit security from Ethereum and the stage one and stage two of decentralization, I think I'm just going to lose them. where if I explain, hey, we have, you know, x number of validators in this colo in Tokyo. This is how consensus works. This is these are the block times and how fast you can update quotes and this is finality for how when your automated tools can withdraw funds, your profits and move them elsewhere. Like that's a much easier story for me to tell, especially those who have seen, you know, the know about the FDX story and don't want to trust just one entity or one person. And if I can say, you know, this is a client that's run by a number of independent validators, not under common control, you know, that's a better story for somebody who doesn't want to trust one person or one exchange monopoly. Cuz, you know, we could have built an L2 and it would have been easier to optimize it. Like we truly believe in the decentralization and the advantages of composability and fast finality that come with an L1. That's why we made that decision. And you mentioned there in terms of like ordering and how you batch the orders and is censorship or ordering risk something that more traders should be thinking about. >> Yeah. Yeah. And Doug talks a lot about this because he actually built ambient on an L2. He's way smarter than me on how an L2 can control ordering and so I won't get into that. Look, I think sandwich attacks ordering like that's an issue with any permissionless validator set and it's a problem that L1's are really working on solving. We were also looking very heavily at first come first serve and FIFO as opposed to this priority fee model. Once again, that's like more familiar to traders. They're used to FIFO and exchanges and not used to having to go through an auction before their order like hits the venue. And so, even though we are starting with priority fees, that's kind of the path of least resistance and what people are comfortable with, we're going to be moving towards looking at first come, first serve. And that helps a lot with this kind of front running. So before we dive into Fogo a bit more, I'm just curious in terms of right now the perpex landscape and the different fast fast chains that per dexes have built on top of this comes back to the question around interoperability the UX for users in general because per liquidity today is fragmented across these many dexes and chains and I'm curious how do you think this fragmentations affects execution quality and liquidation behavior during fast markets? Yeah, it's unfortunate that perp liquidity just isn't fungeible and can't be aggregated like spot can. But it seems like every new perplex that springs up and is good attracts demand. And then if you think about, you know, now moving to real world assets and securities once again like it's just a bigger market and is attracting more demand. So, it's fragmented, but there's so much demand and it's such a superior product if especially if you compare it to like the option in traditional markets to use leverage, which is options, and they're complicated compared to per. And so, I think it's the growth of all these different even if they're fragmented, per taxes, the move to RWA per this is like a native kind of crypto product that I just love seeing proliferating and I love seeing the demand. So yeah, there's fragmentation, but I think if you get enough of the liquidity providers going on enough of the platforms, it becomes kind of irrelevant like and we're starting to see that. So you're starting to see the actual HFTs connect to the hyperlquids of the world. And now that they get comfortable with that, it's easy for them to connect to the others. And in that case, we're going to have like a lot tighter, deeper liquidity and prices will be effectively kind of tied together by the HFTs. Okay. And just the per product itself, I'm curious for someone who has a trified background. I believe there was the CME or not or the CFTC basically released a paper about a few months ago around whether they should allow regulated per products on exchanges in the US. Do you think that large centralized regulated venues in the US could eventually start offering these kinds of products? >> If they're smart. If they're smart. If if you ever go on Phantom and put a leverage position on a token that has not yet launched, I think it just clicks for you that like, wow, this is so cool. This I want to get exposure to this token. It hasn't launched. I can just from my cell phone while I'm waiting for this appointment. I can go on and like put a 3x leverage short on this. And also, I'm contributing to price discovery and not allowing that token to like go to some crazy valuation. You know, that's when it clicked for me like this is a superior UX for exercising my view a token that's not even launched. If you're in Tradfi and not seeing that that that's the future for retail speculation, then you're probably going to lose out. >> Yeah. Yeah. But do you do you have a view on do you think that they will or do you think this is kind of like there's special interests or do you think this special mechanics when it comes to settlement of these kinds of options versus like you know normal expiry futures that the CME offers? Do you envision a future where we actually have regulated per >> I don't think too much about it other than from the perspective I know it takes them a ton of time to do stuff like that. It takes those companies way longer than it takes Hyperl and Phantom to offer it. And that window that we have is our time to get traction before they step in. And that's why I have such urgency with launching FOGO. Like I didn't want to wait 3 years cuz like they're coming at some point. And they're slow, but they're also not stupid and they see opportunities and they find ways if the opportunity is big enough to execute on that stuff. And so like I don't know when it's happening. I don't know. But it is happening. We have a window now to gain traction and not hand over this market to corporations. So, you know, we might as well hurry up and do that. >> Yep. Indeed. Now, coming to Fogo more specifically, when did you start building it exactly? >> Good question. I think it's about a year and a half ago. >> And at that time, Hyperlid wasn't launched yet, was it? Or was it? >> No. No, it wasn't. I gave so many plugs for Fogo already. Very well. >> Couldn't help it. I couldn't help it. Yeah. I'd love to learn more about Fogo. Where's the token? No, I'm joking. Um, >> but yeah, so the backtory is this. You know, I was an adviser and just kind of looking around at different projects. Just saw an opportunity that to make blockchain that worked for traders. Our goal was 10 millisecond block times. We haven't gotten there yet. We're at 40 millisecond, but we're get we're going to get down there. But that was the first premise. Let's make a blockchain that had 10 millisecond block times, but was still an L1 with validators. I was lucky because Pith had already forked Salana and they were running Pithnet. They tried to run the Oracle on Salana, but it just was like too spammy and too expensive. So they created this separate environment, Pithnet. So they're already kind of running like an L1. It was an app chain. And so when I reached out to Mike Cahill who was running Doro Labs and worked with way back at Morgan Stanley and said like hey could you think about if Pipnet was its own L1 and like it worked for Pith and that would probably be attractive to other people who want that same scale and that was the start of it. So that was started fogo and then we were lucky to come across Doug Kolkit who had tweeted about somebody taking fired dancer running it in kind of a more optimized way and so I just DM'd him on on Twitter at the time and was like hey we're actually thinking about doing that you want to talk and after 20 minutes he was in so we had Doro Labs guys and we had Doug and we just started putting our heads together and said like what's the coolest most optimized blockchain we can create for traders and then in the meantime Hyperlid came out so they beat us do it like hat tip to them. And we looked at what they did and some things we liked and some things we didn't. And that was, you know, that informed a lot of kind of we had already started building Fogo, but I would say it informed a lot of our design design decisions like halfway through it. And here we are, you know, mainet's launch. Genesis happened. We're limiting kind of what is on it. The token is limited in distribution right now. We're going to really focus on building up some activity first and kind of stress testing it. And yeah, here we are. I mean obviously it is a there are a lot of perplexes in the market now some that you say have got there first but you said there are things that you guys are building out and features and functionality or that you think are potentially superior or things that they don't have which you have a plan to implement. So what exactly are those that is not in the market right now that you think Fogger will will address? >> Yeah. So, what I do is I look at we have there's enough HFTs that have tried to without singling out any gaps or particular per decks. There's enough HFTs that I'm friendly with that have done due diligence on these per decks and given me feedback on what works and what doesn't. The biggest thing usually for them that's an issue is um like a speed bump where you know there's some kind of last look. their orders are kind of last looked and even if it's not really toxic like it's getting rejected let's say and so that's like one thing and I think the dual flow batch auction is going to address that you know it's not going to we don't want to talk to toxic flow but not all of this flow is is sharp and toxic and so I think we're going to be a little friendlier to the high frequency kind of trading liquidity providers and yeah so it starts with that and then the second thing is the go to market and marketing. And without disclosing too much on that, where we're going to be different is we're going to take some cues from our FX days where the exchanges don't really target uh end clients directly and have programs that are a lot more scalable. So, I'll kind of leave it at that and we're going to announce some stuff a bit later. And I'll mention the perpex is probably going to be kind of in the phase two of launch. You're going to see other lower stake apps launch before the perplex. But when we launch the per stacks, we're going to also announce some pretty cool programs in terms of attract traders and keep them. That's really the name of the game. I should be clear, we're in L1 and the Perex is separate. It's ambient. It's run by Doug, but obviously we're giving them full support and that's a big kind of anchor to to our whole platform. >> It's also interesting um the Pith network connection apart from the fact that you've worked with them on it. In terms of the technology itself like you use in Pith as an Oracle, what other um you know synergies do you guys have with the team there with with the product they've got? >> Yeah, besides Oracle they you know Pith like Doro Labs is a whole machine. There's these labs companies that have just become truly prolific. Miston is another one of them and you know they do community management and marketing besides you know the engineering like you know the the mainet that you see the Fogo mainet that you see that's out today is is their engineers and you know we're at 2100 DPS today 40 millisecond block times we have one app so and that's credit to Doro they're just strong in a lot of different areas and they've got a great team and so yeah like Fogo wouldn't be where it is without them. >> Fergus built as a high performance chain and it's prioritizing throughput. You've mentioned all those statistics and I'm curious what do you say to the people who you know take issue with the fact that these fast performance chains are prioritizing that throughput over decentralization or security and I guess what does decentralization mean to you for Fogo and what are your non-negotiables on the decentralization spectrum? >> Right. So I think this isn't going to work for everybody. So for those people, I say like don't use Fogo if this is not if that's not acceptable to you. There's a lot of slow expensive chains to use more decentralized than Fogo and go go at go at it. I think the way I think about this is Bitcoin and maybe Ethereum kind of solved the decentralization problem such that if you want to store the majority of your wealth in a safe place, it should be there. And I envision traders that want that have a risk profile to put on leverage positions willing to accept a little more risk when it comes to decentralization. And so I I see it as two different things. Like you know take 10% of your money, move it to a bit more centralized chain and put on leverage and that's how you should manage your risk. there should be diversification and that diversification is not only in the actual asset or the product but it's also potentially in the in the censorship resistance of the underlying chain and so we're not trying to be as decentralized as as Ethereum that being said like decentralization is important to me because I come from a place where we were at the mercy of monopolistic exchanges that would kind of wield that power to keep their positions and like you hadn't like you had no kind of say against it and so and also we've seen how those centralized entities can you know blow up from that sense like having an L1 with independent validators and consensus is kind of mind non-negotiable you know it's not these validators are not under common control and that's super important to me so but yeah we're going to we're going to optimize this for trading and we're going to make those trade-offs and it's going to work for a lot of people I mean Hyperlid showed us they started with four validators in one data center and people couldn't get enough of the UX and the liquidity and the trading, right? There's a lesson there that you're willing to accept more risk. And then and you look under the hood and you see that actually some of this stuff is is a bit of decentralization theory theater if you're saying that you've got a thousand validators but the stake is concentrated with just a couple dozen. Is it really and they could get together and coordinate and you know is it really as decentralized as advertised? So that's my thinking on you know those trade-offs. So coming to the validator set which you guys are running right right now how is it look how does it look are they all are permissioned how many do you have are they all colllocated in the same place in Japan you said how does the validator set look currently >> yeah we're not running them no so I think every chain starts out even if you look at the history of Salana they started out as permission because you have to start with a certain set of validators you know that you find you know they don't just kind of drop out of the air and you have to kind of work with them and stake them and so I I think we're going to take a similar route that Salana did where we start out with just a a limited number of validators, but Chyros put out a research report on the Fogo validator kind of environment and the idea is any validator that meets that criteria can be a validator on Fogo and then you know the foundation will have a staking program. So currently you can go on Fogo scan and see this there's currently seven validators and so you can see this you know the stake distribution etc. So yeah, I think we'll our path will look very similar to how Salana started with a limited set of validators and gradually we're able to kind of grow to this more broader permissionless set >> and beyond the integration cuz it's a layer one you're saying you know there's ambient which is coming as a DEX what other kinds of products that are now currently building on top of it or you think that you in discussions with or any sort of teams do you think would want would want to build on top of it? What other dabs and are you guys seeing interest to build on top of Fogo for? >> Yeah, so to be clear uh Fogo is open so anybody can deploy anything and all the apps and games and everything you see are independent. They're not they're not us. Um even though you know we're happy to amplify the ones that we think are um worthy. So the first thing you're going to see is a game. Yeah, you'll see a game. I mean I can I can say that now. And so people uh might already have kind of been playing around with that. And you know the the thinking there is the um we didn't want to launch with like this high stake leveraged purpose decks when we're working through growing pains both on the technology and just the UX. So we wanted to launch with a kind of a more st low stakes game that is even like free to play. And so that's kind of going to be first just kind of stress test the system. The advantage of this game as well is it puts out a lot of TPS and these are real transactions. They're actually like 30 times more complex than like what people use to test TPS. And so the real transaction there is real money if you want to upgrade to certain things in the game. And I think it's going to show off the performance of Fogo. It's also Fogo with integrated with what we call Fogo sessions is a guestless experience. So these games that have the all these repetitive kind of motions that don't work on other chains because you would have to sign the transaction and pay yes, they work on FOGO. So it's going to like be a really cool experience. So that's going to be the first thing. And then after that, we have a number of apps that are in test net. So we have a DEEX, we have a borrow lend staking. So kind of the main DeFi apps are going to be the first ones and you can kind of go on on test net already and play around with them. And then the ambient per se as well >> also in terms of users power users and this is probably on the DEX per deck side but also given your instit in institutional background have you made specific progress talking to institutional side allocators so regulated custodians prime brokers etc or liquidity providers or HFT firms that may want to use or trade on Ambient or use Fogo. Yeah, those I mean those are all our friends and there those conversations are much easier when we're launched and there's like something for them to look at. So we'll probably be having those conversations shortly. But there are like you had mentioned prime brokers and there's some interesting thing things going on now where some prime brokers are basically bridging between the trady HFTs and onchain liquidity and so we are talking to some of the big crypto prime brokers and kind of setting that up so that we have day one liquidity but yeah those conversations I'm kind of waiting for Fogo to launch and to be able to show them cuz you walk into those offices and they're like I don't know you know is this thing going to is this real? Oh, is this thing going to launch? It's a much more productive conversation if you can walk in and pull up the block explorer and be like, here it is. Here's the block times. Here's the TPS. It's working. You know, let's talk about how you can get involved. >> I'm just curious from the perspective of um you know what you what you'd mentioned just the statistics and uh the TPS and finality and stuff like that. And what I'm curious in terms of like right now in this stage in right mainet, you're doing all the testing. What are the what are the stats? Right. you mentioned some of the what are the most highlighted stats you've mentioned? >> Yeah, so we're at 40 millisecond block time over 2,000 TPS now with one game that's on there that has kind of limited uh usage, I'd say, but it's real. It's, you know, there's real money. I think people are tracking the amount of money they made in the last 24 hours, and it's bigger than some some of the other blockchains out there. So, we're starting out a little different with with just kind of one thing and not a lot of fanfare or drama. And yeah, so we're at 40 millisecond block time, over 2k TPS. Maybe by the time this gets out, we'll be at 10K hopefully, which will be significant. And yeah, those are the high level. >> What are the most exciting updates and milestones for our viewers now? I mean, main mainet's been running smoothly. What when are you looking to potentially launch or what are the next steps in your milestone? >> Right. So we're going to have kind of this phased mainet launch. What just occurred is what we're calling Genesis. So like the Genesis blocked app happened a couple months ago. We did things a bit different because the chain was ready. Not all the, you know, apps were necessarily ready because it's a brand new chain. And so we said instead of like making people wait, you know, why don't we just launch the thing and show people that it's real and have kind of the ecosystem build out transparently in real time in front of people's faces. And so that's what we're doing. So, but we're also going to kind of keep it low stakes, light apps, like as I said, work through the growing pains. But in terms of what people can look forward to, there's going to be a series of announcements, I'd say, over the next couple months. And what we're really going to do is try to do everything on chain, if I can give one thing up. Um, so we don't want like the main events, the main initial events to be done on a centralized exchange. like we built this blockchain to do everything we can onchain and we feel like it's it kind of doesn't really make sense to like do things offchain for example we're seeing ICOs being done offchain on centralized exchanges like we don't want to do that there's a little more risk to that especially with the new chain but we think it's worth it you know look if if there's some some issues that'll allow us to fix that quick so stay tuned for more announcements but expect that you see everything that we do is going to be onchain on fogo So assuming Fogo does steal the mind share from existing chains. Um I'm curious in terms of what do you think crypto infrastructure could look like in 5 to 10 years? I mean do you envision multiple specialized L1s for trading privacy general purpose etc or consolidation? >> That's not our goal to steal from the existing. As I said we're trying to think bigger than that. And the way I see things playing out is kind of the way it played out with Hyperl and Phantom. So, Phantom had tons of mobile users and all of a sudden one day this ability to take per position popped up in their existing wallet and so I see if we're successful the that like happening with web two and the mainstream. So people that are on just everyday apps all of a sudden have the ability to, you know, interact with trading, interact with prediction markets. And so they don't even really know that they're interacting with Fogo. They just know it's like a a super frictionless experience through some place they're already kind of onboarded to. And that's how I see it playing out. Maybe it's not super exciting because that does that means that you know the Fogo brand isn't plastered all over every stadium in the world and it's just being used in the background. But that is kind of how I see real adoption occurring is captive users like just kind of getting access to all the advantages that come with blockchains and tokenizations via these channels that they're already onboarded to. Just to finish off with, I want to get your take on a few potentially light-hearted questions, Rob, and I'm curious for someone. This is, I assume, your first L1 you've actually founded. I'm curious, what's one thing about starting an L1 that nobody warned you about, but absolutely should have? >> Yeah. O man, there's a lot of things. What's the one thing? one thing, one thing that would just save you so much time, so much heartache and hassle. >> You need to be very grounded as a leader because you're ultimately going to have this very decentralized team and community. It would make it seem like leadership is not important because it's decentralized, but it's quite the opposite. And I actually give, you know, I I give Lily from the Salana Foundation credit for telling me this way back when that, you know, a der of leadership is a problem in a decentralized world. And it it's the opposite. And that's so true because with this decentralized team, especially like everybody's remote, everybody needs to be beating the same drum. And that's very hard to do. And it's very easy for people to go in different directions. It's very, very easy for infighting to happen. And so you need to be ready to get in front of that and not let it get out of hand. the minute you see two different labs or a foundation of labs go have a bit of friction, you need to step in and make sure everybody's reminded that they're on the same team because I think that's, you know, we've seen this happen often in in kind of mature ecosystems. And yeah, that that's the one thing I wish somebody told maybe I'll give Lily credit for telling me that and and being aware of it. Um, so thanks Lily. But yeah, that's probably the biggest thing that I'd give somebody that same advice. >> It's a very good point. Yeah, because I think people view, oh, it's a blockchain. It's supposed to be decentralized. We shouldn't have any sort of leaders. It should all be community. And I think you do need a figurehead to actually push things ahead when it comes from the building component. Um, so that's a good point. >> And to be clear, I'm not the only one. You know, I got we've got other great leaders like Mike and Doug and others. So, >> Fogo itself in terms of you guys, every crypto project has a mascot of some description. You What is yours? Is it like a flame or? >> Yeah, we have a little fogy NFT coming and um there's a like a flame guy and also we're going to have a you'll see there'll be an interesting event coming up in the next couple months. So, it's Pogo means fire in Portuguese. It's a hat tip to fire dancer and yeah, so that's where you there's a lot of a lot of fire memes come going around. >> Fire memes. Fire. You're going to have fire fire memes. Um, yeah, I appreciate the homage to fire dancer. Final question here. Uh, if I interview again in two years, what three numbers should I bring up to judge whether Fogo delivered on what you're promising today? >> TPS. I would have said real user adoption, but why don't I say real AI adoption. >> Oh, that's a good one. >> And block times. >> Block times. TPS. Real AI adoption. I think that's the first time I've heard a crypto project say they want to have AI adoption as a metric. So interesting. Well, um, thanks a lot, Rob. This has been a great conversation. I've learned a hell of a lot about Fogo, um, and the current landscape of L1's. It seems that there is room for more L1's, and we should continue innovating and solving these problems. Where can our viewers follow more information on Fogo? I'll leave links to the Twitter. Is there any other places they can follow updates? I'll leave your Twitter as well below. >> Yeah, just follow the main page at Fogo. We we went and bought the ad Fogo. I guess we bought it from the Fogo steakhouse. So, it's at Fogo on X and fogo.io is the website. And there's a link tree on the Fogo uh X page that links to all of the starts and connect wallets and portfolio page, etc. So, check it out. Okay. All >> down below, guys. Well, thanks again, Rob. I'm looking forward to the launch and wishing you guys all the best. >> Thank you, Nick. This was fun."
    }
]