[
    {
        "video_id": "8STQFB9PJRU",
        "title": "Crypto’s BIGGEST Scams...Exposed by ZachXBT",
        "published_at": "2025-12-15T10:45:49.000Z",
        "sort_date": "2025-12-15",
        "url": "https://www.youtube.com/watch?v=8STQFB9PJRU",
        "views": 5346,
        "duration": "00:08:25",
        "transcript": "Crypto may be built on transparency, but that hasn't stopped it from becoming a playground for scammers. >> He was scammed out of more than a million dollars. >> That's $120,000 out of their pockets. >> $55,000. From fake support calls to influencer rugps, billions have been siphoned from unsuspecting [music] users. But there's one guy who keeps showing up with receipts. Zack XBT, Crypto's most relentless onchain detective. And he doesn't just call out scams. He follows the money, names names, and forces even the biggest players to face the music. [music] So, here are some of the biggest scams that he's exposed in just the past year. An elderly investor lost 3,520 Bitcoin, a whopping 330 million to a targeted scam call that originated from the UK. Zach XBT revealed that the stolen funds moved through at least six centralized exchanges before being converted into Monero. Shockingly, the laundering attempt was so massive it actually pumped Monero's price by 50%. Next up, in August 2024, scammers pulled off one of the biggest crypto thefts ever, stealing 243 million in Bitcoin from a Genesis creditor. They posed as Gemini support, spoofed calls, tricked the victim into resetting two factor authentication, and even got him to share his screen through any desk, leaking private keys in the process. But Zack XBT would uncover how unbelievably sloppy those scammers were. One of it being video recordings that showed how they walked the victim through each step of the scam and then reacting in disbelief to their own hall. Do you know how much money? >> And one even slipped up and revealed their real name numerous times in audio and text. And the icing on top, one of them, Malone, immediately went to flaunt the money. >> Who the is Malone? >> Hey yo, Malone, you're going real crazy like it's your birthday. >> Blowing hundreds of thousands a night on parties, handing out Birkin bags to random girls. He's like, \"I got this for you.\" And even buying a pink Lambo for his crush, who promptly reminded him she was already taken. So, thanks to Zach XBT's investigation, all four suspects were indicted and over $79 million seized. Turns out, even if you steal a fortune, you can't buy love. And if you thought scams only target the rich, think again. Zach exposed multiple waves of fishing attacks targeting regular Coinbase users. In December 2024 to January 2025, targeted attacks drained around $65 million from user accounts with Reddit threads piling up warnings about impersonated support calls and fake verification requests. Just when you thought it couldn't get worse, March 2025 saw a single victim lose 400 Bitcoin, about $33.5 million in one swoop. And by May, another wave of fishing attacks drained users of $45 million in a single week, pushing estimated losses into the 9 figure range just this year alone. So, what's the lesson? Well, if Coinbase support ever calls you, hang up. Pumps and dumps are nothing new in crypto, but Zach XBT's takedown of Crypto Beast showed just how brazen they have become. In July, the influencer heavily promoted the alt token, sending its market cap, soaring to nearly 190 million as followers piled in. And meanwhile, Zach traced more than 45 wallets directly tied to him, all quietly unloading their bags while the hype was at its peak. The aftermath, over 11 million cashed out, and the token's value dumped 97%, plummeting from $190 million to just 3 million. Cryptobeast then deleted all promotional content and posted a lukewarm apology, saying he really thought [music] it had potential. And this wasn't his first rodeo either, as he had gotten his old followers wrecked on at least six other tokens. After deactivating his account briefly, he returned to X under a different username, Real Crypto Elia, which he probably renamed yet again after the heat that he got from Zack XBT's [music] exposure. Now, it's one thing for a faceless crypto influencer using their followers as exit liquidity, but it's another when the pump and dump is led by an ex Fortnite pro. Last December, Zack XBT exposed Serpent, a former pro who pivoted to cyber security after being caught cheating in the game. He orchestrated a string of memecoin scams worth around 3.5 million. So, how did he do it? Well, he used hijacked social media accounts, big names like Usher and even McDonald's, and promoted coins that he was already heavily exposed to. The playbook was simple. Hype up the tokens, funnel unsuspecting buyers in, then dump his bags as prices spiked. Zach also linked Serpent to a shady project called Error, which showed signs of being a rugpull in the making. Once the heat was on, Serpent tried to scrub his tracks, deleting posts, distancing himself from projects, and even being caught funneling scam proceeds into online casinos. But the blockchain doesn't forget. Thanks to Zach's efforts, it seems Serpent was better at scamming his followers than he was at Fortnite. These days, a lot of people worry about exploits, rugps, and social engineering. But don't forget about physical threats, which have unfortunately been on the rise. The $5 wrench attack is not something to take lightly. And that's exactly what went down in the UK last October. Rearis Ali and two other associates committed a home invasion that ripped 4.3 million in crypto from a victim of crypto data breach. Besides following the trail of stolen funds, Zack XBT also acquired private chat logs between the robbers where they plan to disguise themselves as three delivery drivers delivering a package to the victim's doorstep. But the reason the perp got named is the fact that Farest flexed a picture of his bail containing his name to his friends on Telegram just a few weeks prior to the incident. Someone even bought an ENS domain named far ali and left a message threatening Fars to pay up or risk having his personal information leaked. But it's hard to say if this person really had anything on Fars unless it's actually the North Korean hackers who posted that message. When you think of North Korea's Lazarus group, you probably picture billiondoll exchange hacks and nation state cyber warfare. But it seems that even state sponsored hackers like to moonlight. Earlier this year, Zach XBT flagged wallets tied to Lazarus, funneling funds into Solana meme coins on [music] Pump Fun. Yes, you heard that right. Pyongyang's finest hackers went from raiding exchanges to launching rug tokens with dog logos. The scheme was simple. spin up viral meme projects, pump them with stolen liquidity, then dump on unsuspecting retail chasing the next Pepe. Zach's receipt showed how the same wallets linked to the buy bit hack were now busy running what looked like a budget influencer scam. So, guess memecoin scams were a good side hustle on top of draining treasuries. And that's all for now from Zack XBT for the past year or so. While we can only hope that this is the peak of crypto scams we will ever see, bad actors have a way of [music] surprising us. Anyway, if you like this video, be sure to leave us a like and subscribe for more content to stay sharp. [music] Don't forget to be safe out there and I'll see you in the next video. Bye. >> [music]"
    }
]