[
    {
        "video_id": "o0QpOk8hGk0",
        "title": "BITCOIN: l AM PRAYING…. (this is bad)",
        "published_at": "2025-12-15T16:17:02.000Z",
        "sort_date": "2025-12-15",
        "url": "https://www.youtube.com/watch?v=o0QpOk8hGk0",
        "views": 18119,
        "duration": "00:07:43",
        "transcript": "Holy crap, guys. This is not a drill. This is an emergency. Listen carefully. Bitcoin is now heading lower. It is threatening with a breakdown of this bearish pattern which is the bare flag where we have the flag pole right here. Then you have the actual flag and then the target is that you draw the flag pole down and you see that it is somewhere here where the 200E moving average meets this flag pole extension around 5560K. This will not just be a straight line like this. Obviously this may be this may take some time but on a big big picture this is the raw the raw reality that the bulls need to look at. Obviously bulls don't want to look at it. They don't want to see it. In fact you should watch the full stream from this morning. I go in depth about the Japanese yen and how the rate hike in Japan they will actually be increasing rates will affect everything. Yeah, I really go in depth here. So go and rewatch it because I don't want to repeat everything. If you haven't watched it, you don't understand what Bitcoin is doing. You don't you have no clue. So, go and watch it. But let me just tell you that in this video that I did, I said that we have this target. I basically highlighted this target. And you know, guys, I I'm doing a thankless job here. Even when I'm fully correct, there's always a guy who's like, Ivan, you're becoming ridiculous. [laughter] Like, how how I've been spot on since October 8th. I told you to dish on October 8th is basically the peak they the called the top on the day since then. Down. But Hugo Montenegro 5723 thinks that it's ridiculous. See, so the bulls, they don't want to see. They don't want to see the reality. They don't want to see. Instead, I see the bulls getting uh getting um upset. They get u nervous. They get desperate. They say, \"Oh, no. You're desperate. You don't talk. Don't talk to me that way. Don't talk to me that way. Don't say that business can go to 60.\" Don't say don't say the words. Don't say the words. Don't say the Another thing. They don't want me to say bare market. bare market bare market bare market when I say that it's like you know they they the brain explodes for them the brain they cannot they cannot hear that's why I actually avoid saying bare market I say a bare trend because it sounds softer more people like it more more people feel at ease it's like you know political correctness we don't say bare market it's uh haram we say bare trend then more people feel okay more people feel feel okay otherwise people need to take their medicine the you know the some you know to calm down the pulse the pulse is going too much. But guys, listen. This is what it is. This is what we're seeing on the charts. Oh, yeah. Another thing that I wanted to include here is that Michael Sailor actually has uh been buying a lot today, [laughter] but the price dumps anyway. He bought 980 million. The price is still down, guys. Still down. Why is it down? Let me retweet. Maybe if I retweet is going to pump a bit, but listen. Why is the price down? Because it is many sellers at the end of the bull, beginning of the bear. It is always like that, guys. It's always like that. You have good news, they don't pump. You know, such a news with Michael Seder buying in 2023 would pump us. I mean, just that will give us like 5% on the day. Now, it's so sluggish. The price is sluggish. So, how can the price be fixed? You need a big fat flash. So, the sellers are exhausted. Okay. Personally, I'm not trading this. I'm not trading this too much because we've been risking since October 8th. We've been taking it easy. I mean, we've been risking all the way. and especially when we flip bearish when we flip bearish when we flip bearish on the money line. So basically I have my long-term huddle now of 30%. And that's it that I I will huddle it no matter what through bull through bear. So I'm not trading. So now I'm just you know sitting sitting back relaxing. It's like you know you go to circus you see some dude wrestling a bear like dude wrestling some kind of grizzly bear and you're there I'm I'm I'm eating popcorn spectating. So this is basically what I'm doing. Now this Montenegro guy he's like you're becoming ridiculous. He has to wrestle the bear. Okay, this guy has to wrestle the bear because I can see that he's a bit wrecked. But we ourselves, we're just spectating here because we we've been derisking correctly. And actually, we have also a plan in case it goes up because another guy was asking, Ivan, what do you do if you go up? Listen, we've been derisking since October 8th. Look look at what the price was on October 8th. And then you see that if we go above 50 moving average, this is going to be the first big signal for us to become bullish if we start closing weeks above. And then if we close a week above this one above the bear the bull flip the the bare uh border here that will turn us into bull. It's at 116 which is lower than the price at which we started to do risk. So I mean our system takes into consideration everything we will have a profit no matter what happens whether the price goes up or down. That's why for us it's it's not about prediction. It's about following the trend and then adapting portfolio to the trend. So in case Bitcoin goes to 1 million we're good. In case it goes down to 20K we're good. We're going to be buying at 200E moving average which is the best uh place in the world to buy Bitcoin. Right here is if you look through time guys this is where you buy [laughter] you all the wealth in crypto has been done by buying 200 week moving average. Look at the last bottom of the bear it was 200 week a bit below. Look at the bear before that it was exact 200 week. Look at the bear before that it was exact 200 week. So if you buy here and then you relax for the next three years is the best best best way to approach this market. So guys, what do you do now? Number one, go and watch the stream from uh to this morning where I speak for half an hour about Bank of Japan. I mean, everything everything. If you don't know what's happening to Bank of Japan, you're a noob. You don't know what the hell you're doing. So go and click right now. The link is below. Uh so that's number one. And number two, this is your last chance to join Bull Mania because we are closing it for 2025. Everyone is having vacation soon. So, we're taking the last cohort basically this week. You have time to join. So, use the link below. Uh otherwise, we're closed. No more joining. We go on holidays and and that's it. That's it. So, watch the free training. Watch the free training. And as you know, bullman is all about our methodology, how we trade, how we ensure that we're good no matter what. How we ensure that if we go up, we we make profit. If we go down, we also make profit. It's all about the mechanical rules. And it's the proper way to trade. So, you don't have to be like the Montenegro. Big shout out to Montenegro, but I know he's right. But just by reading people's comments, I know if they're wrecked or or or or if they're good. Some people actually ask good comments. I mean, for example, the guy who asked, \"Hey, what how do we adapt in case price goes up?\" That's a good comment because it's all about how do you structure your portfolio and what signals do you look at in order to start being more risk. So, it's it's more like water. You're like water. You're more risk on, risk off. Risk on, risk off. So, in case we go to a million, good. You're part of the million move. In case it goes to freaking zero. You're not part of it. You You have secured back. Guys, smash it up. Smash smash. If you're new to the channel, welcome. Big big welcome. And share the video. As you can see, I'm doing a thankless job here. I mean, I'm doing videos here telling you exactly what's going to happen. And what do I get back? This is what I get back. This is what I get. This is what I get back. So I'm doing a fully thankless fully fully uh thankless job here. People spitting in my face by just and I'm telling them should they still spit. The more truth I tell the more spit I get in the face. This is the reality of the bare market. That's why really I want to get the bull markets whatever in the bull market you know everyone is bullish everyone is happy it's so nice. Now even when I'm telling you exact exact exact what's happening you see how thankless it is. You see how much piecing is happening in our in my face. But I will continue telling you the truth, guiding you. You subscribe, you like, and goodbye. Goodbye. Goodbye."
    }
]