[
    {
        "video_id": "Jw_kDHCIA10",
        "title": "Bitcoin's Bull Case, Macro, AI & 2026 Predictions | Jordi Visser",
        "published_at": "2025-12-12T14:00:37.000Z",
        "sort_date": "2025-12-12",
        "url": "https://www.youtube.com/watch?v=Jw_kDHCIA10",
        "views": 32225,
        "duration": "01:00:30",
        "transcript": "The odds on Bitcoin being an important asset 10 years from now, 20 years from now are extremely high. The reason I'm confident that the market cap of Bitcoin will be much higher and I think that's going to be a big story behind the rally next year. You wrote that Bitcoin is the purest AI trade because its belief emote strengthens as AI speeds up. >> Bitcoin is the only thing that I'm aware of, not Ethereum, not Solana, not any of them because it's the only one that doesn't actually need to worry about the innovation comparison. How close do you think we are to the end of this particular distribution phase? >> I'll make a uh a big statement here. I actually think it's over. The OG's will continue to be selling. They were inspired by an ideology of anarchy of of I don't believe the government is doing the right thing for us. There will be a short squeeze in in Bitcoin at some point over the next few years. >> Well, a few things around strategy. I think one is it was the first time I think I've ever heard Michael Sailor say that he would consider selling Bitcoin. He has an OG advantage here from a business standpoint in the digital capital structure of the future. That's what I believe in. Good morning, afternoon or evening and welcome back to another podcast episode here on Coin Bureau. Uh today we are being joined by Jordi Vissa. He is the head of AI macro Nexus research at 22V research and one of the deepest thinkers out there on a plethora of topics. So Jordi, a very warm welcome to the Coin Bureau. >> Thanks Nick. It's good to be here finally. >> Yeah, finally. Before we dive in, guys, quick few disclaimers. Nothing in this video is financial or investment advice. Please consult the disclaimer in the description for more information and consult your financial adviser before making investment decisions. Now Jordy, as I mentioned in in the intro, you have a breadth of knowledge on numerous topics, and it was hard to kind of narrow down most of these questions I had for you. But given that we are a cryptonative channel, I would love to start on what's going on with Bitcoin right now. And this brings us to your latest piece, which is titled quote, \"Handicap in the future, what horses, poker, and macro legends taught me about Bitcoin.\" And it was really optimistic, especially for now when it seems that the general consensus especially on crypto Twitter is one of a bearish take. And I actually found this quite enlightening. So I actually summarized a few of the points in it on my Twitter. And and these are one, the edge isn't predicting the future. It's spotting when the crowd is wrong on probability. Two, Bitcoin's biggest feature right now isn't tech. It's how few people actually own it. and three, the best riskreward shows up when most people still think the idea is stupid. So, I want to kick over to you now. Do you want to potentially expand on a few of those? Is that a good read of um the thesis? And and what else do you want to add to that? >> Yeah, it is. And I and I let me clarify just one point on it. So, I'm uh I'm a person who thinks far out, but let's just break it down this way. I was trained as a trader. So, I have the ability of talking to anyone on the crypto side and I can tell you, you know, current sentiment on Bitcoin is extremely low. I can I just posted something on X highlighting that in the equity market, we're seeing beta outperform quality. So, think of it as risk outperforming safety. When Bitcoin fell from, you know, 120 down to 80, the equity market was also seeing the same type of move where risk was breaking down relative to safety. What I'm focused on in this piece is I have no doubt in my mind that the odds on Bitcoin being an important asset 10 years from now, 20 years from now are extremely high. That does not connect back to the people I talked to on Wall Street. And when I say Wall Street, what people need to understand is the greatest argument for Bitcoin to me is both the demographic argument, but also the percentage of market cap for Bitcoin relative to the rest of what I would consider the store of value. And what people kind of get into is converting Bitcoin to digital gold. I will write a a Substack at some point soon with a belief I have that Bitcoin a store of value is equity. A store of value is bonds. A store of value is real estate. A store of value is gold. Bitcoin to me is not digital gold. It's a digital store of value, which means it is converted or it should be compared to the entire fiat store value. I think this is an argument that Michael Sailor has too. I believe in it as well. So, the reason I'm confident that the market cap of Bitcoin will be much higher and that it's mispriced right now, and that's what I go through in in this piece, is that 5 to 10 years from now, there will be a rotation out of these fiat assets and into Bitcoin. It sure should have happened at a faster pace, but the reality is to the degree that it did happen is why Bitcoin's market cap has been soaring faster than any of the fiat market cap. So for everyone who's listening, and I'm sure your audience is predominantly crypto-based, I can tell you in my meetings with anyone above the age of 50, the probability that they embrace this story is very, very low. The higher an age you go, the lower it gets. The more money they have, the lower it gets. So if you believe in this transference of wealth over the course of the future, the odds on Bitcoin working or continuing to go higher is very, very high. If you add in the demographics that for every dollar transferred from someone in their 70s to someone in their 30s has a positive edge to it, which is the way again I handicap a horse race. That has a positive tailwind to it. So I'm not getting caught up, Nick, in the day-to-day things. This is my view in the future. And then I'll incorporate kind of the thing I said about risk versus beta or risk versus volatility in the equity market as a timing tool. I think Bitcoin is going to go much much higher and I think it's because there's so many people that doubt it still that control most of the world's money. >> Yeah. You've also in that piece or you've said it numerous times that and this ties into your thinking around AI which you're also very bullish on. You wrote that Bitcoin is the purest AI trade because its belief emote strengthens as AI speeds up which is a pretty bold statement. So can you expand on that a bit more? Yeah, this is something also that I I strongly believe in. We we're leaving we're leaving a capitalist system that took time for innovation to go from idea to public company. So if you just literally go through how long it it would take to come up with an idea. Let's start with an industrial idea. I want to become an oil company. Okay. So what do you have to do if you want to go compete with a large oil company in the world? Well, you have to find oil. You have to borrow billions of dollars to get the equipment to go drill oil. You have to do all of these things and then hope that the price of oil actually goes higher. Think about all of that for every industrial. If you want to be a car company, if you want to be a wrench company, whatever it is, you have to borrow lots of money. You have to have lots of physical locations. You have to go trade the commodity markets. All of these physical things. What happened over the last 18 years was we transitioned into the digital economy. In the digital economy, if you came up with an idea that I want to create a a client relationship manager system, CRM, you didn't need to go do all that stuff. You could actually do it on code. The code was both your employers, but then you use the internet. The internet and the platforms allow you to not have to go buy buildings or go around the world. And these companies like Salesforce.com, like Google, like all of the companies built on code were able to have incredibly high margin businesses. They didn't need to take money out for debt and so that idea became something much quicker and with a much lower cost and that's why those companies dominated. The problem with artificial intelligence is artificial intelligence has made code ubiquitous. Anyone can have it who has a phone and it's free. So now all of a sudden there's competition for all of those companies that worked for the last 17 years. So an idea now is verbal. You can say an idea into an app like cursor or like Devon or like Replet or like any of these things. You can have an application that competes with Salesforce.com within minutes. Maybe not on an enterprise scale but on an individual scale. So this is the democratization of education. It's the democratization of taking ideas and building businesses. You connect it to Stripe. You put it on the internet and all of a sudden you have competition. So there are no moes anymore. The other side is the belief system of Bitcoin. Bitcoin has gone from zero to acceptance. The Bitcoin white paper has become a part of history and a part of something that is up for the Nobel Prize in terms of the way a lot of people think about it. Mark Andre has written about it in that framework. So you have something that is meant to not be disrupted by a moat. It could have competition, but at this point I think it's already won the battle as being the digital store of value. And so when you get to that place in time, AI will disrupt all businesses. It has already disrupted real estate. And the reason it's disrupted real estate is we had COVID. COVID made allowed people to work from home. Well, now around the globe, you don't need physical buildings to go work in. You can create a business very quickly with very few employees. You don't need to borrow money. So we've made real estate in this concept of traveling into cities moot. It's just not there. So AI as it accelerates, as humanoids come in, all businesses, regardless of what they do, even manufacturing businesses, because if humanoids cost $20,000, you're now bringing the margins into physical companies as well. Everything goes from idea to monetization. And Bitcoin is the only thing that I'm aware of, not Ethereum, not Solana, not any of them that doesn't have it's a belief, it's not an innovation. And that becomes the strength. So I believe Bitcoin will be the best performing asset because it's the only one that doesn't actually need to worry about the innovation comparison. >> Very good argument and so it's that concept of in an AI world uh there is no scarcity and Bitcoin is a scarce asset in terms of its supply. So coming back to the arguments around a lot of the big institutional asset allocators out there that you know of because obviously you have a trady background. You still work with these guys. you talk with them regularly and one of them you say is demographic as well in terms of age component but what are their main reasons for still not wanting to allocate to bitcoin I guess to the extent in your piece you say that they still pric in you know bitcoin at a 100 to1 or even worthless while you're closer to 3:1 in terms of the potential upside for bitcoin if you're coming back to the idea of horse racing so why do you think they're mispricing it so much >> two very simple human emotions fear fear and need. So on the on the need side, let's start with the need. If you're wealthy, why do you need Bitcoin? You've already accomplished what you want. If you have quote unquote a billion dollars, $100 million, $50 million, you don't actually need it. And I think again, Michael Sailor has done a great job of arguing that the the countries, the companies, the individuals that need it will eventually get there. I think his business micro strategy when he described when I first really got interested in this connection between tradfi and macro and AI it was based on the premise of what Michael Sailor said which is his business was being disrupted. Who is it being disrupted by? The government in terms of the debasement side. He had a he had a billion dollars of cash sitting on his balance sheet, but the government was now moving rates to zero, which means he wasn't going to receive any interest, which sped up his demise if he just let it sit there in treasuries. On the on the other side, he was being disrupted by AI. And yes, it was AI. It was machine learning has been around since 2007, 2008 in a big way, growing way. But he talked about the fact that he couldn't compete with the Mag 7, that Microsoft was already destroying his business and how would he ever catch up. So he was a zombie. On the flip side, for all the things we mentioned, if you're a pension fund manager who runs a pension fund, you clearly don't have the need at this point because the Mag 7 have been producing returns that are very similar to what's been happening with Bitcoin. So we actually need the growth stocks to start underperforming, which I believe, as I said, is going to happen with AI. And I believe it's going to start happening in 2026, which is the most bullish argument I can make for Bitcoin is that they're going to be searching for need finally. But on on the flip side, you have the fear side. If a pension fund makes an allocation to Bitcoin and it proves out to be a scam, they lose their job. So they don't have the incentive to get involved in it. This is the way the traditional finance world works. If you have money, you don't want to take risk. If you're a billionaire and your kid is running the the family office, the kid's going to be defensive with the money until the patriarch is gone. The matriarch is gone. That's just the way it's going to work. So fear and need are the two emotions that are driving, let's say, the speed of it. And that's why when you get someone like El Salvador, why are they involved in it? Because they have the need. They're not scared of the outcome because they've already lived in it. So Bitcoin is owned primarily by people in that framework. I wrote a paper called the silent IPO which was about the old guard, the OGs that are now selling. Well, they got involved for ideological reasons, but they were wealthy. They weren't poor people. They weren't the people that needed it. They were inspired by an ideology of anarchy of of I don't believe the government is doing the right thing for us. Well, now, unfortunately, they have no need to own it. Not in the size that they do because they're now wealthy or wealthier than they ever were. So I believe there's a churning that's going on around these levels. The government is supporting it. They're trying to get individuals in. ETFs have come. They're allowing individuals to get in. So we're opening up the door. And I think this is the way people should always think about it. There's people that have need. There's people that on the flip side are fearful. And I think that's what's slowing down or being the friction of moving more money faster over. >> Yeah. And you come you made a point there around what's required for these allocators to want to consider investing into Bitcoin or shifting into Bitcoin. And that's the concept of growth stocks underperforming which help which will be helped on by AI. My question is related to that is in that scenario when AI is you know transforming the world all these AI companies the ones that are in the mag 7 that are driving a lot of the stock performance right now they're going to continue performing surely in terms of like growth. Is it potentially a situation where AI companies right now in the in the right now that have been performing so well could take away some of that mind share and indeed momentum investing factors if you think about trading as factors momentum is one of them that these allocators may think actually you know although I know that growth stocks what the traditional growth stocks aren't doing well because AI is a disruptor I could just allocate to one of the best performing asset classes of last year which was AI and a Mag 7. Well, here's the reality with the Mag 7. The S&P 500 this year is up about 16 17% as we speak. Of the MAG 7, five of the seven companies have underperformed the S&P 500. Only Google has really outperformed this year. I believe that that's going to continue. So, in no way, shape, or form do I believe those companies are going to outperform. And the reason I say the S&P 500 is because what people have to think about, yes, the S&P 500 is up a lot this year, but this is with those companies being up. I think many of them are going to be under pressure because they're doing something that they didn't have to do ever. If you go back to my argument of an oil company and what it needed, these mag seven companies are spending an enormous amount of money to compete with the other companies on a commodity that is free. So they're spending t tons of money hoping that they're going to get their revenues in the door. I don't think they're going to get enough revenues in the door to justify the earnings multiple that they have. So I expect that their earnings multiples will compress over time. There will be some like Tesla and things that'll benefit from humanoids that'll probably outperform, but the reality is when you go through the rest of the world, Tesla is very similar to Bitcoin. The majority of people on Trafy don't believe in Tesla. They don't believe in Elon Musk. It's one of my favorite topics in the world. The Substack I wrote two weeks ago was on the credibility of Alon Musk and what he's talking about. If the world goes through what I think it's going to go through so far this year, we had a big AI year, but foreign stocks have outperformed the US. The DAX has outperformed the S&P 500 or Europe has outperformed, especially in in currency terms because the dollar has weakened. while the rest of the world or all the global benchmarks are dependent kind of on the mag 7 and software names to outperform. So I do believe this is uh getting in the weeds a little bit here but I don't think people should underestimate the fact that with AI happening you're actually going to see the underperformance of growth stocks and people are going to be looking for some kind of growth and I think Bitcoin is going to be the place that they migrate to more and more. I fully expect that sovereign wealth funds, pension funds and everything around that around the globe will allocate more and more money towards Bitcoin in uh in the coming year and I think that's going to be a big story behind the rally next year. >> Okay, we'll get on to that in a bit. I just want to pick on one point you made there around and this relates to the whole AI trade itself that these companies that have these massive valuations and multiples the the hyperscalers etc that they could struggle to get the revenue to justify those those valuations. Why why do you think that exactly? >> I think it's almost in my mind it's almost a foregone conclusion and I and I say this from a very simple thing. They're competing with each other. So there's no way that all of them are going to win. They're spending an enormous amount of money. It I'm not saying in any way that they won't get revenues. Uh the people that think there's an AI bubble, I completely disagree with that. But there's a difference between there being a bubble and these stocks becoming more boring companies. meaning they're getting revenue in, but they have to keep spending more money to get better compute to compete with the other players. You've seen that already this year, meaning Open AI is now, you know, they're questioning whether they're going to be around because of the deals they're making and how much money. Well, this is a company that doesn't have the advantage that Google does. Google has a business in search, which is a cash cow. Open AAI needs to borrow their money to actually go through. If Open AI were in trouble, I think all of the multiples of these companies would come down because it would be proof that it's very hard to monetize this. So, no one has proved yet that they're going to be able to monetize it in a big enough way to justify the amount of spending that's going on. In my weekly video that I do where I connect tradfi to AI to crypto, I highlight an interview that Dario Modi did from Anthropic with uh Aaron Ross Sorcin which went through in an honest fashion the difficulty that all these hyperscalers have with predicting the revenue. And if they make a mistake, they're at severe risk. their businesses could go under because they're dependent on the data centers and all of these things that I believe as AI gets better and better. The disruption that will come from these investments they made, these data centers could become worthless over time. They could be stranded assets in 5 years. And if that's the case, the people that made these big bets, when a new innovation comes, Elon Musk is talking about solar satellites. If that process goes faster in all these data centers, if you want to have your stuff in space because it's cheaper to run, you don't have that advantage. There's a whole bunch of things that are going to happen. AI creates a very, very difficult way to predict the future. And that's why I'll continue to say when you're dealing with Bitcoin, you're dealing with, hey, we're only worth $2 trillion and the fiat assets are somewhere between 500 trillion to 800 trillion. I like that ratio in terms of that one side getting bitter bigger and the other one even if it only goes down a h 100red trillion that's still a big move for Bitcoin. >> Yeah, for sure. So speaking about Bitcoin now and you mentioned it earlier um your silent IPO thesis was I would say one of the most widely shared Bitcoin pieces over the whole year and in it you argued that Bitcoin's kind of frustrating sideways action wasn't weakness but a massive healthy distribution of phase from the OGs holders to the institutions in this IPO phase. I guess my first question is how close do you think we are to the end of this particular distribution phase? I'll make a uh a big statement here. I actually think it's over. I think it's kind of been over to some degree since October. And and this is the reason why I'll say it's over. The OG's will continue to be selling, but it comes down to is there more buying power now? When we were going up to all-time highs, what people have to understand is the selling was happening during that entire article. This wasn't something that I wrote. I was hearing about it. Mike Novogratz was talking about it openly from Galaxy in the earnings reports. this had been going on during the summertime. So when I see anything that has that much upward buying pressure, which again I view uh I view this as being kind of the important buyers of the world, let's break them down so that people can get kind of my deep feelings on the way this is working. There's three buyers that I care about. One of them, let's just put them in as the most important buyer, which are countries like El Salvador. They're very tiny. Meaning, if a kid in Brazil becomes an entrepreneur and they don't trust their government and they want to put money into Bitcoin after they've done some stable coin transactions, selling a new app that they developed using AI to an American or to an Aussie or to a European and they collect $10 and they have those $10 and they don't want to keep it in Brazilian realis. So what they do is they put seven of it into stable coins, dollar back stable coins to protect against the depreciation, but then they want to have money working for them and they put a certain amount of money into Bitcoin. This is kind of what Tether does with their gold holdings, their Bitcoin holdings and the excess return. So I want everyone to just think about that is a small portion of the pie dollar-wise because you don't have Brazilians having much money. The second point is the institutional side, the ETF buyers. Let's put them in as the wealthy individuals around the globe including pension funds, sovereign wealth funds and the people in the western world. Most of the M2 of the world is effectively in China, the US and Europe. Whether people understand this, that is probably 75% of global money supply and wealth is in those three countries. So we kind of depend on those three countries to be the drivers of it. The OGs are also in those countries as well. So you have the OGs selling to other people inside that country that again in the US when I talk to people a lot of the Americans that are buying it they're electricians there are plumbers they're people that have already been forced out of the system those buyers are there they're offsetting the OG side and I think they're growing every day and more importantly the younger demographic is offsetting them so when you take the one buyers which are the poorer people of the world which I think are structurally bullish and will always invest in it because they're hiding from their government then you have the wealthy people which are doing it which is great. You still have you know that part going on but then you get into a third component which to me I think is the reason why which is retail traders. Retail traders are a different breed. Retail traders are people that have already decided in the modern world and these are younger people below the age of 50 for sure. I would say mostly below the age of 40. I do a regular weekly podcast with Anthony Pompiano and I've gotten to meet a lot of these traders. Crypto traders are real traders. They remind me of myself as a young person getting into the business at Morgan Stanley. Well, they're the ones that drove it from 120 from probably from 100 to 126 and then from 126 back to 80 because a lot of the names that they were trading in the AI space, the Palunteers, the Nvidas, those names got bludgeoned during October and November. I think that buying power is now back to clean. It's enormous. whenever that buying power is there and they only play from the long side when it starts to get going. We just need to see some moving averages tick out. I believe when Bitcoin gets back up on the year, I'll say three daily closes above 92,000 which is about where it closed last year. I think the retail crowd will be back in pushing this thing. We'll have the option volume going in and I think at that point we'll get back to the all-time highs and I think the OGs have reduced. I'll add one other seller that's been critical for the IPO part which people have to think about as well and that's the Bitcoin miners. And I think the Bitcoin miners have been reduced going forward as a seller because of AI because their businesses are now starting to get a revenue stream which means they don't have to sell as much as they did in the past. And that's because their electricity is becoming extremely valuable. Always remember and if you saw Lon Mus speak last week he talked about the fact that Bitcoin is pure energy. If electricity prices are going higher, then the Bitcoin miners don't need to be involved as much on the sell side in terms of hedging their business because their electricity is worth a lot of money. Their compute power is worth a lot of money. So, I believe the miners are be are going to become less of let's say call option sellers, which is this phantom supply that people don't see that often. It's to hedge their revenue and the risk they have if the price drops. I don't think they're going to need to sell as much as electricity prices go up. So that's a long-winded answer for you, Nick, but I got a lot out there. >> There's so many threads I want to pull on there. Wow. Okay. So, so you say so you think in in terms of what could get Bitcoin, it's momentum, right? So momentum in terms of these traders, you say it's retail traders who when they see momentum coming in, they see Bitcoin holding, you know, above support levels. In your case, you said 92K, three daily closes. They'll start coming back into the market, start bidding again, and the distribution has slowed substantially from the OGs and the miners. What about, you know, and these when you say these retail traders bidding up Bitcoin, uh, that's the retail component. Do you think that's really that big enough to pump and to increase the price of an asset like Bitcoin itself, which is a massive in market cap already? And and what do you think about the institutional demand that everyone's talking about? like all these institutions coming out, you know, the likes of JP Morgan, Goldman Sachs, and you have all the um Bitwires and all of these guys say just singing the bullish tune in terms of what institutions are looking at. It see indeed if you look at sentiment on retail focused platforms like Twitter or whatnot, right? It's just deathly. But if you hear what the institutions are saying, it's like they're incredibly bullish. So, okay, I'd like to take a moment to thank the sponsors who make this show possible. SVM's ecosystem has been missing a high-speed, low latency chain until now. Fogo delivers 40 millisecond block times, 1.3 second finality, and near zero fees. All backed by high performance validators colllocated near major exchange infrastructure. Made for traders by traders, zero compromise. It's not theoretical. It's live and blazing fast and ready for you to test. Head to fogo. io/start and experience the future of trading. >> In this case, you're thinking that retail could actually take Bitcoin back above 100K in the next few weeks. >> Well, let let's assume, and I don't think this is true, but let's assume every retail trader is actually at the end of every year flat. Okay? And they're pure traders, meaning they don't they're not Bitcoin holders for the long term. Let's just we know that a lot of them are, but let's just assume they're not. They're the energy and the energy in Bitcoin is really important and this is the message that I want to get out to people. You mentioned momentum. Momentum is a very powerful force because it is riding something that they believe is going to go higher. They're involved in equities. I've always said retail traders get the in fact let me phrase it this way since we already talked about it and you asked the question on it. So I wrote a piece believing that Bitcoin will definitely be 10 20 30 times higher than it is today in the future. The question for me is whether that's a 20-year story, a 30-year story, a 15ear story, 10. I don't really care. In my mind, the bet on that is worth me putting 20% of my chips in that bet. 30% of my chips. That's the way I view it. And that's the way I allocate my money from in a long-term investment theme is I want to have less money in the fiat assets. The energy that matters is retail has learned a lesson that fiat people don't think about. Fiat people are always looking for the bare side. The reason there's an AI bubble article every single day is because they realized how hard it was to make that money climbing the wall of worry for the last 40 years. So if you're a 60-year-old and you've made tons of money and you know the government is basically bailing out the system every time COVID happens or any SVB happens, you believe the system's rigged and it's going to crash. On the other side, you have retail which is younger. They're hungry and they're like, \"No, this is like going to Vegas and the odds are you're going to make money 85% of the time. So, I just want to play from the long side.\" And every now and then, if the market's not working, if you read my piece, what my father taught me is, hey, if this is a race where you can't find any value, sit it out. That's what retail good retail traders do. If they see the bull market's not working, they just reduce their bets and they try to pick the bottom of Bitcoin until it goes. But once they feel comfortable and it's working and they feel that now, like blackjack, hey, I'm a card counter and I know now I should be tripling my bets, they will triple their bets. They will leverage in. They will get bigger and bigger because that is the way you make money in a pure way in this in a rigged market, which I believe it is. You're playing it like blackjack. You make your bets three times as more when the technicals are lining up and that fever is going. So what retail does is they actually set up the next trend. They'll get out of that stuff at some point. But when you're playing the game and you believe that over the course of the next three years, like like salmon going, you want to go with the river. You don't want to go against it. Bitcoin's going to be a million in 10 years. I want to find the points where the moving averages start to tick higher and I want to jump in during that because I know I could miss a 100,000 to 300,000 if I'm worried about being a bare market when these things are not going to last that long. That is the thing that I think retail traders do. They are the energy in there to fuel this. And I think they're going to fuel the next one along with the sovereign funds, along with less selling from the things I go. They're the ones that are going to turn this back above a 100 and then it'll start feeding on itself. >> Fascinating. And is it um do you think that's the the retail traders just buying spot? How much of the impact do you think is coming from the ETFs of retail who hasn't been trading Bitcoin for from like new retail come in and buying Bitcoin through the ETF through their stock brokerage accounts? How much of that do you think is the split? The biggest trade we the biggest change we've seen in the structure of the trady world and the world as a whole is the art of gambling and leverage. These guys are going to use options. They're very I went to a Robin Hood event. I spoke there. I was shocked at how knowledgeable people are in the on the derivative side. I was a managing director at Morgan Stanley on the derivatives. I ran the S&P 500 book which is the trillion dollar book. I'm trained in derivatives. These retail traders are very very smart on options and they know when they should come in and buy options. I mean micro strategy technically to me is an option. It's a strategy with leverage. It's a strategy that people use in that manner. I think their comfort for leverage is high. So although they'll trade spot, I think when they really get bullish, they go buy call options. And this is where again I've written and talked about this many many times over the year that I think there will be a short squeeze in in Bitcoin at some point over the next few years. And the reason is because if we take out the V selling, VS are very compressed right now uh from a combination of the DAT companies and Sailor just pummeling the market with a lot of at the money structures. At the same time, you have the Bitcoin miners that are constantly selling there. You have uh Asian wealthy investors that have been in Bitcoin a long time that sell premium and they sell premium to collect cash in from the holding side. This is uh something they do in the equity markets as well. So at some point we're going to get through that supply and those sellers of options are going to need to turn to be buyers to cover their shorts and I think that day is coming sooner rather than later. So the next rally we get when we get some steam going I I want to see if V starts going higher as price goes higher because that'll be the big change. So the option market is the biggest change Nick that's happened in the traditional finance world. Gambling is a big part of the culture for younger people and I think this is something that people haven't adjusted to yet. >> Very interesting. Um coming back to next so then let's assume next year uh I think that what many people are looking forward to next year is this concept of like liquidity global liquidity it's macro thing right and we know it's probably like we expecting this liquidity surge this year and it's kind of decoupled Bitcoin's price from the growth in global liquidity and I guess now of course people are looking forward to next year when you've got QT's ended you've got a doubbish Fed you've got uh potentially changes to the banking reserve ratios which could allow for more liquidity in the markets and leverage from the banks. So do you also hold that thesis in terms of this surge of liquidity which could help you know be a you know take it forward in terms of the price? >> No, I don't. Um let me give you my thoughts on this because so first let me say when liquid when when global liquidity declines I absolutely agree that bitcoin should be correlated to that point and that's because all assets are correlated to that as well. What people have to start to remember um and this has happened the biggest mistake in the United States since 2022 for investors was predicting a recession. The reason they predicted a recession is because they focused on M2. Now M2 is basically correlated to income. So the thing people have to start getting through their head is in the United States right now personal income is growing at 4 and a half% a year. Same as nominal GDP. This is why assets should go higher as income is growing. But what people don't talk about in the Bitcoin community and in fairness they don't really talk about it in in in economists don't talk about it which is why I don't listen to economists. We have a balance sheet as well. So the balance sheet which is described as the assets owned are massive. Uh in the United States we have a household net worth of $178 trillion. It was 120 trillion at the end of 2019. So it's up about 33% I'm sorry it's up about 60% since that time period. That is the money that is the fuel for Bitcoin. It's not the M2. So there's income. Yes, that matters. Income if it goes down, which doesn't happen often. So M2 goes down, then you're going to have a bare market in stocks and you're going to have a bare market in Bitcoin. If M2 is going higher, Bitcoin should be in a bull market. And to me, it is. It has underperformed liquidity. But I think the reason it has underperformed liquidity again, as I as like say, there's no need for people to transfer their fiat assets into Bitcoin. What is going to release that? Part of that is what I said which is we actually need the growth stocks to become an anchor on the growth in the balance sheet and that'll force people to go for the for the com for the governments of the world. I think Bitcoin reserves are going to increase. I I think it's just a matter of when the first one admits they've done it and then they're all going to have to do it for diversification. That's why I kind of talked about Tether and that kid in Brazil. There has to be some kind of balance sheet shift. So you have to pay attention to the balance sheet here more than the income going forward because I don't think we need income to get growth because AI is actually an efficiency and productivity thing which means we don't need anything. So I think people have to get used to that. I do think it the balance sheet is going to be the driver for for Bitcoin going forward. I do think it's going to matter a lot more than people realize. I think that correlation is going to hold, but I haven't been a buyer into it the way people have. The other event that's going to happen on the balance sheet in releasing money into Bitcoin is tokenization. Tokenization is going to allow people that own real estate to get liquidity that own venture capital funds where they're getting no cash, private equity, private credit, all of these places around the g globe. Tokenization is going to allow this stuff to be real time priced, real-time liquidity. And that to me, if you want to get out of real estate because it's an underperforming asset, you can't do it because then you have to go sell things down 70%. This happens in the US every single day. If a big commercial real estate building gets sold, it gets sold down 70, 80, 90% from where the last mark was. If you have liquidity and you bring in 8 billion people into the world, what I believe will happen is people will start selling that and they'll move money into growthy assets and those growthy assets will benefit Bitcoin. So I think the balance sheet story for Bitcoin becomes a massive story beginning with tokenization and beginning with growth stocks to actually stop being a positive performer the way they have in the past. >> So less studying by of the global liquidity charts and more of the total tokenized assets charts uh to determine when we're going to be getting that liquidity into Bitcoin. >> Yeah. And the rotation from where it outperforms. So >> yeah, focusing potentially on the bearish case I would say in terms of what's happening right now. And you mentioned Michael Sailor earlier and historically you've been consistently positive on micro strategy and the broader DAT E trend and obviously they've come under pressure the marginal more so than others but um can you walk us through what you think is the one of the most important why you think it's still one of the most important corporate innovations of this cycle and are you at all perturbed about the current state of the debt market? >> Well, no I'm not perturbed. I mean, I'm it's cost me a lot of money this year uh in terms of owning micro strategy as part of my >> lost. So, it's all good, man. >> Yeah, I own plenty of Bitcoin. I own a lot of semiconductor stocks. Those have done well, the semiconductor stocks have been have been just gigantic this year. But Micro Strategies, fact, I've been doing some tax loss selling and restructuring, taking advantage of some of the losses that Michael's created. But I'm still very positive on Micro Strategy as part of this. It's obviously suffered dramatically from two components. So I view Micro Strategy as Bitcoin. I view it as innovation as Bitcoin becomes the growth name. Meaning if you need something that is a highly levered to Bitcoin, as Bitcoin becomes collateral and things like that, I think Michael has a he just owns he'll own most of the world's Bitcoin. So if you wanted to say hey the OGs are reducing n their numbers well that means Micro Strategy becomes one of the largest holders every single day just by the fact that people are reducing theirs. So I still believe in that component. I think the other thing that's hurt him aside from Bitcoin just having a a zero year is the fact that he depends a lot on volatility and volatility's collapse. So Micro Strategy is a reflection of the volatility in the market as well. So I view Micro Strategy as correlated in terms of their their NAV premium to the fear and greed index within Bitcoin. When it's at the lower end, it's going to be at the lower NAV premium. I view it as when Bitcoin is just horrible and not moving, it should go down. And then when V comes down as sharply as it has, it should go down more than Bitcoin. So it hasn't surprised me. Um, one of the things I do when I handicap a horse race or I handicap a position that I have in my portfolio, does it make sense? The price action, the price action makes complete sense based on what I said. But then you add in the other component you asked about. It's been a huge year for these DAT companies coming to the market and taking up supply. And I think that has had created a negative spectrum from investors that maybe would buy because they have other choices. They have other things they can do. But I still think the story for Bitcoin is about the future of Bitcoin as it goes higher and in particular when the growth equity names are not working, Micro Strategy becomes more important relative to those other names. So I still believe in the story. I still believe in it. But that would be my angle or my my analysis, my handicapping analysis of Micro Strategy for this year. >> Yeah. And no doubt Micro Strategy is a different um in a different uh category entirely from all the others, the marginal ones. But I think the big concern right now, well, a few things around strategy. I think one is the fact that it was the first time I think I've ever heard Michael Sailor say that he would consider selling Bitcoin to, you know, if they did weren't able to fund the dividend payments to the preferreds in any other way. And I think also there's now a lot of concern around MCI wanting to de-index DATs. I'm just wondering, do you first of all, do you think that um do you think that MCI would do that? Do you think they have a justification for doing that? And how badly do you think this could impact on you know forced potential selling on the in the likes of DAT shares like their like strategy? >> So this is a very simple answer to me. The things that you mentioned if at the beginning of the year we said were they stories or not stories they were not stories which means they're built into the price now. So in the case that there's some probability of what MSCI does, this is probably a sell the news event, the number one thing that will drive Micro Strategy in the long term is the price of Bitcoin. End of story. His need to sell things. Unfortunately for for Michael, he had a free ride for a little while. At some point, the investors start complaining. He's been through this game before with his own company. The board starts getting kind of twitchy. Hey, we're not making money. What's going on? So I think this is the normal. You can't separate yourself from the fiat system completely. And I think this is lesson learned which is not shocking to him. He's got some bravado. He's got some arrogance. He goes out there and he talks about it. At some point he recognizes that all right I got to play the game. People are yelling at me. They're going this. The stock's not acting well. We need the performance to go up. He has to say something that he would do that has to go to answer a question. the structure of the company is not an insolvent situation. So every time I hear someone say, \"Listen,\" I'm like, \"Well, how far can the stock go down below NAV?\" If Bitcoin's at 200,000, 300,000, 400,000, you think it's going to sit here? So all the things you mentioned to me are only relevant because Bitcoin is sitting at 90,000 unchanged for the year. If Bitcoin was 180,000, we wouldn't be having these conversations. So the the positive side is these were not part of the story at the beginning of the year when it was 90,000. they are now part of the story meaning they're built into Micro Strategies price when it is 90,000 I will say at the end if you created a very simple formula go back to your your algebra days and said what is the price of bit of micro strategy how much is the things you mention and how much is the price of Bitcoin and Bitcoin is the majority of it so whether it's 80% 90% this is more a function of Bitcoin being at these levels than it is the things you mentioned because those will go away including the MSCI part as a discount account relative to Bitcoin going higher. So, I'll stick with the fact that we just need Bitcoin to go higher for this not to be an important thing. >> Yeah, indeed. It's just a leverage bet on Bitcoin to be honest. >> Wait, let me just add one thing, Nick. It so my view I would not own it if I thought it was a leverage bet on Bitcoin. I own it because it's a bet on the capital structure of the digital economy five years from now when Bitcoin is at a million. That is my belief. So the reason I own it is for the excess business opportunities that will present itself to Strategy. If Strategy owns 5% of Bitcoin at that level and they are the largest shareholder in the the largest owner of Bitcoin in the world, it opens up a lot of business models for Strategy which other places can never catch up. So he has an OG advantage here from a business standpoint in the digital capital structure of the future. That's what I believe in. And so I just want to make sure people I do not own it for the leverage side. I own it for the my viewpoint of how important it'll be to be that size of an owner in the digital capital structure of the future. >> If you don't mind me asking what do you own the commons or the preferreds or combination? >> The commons. Purely the common >> pure commons. Okay. Well, let's assume strategy manages. And what do you think about some of the more marginal players then? because like we said they've basically saturated the market and a lot of them are trading below this below their net asset value. How do you think this shapes like shapes up in the new year and and do you potentially see more consolidation potential hostile birds you know closures? How do you think it plays out in the new year? >> Again I I mean I hate to keep defaulting on this but I would not own any of them. This is me. Micro Strategy for the reasons I said would be the only ones. I'd rather own Bitcoin than any of the the DAT companies in terms of going through. It's just not it's just not my thing. I believe Bitcoin is enough. I don't need to go into all these derivative positions like they talk about with innovation. The valuation for these if Bitcoin is sitting at 90,000 in 3 months. I think a lot of these companies will remain under pressure. The question is for the ones that were established businesses before, they were in trouble before. So, it doesn't really change anything. For the newer ones that came out, I again think it depends on on what Bitcoin does. If Bitcoin goes up, then obviously they might get back to NAV, but they might trade at a discount. There's plenty of closed end funds that trade at discounts forever. Uh never trading at at above NAV. So I think for people that invested in this, they got comfortable with the fact that Micro Strategy was trading at such a premium, which again I think a premium is justified for them based on the percentage of Bitcoin that they own and the fact that they have a monopoly on that for other DAC companies. There will never be another public company that will ever own as much as of a percentage of Bitcoin as strategy. That is a huge advantage. I don't think those companies have that. Do I think this is a good decision for them based on the fact that I think Bitcoin is going to go higher? Yes, I think they'll all be fine in the long run, but they may never be great investments relative to owning Bitcoin. And that would be my my gut reaction is uh they're going to have trouble beating Bitcoin as an investment or competing with Micro Strategy for the reasons I gave. >> Yeah. And then also all of them they had, you know, suboptimal terms on their debt and just badly structured. >> Just moving on to the macro now quickly. Um you've argued repeatedly that we are entering a period where fiscal policy uh not monetary policy is the dominant macro force. So this fiscal dominance argument and especially as AI reshapes labor markets and productivity. So what does a fiscally driven macro regime look like in 2026 and how should investors adapt? >> Yeah. And for this I mean I I think Lyn Alden and and Sam Callahan did a great job in a couple things they wrote this year re related to this topic also related to the liquidity side. There's no way to get out of the trap that the global governments are in. So the first thing I want to say is fiscal dominance is not going away in the United States because the data is so easy to see and because we're so polarized right now. There's a very clear situation that that has happened that will continue to happen. Innovation has hollowed out the middle class. It has caused a massive distribution of wealth issue which still exists. that massive distribution of wealth is having impact on voting. So in New York City, we voted in a socialist democratic socialists are rising for the 2028 election as the ones that the US should think about being in there. Donald Trump is under pressure on affordability. Affordability is directly related to this issue that we have and the debt levels are at the levels they are. If the deficit got better for even a second, the politicians that are in charge would use that quote unquote excess money to again give money to people in the form of dropping it from a helicopter and doing whatever is necessary. And the reason is because technology continues to disrupt in a way that people haven't haven't recognized. We have never had a history a time in history in the United States of America where we had nominal GDP and real GDP growing at the levels that we do. We are basically growing nominally at at close to 5% real GDP last quarter and then what'll happen this quarter will be above 3% and yet we've created no jobs. Small businesses have lost uh jobs six of the last seven months. This has never happened before and this is because of innovation and artificial intelligence is only going to worsen the situation. Humanoids will worsen the situation. There is no way for fiscal dominance to end because we've reached a point where on the one side monetary policy doesn't work in a distributional wealth problem because if you raise rates the companies and the individuals with tons of cash are getting free money and the people that are poor that need to borrow money are suffering and that worsens the gap. So monetary policy doesn't really do anything when you raise rates to slow the economy. So this is a fiscally dominant world until we reach abundance. And so the reason that I I mentioned that my focus is on the traditional finance world to crypto AI is causing the speed to crypto to intensify because the disruption will continue to make all businesses suffer but also increase the distribution of wealth problem over time and that money those assets the wealth is going to look for growth because on the same side they're trying to make more money. So I think people just have to realize that fiscal dominance is here. the Fed doesn't matter that much. They're not going to be able to lower rates that much. And so you're left in a world where as long as deficits are there. The only way to resolve this is one of two ways. One is to let the Great Depression happen again and have a global reset. That's not an option. The second way is for innovation to accelerate so fast that everything becomes free. And the only way for that is humanoids and everything. And maybe that's in 20 years, maybe it's in 15, I don't know. But abundance would reduce all the deficit situations and the debt. But that's going to take some time. So I think in the interim, whether it takes 15 years, the government will continue to give money to people that are voters that need the money and they will continue to try to find ways to not tax the wealthy in a way that would hurt the economy. And so you're left with fiscal dominance. >> Yeah. nothing stops this train in that in that end state where you've got AI that's just been everything's so efficient and everything's done and uh you have people who basically skill set may not be aligned for that do you think this in in this end state will have like a UBI kind of situation a universal basic income for people labor people who can't retool or can't get up the curve in terms of leveraging AI themselves >> yeah so I want to take two I get asked this a Uh, and I also get asked if nobody has a job, how will people pay for things? So, I want to use two quotes from Alain Musk that I think people should should drill into their mind on this. The first one is AI will not replace all jobs. So, this whole feeling that we're going to have massive job losses and replacements, what Alon Mus says is work will be optional. So, if you want to work, you can do it. The reason he says work will be optional is not because of UBI. He says, \"Uhi, universal high income.\" What he's talking about is not income itself. He's talking about income relative to the cost of things. So, we all go to work to be able to buy things. We wouldn't need to go to work if everything was free. There'd be no concept of it. So, we're not going to get there in the next few years. But, I think Alon Musk's point, especially in his most recent interview, which I highly recommend everyone listen to, it's fantastic. It was two hours. It was deep. It was philosophical. It had societal implications. And he's the smartest person in terms of the future that you can listen to. And I think he he did a good job of hammering this stuff out. But you're going to be in a world where if the cost of things are lower, your income doesn't need to be high. And that's why he's saying universal high income. What is happening in the interim until we get to that point is already going on. So people don't know this, Nick, but I mean in the US income growth right now when you go through everything happening for a worker is 1.4% growth a year. That's X transfer payments. Transfer payments are governmentissued money that goes for social security, Medicare, Medicaid. That number is growing at 9% a year. So we already have UBI. It's in two forms. The wealthy people are getting UBI through the stock market going up all the time, which means their net worth is going up. The government doesn't let the stock market fall. On the bottom side, as stock market's going higher from government support and AI productivity gains, you have the displaced older people and the people that government needs to assist, their income is growing at 9% a year. In the middle, you have the the kids that are pissed off and they're pissed off and because their expenses are at a line. Michael Green wrote a paper on the poverty line in the US being closer to 140,000 than what it's listed at as 31,000. If you read through his documentation and his work, although there's a lot of things, he wrote it quickly clearly, there's a lot of truth in it. And one of the things that gets important is if your auto insurance is really high, if your home insurance is really high, if your child care is really high, then a 35-year-old that needs to take care of two kids, it cost you about, you know, $4,000 a month. I mean, that means you're stripping a lot of your money out. And if one person stays home, you've now cut your income by 30%, 40%, 50%. So, I think what's happening is UBI is happening. And the people that are not getting it from either the stock market or from the government, they're the ones complaining the most because they're in this spot that Michael Green talks about, which is the most frustrating. And I think that is going to continue until we get to a lon world. So there's a bridge to that, but it's going to take a long while. In the interim, everyone should just expect the government to print money. >> And that's the one thing that's going to remain constant, government money printing. So just to finish off with uh Jordi, just a few uh some light-hearted questions. And I wanted to ask you, given that you're such a deep thinker on many different topics, is there a book, movie, or idea that had shaped the way you think about the future? One one of each or one? There's there's so many I've I've read over the years. I I you know, one thing I will say to people who've never seen me, I I do a weekly YouTube. It's meant to educate people on what's happening each week, but within there, I always reference books, podcasts that I listen to regularly. I'll pick um three books that I've ref that I've referenced recently. One that gets into a topic that that I very seldom get to speak about, but I'm going to write a substack in. So, one of them is called a whole new mind by Daniel Pink. This book gets into had a huge influence on me thinking about the future differently. It came out in 2005ish. I probably read it not too long after that before the great financial crisis. But what it said to me as someone at the time that had young kids was that you needed to think that the world was going to change and it was going to be commoditized by technology. So this was written in 2005 and it was basically saying that every job based on math or something that could be replicated by a computer would destroy the way people go to college and get degrees. So that book had a huge influence and it said the only thing that'll be left is empathy, creativity, artistics thing. And I started thinking about Steve Jobs and Alan Mus and the people that were basically those types of people. They are they're not mathematicians. They're not lawyers. They're not doctors. They constantly reassess the world. The second one is Thinking in Bets by a former poker player, Annie Duke, who I reference a lot. That book is a great holiday gift for everyone for their kids, any age. I don't I honestly don't care. Even if they're not if they're two years old, keep it for them until they turn there. that is to constantly reassess your views and realize the world and every decision you make is a probabilistic side. That's why I wrote the paper and I reference it in that substack. So Annie Duke is is a great one. The third one is going to be off topic a little bit, but I'll explain why. I'm a longevity freak, not out of fear, but out of I I realize that the healthier I am, the happier I am. And so again, the same way I think about Bitcoin, I want to live forever. I believe the technology will allow human beings to do that. But I want to stay at my current age. So I've spent the last six years focused on doing things to help my health. And eventually along the way I ran into a book by Leah Logos called heart breath mind. And it talks about HRV which stands for heart rate variability. I cannot emphasize to everyone out there who is a parent or an individual. Focusing on HRV to me is a statistic for happiness because it impacts the uncertainty you have in your head. And most people feel trapped in their lives, trapped in a marriage, trapped in a job, trapped in in their existence on the planet. They're impacted in their breathing through what technology has done to destroy the way that they focus, how much they they meditate. There's no prayer left in the world or very little. I meditate. I breathe. That book had a huge influence on me getting healthier. I measure my my HRV regularly through an aura ring and through my eye watch. My HRV has gone from the 20s in 2020 up to where it is now, which is 80. I am 59 years or turning 59 years old. Your HRV is supposed to be directly correlated or negatively correlated with your age. So, as you get older, it's supposed to go down. I've taken it to levels that are associated on aura rings measurements by a 25 to 35 year old. So this is a measurement in a book that's had a huge influence on me. It makes me sharper. It keeps me younger which allows me to learn more and I'm just not scared of anything. So those are three books for you now. >> Heart, breath, mind. I'm going to put that one on my Christmas wish list 100%. >> That's a good one. >> Then final question to finish off with Jordy. Um, one thing that you believed 5 years ago that you no longer believe today. >> Good question. I could make a joke and say my sports teams are never going to win a championship. That would be a joke though. All right, let me let me uh let me say that >> money systems are sustainable. >> No. Uh, I'm going to do something re related to work. Five years ago, I actually thought I would still need a job for being happy, meaning working at a at a at a business. And what I realized over the five years through reflection and and stopping and maybe this is some advice for people. The most painful experience of my life is managing people. The most painful anyone who runs a business and I had the fortune and misfortune to start managing people at 29 years old. I enjoy mentoring people. I enjoy teaching people, but because of AI and the internet, I can actually mentor thousands of people through the webinar series I'll be creating and through all the things I'm going to be doing on my payw wall far better than managing people. When you manage people, and I realize this in hindsight, you're directly connected to their compensation. And when you're directly responsible for their compensation, you're also always wrong in whatever number you come up with. So what I'd rather do is inspire people to work harder, inspire inspire people to be entrepreneurs and inspire people to make more money as opposed to always giving them less money than what they hope for. So that's the thing I learned philosophically that I wasn't prepared for. But thank you, Nick. >> Yeah. Well, it's it's true how you have more reach to help people out instead of having to necessarily micromanage them to do it. Kind of like take a horse to the water, can't make a drink or, you know, so that makes sense. Well, thanks Jordy. This has been uh I really enjoyed this conversation and tap in your brain on all these wide array of topics. Um I'll leave links to your Twitter and your Substack below in the in the description. Where else can people follow you um your thoughts and thinking? >> YouTube uh is the biggest place that's Jisserlabs as as well and I do a weekly there. It's educational again. would say especially for for 16 to 25 year olds that are interested in financial empowerment. I am trying to teach people I've seen a lot of people that are interested in financial empowerment. So I highly recommend going to the the YouTube site and at a minimum if people can't keep track of everything. If they go connect with me on linkedin.com I release everything that I do in LinkedIn. I release everything I do on X and they'll find all that stuff. But my goal is to uh make the world a happier place by making each individual happier. And if I can do that, then I'm a happier person. So, >> love that mission, man. Cool. Thank you very much, Jordy. See you soon. Thanks."
    }
]