[
    {
        "video_id": "qR7DNBsXuVY",
        "title": "Palantir Stock Set to RALLY As Market Nears All Time High!",
        "published_at": "2025-12-12T04:29:36.000Z",
        "sort_date": "2025-12-12",
        "url": "https://www.youtube.com/watch?v=qR7DNBsXuVY",
        "views": 4542,
        "duration": "00:10:07",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope everybody has had a wonderful day. We've had a quite interesting day with a lot of interesting things occurring on with different types of sectors within the market. Uh however, the broader market and the S&P 500 closing near all-time highs. And what we saw in the overnight session last night when we made our last video, that large sell-off was quickly bought up today. Um and we see a lot of resiliency in the broader market and even in the small cap index just looking at IWM uh looking at some interesting plays that are moving forward into the end of the year. And now with Palenteer also also doing a very good job in terms of its resiliency and what its current price is. it's going to be possibly testing some resistance uh with the kind of interesting kind of low volume chop up that we're seeing which is still bullish because we're still continuing to see this kind of end of the year rally that could possibly play out. Now, if you are a new or returning viewer, hit that like button, subscribe for daily videos where we'll be talking about everything in the market. We're trying to hit 30,000 subscribers and follow me on X down below because I've been trying to talk and interact with you guys more on a daily basis on there. Now, I'll pop it up on the screen here. Palanteer closes right here at about 187. Uh it's currently trading right about the same price. We're not seeing any big move on futures or anything like that. Same thing with Palanteer, you know, no big news. The most recent big news, of course, was that large contract with the US Army that we saw this like 448 million or something crazy like that in terms of their operating system to help with ship building in the Navy. Uh in terms of the actual technical structure for Panlier, there's a lot of consolidation. And we talk about this all the time between the 170 and the one basically 184 185 area. We've seen a nice base and accumulation zone that's you know that's been formed there for Palanteer. Uh after these recent dips that we've had with the stock you know you see Palanteer starting to climb back up here and is now at that high resistance point and could be testing this 190 which is an important resistance point. The last time Palanteer broke above that 190 zone is where you saw its run after its last earnings back up to two $200 here. So I still think that's possible in the short term depending on the macroeconomic structure which right now the bulls I think have control in my opinion. Um so hey maybe we'll revisit 200 again uh depending if this can break above 190 that's where things can get quite interesting for this individual stock. Now talking about some interesting moves right to you know today we saw space stocks that are really starting to take off looking at looking at things like Rocket Lab that are really made some big moves. I mean, look at this here just for AS. Uh, now we've talked about AS before on the channel um, in terms of building the whole cellular Broadcom infrastructure within space and why what we're seeing why we're seeing a ton of bullish pressure into these two space stocks in particular as um, Rocket Lab is because right here we're seeing this word a lot. Data centers. First of all, we know the whole AI compute uh the major limitation, the bottleneck is power and we've seen some of the big CEOs that have been talking about data centers in space. Now, I have varying opinions on this, but what we're seeing right here had posted this and I agree with this is that the market right now is absolutely frontr running this um on top of this potential of the SpaceX IPO. We've been seeing more of this across X, about, but a possible SpaceX IPO and their corporate value right now is estimated at about 1.5 trillion. Uh, as we know, that's actually the current Tesla market cap right now. Um, so with SpaceX with a possible, you know, IPO in 2026, that's what we're seeing here. Uh, they're saying here is pract, we don't have the official confirmation, but practically, you see the market that's really front running this, uh, especially with the whole data centers and space idea. That's where you're seeing Rocket Lab and why AS is getting a ton of buying pressure right now as we speak. I mean, AS had that nice breakout from 50 all the way to 100 here with that pullback basically back to 50 and is now right now at $84, up about 7% on the day. Rocket Lab was up like uh 9%. You can see right here on the day at $62. So, lots of liquidities coming into here, especially on these swing trades. We'll see what happens. My opinion on this on the data centers in space, I still think I still I think we'll get there one day. However, I do think that I think that's a little rush and we're not going to see that for quite some time. Uh the main thing is I think we need to build the data centers on the ground first and that's looking at some of the big data center stocks, you know, like NASA, Coral, Cipher, and IN. got to build the data centers on the ground and get the whole neocloud type of compute infrastructure that needs basically to keep up with the demand that we're seeing for AI compute and power needs I think before we start launching these things in space. Um but I do think we get there one day. However, I think the market really is front running as we speak. In terms of kind of the tech sector, what we're seeing with AI in response, you last night, Oracle had the earnings that the market did not like. Um, and we saw Oracle being sold, you know, sold off quite quickly. Uh, with the S&P 500 closing at all-time highs, but we're seeing things like the Magnificent 7 and especially a rotation out of the tech sector. Um, this isn't a bearish thing by all means. rotation out of these sectors can actually be good for the general market in terms of looking into other stocks that can help benefit from a growing US economy, but also to take some frothiness out of the tech stocks cuz that's the most popular traded stocks are the tech stocks. So, a rotation here, especially after the FOMC, the interest rate cut decision. Uh with Oracle right here, you have some uncertainties of course with their revenue that was missed um and also with their capital expenditures um and taking on an insane amount of debt to try to fund the AI infrastructure um as they're trying to compete with all these different AI companies. So as we see Oracle, you know, they tumbled about 11% after hours where they sit right now in terms of trade price is at 197. So Oracle is kind of rebounding a little bit off of these moves. Um you can see here over the last week they were hanging out right about 222. We see a little bit of some basing right here. Hit this kind of local bottom at 180 uh 188 and now seeing some buying pressure back to 197. So um still bullish of course in the whole AI infrastructure play. Um some rotation I think is healthy especially as we gear up for kind of the year end moves and with the S&P 500 ending right here at 6,900. That's pretty awesome. uh the 52- week year to you know the year-to- date highs at 6220. Uh so I think especially right now we do have a 7,000 possible price target. Um I think that can definitely happen especially with IWM here at 258 doing quite well above its 200 and above its 50-day right here. You can see IWM is having quite a nice breakout with what we've seen compared to uh the holy scaling of that got messed up. uh in terms of uh IWM right here having a nice breakout for what we've seen year to date. Um in terms of kind of the general consensus on cryptocurrency, we'll be talking about that here. You have this here from Watcher Guru are saying that the SEC approves uh DTCC plan to tokenize stocks, bonds, and treasuries. And we know tokenization is something that is going to be kind of the next move for crypto in terms of its utility. And how do we get this synergy between, you know, traditional financial and DeFi sectors and uh cryptocurrency and and how do we bring all those things together? Tokenization is kind of the big product that I think uh Wall Street's going to try to get a hold of. Uh we see Bitcoin right here still at about 92,000. Ethereum at 3200. Uh Bitcoin not making a ton of moves. Just been kind of hanging out here literally kind of like over the last month now. Uh after we saw Bitcoin that pulled back from about 120,000. Bitcoin now here at about 92,000. Ethereum like I said at about 3,200. Uh what we are seeing behind the scenes though Tom Lee still accumulating uh stocks like BMR accumulating Ethereum for stocks like BMR at a rapid pace. I saw here on a podcast that basically close to 4% of the Ethereum supply right now when staking is going to be going live that's going to be announcing about $1 million a day which is quite crazy. And just looking at BMR right here at a specific, you know, uh, stock price, uh, currently at about 3920. Now, BMR is very interesting in the fact that, um, we've seen a reversal here at above the 27s. It's back above its 200 day. I think once BMR and if Ethereum also, you know, of course, Ethereum has a strong strong uh, basically implication on BMR stock price. Once this can get above its 50-day moving, we see it popping. We could see some swings that are probably going to be more volatile within the stock. Now, this is already a very volatile stock. 50 days right at about 432. I think once we recapture this, once BMR can kind of hold this $40 level of support, of course, like I said, all dependent on Ethereum's price since it's kind of subject to Ethereum's movements, um, that is where you could see more bullishness coming back into BMR. Looking at some of the data center stocks, let's talk about that. Looking at Nibbius right here. Still below 100. I like this. Below 193. Coraleave. Not haven't done a ton of research on here. A lot of people are kind of beating this down at 86 right now. And you see Cipher right here at 1874 and I Ren. I do like Cipher and I Ren here for the short term. Um especially with Iren making some pretty strong support levels right at about this 40 right here. People on X have been talking about this triple bottom. So I do like that. I think if we have some volume volume that comes in here and if this gets validated u these could be positive moves for these going forward. Uh in terms of the financial type of uh sector looking at SoFi I think SoFi right here could possibly have another back run to 30 in the near future. Of course these are all short-term predictions so we'll see what happens but nonetheless keeping bullish and also I'm getting more interested in PATH. I've traded Path before uh but getting more interested to possibly looking to get some more exposure back to this. Let me know what you think down about all this down in the comments. Peace out. Take care and I'll catch you guys later."
    }
]