[
    {
        "video_id": "8WrmsukEX4Y",
        "title": "3 Million MORE Accounts FROZEN Overnight — You’re Next says Genius Act",
        "published_at": "2025-12-12T14:00:07.000Z",
        "sort_date": "2025-12-12",
        "url": "https://www.youtube.com/watch?v=8WrmsukEX4Y",
        "views": 92814,
        "duration": "00:20:21",
        "transcript": "In September, 86 million bank accounts were frozen in Vietnam. I showed you the story when it first happened, and many of you thought, well, it was a one-off event, a Vietnam specific thing. Who cares? Not everybody had the foresight of this little monster here. And I told you then, this was a test run. I told you other countries were watching. And guess what? Thailand has frozen 3 million accounts in October. Dubai announces 90% cashlessness by the end of 2026. So I was right. And now the pattern is accelerating faster than even I predicted. And this is not coincidence. This is a coordinated global shift happening right now. And if you were a US retail investor, this isn't happening somewhere over there. It is coming to your portfolio, your money, your stable coins, your wealth. My name is Felix Pin. Winston back there in Sabrina the fluff ball was Rose and I used to be an an investment bank and I'm also the founder of the goat academy where we have over 20,000 students. I also co-ounded tradevision.io where we give you news and data that is just insanely better than anything else. And I'm using my retirement to educate regular investors like you and me. And what I'm about to show you is not a conspiracy theory. These are verified facts from official government sources, central banks, and blockchain data. And more importantly, I'm going to show you exactly what US retail investors can do about it. So, I'm going to break down the most important financial pattern for the coming year. The documented cases Vietnam, Thailand, Dun, and Dubai, and what actually happened. Second, the US connection and how the Genius Act changes everything for American investors. And then third, the stable coin reality. Literally $3.3 billion dollars been frozen by Teor alone. And what that means for your stocks, your crypto, and your cash. And then number four, opportunities. Yes. Because while there's disruption, there is profit for those who understand what's happening. And I'm going to give you some actionable some actionable strategies you can implement this week to protect yourself and possession yourself for for for wealth. So this is not doom and gloom. This is about understanding the game and the rules that's being played so you can potentially win here. We're going to round off with exactly what I'm doing about this myself. Now, before we dive deep into this, the key to all of this is understanding where the money is flowing to understanding what the patterns look like that Wall Street and this is a thing that's been around for 50 years, by the way. This is not some new found thing that I just made up. Literally, I've learned this from guys who've done this for 30, 40, even 50 years longer than me. And we actually have a mentorship program where you get access to these same guys. And if you want to still do that, this will be your last chance this weekend. No more. Why? We're going to close the enrollment into our mentorship program to make sure we are focused on the people in it. Uh and and we're at a level where we know if we take on a lot more, it doesn't make a lot of sense for the people in it. So therefore, we're going to close enrollments this weekend. So this is your last your final call to actually book a free strategy call with us where we'll walk you through what mentorship looks like with us. It's a six or a 12-month program. You get access directly one-on-one to my mentors, Wall Street legends, and you can learn from us directly. You also get to see my watch list every week and a ton of other amazing stuff. And the goal there is to empower you to give you the knowledge you should have been taught, you know, as a as a teenager and get you to a level where you're really confident with managing your money. And then you can also pass that knowledge on to your children and your friends and your family and everybody else. If you want to do that, felix/freedom is how you book that freedom call. It is free and we'll walk you through what it looks like to work with us. But let's get back to 2025 to Vietnam. The Bank of Vietnam deactivated 86 million bank accounts. That's 200 million accounts in the whole country. 100 million people. So they closed a lot of accounts. A lot of accounts, right? It wasn't a sudden move. It was a culmination of something that they called Project06. They launched back in 2022. Now, when I talked about this in my last video, the comment section was sort of like, \"Yeah, well, who cares? Whatever. It's far away. It's just Vietnam. It's about fraud prevention. this won't spread. Well, look what happened since that video. So, what's the official justification? It's called data cleansing. That's they call the data cleansing revolution. This is what the Vietnamese government calls it. They say it's about cyber crimes. Apparently, there were 600,000 cyber attacks in 2024. Uh, and they want to create a literally, this is the goal, a cashless society, reduce fraud, and align with the OECD and the Bank for International Settlement standards. Well, everything is all right then, isn't it? Wherever the OECD and the Bank of International Settlements is involved, everything is just kosher, right? So, literally they say they want to modernize the financial system, be more, you know, global and so on. But what makes this significant for you if you're a US investor is that they introduced a biometric requirement. facial scans or fingerprints become mandatory for all transfers over $379. So basically everything I mean who transfers smaller amounts, right? So literally they did this first with mobile payments. So you now need to have your thumb print in there and they have access to it. It isn't just on your phone. Like if you use thumb prints on your phone, it's basically between you and and and the Lord, sorry, Apple. But, you know, it doesn't go to get sent to the to the bank and anybody who didn't fall in line with that got their accounts suspended. And then people said, \"Oh, it's just about dormant accounts.\" No, foreign residents, expats who couldn't return to Vietnam in person in time, rural, the elderly with limited access to technology. Not everybody's got an iPhone, right? Small businesses owners. Um, those all got shut down. A lot of innocent people got got caught up in this. And what was the official reaction by the government? They said, \"Look, your funds are not ceased. They're safe, but they're inaccessible.\" So, it creates a new techn it creates a new category. It's technically yours, but it's functionally theirs. It's what the Swiss banks have been doing for decades with all the billions of all the uh dictators around the world. They kick get the money and then once the dictator gets out of office, they freeze it and they say, \"Well, it's yours, but it's frozen until um if you like unfreezing it.\" 50 years later, they still haven't unfrozen it. What are you going to do about it? Right? How can you prove that it's legally yours? Now, we don't cry tears for dictators that plunder their countries, but this is actually the same strategy. So, why again does it matter to you? Well, it's this case has shown that a government can freeze access to 86 million accounts based on just, oh, you're not complying with the biometrics. You know, we need your nose print, we need your earlobe size, whatever the heck they want to come up with. And the infrastructure is in place. It's tested and it's operational. Other countries have learned from this test case. The World Bank, you know, the people who want to keep you safe and secure. I almost got that out. Um, they look for or predict rather a digital identification system that's going to roll out in a hundred countries over the next decade. So, Vietnam wasn't the end of the story. It was the beginning. And I told you then that this was a proof of concept that's going to spread like I was going to say measles. Will that still spread? And literally within months of me making this video, Thailand froze 3 million accounts. Similar justifications. Dubai is accelerated its cashless push and then the US passed the Genius Act which has freeze and seize capabilities. This is literally what I warned you about and it's unfolding faster than most people realize. So, Thailand came up with a justification for this. Somebody was running some fraudulent accounts somewhere in Paya, which is sort of the the entrance to hell, apparently. I've not been, but that's what I'm told it is. Um, and anyway, someone was opening accounts fraudulently there, and there was a fraud there for about $60 million. So, what has Thailand done? Well, they slapped a mandatory transaction limit on all transactions bigger than about $1,700. So again, we're talking about fairly small systems, right? So again, you need biometric verifications if you want to send any kind of amount of money. So criminals, yeah, that's the excuse, but the small businesses, the online vendors, they all just found their accounts frozen. Expats, foreign residents, hopefully not the ones in Paya, scam of the earth. Um, but you know, they all got affected. So some merchants stopped accepting bank payments because of the freeze fears. And the new regulation is that all bank accounts must link to a valid SIM card registered with the account holder. All sounds kind of reasonable until you are actually in this. And guess what? They've established a center to unfreeze the accounts of the innocent and they are aiming to do that in a day where that isn't really happening obviously. Now Dubai and I was just there for a couple of days. They have a very aggressive timeline to make cash disappear. 90% of all transactions need to be digital. So Dubai or rather the country around Dubai called UAE, United Arab Emirates, they launched the digital durham. This is a CBDC. This is a centralized digital currency which was coming to the US. First all government transactions use this digital thing that is literally like done now. They've built a blockchain infrastructure so they can track everything. And by the way, when people say, \"Oh, cryptocurrencies is marvelous. It's decentralized.\" No, it's the most centralized thing in the world. Every single transaction, every movement is on a blockchain. It is publicly accessible. And you therefore become 100% transparent. Every scent you pay to whatever they can see what you're paying it for, where you're paying it. No more beautiful cash where you just pay for something and the government doesn't know. The government will know everything. And then in the US, we have the Genius Act. appropriately named. Not coincidence. This is a coordinated global financial infrastructure transformation. In my humble opinion, the US is leading this both in Vietnam and in Thailand and in Dubai and yes, in the US. These are test markets for them. So when I showed you the Vietnam story, that's what I was thinking about. And I told you to watch out for this exact pattern. every other country implementing similar mechanisms and we've done that now within like a couple of months. They're using biometrics. They're calling it fraud prevention and they're testing the cashless economy. But what's the common thread? It is centralized control over your money. Now, the Genius Act was signed into law in July. So, you might think this is old news, but what does it actually do? And why is it not old news? But it's actually early news. Most people don't realize this is happening yet. It establishes permitted payment stable coin issuers. So banks are approved now to issue stable coins. Now if you're a non-bank in theory, you can also get a permit, but it's going to be insanely difficult. Now, everybody talks about, oh, the stable coin must be backed by some sort of reserve asset. The US dollar, by the way, counts as a reserve asset. That paper thing that they just keep printing, right? They're printing an extra 50 billion every month. And so apparently there's some value in this, but that's the distraction. There's actually two parts to that. One is, and I talked about that previously, that stable coins will buy US government debt. So they're creating demand for more debt, which is what they desperately need because the foreigners unfortunately stop buying US debt. But while they're talking about audits and responsibility and regulating the crypto world, and isn't that wonderful? Isn't that marvelous? Look how modern we are. There is a kill switch in it. Freeze, seize, and burn. Those are literally the capabilities, and that's what people are missing out on. I think it's section 126. All permitted stable coin issuers are classified as financial institutions under the Bank Secrecy Act. And they must have the technical capability, I quote here, to freeze, seize, or burn stable coins when legally required. Not optional. It's a licensing requirement. And maybe you think, \"Oh, Felix, it's not going to happen. It's not going to happen to me.\" Well, look at what already happened with Tether, right? Biggest stable coin out there. I actually ran into the founder about a year or two back in the south of France. Amazing guy. He was the palest man in the room, so you could tell he was in crypto, but very, very, very, very nice guy. And this is the largest stable coin in the world, right? $3.3 billion were frozen by them in the last two years. 7,000 wallets, or so. over 2,800 of those were coordinated with US government agencies. So whenever the US government feels like it, they can message any of the stable coin issuers, including their own because the USDC is going to come and they can just say that guy there, Felix, with too many cats. Um, we don't like him. Let's freeze his account when actually just burn it. And then you have to sue them and try and figure out what to do about it. So when does this take effect? How does this affect you? the Genius Act becomes effective on the in in basically January 18th, 2027. So your financial system, it's going digital. Central control mechanisms exist and they're being implemented and that isn't nice. So what can you do about it? Well, you can go out and buy lots of gold. And if you look at the gold and the silver prices, well, a lot of people are doing that clearly before there's some sort of registration event happening, which will also come in my humble opinion. Plus, in the future, when there is no more dollars left, you're gonna they're going to know what you bought, right? They're going to know who you bought it from, and then they can come and they can tax it or or whatever. But when there is disruption and fear, there is also opportunity for informed investments. So, the question isn't will this happen, but the question is how do I position myself? How do I protect myself? And what's the opportunity to make some money out of this? Because when there is fear and risk, there's always opportunity to make money. So, disruption creates profit as I put on the screen here. And there are a couple of companies who are clearly going to benefit from this. The stable point companies, they're going to benefit from this. Who who are you thinking of? Well, think of the sort of the payment processors, your PayPal, your stripes, the big banks, your JP Morgans, right? They're going to massively reduce the transaction costs of sending money from A to B. And they're not going to have to pass it on, are they? They're still going to charge you some fees. So, their life's going to get better and they're going to get a lot more control. They're going to enjoy that, right? Think frozen assets. they can still lend those out by the way. So, it's a good thing for them. So, the financial sector is actually a place you might want to look at and um just be careful of regional banks because they're generally fairly shorty unless you're a short-term trader in which case there might be some opportunity with falling interest rates. But yeah, I think the the fintech sector is one I like um for many reasons. I'm not telling you to run out and buy PayPal or or um any of the other payment processors or JP Morgan or you know sofi or whatever but I think there's a lot of opportunity in that entire sector I think it's looking quite positive now what else is is part of that well circle visa shopify Amazon anybody who has massive transaction volume where they handle the actual payment processing themselves particularly so look for the good companies the high value companies that give you an exposure to this, but they're still good businesses regardless. That's what I really what I would look at. We have a great tool in our free community. It's called better stocks GPT, and you can find out sort of very quickly whether a company is good or not. Just spits it out for you. Now, the good thing is that you now understand the concept. You're already ahead of 99% of people. Not so good news is that you're still going to have to sit down and learn how to a pick better stocks, b risk manage them, and what your actual overall strategy is and where you want to get to. And I think it's a initially a hard thing to do, and it becomes very easy after a little while. So, how do you overcome the initial hurdle? Well, the simplest thing to do is to learn from somebody who's done it before. And I would say that's in all aspects of life. you want to play a sport, you learn from somebody who's good at it, not from somebody who's watched a YouTube video on it, right? It's like, uh, I think people hit this ball a bit like that. At least that's what the video said. That's not usually what your instructor says. Or if you're learning to swim, you don't talk to a guy who says, well, I've read the book on swimming, so I think you should do the following. No, you actually want to learn from someone who's can actually, you know, stay afloat in the water. It's the same thing with with money. So, if you're interested, if you're serious about your money in your portfolio, book a free strategy call with my team, felix.org/freedom, and they'll walk you through what mentorship with us would look like. As I said, that's a six-month program or 12-month program, direct one-on-one access to our retired Wall Street bankers, and it'll it'll get you to another level of confidence and decision-m ability that you probably haven't seen yet, but anybody can get there. It isn't rocket science. It's a question of actually learning it. And then I put on here, you want to diversify different asset classes and jurisdictions. And I think that's true for most people. I think having accounts um in multiple countries is probably a good idea. Now, if you're an American um a little bit some hurdles there that they've thrown in your path in on purpose because they like your tax money. Now, I'm not saying you should avoid taxation, by the way. I'm just saying you can legally open accounts in other countries, other jurisdictions that may not be affected by what's going on at home. And I do that and I would do that. and you can just go on to, you know, any AI Gemini or ChatgBT or whatever and talk to it about it and um I'm sure that will register and and and inform the IRS that's coming next too with digital IDs online. But no, for the moment in all seriousness, I think that is a good thing to do. It removes some risk by having being in different different um jurisdictions. In terms of investing, yes, of course, you can buy European companies or Asian companies or whatever. But the challenge there is often, well, we understand that sector, their regulation, their taxes, what's going on there, even less than than than your home country. So, there's some advantage of investing in your home country. Plus, the US has the greatest stock market in the world. It has the largest pension funds, the largest banks, the largest hedge funds, and therefore there is the most money there. So, all the money pours into those stock markets, and it's a bit of a self-fulfilling prophecy. You have a country that prints money. The money is going to get invested. You have a government that runs an incredible deficit. That deficit gets spent on businesses who then report profits and bring it back to shareholders. So, it's all set up for um the little guy to win. No, it's not. It's set up for those with lots of wealth to become even wealthier. And ultimately, your choice is just do you join them or do you like, you know, loot and murder them? I would not recommend the second path. I think it's a path to happiness. So really I think just focus on how do you become wealthier? How do you become better equipped to manage your money and your present level of wealth so you can make better decisions and have better outcomes. And I hope here is aful community here um as we are driving towards 400,000 subscribers by year end um is going to do its part because that's really our mission here. So if you got some value out of this, share it with a friend. It's not doom and glooms. It's not a you know conspiracy channel. It's just it's just the unadulterated truth in my humble opinion. You may of course disagree with me. That's what the comment section is for. And click on the link in the description. Book your free strategy calls.org/freedom. And I wish you a merry Christmas. The Fed just made a move that Wall Street insiders have been quietly positioning for and I've been telling you about for some weeks. But most recently is they still have no idea it's happening because they're"
    }
]