[
    {
        "video_id": "Mng9mufh8EM",
        "title": "BITCOIN: LIGHTS OUT. (Massive Breakdown Warning)",
        "published_at": "2025-12-12T19:03:20.000Z",
        "sort_date": "2025-12-12",
        "url": "https://www.youtube.com/watch?v=Mng9mufh8EM",
        "views": 22528,
        "duration": "00:07:16",
        "transcript": "Yes, guys, the bulls have to be extremely careful and this is not some kind of scam title, fake urgency title. This is real. This is serious. It is currently happening on the chart and the chart is warning us. You now have a clear warning on the chart to be careful. Look here. Look here. Especially if you are with leverage, be extremely extremely careful here. Look here. You have this channel right here. This channel is super important in the context of us being in the bare trend on the money line. Number one. Number two, uh, as being below the 50week moving average, the yellow line, super important. And number three, the fact that the yellow line now starts to slope down. The moving average starts to slope down. And basically, it's another sign of the bare trend. The fact that we are now trending down even in the long-term average. So why is this so important? Because in this context, the way to interpret this chart is as a bare flag. The bare flag works like this. You have a downtrend. You have the flag pole right here. Then you have a counter trend move like this one. And next step is that this thing normally breaks down with 70% probability. And then the target is basically the length of the flag pole. We already talked a bit about it this morning. If you haven't watched the daily stream, go and do that because we also cover many many news here. I will link the link below. But in the context of what we're speaking about here, the bulls need to be careful because as you can see there is a lot of weakness in the chart. The bulls get dumped on like never before. Look at this long wicks. Long wicks are quite crazy here. And it means that there's so much sell pressure. We cannot get it up. I mean literally and figuratively. And that's also what she said. But literally you cannot get it up. Now you may also argue that wait look at the bears here. Look at the wigs that bears are creating and the fact that bears cannot push it down either. Well, the thing is within a bare trend, within a bare trend, the bulls have to prove themselves. The burden of proof here is on the bulls. We need the bulls to create an impulsive move that actually attracts new capital into crypto and gets new buyers in. What we're seeing here is distribution. This is not an impulse move where with new demand. This is just distribution, meaning that the bulls cannot even touch the 50 moving average. The chart is super weak. I mean very very very weak with all of these different tweaks that we see right now. It's it's not strong. It's in fact it's quite weak and this is just a question of time before we take the another elevator down. Now nothing is 100% obviously it could go to the upside but given the scale of probabilities. If you are a bull you have to at least be a bit concerned because this chart is not looking super strong. Not looking super strong whatsoever. Now, the good thing is, of course, that you can short it. As we start breaking down here, you can short the crap out of it. In case we go to the 200 week moving average, this would actually be a very good target to start buying Bitcoin for the long-term huddle because it's a Bitcoin fair price is the 200 week moving average is a very good price for Bitcoin. And so, the good thing for the bulls would actually be that we break down and we quite quickly go to the 200 week, which is at around 55. Because here is where normally the bare markets end around or at 200E moving average. You have uh this one right here. It took it took us a year to get there and then before the previous bull market bare market also ended here at the 200E moving average. So the faster we get to 200E moving average the better. Normally it takes about a year. We are already soon two months into the journey. So let's see if it's faster than a year this time or it's going to take about a year to go to 200 week and bottom out here. But all in all, I think that even if this bare pattern that we're looking at right now plays out, I'm still extremely bullish for 2026. In fact, with a fast dump towards 200 moving moving average, I would be even more bullish because you want the flash to happen. You want the flash to happen. So all of the people who are now dumping into the price, I mean, someone is dumping here like never before. Look here. Look, look at this week. Sound is like pushing the price down like never before. They need to be out of coins. How can they be out of coins? In case they aggressively sell, so we dump fast, then they don't have coins and we can now have a new fresh bull trend and we can go to to the highest. So that's very important. Also, just looking overall, looking overall, uh people are still hoping people are still praying for uh this fast recovery that we're going to somehow go to new alltime highs quickly. Tom Lee saying we're going to go to a new alltime high fast. There is no sign of that whatsoever. I've been saying that since October 8th. There is no sign of any V-shaped recovery. Very unlikely that it's going to happen. It did not happen. In fact, we kept going down. Now, now I'm also telling you with highest likelihood it will not happen. With highest likelihood, the fact that we cannot even see any kind of strength, any kind of impulse move is going to keep going down. Now, some people some people I've seen this very interesting analysis uh online. Some people have been saying that hey actually it's not a a uh bare flag it is ascending triangle this it looks kind of like ascending triangle like this an ascending triangle as you know it is bullish but the thing is within the bare trend this has less strength this uh uh bullish outlook and also another important thing is if you look on the daily to to have a bit more understanding of how this thing looks like you can go you can check the daily and on the daily you see that this looks more this looks more as a channel than a triangle. Okay, this looks way more as a channel as than a triangle. Uh there is the no clear uh no clear horizontal line. This is way more as a as a channel. But it could be the thing is all of this u all of these patterns you have to take them slightly with a grain of salt. I use the uh the trend as the number one signal, the number one sign because as you can see with patterns like could you potentially see it as a ascending triangle? You could like it can be either or but given the context given the context and also given just my experience in the market trading this market since 2013. I can tell you that in this context I would choose to use the bare flag. I know that many people just want to pick whatever fits their narrative. But the best thing is to number one look at the trend. Are we in bull or bare trend? Are we above or below key moving average? Those are the two most important things. And then the third important thing which is less important than the first two is you know some kind of pattern triangle butterfly this those are less important. Why are they less important? Because it's tougher to pick them. As you can see several can be can be applicable. Some people it's like an art you know it's a discretion while the trend and being above above or beyond moving average it's less of an art and more of a mechanical rule approach where you clearly see what's happening. So guys uh hope you understand the warning if we start breaking down don't get surprised I mean I told you if you want to trade and get nice sign up incentives use the link below for exchanges I use for example on Bybit you can go long you can go short you can short the crap out of it or you can go long you can also use use by bit to go long. So you can do anything on BBIT. Use the link below to get nice nice nice incentive to join and you have all kinds of other stuff here as well. Uh so guys, thanks a lot for watching. See you all very soon. Smash up the like, subscribe if you like this short analysis and goodbye. Goodbye."
    }
]