[
    {
        "video_id": "gZt96mjxpjg",
        "title": "These 6 Threats Could Crush Bitcoin Next Cycle",
        "published_at": "2025-12-24T14:01:17.000Z",
        "sort_date": "2025-12-24",
        "url": "https://www.youtube.com/watch?v=gZt96mjxpjg",
        "views": 36942,
        "duration": "00:23:08",
        "transcript": "In 2025, Bitcoin bulls finally got everything they wanted. ETFs, [music] institutional adoption, a US president who says the word crypto without wincing. But in 2026, that very success might be [music] what breaks Bitcoin. It's outgrown cryptospecific risks like exchange hacks and code vulnerabilities only to become exposed to central [music] bank policy, semiconductor yields, and banking capital yields. So today we break down the top six threats [music] that could push Bitcoin lower in 2026. Some are already in motion, others are waiting for a spark. This is what the Moonboys aren't telling you. My name is Guy and this is the Coin Bureau. Before we get into it though, nothing in this video is financial advice. We're not telling you to buy, sell, or panic. We're just walking you through the structural risks that could hit Bitcoin next year and explaining why they're different from the threats we've seen before. If you find this useful, smash that like button and let's see what Bitcoin is up against. So, the first risk to Bitcoin is a good old-fashioned recession. JP Morgan's December outlook assigns a 35% probability to a US and global recession hitting in 2026. That might not sound like much, but consider that the consensus is still pricing in a soft landing. The market thinks the Fed threaded the needle. JP Morgan says there's a 1 in3 chance it didn't. The World Bank is even glooier. They're warning that global growth this decade is on track to be the slowest since the 1960s. A lost decade, they call it. The structural story is that business caution and weak labor demand have been masked by AI capital expenditure. Strip out the tech giants building data centers and the underlying economy looks fragile. Now, a recession is guaranteed to strike at some point in the future, but 2026 would be exceptionally bad timing. That's because the central banks usual rescue playbook doesn't work in the current macro climate. In 2008 and 2020, the Fed responded to crisis by slashing rates to zero and flooding the market with liquidity. That's how Bitcoin went from a curiosity to a macro asset. It rode the wave of monetary expansion like nothing else. The trouble is inflation hasn't gone away. Morgan Stanley forecasts core PCE hovering around 2.6% throughout 2026. If growth crashes while inflation stays sticky, the Fed is trapped. Cut rates aggressively and you reignite inflation. Hold steady and you watch the economy bleed out. As such, I wouldn't count on the cavalry coming this time. And this matters because Bitcoin trades on liquidity. Research by Lynn Alden shows that BTC moves in the same direction as global M2 money supply 83% of the time over any given 12-month period. When central banks print, Bitcoin pumps. When they tighten, it shrivels. A stagflationary environment, weak growth, sticky inflation, no QE, is the worst possible backdrop. And there's an even nastier wrinkle. In late 2025, Bitcoin maintained a 0.8 correlation with the NASDAQ during draw downs, but failed to match it during rallies. Analysts call this negative performance skew. Bitcoin captures the downside of risk assets without fully participating in the upside. This could be exacerbated by Bitcoin's unique liquidity profile with 24/7 trading and instant settlement. When a fund blows up at 2 a.m. and needs cash to cover margin calls, it sells whatever is liquid. So, this could make Bitcoin an ATM of last resort, or as others have described it, a liquidity alarm bell for other macro assets. If liquidity does dry up in 2026, leverage players in the Bitcoin ecosystem are going to start sweating. And speaking of volatile markets, if you're actively trading through this kind of environment, then fees can eat into your positions fast. So, if you want to keep more of your gains, check out the Coin Bureau deals page. We've got signup bonuses of up to $100,000, trading fee discounts of up to 50%, and deposit bonuses on some of the best exchanges out there. You can scan this QR code or find the link in the description. These deals won't be around forever, so grab them while you can. Now, about that leverage. The Bitcoin mining industry has a debt problem. Over the past year, minor debt surged 500% to a record 122.7 billion. That money went into buying fleets of next generation ASIC miners in the hope that hash rate dominance would translate into outsiz returns. It was a bet on Bitcoin staying elevated. But if that bet goes south, the collateral gets liquidated and a lot of that collateral is BTC itself. Miners are inevitably squeezed when the Bitcoin hing comes around and April 2024 was no different. Block rewards dropped from 6.25 to 3.125 BTC overnight and miners had to find twice as much efficiency just to stay in place. Now the metric that matters most for them is hash price. The revenue a miner earns per unit of computational power. Postthing it compressed to around $53 per pahash per second. For older machines like the Antminer S19 Pro, that's the shutdown threshold. Below that number, you're paying more in electricity than you're earning in Bitcoin. If BTC drops to $60,000 in a recessionary environment, an estimated 30 to 40% of the network becomes unprofitable to operate. Miners facing this squeeze therefore have two options. Sell their Treasury Bitcoin to service debt or pivot away from mining entirely. And many are choosing the latter. Hut 8 recently signed a 15-year deal worth $7 billion to host AI workloads at its facilities. Core Scientific is doing the same. The economics aren't hard to understand. AI hosting offers predictable contracted revenue over long time horizons. Bitcoin mining offers a volatile coin price, rising network difficulty, and a hing every four years that cuts your income in half. The risk this divergence creates is subtle but significant. If mining becomes unprofitable in 2026, we'll see power capacity permanently repurposed for AI data centers. A great hash rate exodus means a structural shift in the security model of the network, and it could undermine confidence in Bitcoin's robustness at exactly the wrong moment. But of course, miners aren't the only ones sitting on leverage Bitcoin positions. The biggest single holder of BTC excluding exchanges has built an entire corporate strategy around accumulating it with borrowed money. And that strategy has a specific vulnerability coming due. At the time of shooting, Michael Sailor's strategy, formerly Micro Strategy, now holds over 670,000 BTC on its balance sheet. That makes it the largest corporate holder of Bitcoin in the world. They built this position using a financial mechanism some have called the infinite money glitch. Issue convertible notes at near zero interest. Use the proceeds to buy Bitcoin. Watch the stock price rise on the back of BTC appreciation. Then issue more stock at inflated prices to buy more Bitcoin. Rinse and repeat. Now, the glitch works as long as Strategy's MSTR stock trades at a premium to its net asset value. At points in 2024, that premium exceeded 3x, meaning investors were paying $3 for every $1 of underlying Bitcoin exposure. That premium is what allowed the company to sell expensive equity and buy comparatively cheap BTC. But if the premium compresses, whether from a falling Bitcoin price, investor fatigue, or a broader riskoff environment, the mechanism breaks. No premium, no cheap capital, no cheap capital, no Bitcoin accumulation. And Strategy shifts from being a relentless buyer to just another bag holder. So the debt structure is what you want to keep an eye on. Strategy has billions in convertible notes outstanding, including 0% notes due in 2030 and 0.625% notes due in 2028. The danger, though, isn't the maturity date so much as the redemption option. Starting on the 5th of March 2027, Strategy can be required to redeem the 2030 notes for cash if certain conditions aren't met. And markets don't wait for the event. They price it in 6 to 12 months ahead. That means throughout 2026, investors will be stress testing to see whether strategy can actually cover its obligations if its stock craters. And the company clearly knows this. They've set aside a $ 1.44 billion cash reserve specifically to handle potential redemptions. But that's a buffer, not a solution. Their total convertible note obligations dwarf that figure. If Bitcoin enters a prolonged draw down and the stock falls below conversion prices, strategy faces a choice. Sell Bitcoin to raise cash or watch the whole structure come under pressure. And there's another accelerant on the horizon. In January 2026, Morgan Stanley Capital International or MSCI is expected to decide whether to exclude digital asset treasuries from its major indices. If strategy gets booted from the MSCI world index, passive funds tracking that benchmark, pensions, 401ks, broad market ETFs would be forced to sell MSTR stock. That kind of mechanical selling could crush the premium overnight, which in turn could trigger margin calls on loans backed by MSTR shares or strategies Bitcoin holdings. So, we have miners potentially dumping BTC to stay solvent and the largest corporate holder facing structural pressure that could force them to do the same. That's a lot of selling from inside the ecosystem, but the external pressure is mounting too. The European Union has spent years building a regulatory framework for crypto. Micah, the markets in crypto assets regulation comes into full force by July 2026. Now, on paper, this is legitimization. Clear rules, licensed exchanges, consumer protections, the sort of thing the industry has been begging for. But there's a catch. While one arm of EU regulation is opening the door to crypto, another is slamming it shut. The Basel 3 banking standards include a provision called SEO60, which assigns a 1250% risk weight to what they call quote unbed crypto assets, a category that includes BTC along with virtually every other native crypto asset. But what does,250% mean in practice? Well, for every euro of Bitcoin a European bank holds on its balance sheet, it must set aside 1 euro of tier 1 capital. That's euro for euro reserve requirement. It completely destroys the return on equity for any bank trying to custody, trade, or hold BTC for its clients. For reference, banks are typically required to hold capital equal to 8% of their risk weighted assets. 1250% is a massive middle finger to crypto from the architects of the Basel standards. No bank is going to tie up that much capital for an asset this volatile. It just makes touching crypto economically impossible. So this is the regulatory pinser movement. Micah says crypto is a legitimate regulated asset class. Basel says touching it will vaporize your balance sheet. One hand welcomes Bitcoin into the European financial system. the other slaps it in the face. But Micah itself contains another intractable hurdle. The regulation includes sustainability disclosure requirements developed by the European Markets and Securities Authority. Crypto asset service providers will need to report on the environmental impact of the assets they support. If Bitcoin gets labeled as having a significant adverse impact on the environment, which given its energy consumption is something many assume to be true, it becomes radioactive for institutional capital. Specifically, article 8 and article 9 funds under the EU's sustainable finance disclosure regulation. These are the big pools of European institutional money. Pension funds, insurance companies, asset managers marketing themselves as ESG compliant. If Bitcoin carries an official environmental warning label, these funds can't touch it. Not because they don't want to, but because their mandates won't allow it. Now, of course, this isn't a hard ban. The EU is not trying to confiscate anyone's BTC, but it amounts to a capital boycott. The regulatory architecture makes Bitcoin too expensive for banks and too toxic for institutions. European money is likely to be walled off from BTC by the cumulative weight of compliance costs and ESG [clears throat] constraints. That's one external wall. But there's another checkpoint that's even more acute, and it runs through a single island in the Pacific. Bitcoin's security model depends on a global network of miners running specialized hardware called AS6. AS6 depend on cuttingedge semiconductors. And those semiconductors depend on a supply chain with an alarming number of choke points. It starts in the Netherlands. ASML is the only company on Earth that makes extreme ultraviolet or EUV lithography machines. The only machines capable of printing circuitry at 3 nanometers and below. Decades of research and billions of dollars were invested into developing EUV lithography. Now, the process involves firing an incredibly powerful laser beam at a tiny droplet of liquid tin, creating an explosion that releases a massive burst of ultraviolet light, which is then funneled onto a wafer of silicon to print a piece of circuitry as fine as a strand of DNA. And if you can't do that, you can't make advanced chips. ASML sells those machines to TSMC in Taiwan, which uses them to produce over 90% of the world's most advanced semiconductors. TSMC then supplies the chips that go into Bitmain and MicroBT mining rigs. So, one Dutch firm and one Taiwanese foundry. They are the foundation of the entire Bitcoin mining hardware pipeline and much else besides. There is one other company that can claim to have 3 nanometer production capacity though. On paper, Samsung Foundry can do it too. The only problem is their yields are puny. Samsung's second generation 3 nanometer process is reportedly running at around 20% yield, meaning eight out of every 10 chips that come off the line are lemons. You can't run an industry on that, especially not when TSMC is yielding 90%. So, who in their right mind would actually pay for 20% yield production? Well, the answer apparently is some Chinese ASIC manufacturers. Companies including MicroBT and Canon have started ordering next generation 2 nanometer chips from Samsung, which tells you everything you need to know about how desperate they are to reduce their dependency on Taiwan. When you're willing to sign up for this, it suggests you've run out of options. China is also reportedly trying to cut out the Dutch entirely. In December, Reuters reported a breakthrough in EUV development by researchers in China who allegedly reverse engineered ASML's lithography technology. This is a huge step forward, especially considering that just a few months prior, ASML claimed it would take China quote years to accomplish it. That didn't age so well. And now China's path to domestically produced chipmaking equipment and semiconductor independence is a lot more straightforward. However, reverse engineering the design is not the same as mass production at scale with viable yields. Building a functional foundry takes years, even with the blueprints. So for 2026, this changes nothing. If anything, the news is likely to accelerate US and Dutch sanctions on China, making the short-term supply chain more fragile, not less. And the pressure is already visible. US mining companies have been hit by delays in Bitain shipments, reportedly due to tightening customs enforcement around Chinese tech imports. The frictions are already here, and they're more likely to intensify than they are to ease. Now, China's military activity in its own territorial waters is often paraded in Western media to suggest that Beijing is on the cusp of sending troops into Taiwan, a bit like Donald Trump did in Washington DC and Los Angeles, but well, more ominous and more Chinese. This scenario has major implications for TSMC and by extension the global supply of advanced semiconductors. Whether or not China will ever catch up with the Hawk's ever retreating deadline for it to make such a move is questionable, though. If it does, then all eyes will be on the reaction from the United States. For semiconductors, however, it would take much less than a kinetic war to snap the world's supply chain. A sustained naval blockade, for example, would probably do the trick. A semiconductor specific sanctions package or even a major earthquake in Taiwan could freeze the flow of new mining hardware for months or even years. In that event, hash rate would stagnate and network security would depend entirely on an aging fleet of AS6 with no replacements in sight. And unlike a price crash, which can reverse in a quarter, a supply chain rupture takes years to repair. So that's five systemic risks so far. macro, miners, corporate treasuries, regulation and supply chains. The final threat is different. It's not here yet, but the market has a way of pricing in dangers before they arrive. Now, the final risk is different from the others because it's a ghost story. But ghosts can still move markets. Quantum computing has been looming over Bitcoin for years. The fear is that a sufficiently powerful quantum computer could break the elliptic curve cryptography that secures Bitcoin wallets, allowing an attacker to derive private keys from public keys and drain funds at will. So, let's see how that would work. Bitcoin uses something called ECDSA encryption. To break this encryption would require roughly 2,300 logical cubits. The key word here is logical because not all cubits are created equal. There are also physical cubits. For reference, IBM's most advanced quantum processor scheduled for 2026 and cenamed Cookara is targeting under 1,400 physical cubits. To produce a single reliable logical cubit, you need approximately a,000 physical cubits with extensive error correction. This means that a quantum threat to BTC is not yet on the horizon, nor anywhere near it. Gayscale put it bluntly in their 2026 outlook. Quantum computing will not meaningfully influence crypto prices next year. It's science fiction for now. But well, there is a butt. In 2026, the US National Institute of Standards and Technology is expected to finalize its postquantum cryptography standards. The new encryption protocols designed to be resistant to quantum attacks. This is going to generate headlines. And if Google or IBM or whoever else announces some kind of quantum advantage breakthrough around the same time, even one completely irrelevant to cryptography, media reporting might not care to make that distinction. quantum breakthrough and Bitcoin vulnerable will probably end up in the same sentence and retail will probably panic. Another face of the quantum threat relates to the so-called zombie coins. Approximately 1.7 million BTC sit in early P2PK addresses from the Satoshi era, the first few years of Bitcoin's existence. These addresses expose their public keys directly, making them theoretically more vulnerable to quantum attack than modern wallet addresses. At current prices, that's over $150 billion in coins that could one day be at risk. Now, we think the chance of a material threat from quantum computing in 2026 is close to zero, but markets have a habit of front running dangers that don't exist yet. If the narrative takes hold, the selling will be real enough. So then, there they are. Six risks that could slam dunk BTC in 2026. A recession the Fed can't rescue. A mining industry drowning in debt and eyeing the exit. A corporate treasury strategy with a redemption cliff on the horizon. A regulatory pinser in Europe that welcomes crypto with one hand and gives it the middle finger with the other. a semiconductor supply chain that runs through two irreplaceable choke points, and a quantum ghost that isn't real yet, but might not need to be. The worst case scenario is several or all of these risks materializing in quick succession. It might not sound likely now, but when cracks of this magnitude appear, they tend to spread fast and cause cascading failures. And if you want to learn more about how asset prices could violently reverse in 2026, then why not check out our video about what happens when passive buying pressure turns into passive selling. You can find it right over here. That's all from me for now, though. Thank you all for watching, and I'll see you again soon. This is Guy signing off."
    }
]