[
    {
        "video_id": "sjZddWvFqcU",
        "title": "Precious Metals Parabolic Alt Season: Platinum, Gold, Silver #shorts",
        "published_at": "2025-12-24T18:13:35Z",
        "sort_date": "2025-12-24",
        "url": "https://www.youtube.com/watch?v=sjZddWvFqcU",
        "transcript": "We need to discuss what else is happening here because precious metals are in their own kind of parabolic old season. You see platinum, paladium, paladium not alltime high, wants to go up. You know, I joke that this is kind of the small gem, small cap gem. Paladium is the small cap gem still below alltime [laughter] high and then you have the silver, the golds, all of this massive massive pumps. I mean literally all coins season kind of charts. We will be discussing that. Then of course we have to discuss all coins. Power all con."
    },
    {
        "video_id": "z54jD_DrrdA",
        "title": "BITCOIN: 2026 PREDICTIONS (MERRY CHRISTMAS!!)",
        "published_at": "2025-12-24T10:58:11Z",
        "sort_date": "2025-12-24",
        "url": "https://www.youtube.com/watch?v=z54jD_DrrdA",
        "transcript": "Ho ho ho. Guys, welcome back. It is Christmas. Merry Christmas to everyone. I wish you and your family all the very best. And of course, on this day, I want to discuss a bit of crypto. We need to discuss what else is happening here because precious metals are in their own kind of parabolic old season. You see, platinum, paladium, paladium not alltime high, wants to go up. You know, I joke that this is kind of the small gem. Small cap gem. Paladium is the small cap gem still below alltime high. And then you have the silver, the golds, all of this massive massive pumps. I mean literally all coins season kind of charts. We will be discussing that. Then of course we have to discuss all coins. Our all coins sadly guys they are on a big support. And uh yeah they if they break this support guys it's uh good night. It's good night for Solena. It's good night towards this level 20 $15. For XRP it is good night towards this level around the 0.70.8. So just be aware that all coins currently are not in a good spot. They're not in a good spot. I don't want to sugarcoat it for you. I've been wrecked many, many times in all coins since I joined crypto in 2013. And I know how serious it is. In the bare market, all coins will hit you in ways you you never imagine. And look here. Actually, XRP, as you can see on the monthly, it's breaking down. Let's see how the weekly looks like. Week, oh man, I mean, weekly is the same. It's it's breaking down this massive massive support. So, be careful. But let's take one step at a time. Welcome everyone. Merry Christmas yet again. Smash up the like, subscribe, and let's see how our journey journey has been um so far this year in crypto and where we're heading next year and where the bottom could be. First and foremost, as you remember, we did start to derisk on October 8th. This is important for all the new viewers who join us that you understand our journey where we've been since October 8th. We've been super careful. Most people have been complacent. We have been super super careful. So our strategy has played a very very big role in us being in a calm position not being angry not being concerned because that's the current situation for many people. I mean even influencers even your favorite influencers I see them being angry on the timeline and let me show you what I mean. I they they can write stuff like for example uh that something broke. You remember October 8th when we had this big liquidation day. I see people today still today saying something broke or that we deserve to know. They're angry. People are angry. And this is not just, you know, random pleba trader, new trader. These are experienced traders in this space. They're angry. They're they want answers. Something broke. They say, \"What happened? CZ, did you break the market? Binance, did you break the market?\" They're so angry. They're so angry. They want answers. So, they think it's some kind of conspiracy the crypto is dumping. They think it's so strange that all pumps get sold into and I mean for me personally I think it's just entertaining because you understand that when you are below 50 moving average when you are in a bare trend because on the money line also we're now in a bare trend. Uh this is the normal behavior. There's nothing unique with that. There is nothing you know extraordinary with the fact that when you are in a bare trend the rallies get sold into. That's why we have the bear here. You see the the Mr. Barra he is the signal he is the mascot of the bare trend so Mr. Barra has been in charge now for the past weeks and on the daily we quickly went into bear from this fake alltime high and when you have a bare trend the rallies get sold into I mean that's the definition of the bare trend in a bull trend every dump gets bought up in a bare trend all rallies get sold into so let me know if you recognize this this kind of tweets on Twitter know something broke we deserve to man come on it's standard it's standard in these conditions people see any pump as relief rally and an opportunity to dump. It's fully normal. So there's no conspiracy. It's just basic TA. But of course, too many people, they look too much at the macro. And macro is important. I mean, it will work out at the end. The problem is that micro can take months to work out. And in those months, if you hold all coins, you're losing, as you can see here, between uh 20 to 40% per month. Per month. And look at 60 days how how much they lost. 60% 60 60 90 days uh 79. you lose very quickly. So macro, it's not like I'm denying macro. And of course, if the Fed prints money is going to help us, the question is when it's going to be today or in six months because it's if it's in six months, you can lose 90% of your money. 99% of your money in many in many cases. That's why all of the Fed stuff, the macro, the ISM, obviously, it's good to know for the long term. If you accumulate Bitcoin for the long term, it's okay. Your old coins are not going to help you. they're gonna be dumping so hard so so fast and this is why if you have not been listening instead you know you thought that global M2 is going to help you or now you know the latest thing people say ISM ISM is going to go up and we're going to pump and listen probably yes probably if ISM goes up we're going to pump but the the question is where are your altcoins at that point where is Sana at that point where is it here or it's here where is XRP at that point it's here or it's somewhere here okay that's the question so that's why for trading all of the micro it's not useful It is useful for long-term allocation, long-term 10 plus years. But let's be real, most people when they trade altcoins, they don't they don't think like that. They think that they want to get rich. They that their alcoin still hasn't reached alltime high and then it's kind of hoping for them that ISM maybe is going to pump them. So, because we did play it quite nicely, we're not in this position. We don't have this uh phases of grief. I mean, this what I currently see on the on the timeline. Many people, they go through the phases of grief. They they still haven't accepted. Now they they're in the anger stage. They're in the anger. They're angry. What happened? Cece, DID YOU DUMP? BUTANCE, DID YOU DUMP? WHAT HAPPENED? WHY WE DUMP? But it's so simp. I mean, it's way more simple. And then another thing which is important to realize is that I mean, this cycle topped out in in October Q4 2025. The previous cycle topped out in November 2021. So Q4 Q4 uh 2017 also Q4 another top right here. So all of them do this the same thing. I mean it's the same thing. The cycle is the same. I mean literally everything is the same. Everything is the same. The only difference is that altcoins did not pump as much but it's your altcoins. Many altcoins did pump. I mean dog with hat meme coins they went very very high. So many altcoins did fantastically well. And also another problem why many altcoins have not pumped is because they pumped but not in the public market. I mean it's something we have to look in the eye and see the truth as well. In 2021 and 2017, a lot of coins they pumped after they started trade to trade publicly. But in this cycle, whether you look at optimism, I mean these coins are so bad. Optimism orbitum or other L2, Starket, another catastrophe, Starket, another big fat catastrophe. The problem with them is that they already were expensive when they started to trade. So all price discovery took place in the private market before before the public market. So this is something I don't see discussed enough that all pumps did happen just among VCs. I mean among themselves they had very nice pump. I mean Optimus went from zero to billions then it got listed on public markets and then it kind of went down. So ple didn't get the pump. Retail uh didn't get the pump but if VCs got a lot of pump it I mean all of these pumps in altcoins they did happen just not publicly. They were in private markets. So this is why uh being angry for the cycle I don't think it makes sense because time-wise it's been uh the same lengthwise it topped out exactly where previous cycles topped out. Then we went into bare trend uh and since then it's bearish. I mean what else you want like previous cycles. So the similarities are very very big. I mean they're they're massive. They are literally staring us in the face. Then of course you can look at how the cycle has been in terms of you know days from h havinging uh and uh what the performance has been and is also exactly the same I mean in terms of where the cycle topped if you look at number of days since hovering uh you see here it's basically where the previous uh cycles topped out like this one topped out here this one topped out here the blue one was a bit before but it's an early one but you know few last cycles topped out exactly where we were and then from low to low if you look from low to in uh Bitcoin performance uh time wise I mean you see yourself we topped out so our chart now is the white one we topped out basically where previous cycles stop topped out so listen we have to look the truth in the eye and say that there is nothing different about the cycle I know many people want it to be different because their altcoin did not pump I understand that but the way to fix it is by managing your altcoin portfolio and not blindly believing in altcoins I mean that's that's the that's the true answer I know many people don't want to hear it and that's I you need to sign up for bull mania. It is closed now but we're going to open it up in the new year because managing your old portfolio that's what we teach. I mean it's very important. You need to manage it. You don't want to be holding bearish assets. You don't want to be holding bearish assets. It's very very bad. So let's the first chapter of this video that I want to highlight that this cycle we've been playing it very nicely. Mr. Barry is here helping us because since bare trend we know what to do and uh there is nothing to be surprised about. There's nothing to be shocked about and so on so forth. is just simple simple simple TA that explains most of the situation. So that's number one. Number two, let's speak about how low will we go. Is it possible that we have a bottom here or will we go lower? So first and foremost, we have to look at what normally happens. Normally we we do go to the 200E moving average. 200E moving average is currently uh right here at 56 and it is going up quite quickly. Okay. So within the coming months, let's say in February, March is going to be above 60. Okay. So this is why when people are saying, but Ivan, why do you think we topped out if we didn't have a crazy blowoff top? We didn't have crazy alcoin rally, we didn't have this retail mania, how can we have topped out? Well, everything else is exactly the same. And you can argue that we did see another type of demand from institutions that we did not have before. We had ETFs. So it's not like this cycle has been, you know, fully dead and somehow we pump without any explanation. I mean literally president of the United States did the memecoin. We had ETFs and so on so forth. But it is true that in general we we had bigger pumps in general but Bitcoin is also a a bigger asset. It does it has diminishing return. So it pumps less but the people are ask that are asking that also ask hey Ivan so we did not pump that much this cycle from the lows. So it means that we will not dump as much. Is it true? I think it's true. And this is also represented by the 200week moving average. Okay, the 200E moving average now is not that far away from the price because we did not pump a lot away from it. We did not deviate too much from it in the last cycles. If you look for example here, I mean for us to go to 200E moving average, it was quite a lot here. I mean we topped out here at 70 and the 50 week was somewhere here at 20. So it was quite a big fall here. We topped out at uh 126 and the 200WE moving average was at 50 50 something 55 50 54. So the fall here is way less to the 200E moving average than it was back here. So this is baked in the fact that we did not pump as much and listen all cycles are like that. All cycles we pump less each cycle. It's always like that. If you look at the percent gain from the lows it's less. This cycle just like last cycle was less than the cycle before that. So, but this is listen this is uh baked in into a 200 week moving average. That's why we keep it simple. You don't have to over complicate it. Look at all kinds of you know onchain just keep it everything is in the price. Everything is literally in the price. So whe when you look at the diminishing returns 200 week moving average takes care of that. It takes care of the fact that we did not pump uh as much this cycle. So uh that's why our target is somewhere here. Uh looking at the length of the dump, this one is hard to predict. Uh normally it is in in Q4 uh the year after the top. So this would be Q4 2026. However, it all depends on how fast we dump. I mean, if we dump faster, it's good. That's why a fast dump is actually good for for bulls. We need some kind of clearing of pipes here. We need some kind of uh capitulation because there's still a lot of outflow. For example, in ETF every day new outflow. So whenever you have any kind of rally, it instantly gets dumped into. So we need an event where everyone who wants to sell, they already sold. That hasn't happened yet. As you can see, every day, I mean, there's a bit it's seeping out like this this outlook is just seeping out a bit at a time. A bit at a time, a bit at a time. We need a big fat outflow. Okay, we need everyone who wants to sell just sell quickly within a period of a few weeks. I mean, that would be the best. H and then the second best for bulls would be like a slow bleed towards this maybe a relief rally and then you know slow bleed lower down towards the Q4 of um next year but in terms of the uh time uh um period I don't really care I mean personally I don't care I don't care if it goes fast or it goes slow for me the signal is going to be that we are at the 200 week that's number one and then that we go into bull trend on the money line that's number two okay that's what I care about th those are my signals then whether it's going to happen in May or in u October Ober, September, it matters less. It matters way way less. So that's that. Now let's speak about uh altcoins as you know uh we need to be cautious here if you still have all. And as you know since October 8th we have been derisking. I currently have no alts. So all know if you still have alts just be careful. Sana if it doesn't bounce here and again it it's unlikely to bounce if Bitcoin does not bounce. So that's why Bitcoin is what we'll look at primarily. But here you you you just have a lot of room to fall. A lot of room to fall. Okay. So, don't get surprised if it starts to become a bit of an elevator down in case we break down this we go below 100 dollars for Sana is going to be fast down. The same thing is for XRP as you remember from the introduction. It's kind of now breaking down guys. I you see yourself I I can just point you to the picture and uh then it's up to you to do something. But yeah, I I mean you see yourself do I need to comment on this or it's presented without comment. Okay, let's check other ones like um SUI. I mean, SUI is kind of the same as well. It's uh it wants to go towards it broke down this high. Now, it's going to go towards this support here at 0.5. That would be the next big support. As you can see, uh right here, I mean, let me do more professional. People say I want draw more professional. Okay, let me do more professional. I will draw a line like this. So, all in all, the next big support is somewhere here at 0.5. So, don't get surprised if Sue goes there. And uh listen, it's not like I want to be I'm just trading the market I have. It's like Benjamin Cohen is saying don't trade the market you want. Trade the market you have. And and it's pretty correct. I mean I I want Bitcoin to go up. I want everything to go up myself also. People are way more happier when things go up. I get way more likes by the smash the like, subscribe and all that. But I get way way more likes when things are bullish. And I can just tell you that you're going to be rich with your all. Okay. I mean of course naturally people like that more. People don't like to hear when the market is changing. But I mean our job here is to is to cover the market. I mean it's uh is to trade to make money in the market. So that's it guys. Another way to see it by the way look here. Another way to see it where we are currently is this uh different zones. So now Bitcoin is um still in the expensive region. And how do we construct the zones? These zones are distance from the 200E moving average. Why do we use distance from the 200WE moving average? Because here is where normally buyers step in and they see it as cheap. I mean normally we bottom out at 200 week moving average in previous cycles. Why do we bottom out? Because this price is where you know you look at it and you see holy crap it's quite cheap. Let me get some. Let me get some. Now some people will be saying but I'm buying now. I'm buying I I think Bitcoin is cheap all the day. For most people around 200 week is where they see Bitcoin as cheap. So that they buy. So they click the green buy button when it comes to us. I mean, when it comes to just uh market sentiment, uh you have buyers coming in at the 200 week. So now we're still too far above it uh to be called fair price. So we're still expensive and um uh when we get closer to a 200 week, we're going to get into the fair price. Bottom is very likely here. And if we go below here towards, you know, 40s and high30s, if that happens, guys, this is, you know, buy opportunities like there's no tomorrow. It's uh very important that you keep it in mind that yes it is still expensive now it's still not doesn't look too bullish but things will change I mean that that's another important thing will change things will change very very quickly next year as Bitcoin reaches uh this green area and we're not even far away from it I mean that's another thing you know to be in green area is like 15% down it's not even that that far away to go to the um from here to go to the 200 moving average it's minus 30%. It may sound like a lot, but listen, it's, you know, it's a few candles. Bum, bum, bum, we're down. We went down here. How long time it took to go 30% in like in a, you know, in a few weeks we went down 30%. It can be like really Bitcoin dumps fast. This can be a matter of seven weeks, okay? And boom, we're there. So, this is from the bearish perspective. Of course, there's always a possibility that things just start pumping out of nowhere. And then the first signal to be bullish is this break above. Okay, very important. If we break above, we start tracing here. So, we break above this and then the the next big signal is to be bullish if this uh breaks and this way Bitcoin will not go to a million without us. Uh but uh what's likely to happen here is that when we retouch it, we get rejected. Normally, it is like that because all the support turns into resistance. Uh it's a simple simple simple. It's not that you know I'm I'm telling you is this is not even even something I invented or some kind you know I mean it's simple stuff. The first thing you learn in TA is uh support and resistance. And when you break support, it becomes resistance. But for some reason, people get angry. They get very angry when I tell say that. They they get very angry. Angry. Yeah. Uh finally guys, let's look at precious metals. As you know, 6 months ago or so, we added precious metals to the uh to the commodity. We added commodities together with precious metals to the Bulmania infrastructure, our software. And as you can see 61% of commodities are in a bull trend and this also includes commodities like sugar and all kinds of stuff. But in terms of precious metals all of them are in bull trend. Gold, silver, palazium, platium you know the key biggest precious metals all of them are in um bull trend and this bull trend is quite extensive. If you look at weekly on the weekly we've been tracking it uh perfectly. I mean gold on the weekly is since 11 months in a bull trend. silver since six months and I mean you can see yourself here on the chart what it means. This is why trading based on trends, it's so important. When something is in a bull trend, you have to respect, you have to respect the pump. I mean, it is what it is. You look at gold, um, bam, I mean, it's crazy. It's crazy. Respect the pump. Respect the pump. Respect the pump. Um, paladium, respect the pump. And, you know, the saying respect the pump was actually invented for this kind of situation where you have an an asset and it does not pump, then something something else pumps. You have to pay respect. You have to pay respect. You have to invite the pump into your life. You have to pay respect. Paladium, sorry, platinum, the same thing. Massive, massive pump. As soon as bull trend, massive, massive pump. So, I hope you understand how important these trends are. I mean, a trend is only the is the only thing that you can use in order to see where the price is going. That is the primary. No one knows where the price is going to be. But with the trend, it is is the best like it's the most accur highest accuracy thing you can use to tell you where the price is going. Guys, smash a like, subscribe to the channel. Uh, merry Christmas yet again. Was fantastic hanging out with you this fantastic Christmas here. And, uh, yeah, we're going to be back tomorrow likely. And have a good, good day. And goodbye, guys. Goodbye. Goodbye. Bye."
    }
]