[
    {
        "video_id": "6sKKOrNVsk8",
        "title": "ETH &amp; SOL WAKE UP, Bitcoin Reclaims $92K, Crypto Turns Bullish &amp; More!",
        "published_at": "2026-01-05T17:55:01Z",
        "sort_date": "2026-01-05",
        "url": "https://www.youtube.com/watch?v=6sKKOrNVsk8",
        "transcript": "[Music] New Year resolve. Bitcoin and the rest of the crypto market rallies despite geopolitical unrest and the promise of another crazy year courtesy of Donald Trump. What to watch as 2026 gets underway. We break down the key crypto catalysts that could get the market moving again. And we'll bring you the tweets of the week, more TA from Lewis, and the conclusion of our portfolio competition. This is the Coin Bureau News Live. Hello everyone. A very happy new year to you. Uh to you one and all. A very happy 2026. Uh it is good to see you again for what yes is going to be another crazy year. Nick, how are you doing, sir? Good, man. Happy New Year, guy. Seems like we're getting off already to a bit of a strong start, right? An interesting start. Hopefully. Hopefully. Don't jinx it. Touch one. Don't jinx it. Yep. Yep. It has uh yeah, you just there's kind of a slight sense of ah [ __ ] here we go again about it. Yeah, we too jaded. We like we can't have too much of a good thing. We are allowed good thing guys. We are we are allowed it. We are. We are. Um but uh yeah, you just know that everything that went on at the weekend and uh is kind of still going on. You just know it's going to be another eventful year, right? That's how we started the year off. An invasion of a sovereign nation by the biggest military power in the world. Can you imagine what 2026 is going to be like? It's it's going to be a wild one. Um, but yeah, so we will be looking ahead to uh 2026 in the second half of the show today. Some of the big things to look out for and of course we're going to be breaking down the last week as well. But it's it's kind of good to be out of that whole sort of festive period now. I always find it a bit disorientating. I'm not I'm not a big fan. Like once Christmas is done, I'm sort of like let's just get on with it again. Yeah. But uh and that's exactly what we're doing today. Exactly. starting off with a bang for the first Monday live stream of 2026. So before we dive in guys, firstly uh please let please hit the like and the subscribe button. We're not going to even we're going to do at the end because you guys have been very far off the the one the 1,000 like number before. So we're just going to beg for the likes. We're not we're not going to incentivize you. We're just going to ask you very nicely, very politely to please, please hit the like button. But if we do hit 1,000 likes, we'll we'll review some Portfolio Alpha. Don't forget to subscribe and hit the bell as well. And then at the end of the stream, of course, you guys have been here been following for the past quarter. We've got the Bitgate competition which is now completed and uh we're going to let you know about how we're going to be choosing the winner at the end of the stream as well as revealing where we're at in terms of the actual portfolio value because I believe given your choice last week and buying some Bitcoin, we could be close to break even. We are. Yeah, we are pretty close. You guys have done You guys have actually done pretty well. I mean, you know, if the first rule of investing is not to lose money, um, I mean, you're almost there. Given that Bitcoin was down by 20some percent in Q in Q4, it's quite impressive. So, well done, guys. Yeah. Cool. So, we'll get on to that in a bit, but let's kick off with, of course, a look back at Bitcoin last week. Uh, so on Monday, uh, indeed, true to form, Michael Sailor himself bought some Bitcoin. Not a massive bag, but decent. Just a nibble. Just a nibble. 100 Christmas nibble. Exactly. He just got to stack up his last buy for 2026. Mhm. On Tuesday. Um yes, we had MetaPlanet also buying. Um they added uh God, they added actually a fair bit more than S did. Almost three times more. Yeah. Uh and um also on Tuesday, we got the news that Powell's replacement will be coming soon. I would announce replacement probably in January, probably. Trump on the phone to him now in front of the giant Christmas tree. Exactly. Um yes. And we're going to talk a little bit more about uh about the new chair of the Federal Reserve, whoever that's going to be, because that is obviously going to be very important. And on the topic of the Fed, we also had the FOMC minutes last week as well. Yeah, exactly. And the minutes revealed exactly what was said, and it was, as we'd expected from the actual press conference, it was a hawkish cut. So although we got the cut, they were slightly hawkish on inflation. and it showed basically the division between the governors, although they did say that the balance of risk was now on the labor market front. Okay. Now, on Wednesday, we had some news that I I must say I always hoped I would never hear. Um, and that is that David Beckham's biotech company had paused its Bitcoin buyers. I mean, there's a lot to unpack. Did you know David Beckham had a biotech company? I did not know. Sorry, I must corre I must correct myself. It's Sir David Beckham. Sir David Beckham had a biotech company. I did not know that. But the fact that be that Beckham bended Bitcoin bend Bitcoin like that's mad, bro. Yeah. So, this is a this Yeah. Do not adjust your sets. This is a biotech firm co-founded and um by uh Sir David Beckham. Um they've they they apparently hold Bitcoin um although they're not buying anymore. Yeah. So, they've paused their Bitcoin buying. Even David Beckham is stopping to buy Bitcoin through his biotech firm, which we did not know about. Then if even Beex is bearish, bloody hell, we're bugging. Um, okay. Um, and yes, they uh they didn't have a they didn't have a very good quarter. Well, Q Yeah, Q4 wasn't a good quarter. Well, we ended the year down. So, this was Wednesday was of course New Year's Day. That's how crypto afficionados generally spend their their New Year's. Um, but it ended the year down 6.2% 2% Bitcoin and it was the second worst quarter uh ever on record at 23% down. Oh, okay. Well, that's that's great. That's great. I mean, that's just that's just lovely, isn't it? Lovely. Um, but we, you know, new year, new CME gap, right? We did get another one of those. Where's that at then? That one is, I think, around the 87 KO711. Um, but it was a gap that opened up to the downside because we had New Year's Day with no trading obviously on the CME. Mhm. So we did open up a gap which is still left unclosed and um again on Thursday new data was revealed by cryptoquant that there is long-term holders are again accumulating which is good to see. So there was a net accumulation of 10,700 BTC by the long-term holders the long-term holder supply chain increased. Okay. And then we as the week drew to a close bitcoin broke above 90k again. Um so there was definitely there was definitely a bit of op optimism in the chart and uh strategy as well was feeling the good the good vibes. It raised its dividend on uh on one of its several uh preferred stocks on the stretch div on the stretch preferred. Yeah, exactly. 25 basis points to 11%. Not bad returns. Not bad returns for I mean you know in terms of like stable returns. So it seems as if uh if you are strategy shareholder if you hold the if you held the preferred you're in a way better position than if you hold the common. Okay. Okay. The comments are down 45%. We don't want to mention that. Um then the weekend, I mean I as far as I remember nothing nothing much happened over the weekend. It was fairly quiet, fairly uneventful. Fairly uneventful. Oh, of course there was something really exciting that happened. Of course. Yes, there was. It was. So it was Bitcoin's 17th birthday. The block 17 years since the How could we have forgotten 17 years old Bitcoin? Yep. It's entering arguably its uh its most troubled stage of life. apt to do, apt to steal its father's car, go joy riding, start experimenting with various substances, discover otheries, try and try and do things with them. Are you experiencing or something? Look, you know, I'm just, you know, this is just this is just how life plays out. Bitcoin is in the is in the tricky teens. Um, it's only going to get more complicated. It's going to get more volatile, more acne prone. It's got a tough few years ahead of it. [ __ ] volatile. Hey. Wow. Yeah. But of yeah, something else did of course happen the weekend. It was uh the capture of Venezuela's Maduro. Crazy stuff. And this is actually a live picture of Maduro waking up. That is absolutely brilliant meme. Props to whoever made that. Whoever made that, bro. Wonderful. But Bitcoin did nothing, which is crazy. You would think to yourself like a on a weekend no less when you have such a geopolitical earthquake happening and you've got this going on that Bitcoin which is supposed to be a risk on asset would have collapsed and I was kind of this is very highly I find this kind of sus you know the fact that you don't have any movement in Bitcoin so it's kind of like when is it coming when is it coming I mean yeah because you could I think you could make a convincing argument for either side couldn't you you know for volatility either side you could say well it could crash because you know it's a risk asset and people would be kind of panicking or you could even you could even make a case for it to pump because you know it's a hedge against geopolitical uncertainty or at least you know it was maybe that narrative is a little out outdated at the moment but yeah Bitcoin traded last year you know like bad luck Brian that meme you know it's kind of like it when it was a riskoff it basically sold off when when gold rallied and it sold off when equity crashed so it doesn't matter what it's risk on when the markets are crashing and risk off when they're not so and that's why I was kind of suspected suspect, you know. Yeah. Yeah. So, but yeah, it was it was interesting. Obviously, um this kind of Venezuela business has been brewing for a few weeks now, ever since ever since uh the US started sending sending increasing amounts of hardware to the Caribbean. But I think this kind of caught everyone by surprise, not least Nicholas Maduro. Um but uh yeah, it was it was kind of mad, wasn't it? They just went in and snatched him in the Apparently, there were also like at least 10 Chinese dignitaries there as well to meet with Maduro. Apparently, they were there meeting with Maduro. They had arrived the day before to meet with him and discuss, you know, discuss. Yeah. Whatever it is, Chinese Venezuelans discuss. Sorry guys, where is where is Nicholas? Cuz he's late for the meeting late for our meeting. Um gosh, that must have been quite awkward. Yeah, obviously. Anyways, back to crypto. Sailor may either be buying or stashing fiat. We don't know yet because he he alluded to either green or orange or green. So, as we know now now know, orange means they he bought more Bitcoin and green means he's stashing more fiat to pay uh to for the long term to pay his dividends. Uh so, let us know in the comments if it happens during the stream, guys, uh which one he's decided to go with. Mhm. So, what's coming for this week? Uh on the macro front, we've got the first jobs report coming out on Friday, the NFP numbers. So, we'll talk a bit more about that. And looking at the charts, uh, indeed because we did have a bit of a pump over the weekend. Yes, of course. I'm not going to I'm not going to give up on the CME charts just yet. It's only a few more weeks until we have 24/7 CME trading and then we'll you'll stop hearing me talk about the gap. And then you'll complain. You'll be like, \"Why isn't Nick talking about CME gaps anymore? I used to love it. I only tuned in to hear Nick talk about CME gaps.\" And and look, you know, if you watched our video on CME gaps or just listen to Nick blithering on about them for the past year or so, you'll know that it is a pretty pretty straightforward short opportunity. Past six months, short or long? Yeah, past six months he's been quite accurate. So anyways, guys, take just saying just saying um but we have got some bull some more bullish signals, right? Yeah. Well, one is the golden cross on the 4hour chart where the 50 period moving average is about to cross over the 200 period. Now the golden cross is generally used to on the daily time frame but it can also be used in shorter time frames just to give an indication of shift in momentum. So momentum is looking good in the short term and indeed on the daily chart we have had five solid days of gains right and uh we now obviously above the CME gap and we are we are also above the 50-day moving average and we are approaching that key resistance which is the Fibonacci 61% uh retracement level from the all-time high and it's also a previous zone of consolidation. So, that's at the $94,000 level. Let's keep an eye on that. And if you guys want to trade this Bitcoin uh move, these Bitcoin moves, then uh the best place to do that is over on Tubit, which is a top tier international exchange, uh they're one of our brand partners. And if you haven't gotten a Tubbit account and you want to start trading, first of all, to sign up and create an account is super simple. All you need is an email address. So, you can just go and sign up using this QR code or the link down below. Create an account. All you need is an email address. And if you do want to trade and want to use two, but then you can also avail yourself of the bonuses and discounts we've got exclusively for the viewers of this channel. That's 90K in trading rewards and and VIP level one instant upgrade, which is basically giving you 50% off trading fees online. Oh yeah, go check it out. The ghost proves the ghost approves. Fantastic. So go and check it out guys too, but uh Q QR code or link down below. Yeah. Okay. Um, I will just give you a a brief overview of the sentiment. Um, uh, Renee reckons this is a bull trap. Um, shout out. Thank you to everyone who's wished us a happy new year by the way and a very happy new year to all of you as well. Let's make it a fantastic one. Um, meanwhile uh, someone pointing out whenever they make video posit positive video on cryptocurrency market dumb very hard. Dumb very hard. The market is dumb. Yes, the market is dumb very hard. The market should follow us. Come on guys. D at DGN assets is pointing out that crypton crypto often goes up in the beginning of the year. No more tax optimization. That is that is true. Tax obviously closing out portfolios. It's not just crypto generally. It's also kind of like you know sometimes something so traditional assets as well. So let's see. Um I like this. This is nice. Liked you liked you just because you're you are amazing. No need for giveaways. That's nice. Sweet. That's nice. Very lovely. Um, meanwhile, someone's saying out that Beckham's company was giving merch at BTC Mina. Ben Cowan went to that. He should have got some up. So, he they literally went to the Bitcoin conference when they were done with the conference like, \"God damn it, we not buying another single Bitcoin after that conference.\" After seeing what these Bitcoiners are really like, we're not buying another another sack. Just dump it. You're going to stop dump it. Um, uh, someone wanging on about the UK being a failed state. Um, guys wearing white shirts because it did vagabondness. Um, and then it's just a bunch of tickers. Um, and uh, yes, gains like my waistline over December. I know. It's tough one, guys. It's been tough. Yeah, I can't relate. But, um, fortunately though, if you follow crypto, you spend so much of your time ftting and worrying. The weight just falls off. One look at one look at my portfolio is enough for me to drop several pounds just like that. Um, let's not talk about money right now, shall we? Let's talk about money. Let's not be so vulgar. Let's not be so vulgar. Okay, so 2026 is upon us. There are lots of things coming down the pipes that we need to be keeping an eye out for because any one of them could kind of get the market moving again and especially if we get a kind of confluence of these factors. Uh there is a very good chance that you know we could see some we could see the market moving back up again in the coming months. Q1. Yeah, exactly. Because Q1 has historically been a bullish quarter on on average about 47%. So that's the pro. The con is well I believe Q4 was also supposed to be bullish historically on average which you know yes if the last few months have taught us anything it's that past performance is no in is not indicative of future returns. Yeah man we're in a new paradigm anyway. So what are the few we're going to start and look at some of the macro potential um catalysts for Q4 and then we'll look at some crypto specific stuff for a few cryptocurrencies. So on the on the macro side of it obviously big one Fed rate cuts right. Yeah. Yeah. As as Nick pointed out earlier, the minutes came out last week said the Fed was still hesitant of cuts. Powell and Co really don't want to cut unless they absolutely have to. Um and it seems now that the main driver around future cuts is they're not focusing so much on inflation anymore. The shift is the focus is now on employment, right? Yeah. The risk to the downsides on employment. Um and that's why we it's an important week this week with regards to the NFP numbers. And if unemployment rose again in December, this is pretty interesting because this could potentially trigger what is known as the SAM rule. And it's another benchmark that could potentially be used to define whether we're in a recession or not. Uh so that's something that could potentially happen. Okay. And um this is potentially why some uh market analysts think that we're likely to get a surprise cut, including Zack and Mark Xandandy over there. Okay. Um, meanwhile, if we have a look at the Fed watch tool, I think we've got it's saying a 62% chance of a cut in Q1. Yeah. So, that's what we could see. Now, keeping with the Fed theme, uh, as we'd mentioned in the in the rundown of last week, uh, Trump is going to name a new Fed chair in the next week or two. And this will be determined what's going to be happening at least in terms of like what the Fed chair himself is going to be bullish. I'm not doubbish or hawkish. Uh, and right now Kelshi has it almost neck andneck between the two Kevins. Yeah, this is interesting. So Kevin Hasset and Kevin Walsh. Um, they I think it's fair to say that they have, you know, they're not exactly the same, you know, when it comes to their views. One's more dubbish than the other, I think. Yeah. And they're also sometimes some are being quite contradictory. Like Kevin Walsh has been quite hawkish in the past about Kiwi, about the Fed, whereas now he's kind of like changed his tune because Trump is basically considering him for the role. Either of them, whoever it is, Trump has made explicitly clear in this this post he put out last week that uh whoever is Fed chair, they're going to do as he says, right? Which is okay. But he's still needs to understand that you can't control Federal Federal Reserve policy just with the Fed chair, right? I I don't think that line of reasoning is going to is going to stop him. I mean, I think Yeah, it's um he's got his he's got his own ideas about how to get into the Fed building. Yeah, exactly. Maybe maybe this whole Maduro thing was just to demonstrate to the incoming Kevin at the Fed. It's like unless you unless you cut rates and juice the markets like crazy, you're going to get a Chinuk helicopter flying over your house, bro. Yeah. the guys the guys will come to your compound and spirit you away to uh to to New York to answer questions. Um but yeah, I mean look, you know, whatever uh whatever whoever replaces uh Powell at the Federal Reserve, you got to think, you know, they are going to be under a lot of pressure from Trump to pass interest rates. And as we get closer to November and of course the midterm elections, can you believe we're getting towards the midterms? Um then, uh you know, that pressure from Trump is only going to get stronger. Meanwhile, talking of all things Congress, another thing that we need to be looking out for in Q1 is the possible passing of the Clarity Act. Clarity. Yes. So, this is the market structure bill. It's the big big piece of crypto legislation everyone seems to be focused on. Uh David Saxs confirmed the Senate plans to hold hearings on um hearings on the crypto market structure bill in January, aiming to unblock legislation stalled since mid 2025. So uh they're going to start talking about or to draft next week I believe uh in the in the committee itself. Yeah. Yeah. So second yeah second week of January. Um and it will have at least one markup on pending market structure legislation in the Senate. Um and before we move on I just want to quickly mention one thing that we uh that we haven't noted yet and that is also the SEC's innovation exemption which is due to be going live. In fact, I think it was muted to go live today, although I haven't heard anything further on that. But, uh, Paul Atkins, the SEC chair, has said uh that the innovation exemption is expected to go live this month in January. Um, and I personally think this this and the clarity act uh are going to be the two really important crypto catalysts to watch because I think it's going to be very interesting if we do get this innovation exemption which basically makes most cryptoreated things legal from a development standpoint in the US then I think it's going to be really interesting to see how crypto projects and especially US-based ones react to it like what sort of changes do we get what sort of uh you know what sort of benefits are going to acrude to tokens holders, how brave a project's going to be in sort of trying to roll out features or benefits or whatever it may be to uh to users and token holders. Um because I think those that do, you know, those are those are the ones that could win. Yeah. Releasing those animal spirits, those crypto animal spirits upon the markets. Yeah. So maybe uh well hopefully in next week's news, we'll be able to give a bit more of a rundown of the innovation exemption. Hopefully we will be in living in that world then. Um, meanwhile though, uh, you may just be feeling like you just want to hold your assets close, hold your crypto assets close, uh, not try and trade them in any way at all. And, uh, if you want to do that, then we can't think of a better place to do that than with a Tandem wallet. Um, we have got a delicious Tandem wallet uh, deal for you. So, if you scan that QR code, um, you get our special deal plus you get a $10 BTC reward. Exactly. And also, your uh, information won't be leaked in a database leak. Some hardware on wallets do that. Yes. Yes. Um, so that's nice. And yeah, I can tell you that uh using a Tandem, if you haven't used one before, they're an absolute delight to set up and use. They function both as a hardware device and as a web wallet as well. Very, very useful piece of kit to have. Okay, so uh what else have we got to look out for in Q1 then? So now let's take a look at some things that could affect three very big altcoins. Uh and these are Ethereum, Salana, and XRP. So we'll start with Ethereum Q1 stuff. Now Fusarka, which is the upgrade, it went live in de in early December. That's fair. But its impact window is very much now happening within Q1 2026, which is why it keeps coming up in institutional and ETF related coverage. And that's because most builders, protocols, and rollups are only rolling out Fusarka optimized upgrades in Q1. So you should um growth lags the actual work. Yeah. For sorry. Yeah. Um meanwhile in terms of institutions they they like to they like to sit out on the sidelines and wait for all the sort of data to come in post upgrade to see how successful it's been. Um so if you like Q1 is a kind of validation phase for Fusaka. Yeah. And it's not just Fusarka. There's some other upgrades that are coming that sits between Q1 sits between these particular phases and that's Glamsterdam the first half of 2026 and Iota which upgrade which follows that in later 2026. Yeah. So the evolution of Ethereum continues um and yeah as we say like you know it seems to be that Ethereum is uh is very much emerging as the institution institutional chain of choice. Um so they will be watching these these upgrades very very closely and yeah uh let's see how let's see eventually or pretty soon how well Fusaka has gone. Yeah from their point of view. Um but it's not just Ethereum is it Nick? No Salana as well. Uh so Salana's road map features major upgrades. Notably there was the Alpen glow consensus update which is launching in Q1 this year. And uh we also had fired dancer the long-awaited fire dancer client which I think went live last year. And it's meant to dramatically improve speed and scalability especially for institutional use. Yeah. Um so uh we've also got ETFs of course for Salana. Now we uh we these launched uh late last year. Um by the 30th of December Salana ETFs were already seeing net inflows um and I think $5.2 million on their first day which I mean you know isn't massive in the grand scheme of things but they have held up pretty well. they have held up and in fact in terms of like most of the days have been inflows which is impressive for an altcoin ETF. Um now there's also some price predictions that are out there uh that we've also shared on on our Twitter. Uh but um so early Q1 predictions there's the range between $130 to $200 which is quite wide. So, but the one positive there that is the bare case. If they have a if the bare case is the lower end, it means that we're not likely to go that much lower than 130, which is close to where where we trading now. So, that means it's up only hopefully. Let's see. Yes, according to these whoever these predictors are, whoever they are. And when have these institutional predictors ever been wrong? Um, meanwhile, XRP has got exciting stuff going on as well, not least ETF adoption. um growing institutional update uptake via regulator products. In the 30 plus days leading up to uh the new year, US spot XRP ETFs saw consistent inflows um including uh December 30th $15.5 million on that one day. Yeah. And also in terms of talking about supply crunch, uh there was a sharp decline in XRP held on exchanges is down from 4 billion to 1.5 billion coins over 2025. And this indicates a robust institutional demand and a tightening liquid supply heading into Q1. And it's not all just ETFs as well. XRP, the XRP ledger, XRPPL is also expanding. Um, its next uh major push is programmable privacy. Uh, lots of people talking about privacy as a big narrative this year. Um, zero knowledge proof integrations are already being explored. Um, and the first use case apparently is going to be confidential multi-purpose tokens, MPGs. Yeah, Q1. So, that's cool. That's something to look forward to. XRP arm is no doubt ecstatic about that. Um, and also, by the way, guys, in terms of these 2026 predictions, we actually have released a Q like a 2026 uh coin bureau kind of like crypto predictions version, which is actually in our Telegram channel. So, if you guys are not following there, you're missing out. This was shared last week. So if you want to follow, just scan that QR code and go and follow the Coinb Telegram channel. It's we're now sharing a lot of daily maybe like daily alpha unique unique away from the news that you guys can get just there, but you have to be within that Telegram channel. So scan that QR code, go and sign up right now. Absolutely. Absolutely. Um okay. Uh before we move on, can I can can I just can I just put to bed a rumor that suddenly seems to be gathering uh speed in the gathering uh momentum in the comments. It is not my birthday. Why do why do people think it's my birthday? Um, please don't no please do not uh everyone wish guy a happy birthday. It is not my birthday. If it was my birthday, trust me, I would be depressed beyond words and it would be it would be shining through. So please, it is not my birthday. I very much appreciate the wishes. Um gosh, these things can uh can can spreads like wildfire. Exactly. Exactly. Um yeah. So moving on, guys. Um in terms of the bit the BitKit competition first of all uh for those who joining just starting right now to get an understanding of what the Bitquet competition was. It was a trading competition which we did in collaboration with BitGet uh one of our brand partners where you would have had to have a BitGet account and traded on it and also been a view of the live stream and uh engage with these live streams and then at the end of the quarter we would give away what was left of the portfolio. So first of all shout out and thank you to BitKet our brand brand sponsor or brand partner. If you don't have a BitKit account already, you can go and sign up right now. Scan in that QR code and you'll get a lot of other goodies as well in terms of up to 50K 50K USDT in bonuses and discounts and as well trading fee discounts. So, in terms of who won the competition, at the end of the stream, we'll let you know about how you can find out. Uh so, just stick around for that. Uh and we'll also let you know the size of the portfolio. Yeah. Okay. So, uh, with that, shall we go to some TA from Louis? Go. Let's see if he's got a trade for us. Come on, Louis. Give us a trade. [Music] What's up, guys? Okay, so we've had an eventful uh last few days with a couple coins at least. We got Pepe over here that is up over 70% right now. And so I'll show you a couple things that look good and a couple things that don't look too good. Um, and why I'm still cautious overall. So looking at Pepe, this looks great. Obviously, you want to see these big moves up. That's awesome. Um, however, or I guess I shouldn't say however, I should say if you if you look at the bigger picture of Pepe, you can see that for this coin at least, it's back above this major major major support area, right? It's like bounced off the support here. It did go underneath underneath of it right here, but like besides that, bounced here, bounced here, bounced here. Um, and now it's back above there. So, who knows? Maybe it's going to stay back above there, and this will be the range once again between 578 and 1315, right? That's something that's a possibility. However, there are some other coins like Dogecoin for example that look really really good if you're looking on the, you know, I don't know, 2 hour, 1 hour chart, like, oh my god, it's just going up up up up. But, um, if you look at it on the higher time frames, you could see, oh, it actually touched the previous SR flip area and now it's coming back down. Or another one that I like, which is a fan favorite, S&P 6900. Yeah. Okay, cool. It's going up. It's going up. It's going up. But if you just zoom back a little bit, like look at all of this big resistance area right here. And it's yeah, it still has a little bit ways to go uh before it really hits, you know, this area at around 73 cents uh for the major major resistance, but it's it's basically a little bit above the middle the mid zone, uh which is not a good area to long if you're trying to manage your risk or anything like that. Obviously, getting into it down here would have been great. And if you zoom back, at least for this coin, which is something that I noticed, uh it actually did bounce off of a major support area that it bounced off of multiple times in the past in, you know, 2024 and 2025, right? So, it does show that uh you can zoom out on the higher higher time frames and look for these big areas of support on certain coins and maybe if uh you know the coin does come back down to it, that might be a good opportunity to get into it. But as of right now, a lot of the coins, other than Pepe, which I just showed you, they look sort of like this, where it's a little bit in the middle between the previous highs and the previous lows. And yeah, maybe it's a little bit above the mid zone, but it it's not in a really good area where I would want to be longing it just to FOMO win, right? And so, for the most part, I'm going to be waiting until something does come to the area that I really want to get in. And as an example of that, I'll just I'll show you Monero real quick. XMR. Like to me, my alert went off when it hit around $470. Why? Because that was the all-time highs in December of 2017 and almost uh essentially the all-time highs in 2021 almost. Um and then it was all-time highs of November of 2025. So, when it came in and it hit that area again, I was like, \"Okay, that makes sense to look for shorts, you know, in this area because it's such a big resistance, right? And if we have such a big support area on other coins, that's where I want to be getting in where things just make a lot of sense to me. But if something's in the middle, like how I just showed you some of these coins are in between the resistance and the support or the highs and the lows, that's not a really good area for me to take a riskadjusted trade in. So, I'm just going to be waiting until coins come into these really big areas. The same way how XMR came into this really big area and printed a short setup. I'm going to be doing the same thing for longs and shorts for a lot of different coins. Of course, anything could change at any moment, but right now, I still think it's the time to be back testing strategies, creating new strategies, getting really clear with whatever you're trying to do in this market, and not FOMO into anything or rush into anything too quickly just because we get some pumps in the market on coins like Pepe and some other meme coins. And so, those are just a little bit of my thoughts on the market. And with that, I'll hand it back off to you guys. Cool. So, don't FOMO. Don't FOMO again, guys. And if you want to catch a bit more of Lewis, he's actually going live for his first time on the trading channel late today. Later today. Yeah. Later today. Yeah. So, in the next two, three hours. So, you guys go and if you're not subscribed yet, go and subscribe to the bureau trading channel and yeah, Lewis is going to extend that alpha over uh for you guys exclusively on the trading channel and you can maybe go and ask him some questions there live. So, go and check it out. How is it, Nick, that Mondays get such a bad rap when nowadays you can watch not one but two coin live streams on a Monday? I know. Crazy, right? It should be the best day of the week. Exactly. Monday is the new Friday. What a way to kick it off, right? Market should rally in in response to that. I'm I'm baffled as to how people can be so negatives about negative about Mondays. Okay, let's have a look at some of the tweets of the week then. So, first up, we have this one from Blockgrave. Uh, if you didn't nail the whiff to Zerro to fartcoin to silver to Somali daycare owner rotation, then just pack it up, man. Crypto isn't for you. I mean, it was pretty obvious, right? So obvious, man. Of course. What's the next rotation, man? It's definitely Somali daycare. Absolutely. You know, absolutely. Come on, guys. You got to you got to pay attention. You got to lock in to to the insider to the uh going long Maduro being captured before on Poly Market. Like that's the next rotation guys. You can't even do that then what are you doing this game? Absolutely. Absolutely. Um okay. Uh next up we have uh this one from uh Nero. Hot take that is not hot at all. 2026 winners equals 2025 winners. Per prediction markets privacy. The three Ps. I Yeah, it's not really a hot take at all. I think it's I think it's likely to play out like that because you in in the sense that momentum is a strong force. First of all, PES are one that on the top of the revenue meta. It seems to be long DJ gamblers, right? Which is seems to be this now financial financial nihilistic sector. We're in prediction markets because that is also where a massive product market fit is with users right right now. look at with this valuations of some of these prediction markets and the volumes and the news and then privacy because I think that there's always especially in the state in in a era of state surveillance and lack of financial privacy CBDC's and everything privacy coins are still catching a bit. Yeah. And there's still there's a lot of development work going on in the privacy sector. I think, you know, I think we've discussed I don't know if we discussed this in last week's stream or maybe I was um discussing in the Coin Bureau Club Discord, but it seems probably more like, you know, privacy as a service. I'm not I must say I'm not enormously bullish on kind of older, you know, legacy privacy tech like Zcash and Monero, although, you know, they could both theoretically do well. I kind of feel that we now, you know, it's going to be privacy solutions that are very institutionfriendly, that are very compliant. Yeah. Um that could be the big winners of this year. So, uh we'll be keeping a lookout for some of those as well. But, um yeah, the three Ps. I I can see all three of those doing well this year. Okay. Next up, ZeroX Sweep had this to say. Someone in crypto can grind for months, lose hundreds of hours of sleep, get rugged 27 times, go broke, go insane, and still wake up believing that the future will be amazing. I mean, first of all, only 27 times rugged for months. First of all, this is not months. Secondly, it's not only 27 times, but I think to be fair, you know, it costs nothing to believe. There's no investment to believe apart from your sanity, your hopes and dreams, which is not monetary value attached to that. though, you know. Oh, good old Bojack. He just Yeah, just wakes up and carries on. Yeah, it's Today will be different. Today will be better. Today will be a better day. Today I'm going to not going to get rugged and lose some money. Better turn up for my shift at McDonald's. Um, okay. And we also have this one from Cipherstein. Um, Cipherstein. This is Ilia Likenstein. Yeah. So, if you guys don't know who this is, he was the infamous Bitfinex hacker who was married to the the crocodile of Wall Street rapper Razel Khan. Raz Khan's Razle Khan's husband, the guy who hacked Bitfinex for billions and billions of dollars and was living in plain sight in New York on OS. Yeah. And he he was sentenced and he spent I think three four years in prison, but now uh he basically has been freed. I am not familiar with the First Step Act. Thanks to President Trump's First Step Act, have you heard about I have not heard about it. I assume it's some sort of an act that gives basically whoever donates the biggest campaign gets uh you know, possibly. Yeah. Um I remain committed to making a positive impact in cyber security as soon as I can. Okay. To the supporters, thank you very to the haters, I look forward to proving you wrong. I mean, that sounds like a bit of a threat, doesn't it? That sounds like it. Yeah. I mean, this is this is such an odd point we're at in history. Going to go and start consulting with the Lazarus group. I mean, would you rule it out? Would you rule it out? Like, we're now at a point in history where someone gets convicted of a very serious crime, spends, you know, does a little bit of time for it, and then just comes out and starts like, you know, and then goes about kind of building their social media profile again. Oh, SPF soon, bro. I wouldn't count I wouldn't count that. I tell you the day if if SPF is pardoned, I'm leaving this industry. That that I can promise you. Um, yes. So, uh, Ilia Likenstein is back. Will we be hearing from Razle Khan again? Maybe she'll be start releasing new music. Performing. Exactly. She's going to start performing. Go on a world tour, you know. Okay. Okay. Well, you know, if that doesn't scream bull market, I don't know what does. Any dates for the diary? Really? One important one I think is Friday which is the n first non-farm payrolls or employment report for this year. Uh the expected number to watch is 54,000. Okay. Yeah. 54,000. All right. Okay. Um shall we So are we going to are we going to close out the trading? Close out the trading competition. Now firstly we need to know we've still have the Bitcoin trade on from last week. Right. We do. So what is the value of that portfolio right now? Okay. Let me uh let me add this to the screen. Uh is that uh that's Lewis. Where am I? Um so is this us? You got me. Ah yes. Okay. So here we are uh on the BitGet terminal. Um and the full uh portfolio. Hang on. If I go to assets, that will tell us uh we are in Bitcoin and the value of that is $4,92147. That's impressive to have lost virtually nothing. Well, you know, like a few hund few like $80 something. So, if I get my if I get my premium maths brain on that, that's something like $78 we've lost. Is that $78 and a few cents? No. Um okay. Uh who let guy have the controls? Yes, thank you Brad. Um so congratulations guys. Uh you have managed to almost break not lose any money almost break even which is yeah which is crazy because like I said at the beginning the bitcoin last bitcoin in Q4 was down 20 something% 23%. So it's it's basically maybe some of the altcoin tried states they put on also because they didn't full ported at the worst times bitcoin performance and they full ported the performance. they full ported Bitcoin when we did have that that performance up. So we close to the entry point of the portfolio which is great. So better than most people are in crypto. Uh so so essentially now in terms of deciding on the winner uh we need to match up the UID you guys have used and traded with on Bitgget with you who's watching the stream. So if you're watching the stream right now and if you're watching this post and you do have that Bit Bitgget account, can you please email this specific email? It's bitlivecoinbureau.com. We'll put it on the screen as well. So bitglive@coinbureau.com. Email us uh your obviously use the subject line bitkit competition coinbureau with your bitket unique user ID. So it's your user ID number which you'll find in your account details. And then what we will do is we will then go and confirm that you of course do meet the criteria in terms of they have an account and you've traded. and then one of the w one of the individuals who's emailed in, we will then let them know they've won and then announce the winner in the stream next week. So there we go again. Bitgatlife.com, bitglifecoinbau.com. Email in, let us know it's for the competition, your UID as well, and our team will get back to you, confirm that, and then yeah, hopefully one of you guys luckily going to have $5,000 of um dry powder to start the trading year with. Absolutely. That would be a good start to 2026, wouldn't it? Um, yes, that UID number I think is about 10 10 digits long or so. And as Nick says, you can find that in your portfolio and they give you the option to copy it as well. So, email in there. If you if you don't put the UID number in, you ain't going to win it. Okay, that is very important. Um, so Nick, do I have your permission then to sell out of uh of the of the Bitcoin in the portfolio? Stable that bad boy. Stable that. Okay, I am going to do that now. Uh, make sure I'm doing a market cell. Uh, we're going to sell the lot. Boom. Confirm. It is done. It is done. Well done, guys. Well done, guys. Yeah, we uh we we almost broke even. Better traders than most in crypto. I'll tell you that. Absolutely. Because because they watch Coin Bureau. There we go. Exactly. Exactly. Okay. Um so, uh I think that's about it for this week. Let's just have a look at some of the comments. Um, why didn't we know that it was Crypto Machinery's birthday a few weeks ago? Yes, congratulations, Crypto Machinery. Just just to remind everyone, it is not my birthday today. Um, but uh, as someone pointing out, we celebrate anyway. Yeah, I mean, it's it's someone's birthday somewhere. Um, wow. There we are. Uh, okay. Someone um, we are we always like to hear where people are calling in from. Hello from Greenland. Okay. Okay, bro. It could be things could be about to get interesting there as well, right? Yeah. And um discovering Florida 67. I predict a year where humans intentionally go offline and back to basics. That would be good. That's what we need. But I think predict a year that's not going to happen. I mean, unfortunately, that's but that's much needed. A digital digital detox is required for everyone. Absolutely. The thing to do is to go offline for most of the week and then come back online just in time to watch the Coin Bureau weekly news show and maybe Lewis's uh live stream on Coinb trading after that and then go back offline for another week. That way happiness lies. Exactly. That's all you need to know about what's happening in crypto to be honest guys. That's the only creators you really need to watch to be honest. Uh a couple more. The uh the Fed chair role is worse than being a Man United manager. Bit of a poison chalice. Man United have just sacked their latest manager after why he was there for about a year I think. Um but uh yeah it wasn't a success. Um and then Liz is feeling cynical question. Anyone else find it suspicious that many oil related companies ripped on Friday hours before the events of the night. Liz in a word no no totally expected. I would I would have been surprised if it didn't. Like there's literally someone who knew that there was going to be arrested on Poly Market the day before. So, I'm pretty sure there was inside trading going on across the board everywhere and anywhere. And you know, it's just crime is legal, guys. Yeah, inside is legal. I It would be very interesting to go back and um uh to to see what Poly Market was saying before it like I can't I I haven't heard of any big bets being placed on sort of Venezuela related stuff, but I mean it wouldn't surprise me at all if prior to the event. Yeah. Yeah. No, there was a story about this guy who placed a 30 He he placed a $30,000 trade on a freshly funded account and he made like $400,000. What was he what was he? Um was the major major was going to leave president. He was the majura was going to be ousted or something prior to Jan end of January or something crazy. Yeah. So there's lots of accusations now that it's insider trading going on because it how else would you have known that and put such a big bet on just that and freshly funded account. Donald Trump. Of course, it's going on, guys. We know it's going on. It's just like, okay, accept it. You know, you're not a party to the inside information, unfortunately. Yeah, people. Yeah, people uh I think very much agree with us in the comments. Not surprised at all. And um uh Sir Nakas Taco says, \"I totally digital detox at least once a day in rural Texas.\" Sounds wonderful. Oh, man. Beautiful. Well, you can start today's digital detox about now because that is all we've got time for this week, folks. But as Nick said, uh Lewis will be going live over on Coin Bureau Trading shortly. Lots more videos coming to you from our main channel here from Coin Bureau Finance, from Coin Bureau Trading, etc. So, we are starting 2026 as we mean to go on as with a bang, guys. With a bang. Exactly. Exactly. Thanks everyone for tuning in. Uh let's hope it's up only from here. See you next week. Cheers, guys. [Music] listening to the banter. What's up, guys? Nick, appreciate you guys and thank you. Great channel. Happy New Year. Informative. Great day, guys. Happy New Year. Spot on impersonation. Great channel. Happy New Year. Informative. I mean, so you know, if everyone's just going to digital detox, maybe we just need to pivot to maybe Could we pivot to gardening? Coinb Garden. You've taken the touch grass thing a bit too literally, guys. I think this is what people want. Gardening bureau. I Well, not everyone has an interest of the garden as much as you do. But they will. It's not like they will once they start content. best."
    }
]