[
    {
        "video_id": "fEWD6EzGuGo",
        "title": "Palantir SOARS Overnight and Shocks The Market!",
        "published_at": "2026-01-05T04:33:01.000Z",
        "sort_date": "2026-01-05",
        "url": "https://www.youtube.com/watch?v=fEWD6EzGuGo",
        "views": 5718,
        "duration": "00:10:03",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. I hope everybody is having a good day and had a great weekend after we saw the geopolitical tensions that we saw with Venezuela over the weekend. It's going to be very interesting to see the volatility that comes into the markets this week. Nonetheless, though, Palanteer is absolutely soaring right now in the overnight session on Robin Hood. We're going to be talking about possible reasons why and we're also seeing a lot of other of the individual stocks that we've been covering on the channel catching a bid right now as we speak. On top of that, we'll be talking about some of the major macroeconomic pieces of information that will be released for the market this week. And cryptocurrency is it catching a bid? We're continuing to see a little bit of some Sunday juice coming in. That's typically followed by a sell-off. But could this time be a little bit different because things are starting to stay a little sticky with possible support lines forming. Who knows though? If you're a new or returning viewer, hit that like button, subscribe for daily videos, and follow me down below on X. Trying to talk with you guys more on a frequent basis. And if you want to get my type of ideology before these videos drop, pop it up on the screen here. Palanteer closed or closed on the actual day uh at about 169 and we had talked about this basically 168 169 and it lost that 170 support where it's sitting at right now is at 17457 up about $771 which correlates here to 4% and recaptures its 50 moving day. Now on Friday's video we had talked about that Palanteer basically um had a ton of selling pressure that we saw a ton of calls being sold puts a lot of pressure against it in terms of a push down and it lost its critical support level of 170 and that has been a long consolidation kind of support area for Palunteer as we've seen Palunteer does like to hang out between the 170s and the 184 and if it hangs out in that area that's where I'm typically personally comfortable for Palanteer. uh to not experience further breakdown. What you see here is a very strong reversal, a large push up. Now, could this likely be due to some of the investors type of, you know, um stipulations with the current geopolitical tensions. Uh right here, you can see this on X, you know, people saying, well, I'm not selling a single Palunteer share. And I've saw this also with, you know, with the capturing of this uh uh political leader here. What you've also seen with um Palunteer is a lot of different ex uh tweets basically talking about this is why Palunteer is so highly valued. So a lot of investors here seem to be betting that Palunteer had a lot of involvement with this specific event. And on top of that, you're also seeing here defense stock just due to the volatility and the craziness from geopolitical tensions that we've already had in the first few days of 2026. Uh for anybody that thought 2026 was going to be boring, it does not look like that. Uh you can see defense stocks here, AI defense stocks, drone stocks, those could all be catching a bid. It could be a major theme. It'll be interesting to see depending on how tensions play out. Now, specifically here with Palanteer technically, I like it right here at 175 basically up about 7 bucks. Um great to see here in terms of earnings. We're going to start to have to talk about that cuz earnings is coming out in a little bit less than a month. uh February 2nd. It's estimation right here at pre-market uh with an revenue estimate of 1.34 billion. And one thing that I do like right here for earnings per share revisions in the last 90 days, we've had 21 actually in the bullish direction and zero in the bearish. So that is very cool to see in terms of analysts. I keep expecting Palunteer to increase their revenue estimates with earnings per share here normalized at 23. Now, one thing that we should also be taking a look at are futures. SPY futures right here up about 83 cents. They're just basically relatively flat. Uh you see green here 0.12% not making any huge moves. We had the index that somehow found its way to close in the green on Friday session right here after experiencing a little bit of a sell-off here kind of from the 6900s back to this lower end at 6830 and closing right here at 6858. So, we'll kind of see how the general market, you know, outside of Palunteer, how the market's going to open up and what type of a move are we going to have because really the SPY is not showing any huge indications for a specific direction, at least to me. Um, but nonetheless, the index in terms of the broader market as a whole at that 6,800, you know, there is a decent amount of support there at that level. Could definitely be tested again. And so I guess we'll just see what happens and what other type of events will unfold that could help with catalyst and moves within the specific market. Uh looking here stock futures like I said really not making a ton of moves. Uh you know a lot of interesting different opinions on this depending on the side uh about the whole you know was this proper was it improper blah blah blah. I don't really get too involved with the politics. This is not a political channel. Uh I'm more looking how is the market going to react. I more care how is the market going to price us in? which directions are going to go so I can be prepared. Uh, you know, President did Trump, you know, Trump did assert that the US is going to occupy basically the country and uh once it's kind of back on its feet, have a fair share of kind of power back to the people that do need to um operate it. You see crude prices here slip, you're going to see a lot of drama. It's probably going to pop up around with oil, all this talk about oil, oil, oil, oil. We'll see what happens. Uh especially with the reverse the reserves that Venezuela does have. Now, that could have some impacts on the macroeconomic environment. And speaking of the macroeconomic environment, you know, what are we going to be having here? Not a ton of information on Monday and Tuesday. We'll probably be seeing more of the Venezuela stuff type play out. Uh Wednesday though, you're seeing here ADP employment. Uh it's going to be coming out for December. Uh you also are going to have some key earnings. We're going to see job openings and labor turnover for November. It's going to be important on Wednesday. uh just kind of giving us more key insights on the labor market as we've seen signs that has kind of been weakening and that's been a fear that's kind of been you know hanging over our heads within the market and then follow here by Thursday and on Friday you're going to be getting consumer credit and US employment report. So lots of job and labor data that's going to be coming out this week which will be important to kind of help justify some of the valuation some of the moves that we're seeing in the market. It'll be interesting to see. Uh on Friday, what we did have also on top of that was a bid and a lot of these more kind of riskier growth type speculative names experiencing a large selling sorry a large uh amount of buying pressure compared to the MAG 7. We saw rotation kind of into some of these names and specifically with the data center stocks right now. I am liking personally in the short term uh cipher right here. Cipher above its 15. 200 currently up another 2% in the overnight session right here up at 35. INEN right here up about another dollar. Uh currently at 4369 and the nice thing about IEN right here um it's recaptured kind of this $40 level of support which was a triple bottom that was invalidated before we saw a reversal right here at 33. So you know Ian here is recapturing these important support levels. Could we see a type of a move here? You know, it's interesting to see especially with SoFi here catching a little bit of a bid and not really moving a ton, but at 2751 here. So, you have SoFi, it's also back above its 50 and it's 200 depending on how I think the macroeconomic situation looks here. I think in some of these more speculative names that we've been, you know, checking on the channel here, Cipher, INBUS, uh we have Nvidia that is currently sitting at about 190. Nvidia also back above its support and moving averages. So, I like the AI trade right now as we speak and especially the AI data center trade for the short term. Uh, let's talk about cryptocurrency right here cuz that's a big thing. Oh my gosh. Bitcoin right here at 92800. Uh, Bitcoin I think touched 93 for a little bit with a little bit of a rejection right there. But nonetheless, Bitcoin holding above 90,000, even 91,000 right here and Ethereum holding above 3,000. Now, I'm going to take this with a grain of salt because every time over the last month, we've seen Ethereum even touch above 3,000, it's immediately fall back to this kind of 2900 uh support area. Um, we'll see what happens. But with Ethereum and Bitcoin, they're kind of back above some important moving averages, too. Apparently, it seems like the reaction to the whole geopolitical conflict, crypto likes it. Uh, we'll see what happens, like I said, when come market open. But nonetheless, this is looking typically pretty well, especially since we've been covering BMR recently on the channel. And BMR has just been getting beat down recently. But BMR is up about 4% right now. 3246. It's where it's currently sitting at. You also have Tom Lee, uh, as we know, a huge, huge supporter of BMR is going to be coming in tomorrow. So, we'll see what kind of some of his remarks are talking about the recent price action. We'll be covering that and kind of giving the results of that and my impressions. uh talking about in CNBC here. Uh looking at kind of Bitcoin um and you have Ethereum. Uh personally I don't have any involvement in Ethereum right now. I was invol had some positions in BMR but don't have any of those currently. We'll see what happens. Uh Bitcoin I do like ASST right now. That's kind of a leveraged play on Bitcoin that a lot of people um specifically retail does like and it's all over X right now. So I do like that as just kind of an exposure to Bitcoin. So we'll see what kind of moves happen here. Um, and but specifically, uh, other than that, I think more this is going to have a major move. Um, you know, depending on where it could go, but right now, the futures don't really seem to know where to go with it. What do you guys think about all this mumble jumbo? What do you think about palenteer up here? You think it's back? It deserves to be back up here in the 175s. Um, what do you think it's hoe, you know, opinion regarding its valuation and stuff like that? Um, other than that, peace out. Take care and I hope you guys have a wonderful start to your week."
    }
]