[
    {
        "video_id": "M4Q7mxMrPqQ",
        "title": "The Exact Date of Next Stock Market Crash",
        "published_at": "2026-01-05T14:00:06.000Z",
        "sort_date": "2026-01-05",
        "url": "https://www.youtube.com/watch?v=M4Q7mxMrPqQ",
        "views": 48096,
        "duration": "00:24:14",
        "transcript": "The Federal Reserve just announced they're printing money again. Not like in the future, not next quarter. No, they've already done it. They've already started $40 billion every single month. Plus, they shoved about $75 billion on the last day of the year properly into JP Morgan. Now, that's a silver story. We're not going to cover that one today. But why is nobody talking about this? Well, everybody's distracted by the headlines. SpaceX is preparing for a trillion dollar IPO. Open AAI wants a trillion dollar IPO. The biggest private companies in the world are all rushing to sell you their stock at the exact same time. And this exact pattern has happened twice before in the last 25 years. In 2000, the NASDAQ crashed 78% if you recall. And then in 2021, 95% of IPO investors lost money. So, by the end of this video, you'll understand exactly why the Fed is printing, how it connects this IPO frenzy and the precise timeline for when this party ends. So, you can position yourself to profit instead of panic and then you can be as chilled as Winston back there. You did all the research for this. Thank you, Winston. Takes it graciously. Now, you might be wondering, why should I listen to this golden retriever? Well, golden retrieves are quite smart. Now, my name is Felix Pin. I used to be an investment banker. I'm also the founder of the go academy. We've taught over 20,000 students. I'm also the co-founder of tradevision.io. And um that gives you insane quality news and data by the way. Wall Street level data, which is what the point is. And what my mentors taught me, my Wall Street mentors taught me is what got me here. It's what got me retired. And it got me from corporate, you know, working every hour of the day to hanging out with this guy and having a lot of fun and sharing this with you. So, what we're covering here in the next 30 minutes is this. Why the Fed just reversed courses start printing money 40 billion a month. How the banking system really works and why it's in trouble and why trillion dollar IPOs are a massive warning sign. And then the exact timeline for the market cliff, how to position your portfolio right now. So, let's jump straight into it. As most people missed, um while everyone's talking about interest rates and so on, the Fed made a much bigger move. The Fed started something called reserve management purchases, which is a really creative way of saying we're printing money. How much? 40 billion a month. That's 480 billion a year. If anybody's keeping score and the simple explanation, okay, imagine imagine your town's bank is running low on cash. The Federal Reserve, the bank for all banks, notices this. So the Fed creates new money. that make it up and then they use that new money to buy bonds from those banks, those banks that are a little bit in trouble. Now, those banks have free cash to lend out. That's that's sort of the the theory here. Now, Fed Chair Jerome Powell will tell you this is not quantitative easing, which is the what he used to call it. He'll say it is just a technical operation to manage bank reserves. And technically, he's sort of right. They're buying short-term bills, not long-term debt. But why does this matter? The Fed's balance sheet is expanding. It's been shrinking for two years. So, they've been removing money from the system. Now, they're starting to print money again. And bank reserves at a 4-year low. The Fed's emergency lending window hit a record usage. Some crazy stuff happened at the end of the year. So basically in plain English, banks were running so low on cash they had to borrow emergency money from the Fed. Typically a stress signal. So the Fed panicked and they started pumping a bit more money into the system. Wouldn't want those gold shorts at JP Morgan to go, you know, without an hour, would we? Now you might be thinking, okay, if the Fed's printing money like this, isn't that good for stocks in the short term? Yeah, absolutely. I mean, we're excited. We're excited to make some money. More money in the system pushes asset prices up. Sucks if you're a salary slave because well it's going to inflate away your earnings. But because the bo but because the banking system was showing cracks that's why they are pumping this money in there. So there is a negative reason for the positive money printing. Hear me for less than a minute to explain how banks actually work because it isn't intuitive. It isn't logical and I think it's really really important. And then we go into these massive IPOs and then we go into how do we position ourselves uh for that. So once you understand this all of this will click into place. Let me ask you this. When you deposit say $100 into your checking account, big investor you. Where does that money go? Well, most people think it sits in the bank's vault or something, right? Yeah, it's my money. The reality is it is not your money. The bank immediately lends the money out to somebody else. That $100 goes to someone else. They now have that $100. So imagine, okay, let's break this down even simpler. Imagine you give your friend Sarah $100 to hold for safekeeping. You have $100, right? She says you have $100, but Sarah turns around and she gives $90 of that to your neighbor, Tom. I should probably write this down, shouldn't I? So, you give a $100 to s Sarah. She gives $90 to Tom. Now, something magical has happened. You still have $100 in your account with Sarah, right? You can check the piece of paper she gave you, which is what the banks do. Tom has $90 cash in his pocket, which he can actually spend. So, the total money in your neighborhood just grew from $100 to $190. Do you follow? Do you follow that system? This is called the fractional reserve banking system. The bank keeps a teeny tiny amount of money, the fraction of your money, and they lend out the rest. Now, here's the wild part. Since March 2020, US banks have been required to keep 0% in reserves. Zero. Banks can legally lend out every single dollar you deposit. Now, you're probably thinking, \"Wait, if the bank lend out my $100, what happens if I want to withdraw it?\" That's the question. Bingo. The bank is betting you won't. They're betting that on any given day only a small percentage of people will want their cash. And they're usually right. But what if everybody wants their money at the same time? What if there's a panic? Well, that's called a bank run and the whole system collapses. You might remember Silicon Valley Bank from 2023, which was not, you know, a long time ago. This is less than two years ago. Tech startups got a little nervous. They started withdrawing deposits. The bank didn't have enough cash. They had to sell bonds at a loss. Word spread on Twitter. They were still called Twitter back then. More people panicked. The bank collapsed in 48 hours. That was the 16th largest bank in America, gone in two days. So, what am I telling you? Is someone just spreading fear and that sort of thing? No, but the Fed printing money. $40 billion is not about helping the economy. It's about preventing bank loans. It's about keeping enough cash in the system so banks can meet withdrawal demands. Now, how does this work? Okay, so the Fed prints money, the green stuff, right? What happens with that money? It goes into banks reserve. The banks therefore feel safe and they're going to obviously do what they do. They lend the money out or you know short silver. So what happens? There is now more money about. What happens with more money? There's more money about. Well, asset prices go up. Money will always seek a return. So stock prices go up. Real estate goes up. That kind of thing. So the stock market rallies. What happens when the stock market rallies? Well, IPOs, founders and investors are rushing to IPO at the top of the market. And that's exactly where the story is going. And that's exactly how we figure out where we want to be more cautious and where we want to take less risk in this coming in this this year. Even it's not the coming year, is it? It's this year. For instance, says you don't even know what time of the year it is. I know. Okay. Before we jump into the trillion dollar IPO frenzy, I'm gonna do something even better for you. We're gonna run on the coming Saturday, I think it's Saturday. Um, he'll remind me a live training on how to pick great stocks in 2026 and how to make better investments potentially in 2026. So, we're going to take all the the reset, the money printing, the inflation, all that stuff, the IPOs, all that, and we're going to package that together into what is actually a sensible strategy. What is Wall Street telling us we should be doing? We're going to be doing that as a live training. Simple rules. Uh, this is intended for beginners. If you're more advanced, I think you'll still learn a lot and it's free. It's felix.org/weinar. There's a link down below. Grab yourself a seat. Last time we did one of these, we had like 6,000 people uh sign up to it. So, do it early till the room fills up and show up on time and we're going to have some fun. But let's talk about the elephants. The elephants in the room. The biggest private companies in the world are all preparing to sell their businesses at the same time. Got SpaceX, trillion in a bit, right? Elon Musk space company. They're apparently preparing for an IPO in 2026. And we have, by the way, yeah, a trillion dollars, by the way, is about 60 times its estimated revenue. Just saying. also bigger than the entire economy of I don't know Indonesia be the largest IPO in history um we've got open AI the chat GBT guys they're also targeting a trillion dollar valuation potentially also in 2026 and it's the hottest company AI right but if it's such a long-term investment why are the early investors so eager to sell to you never mind moving on we got data bricks 134 billion apparently valuation expected to go public in early 2026 15,000 customers 50% revenue growth year-over-year this is actually one of the more reasonable valuations on the list but even reason valuations become unreasonable I mean everyone's buying it and then we got anthropic another AI rival to chat GPT cla is what they do it's pretty good actually and um about 350 billion as well we have we have others we have anal um another company I am a big fan of not necessarily of the valuation That's about a 30 billion defense contractor. But do you notice a pattern? They're all AI or tech companies. They're basically all AI companies really sky-high valuations planning to sell themselves in 2026. Basically all rushing to the exit at the same time. So why would all these smart founders, and these are really the smartest people in the world, why would the founders and the early investors want to sell it now? Because they're reading the same signal I'm showing you. Let's go back to our imaginary friends. Number Sarah, which is a lemon lemonade stand. Let's say she wants to sell shares of her lemonade business to the neighborhood. When do you think it's the best time to sell for Sarah? Or when it's summer, right? And everyone's thirsty for lemonade. When people have money to spend, when everyone's excited about lemonade now, when nobody's worried about winter, might be another way of looking at it. So, when's the worst time for her to sell? January, probably. But nobody wants lemonade. People are broke, so just spend everything on Christmas. And when everyone's scared about the future, it's dark out there. Company founders and early investors are smart people. They're some of the smartest people in the world. They wait for the perfect window. Stock prices are high. So you're in a bull market. Investors are optimistic. Money is flowing in. The Fed's printing it. Thank you. Valuations don't really matter anyway because this time is different. Right? This is called market timing. And history shows they're usually right. Now the problem is that perfect window is often right before the peak before everything reverses. So let me give you two movies where we've seen this before. The dot bubble. I started investing in 1999. That was not good timing. That was a bit harsh. Um there were, wait for it, 457 IPOs in 1999. They all had.com in the title. That's really all that mattered. And it was an insane place. The stocks were doubling every day and companies with zero revenue were worth billions. 86% of these IPOs were losing money. Nobody cared. It was the new economy. This time's different. You tool you don't understand it. You know that kind of thing. The internet changes everything. The old rules don't apply. You know, bit like what you can you can replace the word internet with AI right now. So the NASDAQ, well, it went down 78% which was not pleasant. Lost $5 trillion in wealth. Pets.com, web van, e toys. Do you remember these names? Anybody remember them? Put in the chat. Um, they disappeared, right? Little bit closer to home. 2021, the Fed printed $4 trillion. So, tech stocks went nuts and we got new IPOs. We got things like Roblox. We got Bumble. We got Rivian. We got Coinbase. Everybody was very excited. Rivian raised $12 billion dollar with practically zero revenue. It was worth more than Ford and General Motors and ear basically no revenue. Why? Well, it was the next Tesla. You could have just bought Tesla. That's a different story. I was guilty of getting caught up in some of this myself. Now by 2023 only 5% of the companies that listed were trading above their IPO price. Read that again. 95% of people who bought IPOs in 2020 2021 lost money. So the IPO frenzy wasn't just coincidentially near the market top. It was the top. And right now we're staring at the biggest IPO wave in history. So why would you think this time is different? Let me connect all the pieces for you. Three stages. Stage one, you get a bit of economic weakness. The economy slows down a little bit. Banks need more reserves. That just happened. The Fed starts cutting rates. They've been doing that. The Fed then begins injecting money. They print money. That's where we are right now. Right? This is us now. Right. The stutter is going to get me a banned, isn't it? That that's a joke stutter, by the way. Apparently, it isn't funny. I've been told many times. But then, you know, I'm German. I'm not meant to be funny. Stage two, you get the money party, the liquidity party. New money floods in. Stock prices rally really, really hard. Valuations go up. PE ratios go up. Everybody feels like they're genius, right? Risk assets like the the meme nonsense goes to the moon. That's where we are beginning to go right now. And that means we could go much higher. So I am almost fully invested. Why? Because I see this market going much higher. midterms coming up. We've got money printing. We've got lower interest rates coming in, right? Inflation's going to go down because of what? Well, Venezuelan oil will help in about two years. Um cynic and um actually my Venezuelan friends are very happy about it. So, I hope it's a good thing for them. Hope they get the stability and the peace that they deserve. Um what was the next thing I was going to mention? Oh, yeah. AI is going to make stuff cheaper. So, inflation is actually going to be a deflationary problem, but that's a whole another topic for another day. Smart money right now is seeing the peak coming. Private companies are rushing to do the IPOs with crazy valuations and retail investors, you and me and that guy, we buy everything, right? Because uh we want to be early. We want to did you get into the IPO? How much did you get the IPO? Are you buying the IPO for No, don't. Just don't bother with IPOs. Why? Because the music stops after them. So the IPO wave is being announced. It hasn't happened yet. So what are we watching for? Well, it says Q 2025 right now. Um, that's smart, isn't it? Um, it is it is January 2026 as I'm recording this. I think the market's going to go fair bit higher. Money printing, all that stuff is going to be good for us. I think it's likely that the the the beginning of the year is going to be quite good. The first major IPOs will be good. Excitement will be at peak levels. Valuations are all going to go gaga. And that's the danger zone right now. 6 months, this is something most you don't understand if you ever done any venture capital. The real pain point is there's something called a lockup. So after the IPO, you have six months in which you cannot sell. If you were an early investor or a founder or or an employee of these companies, that means 6 months after the IPO, those guys start to sell. That also then brings us into midterms which could be a big wobble depending on how they go. So I'm looking at a late 2026 cliffish and quite frankly I love those. Why? Because it's an opportunity. It's an opportunity to buy the better companies at a lower valuation rather than panic about what could have been. Now there is also something in the presidential cycle, right? So we're in in year two of presidential cycles. Usually not a great year for the market. um a lot of uncertainty around midterms and and and that sort of thing. Usually a realization that the new administration doesn't do anywhere near as much as we thought. Although they kind of proved us a little bit wrong on that over the weekend, didn't they? Uh that was that was quite something. Um the oil majors are rallying as I'm recording this, which makes a lot of sense. I put a whole list of companies who will benefit from this on on my my ex account, by the way. There's an article over there. Um I put out the the day they they nabbed the the bugger. And then in year three, typically you get a much better market performance of the presidential cycle. So just just a bit of data. It's been 90% accurate since 1933. I'm not saying past performance guarantees future performance and so on. Especially with uh this president you got in there because he's a he's a little bit unusual one. So what's the playbook? I stay automated. I have stops on all positions and I keep my position sizes relatively small. Although I'm not a fan of selling winners too early, but we have stops on everything. Um, start looking at the higher quality companies when they become cheaper. And we're already seeing that actually. Some of the big tech companies are looking pretty reasonable right now. Uh, AR K is sort of a canary in the coal mine. When it goes up a lot, this is Kathy's little thing. When it goes up a lot, I I get worried. When it starts falling, I I I I think I think there is some opportunity coming up. Um, but yeah, watch for the major IPOs. If you get huge popups into in price the day after they they list, that makes me worried. And when your barber starts talking to you about your Space X stock or his, then you should start getting worried. And if the Fed stops printing money, quite frankly, we're really in trouble. I I don't think that's going to happen, but could happen. And when you start seeing the ARC ETFs, so the the the looney bin of stocks falling or the S&P holds up, that tells you the market is leaving risk and is entering reliability. And that's kind of the pivot we generally want to want to want to fall. Um how what do I do? This is my to-do list, my don't do list. It's not yours. You got to like use your own brain and so on. Um I don't buy IPOs. Actually, I just don't buy IPOs. That's simp simply the reason and I tell you why. There are about 5,000 stocks listed in the US give or take that I could buy for which I have years of audited returns um proof that management is doing what they they said they were going to do or not and I could buy any of those in any given day. So now you're adding one extra stock and you're saying that extra stock deserves my attention more than the other 5,000. It just doesn't make any sense to me. The riskreward is the greatest. I always ask myself, why are the insiders selling? Why are the investors who are the smartest people in the world, why are they selling to me now? Why have they decided to honor me with being their exit liquidity? As in I'm giving them the money so that they can go off and buy another island. Um, so I'm not a fan of IPOs. So I just say don't get caught up in the FOMO. Doesn't matter if you miss things. If you invest for a long time, you realize it's a wonderful world. There more opportunities you can ever take advantage of and you will miss out on most of them and that's perfectly fine. Um, look at valuations. 60 times revenue valuations will be which will be a rumoring ad right now. That's bonkers. It's not an investment in the short term at least. Um, SpaceX, by the way, I think is a personally a better business than uh than the open AI thing because I think I think all the AI basically do the same thing. So there's massive competition there. Whereas SpaceX, they've got I don't know what is it 5,000 9,000 satellites up there or something. That's a pretty hard thing to do. And um the US military is about to put their Starlink and and most planes and so on. So I think that's a real actually real physical mode just getting that many satellites up there. That's a hard thing to do. So I actually like that business better. So that valuation might make a little bit more sense down the road. And think about it, they could be the the internet service provider and the mobile phone service provider for the world without having to put up a single mast, right? So, kind of makes a lot of sense. This time is never different. Um, and please, please, please don't panic. Set at the bottom, right? There will be a bottom. I'm not saying it's going to be necessarily this year. I'm just saying there will be one. I think the likelihood that it's coming after these IPOs is very great unless the government gives even bigger tax cuts prints even more money and then we just kick in the can down the road. But it's a normal thing for the market to crash. It is a normal feature. It's not a bug. It's something you have to get used to. So at the moment the Fed printing is going to support the market. The trillion dollar IPOs will make get people very excited. We might get some really seriously higher highs in the market this year, but they are a warning sign. And there is a correction likely. I would say more end 2026. Depends a little bit I think how the midterms go. If if Trump loses his majority, that could be bad because it would prevent him from doing a lot of things. And the market generally at the moment likes Trump for being very market supportive, right? I mean, rare earths and and and and and all that stuff, right? um a lot of like money handouts to businesses essentially in terms of regulation and literal subsidies or or guaranteed prices and so on. So, if you want to come and join um this is not something we do anymore, by the way, so that's not going to work. But if you want to come and um check out our live training on Saturday, we will talk about how do we make 2026 a better year, what do we buy in 2026, how do we decide what we do to buy in 2026, I'll also walk you through some of the really cool tools um and indicators that we use internally. U go to Fenix training, grab yourself a free seat. If you enjoyed this video, if you felt there was some value in it, shock horror, then share it with a friend, share it with a golden retriever, and I wish you a beautiful, wonderful, successful start to 2026. And may it be the year where your investment really takes off because you are now smarter and better informed and better skilled. All the best. If you invest in the stock market right now, what I'm about to show you could either make you a fortune or cost you everything you've worked for in 2026. 2026 is shaping up to be a womson a decade."
    }
]