[
    {
        "video_id": "EEjz8116Aac",
        "title": "Why I’m NOT Buying the Bitcoin Pump (I AM BUYING THIS INSTEAD)",
        "published_at": "2026-01-05T09:05:41Z",
        "sort_date": "2026-01-05",
        "url": "https://www.youtube.com/watch?v=EEjz8116Aac",
        "transcript": "Oh yes guys, holiday is over. Back to work. You're back to work. I'm back to work. And guess who's else is kind of back to work? It's Bitcoin pump. Bitcoin pump decided to come back to work. We do have a bit of a pump here which may actually be the beginning of the relief rally towards the 50 moving average. We have to break this horizontal with confidence and close the week above it. And I have to be upfront with you guys and say that I am treating it as a bull trap. You can still make a lot of money in the bull trap. I will soon show you how. But long term, nothing has changed. long-term, we're not even at the 50 moving average. Long-term, we have to understand that Bitcoin is still bearish. It's in a bare trend, and we have to be conservative. But just like I said, you can still make a lot of money even when it is a bull trap even when it is a counter trend rally because look here in the last video, we did discuss the Peppa trade. Peppa was at 0.005. Now, it is 0.00 almost 7. Okay, basically it's a 50% pump from here after the bull trend happened. And of course, it's so nice to see when you guys are making gains based on the setups we share in these videos. And of course, Pepe is not the only coin that did well during the last few days. If you're part of Bulmania and you have the money scanner, which is included in your subscription, then you see all of these different flips in real time. And now we have a filter that shows us what flipped in the last week. You can also see what's flipped in the last day and so on so forth. But here you see Pepa up 53% since the flip. Lighter up 187% since the flip 5 days ago. Render up 41%. Virtual sport 33%. Bong 33. this dog on Bitcoin 32 maybe even Bitcoin is going to come back bit Bitcoin memes useless 31 and so on and so forth and the way to use this tool is that you go here on the filter and let's say that we go to one day this is everything that fle bullish in the last one day and then you can open the chart and you can see kind of what's going on here for example this thing just fle bullish and you can measure the riskreward for example let's say that we keep pumping where's the next resistance the next resistance is likely going to be here so you have 27% upside here and when you think about the downside if it goes down towards this uh this moving average, then you have a loss, a potential loss if you set stop loss right here at 9%. So, this is a good riskreward. And yes, guys, this is a way more superior way to trade versus just holding all coins and hoping that they will bounce. For example, if you look at Murad's list, you see that most coins are down a lot, whether it's Giga, whether it's SPX, whether it's Forestcoin. And I have checked all of them. These are real numbers. For example, you look at SPX is down 72% since the peak. Basically the same as in this sheet. So, the numbers here are fully correct. giga down 95%. And you know that if something's down 95%, let's say you had $100, it is now $5. For you to come back to $100, you have to do a 20x. And many people have this weird idea that you have to quote unquote deserve the pump. That if you don't hold all the way down, you haven't deserved the pump. But in reality, you just jump in when the trend flips bullish and you capture most of the upside anyway. Whether you do on the daily time frame or on the weekly time frame, you have massive massive absolute opportunity with the perfect perfect riskreward where you are entering in a confirmed bull trend, you're not catching a falling knife. And if something goes against you, let's say that this meme trend, I don't know for how long it continues, maybe a few more days, maybe a week. In case it stops, we're out. We're out. And that's how we capture most of the upside. If all of these memes go back to alltime highs, we're going to be part of that move. But in case they go back to zero, this is just a fake out. We're not part of that move. And in my very very humble opinion, this is the optimal way to approach this market. As we all know, these meme fugazis can pump a lot. So it's not smart to just say I don't touch memes. I'm not part of memes because I'm too sophisticated. Listen, you want to be rich or you want to be sophisticated because these memes, yes, they are for guys, but they can pump a lot. At the same time, we have to acknowledge and really see the truth in the eye and understand that yes, it is for Gazi. It's profitable for guys. Also, it's for guys that can go down 95% in a matter of months and destroy your capital. And you will be paying years and years and years of mental pain, financial pain. Your family can probably tell when you are in a bad trade, when your trades are going against you. Listen, they can tell. They can tell when you're more irritated, when you are more depressed. So, these these are serious things we're sick speaking about. And if you want to learn more about my trading philosophy, if you want to get access to the money line, the money scanner, and other tools within Bulmania, you can join Bulmania by clicking the link in the description, then watching this free video. And all of the instructions are going to be in here. Do it as soon as possible. If you recognize yourself and if you want to get out of this mess that you've created, because I've been there myself. I'm telling you all of this, not because that I see myself somehow above everyone else. I've been there. Listen, I know the pain. I know the pain. For the last decade, I've been in all situations. That's why I take it so seriously now. That's why I'm not messing around with a bare trend, guys. And another thing I have that may help you is this five-step framework, which is a free PDF you can get if you use the link below. And here you do a bit of self diagnosis first. You answer some questions here. For example, you sometimes skip trades because they don't feel right or your mood at home depends on how your trades are doing and so on and so forth. And then based on your answers, you can then see the five-step framework that fixes your trading. So check it out as soon as possible. This is how the website looks like for the PDF. We only give it to people who are our affiliate in one of these exchanges because affiliates is how we fund our YouTube channel. So select BBIT, for example, and then enter your UID. If you're not our affiliate in any of the exchanges yet, just click the links here. They're all partner links. If you register using our links, you will be an affiliate. Then you will be able to come here, click the exchange, write your UID, and if you have any questions, just email the support. We're going to help you as soon as possible. And I really want to highlight that the bullish setups we're speaking about all these meme coins they are for the short term. If you look longterm for example on the weekly time frame you do see that the bears dominate. Most of all coins are struggling a lot a lot lot. Celestia down 95% save 94%. So if you want to be taking trades on the longer time frames you have to be more patient here. If you are a trader you want to get in out maybe a week or two then yes then you can go to daily. Then you can see what flip bullish on the daily. And then you can see what's happening here with all of these different coins that recently recently flipped bullish in the last week or or a few days. But on the weekly, most of things are still looking very very bad. And on the weekly overall, you see that 86% of coins are bearish. and uh before they flee bullish, this is not a good idea to really bet long-term somehow accumulate because something that's down, let's say 69% can fall another 90% and be down 96% altogether. I mean, you can do the math here, but something that's down 67, it's still kind of okay because a lot of things, including Celestia, go down way more, way, way, way more. I also want to speak about the Bitcoin monthly chart because there is an interesting pattern that is playing out here where we had three red months in the last bear before two green months and now we also had three red months before potentially two green ones. And here we topped out in March. I think we're going to top out in February here because we're just one month earlier because the peak was in October, one month earlier than last time which was in November. So if the history is to repeat in one way or another, we're likely to see quite a convincing rally here, I mean from the lows, this rally here was 45%. If something like that repeats, we may even go, I mean all the way here, we could even go at the same time the fall here, let's measure the fall. The fall here was uh 52 and the fall here is a bit smaller. It is just uh 30. So let's see. The fall was smaller. Maybe the bounce is also smaller. But all in all, from a month count perspective, it is somewhere here where the bulls normally put in a relief rally and we'll have to monitor it closely whether it gets rejected or not at the 50week moving average. Now looking at the micro, something interesting has happened here and that's that the Fed balance sheet has started to go up. We haven't seen a sustained uptrend in the balance sheet all the way since 2019. So hopefully this is what we're going to see in the coming years. Something like this where the Fed balance sheet explodes. This would obviously be fantastic for Bitcoin risk assets and so on so forth. In May next year, we have the next Fed chair getting installed by Trump who is likely to be printing a lot, growing the balance sheet a lot. And all in all, I'm very bullish Bitcoin towards the end of 2026. But Ivan, why are you not bullish now? Now, now the balance sheet is going up. We should be bullish now. Now, now no, no, now. Someone is always yelling that in the comment section. Guys, normally it takes time for this to play out and also as you know, we have to be disciplined and we have to see Bitcoin go into a bull trend first before we go heavy Bitcoin. But look at the last time we did see a similar situation. It was back here in 2019. And as you can see when they started to grow the balance sheet, we first had a massive dump before we could see any kind of meaningful recovery. And this basically took a year from this start of increase to the massive parabola. It took more than a year. It took 60 weeks before we start to see real real explosion in the Bitcoin price. So patience is key here. All of the macro will of course pump Bitcoin in one way or another. But practically you have to look at the price trend because before price trend really shows you there's time to be bullish. The macro lag, the delay between when macro starts to happen like now for example and when the macro actually affects the price can mean life and death to your portfolio. I mean in the meanwhile your altcoins can down dump 90%. Bitcoin can dump to 200 week moving average. That's why we don't trade based on micro. We trade based on price signals. But we can use micro in order to foresee long-term changes. And when the price actually flips and micro is good, that's the super mega signal, super confidence that we get to go into the market. And guys, as you know, the true all coins of this season are gold, silver, platinum, and paladium. Because look here, you have ETH up 1%, XRP 3%. I mean, all of our old coins are kind of struggling 1%, 1.6%. Meanwhile, look at this. Gold 2%, silver, silver 4%, platinum 4%, paladium 2.7%. So, the big metals are slaughtering, they're slaughtering the big old coins, at least today. And again we still have the precious metals bull market the precious metals pump no one has canceled it and that's why here in the commodities tab in bull mania if you go to what flip bullish and when bullish on the weekly gold is 11 months bullish silver 7 months uh platinum uh 7 months paladium 7 months plum also seven months that's why you have to really understand that the market we're currently in is still favoring these precious metals instead of all coins at some point it's going to flip. We're going to notice that. We're going to tell you now money is going into metals. And of course, the recent events with Maduro capture with the US taking over Venezuela, remotely steering Venezuela is obviously good for precious metals. Geopolitical risks are always good for precious metals. By the way, big congrats to all Venezuelas. All Venezuelans I know, they're very, very happy. They're very, very bullish. So all the media talk that this is UN breaking UN charter, whatever. Listen, Venezuelas are happy. All of them that I know are happy. That's it. And if you come from dictatorship, you understand. Now, another thing is that potentially we may have uh Greenland Greenland going to the US very quickly as well. Listen to this. >> We need Greenland for national security, not for minerals. We have so we have so many sites for minerals and oil and everything. We have more oil than any other country in the world. We need Greenland for national security. And if you take well if Venezuela is under control then definitely has more oil than any I mean Venezuela has the largest oil reserve on earth. So he's fully correct here. Let me play you again. >> We need Greenland for national security. And if you take a look at Greenland you look up and down the coast you have Russian and Chinese ships all over the place. We need Greenland. >> All in all we are now face oh by the way look here also Cuba. Cuba. Cuba. Another potential escalation point for the US. Listen to this. when it's Donald Trump, you know how, you know, all these Democrats go bonkers. >> Is the Cuban government the Trump administration's next target, Mr. Secretary? >> Very quickly, >> well, the Cuban government is a is a huge problem. Yeah, the the the the Cuban government is a huge problem. First of all, Cuba, but I don't think people fully appreciate >> I think they're in a lot of trouble. Yes. I'm not going to talk talk to you about what our future steps are going to be and our policies are going to be right now in this regard. But I don't think it's any mystery that we are not big fans of the Cuban regime who by the way are the ones that were propping up Maduro. His entire like internal security force his internal security uh oper apparatus is entirely controlled by Cubans. >> And the conclusion here is that Peter Shiv is likely very happy. All of this geopolitical turmoil is very very good for risk of assets such as gold and maybe Bitcoin. Let's see if Bitcoin finally wakes up and takes its form as digital gold. For now, it is more like a tech stock. And sometimes when Bitcoin is in a bare trend, it's also underperforming tech stock. When Bitcoin is a bull trend, then it is outperforming tech stock like never before. Let's see what kind of form Bitcoin takes in this geopolitical crisis potentially that we have unfolding in front of us. Hopefully, it's going to calm down, but hey, probably not. Listen, Trump woke up on January 1st, got everyone to work. No freaking holiday. Get Rubio here. Get in. Get Madur. Listen, no holiday is there. That's true execution. So guys, on this note, smash up the likes, subscribe to the channel, share this video with everyone who needs to see this because many people need to see it. They need to hear what we're speaking about here because most of them are blind and they're watching people who are also blind or engagement farming and then it's blind leading the blind. They get slaughtered into the mid grinder. What you have to do is that you have to join Bullmania. Watch the free video. Click the link below. If you want to have nice signup bonuses, go and check the exchanges I use. There is a link called exchanges I use. You get all of the different exchanges here. And then finally, if you have signed up using one of our links, you can get the PDF uh using this uh this website right here that is below as well. Guys, see you all tomorrow. Smash it up. And also another question people have is when will the streams be back? That's a very good question because when I do the shorter videos, it's just more value and I see that people like it more. When you look at the analytics, people like it more. At the same time, uh OGs want streams. And so on Fridays we're going to do streams. On Fridays we're going to do streams. But I just see in analytics that the videos reach more people, more people subscribe, the message gets out more. So that's obviously what we want to optimize for. At the same time, of course, we need the streams. So Friday we're going to do streams. For now, we're going to do this videos on other days shorter. And let me know what you think in the comment section. If you like shorter, you like longer and let's adapt. I mean, listen, nothing is written in stone. We experiment. We see what works. We see what gives more audience, what gets the message out because that's the main thing. And on Friday, we have live stream. Guys, smash it up. Goodbye. Have a good day. And goodbye. Goodbye. Goodbye."
    }
]