[
    {
        "video_id": "PwwKMFIn7-0",
        "title": "Palantir Stock TANKS Overnight After Futures SHOCK The Market!",
        "published_at": "2026-01-30T03:49:18Z",
        "sort_date": "2026-01-30",
        "url": "https://www.youtube.com/watch?v=PwwKMFIn7-0",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. And holy Toledo, we saw a ton of selling pressure today. And even right now as we speak in the overnight hours in the future market, uh equities, commodities, crypto are dumping at a very rapid pace and especially here with Palunteer that has closed below a critical level. We're going to be talking about it and it's at a very critical price zone right now as Palanteer has also been selling off uh quite quickly with a lot of these other equities in the market. We're going to be talking about this especially with Palanteer earnings coming up looking at some of the other big individual names that we've been covering on the channel and could this be a potential decent spot for good reversals here if we see a change in the macroeconomic environment. Before we get too far, if you're a new or returning viewer, hit that like button and subscribe for daily videos. Let's [snorts] pop it up in the channel right here. You got Palanteer currently at 14960. Now, this close at the market close, if we go about 5:00 right here at about like 150, we saw a little bit of a reversal after it opened up here at down and sold off down to about 147. In the overnight session, though, it's down about another 1.5%. It's currently below 150. One of the big things here, it is at is is currently below its 200 day moving average. This is a critical support area for Palanteer to try to reclaim hopefully for a nice bounce over the last 3 months where Palanteer has been trading. If we zoom it out here on the screen, Palanteer has had a nice reversal at 150 when we revisited this back before here in November 21st. This is kind of after we saw the whole November 10th thing or with a ton of selloff or October 10th with a ton of selloff and a lot of liquidity that was leading into the market and Palanteer right here at this zone. We had talked about this in a few days ago. This 165 was really an interesting area and we don't have a lot of historical trading here. So Palanteer wasn't able to hold that and lose that support that the breakdown could come relatively quickly and that's exactly what happened. So now what's really important is Palanteer's earnings. uh fee February 2nd that's next Monday happening post market earnings per shares normalized are estimated to be at 23 cents here we correlated with the revenue of 1.34 billion so Palanteer here is priced for perfection if Palanteer is able to beat their earnings and have a nice slam dunk earnings and if Wall Street likes it this is where you could see an incredible reversal for Palanteer however if Palanteer does not for some reason and Wall Street doesn't like it that's where you could potentially see a further breakdown in Palanteer even though Palanteer has sold pulled off uh quite tremendously when it's been sitting in its zone between 170 and 184 for quite some time. Nonetheless though, Palanteer is typically really resilient. So, like I said, at this zone and literally where we're sitting at right now, I think anything is possible cuz we have a lot of interesting things that are happening right now in the market and a lot of uncertainty that's kind of hanging around. However, with mega cap earnings, those actually have been doing quite well. So, we'll be talking about that, especially with Apple that came out with some slam dunk earnings today. and I think we'll do a good job to help kind of remain and restore some confidence within the market, especially after the Microsoft sell-off. Now, looking here on top of that, Palanteer that lost its 200 um day average, you also see Hood that saw lost its 200 day average. And this is just before we have the announcement that Trump could be possibly utilizing Hood as a platform for their Trump accounts, which would be incredibly bullish for the amount of uh different accounts that would be open and on Robin Hood just by themselves. So Robin Hood is also uh basically sitting right below its 200 day at 102 right now. And this is also a psychological support area. This could be also a deep value play for Robin Hood if you're maintaining a long-term, you know, perspective on the stock itself in terms of a financial platform for the next generation and what the great wealth transfer is going to be looking like. That's the big bet on Robin Hood. So, these are some interesting spots right here. And if we look at some of the individual names before we kind of move on into what's happening in the general market and where there's uncertainty that's lying ahead, uh you see some of the data center names like Cipher, they're actually not doing quite bad. There's resiliency here and I do like that. You see that even with IEN that there's resiliency here. This is only down about, you know, 2.5%, came down about 5% on the day, but this has made a nice swing and a nice move up here to a local high of 63 now down here at 58. And you see the same thing with Cipher actually not making that bad of a move. Uh Cipher was here in the 19s, dropped down to the 17s, has found some support there, and it's kind of hanging out. So, I do like how the data center names are being pretty resilient. this could be a positive effect that we experience from the make seven earnings that we've had so far. Now, some of the um names and the agentic names that we've been talking about are continuing to sell off, but could be decent reversals or opportunities possibly in the future if we do get that reversal or confidence back in the SAS software market. And this is because Microsoft now Microsoft had lost about 10% of its market cap. Um right here, the stock slid about 10%. It had its worst day one day decline since March of 2020. And this basically came they had decent earnings but this came here reported after a slight slowdown in the growth of the Azure cloud division and gave soft guidance on operating margin for the fiscal third quarter. What this caused was the software stock here tumbled on growing fears and this brought down and brought a lot of uncertainty regarding that AI could threaten software business models. And what you have here with the agentic names, Zetta, we have now below 20 and is at a very interesting area. 19 right here is going to be testing this for a nice bounce. And you also have Path right here that is currently at $13 also falling down. Now over the last 3 months here in 3 months here, Path has also used 13 as a nice bounce before we had its run up to the 20s. So we'll see what happens. All these stocks are at some pretty critical support levels. Um, so we're hoping for, you know, is the selling pressure going to be done here or are we good, excuse me, a sneeze or are we going to continue to see a breakdown? Uh, what you see here with SPY, uh, in the overnight hours, that's currently down about 31 basis points, currently right here at 217. We'll see what happens. The S&P 500 index is still sitting around all-time highs. It only came down about.13% today after we saw a large dip opening basically right here at the high 6,800. So, um, the general market has been decently resilient. It's more of these individual names. Some of the big news that we could have here for tomorrow is that Trump says that he's going to be announcing the candidate for the new Fed chair tomorrow morning. And he says that he has narrowed the picks to Kevin Worsh and Rick Reer here and is leaning towards Worsh. So, we'll see what happens. Um, and we'll see what kind of volatility that brings into the whole market. uh what is the future outlook going to be looking like with um POW that's going to be exiting the door soon in terms also on Apple like I said they beat their fiscal first quarter earnings revenue expectations shot up and that was a buy significant surges in the iPhone sales um this has also been a major week for tech earnings and we also have the uncertainty of course Trump had made some addresses and some statements regarding the housing market saying that he's going to make their housing value stay up. So that's kind of quite interesting there. And we also have gold and silver that are kind of falling a little bit right now with the general market that's also falling rapidly quickly. But silver, the futures have been holding, you know, above 100 decently well. So we'll see what happens there, especially as the dollar index is been dropping and as the market is continuing to lose confidence within the dollar and it seems like Trump is okay with a weakening dollar right now. Uh what does that mean for other commodities such as gold and silver? Will the euphoria continue to melt up or will we continue to see possibly a reversal uh where we could see the flip side and possibly some selling pressure and rotation? Who knows? Um right now Bitcoin and Ethereum are also experiencing quite a large dump. You see right now Bitcoin is at 82,000 falling quite quickly but this is also at a major support area and you got Ethereum also at a major support area. So Ethereum right here at 2700, you know, this is a major floor for Ethereum that has been hanging out here for quite a long time. One, you know, particular shareholder that's probably getting beat down quite hard right now are BMR shareholders cuz now you have BMR that is at $25, uh, over here over the last day. BMR has been falling quite quickly and even touched I don't know if it's touched until the 24s, but at $25 both below it 50 and it's 200 day. a lot of these, you know, price targets that Tom Lee had called for the end of year 2025 and even the end of the month here, 2026. That's what we're approaching very, very quick. Uh, unfortunately, the opposite has occurred and he's been wrong so far. Uh, which kind of stinks because I think a lot of people put their money behind uh, you know, where he was speaking. Not to say, you know, those price targets can't come at some time. Uh, it's just the timing has been incredibly inaccurate. Uh, so right now we're seeing a lot of big holders in the crypto community and especially with BMR. Uh on top of that though um looking at some of the more micro cap kind of more speculative name uh Andas the drone company right here this is dip below you know down about8 of a percent in the overnight session at 1180 uh currently sitting at that there was recent deals here especially with them they got like the blue light I believe uh so that way they can start having um or being open to federal contracts so that'll be interesting to see what happens we see SoFi here even below 25 and they have earnings coming up I think tomorrow before the market opens. So, let me know what do you guys think about everything that's happening here. Do you think we're kind of at the bottom? Uh are we going to be experiencing a major reversal soon or do you think there's further breakdown in selling pressure ahead? It'll be really interesting to see what you guys think. Uh we'll see what happens tomorrow. I'll make sure to report on it. Peace out. Take care and I'll catch you guys on"
    }
]