[
    {
        "video_id": "xzZzRXdWlgU",
        "title": "The Entire World Just Left America Behind (Be Prepared)",
        "published_at": "2026-01-30T22:26:58Z",
        "sort_date": "2026-01-30",
        "url": "https://www.youtube.com/watch?v=xzZzRXdWlgU",
        "transcript": "What happens when the world stops trusting America? >> Globalization has failed. The West and the United States of America. >> In the last few weeks, the United States actually snatched out of bed the [music] president of Venezuela seized their oil, threatened to take over Greenland and got into shouting matches with countries around the world, namely our very good friends in Europe. The global chess board of power is being rearranged very very quickly and it's pretty much causing a lot of countries to stop trusting the [music] United States. And what that means is that asset prices are flying all over the place. This video is going to be about the delobalization of the world. What it means for the United States and most importantly what it means for assets. Because of course this is an investing channel. The goal here is to figure out what to buy and what to sell. I know most of you came here for crypto, but the world is changing rapidly, and it's very important that we change with it. Understanding where to put your money in 2026 is all about understanding the way the world is changing, the way geopolitical tensions are shaping up, and what it means for the most important sectors of business and society. So, I hope you guys are ready for this one because some of the biggest assets in the world are pumping like memecoins. First, let's talk about Greenland. As you know, Trump has been trying to acquire Greenland, talking about getting his hands on Greenland for quite some time. He actually started talking about this for the first time in Trump 1.0, his first term as president, and it hasn't gone away. Trump has a full-blown obsession with Greenland. He absolutely loves Greenland, and there's a reason why he loves Greenland. Now, one explanation you might have heard is that there's some kind of natural resources there. But I think this is probably the simplest way to understand it, which is as the oceans in the north start to melt, travel around Santa's home in the North Pole has become far more feasible. And it presents a global national security risk for the United States. As you can see here from this map, the easiest way to prevent any kind of intercontinental ballistic missile from hitting the United States is Greenland. Greenland sits very squarely between the United States and its two most famous global adversaries of China and Russia. This isn't rocket science. It's basic physical protection. But Trump understands that the world is headed towards a far less unified, far less peaceful version of itself. And I'm quite sure that his generals or someone high up in the military has been pushing him to get full and complete access to put missile defense systems across Greenland and probably also to tap its natural resources. Natural resources of course are going to be a huge theme as we get through this video because that's really the big game right now. The game has completely changed and for that reason our investing strategy must change with it. Now as you know Greenland is actually owned by Denmark, the Danish. You don't hear a lot about the Danish. Well, at least not after lunchtime. The truth is that this small Nordic nation controls one of the most important strategic touch points for the United States. And for that reason, the United States or Trump in specific has been pushing hard to get a deal done to actually buy Greenland. This would be one of the biggest purchases of land in history, even bigger than the Louisiana purchase and bigger than Alaska. Simply put, this would be a massive new addition to the United States. But the Danes are not happy about it. And in response, because he couldn't get any motion, Trump threatened Europe with a massive hike in tariffs. Not just the Danish, but Denmark, France, and several other countries. He's essentially saying, \"Hey, Europe, you need to play ball here.\" My friends, that did not go over well with the euros. To hit Trump where it hurts, the US dollar and the US debt system, Europe threatened to sell its holdings of US treasuries. Adding it up, the UK has 800 billion, near a trillion dollars of US treasuries, Belgium has 399 billion, Luxembourg has 328 billion, Switzerland 243 billion, and Norway $218 billion. And their sovereign fund alone is $2 trillion. Essentially, these are non-negligible massive quantities of US debt that if they did sell in mass could cause a full-blown financial crisis, blowing out the long end of the US debt curve. This would be catastrophic. So, it was certainly a nuclear option and one that forced Trump to come back to the table with a more reasonable deal. And a more reasonable deal did emerge as Bessant and Trump were able to negotiate a framework for this Greenland deal that seems like it has been appeasing to both sides. and essentially everyone was able to put their guns down. But in the midst of this hostility, CNBC came through and coined this moment, the sell America trade. And that is the moment we find ourselves in, where selling America has become the flavor of the month. And you can't talk about selling America without getting into Venezuela. As you know, President Trump snatched the president of Venezuela out of his bed in the middle of the night using a supersonic weapon and some special forces. They called this some Hogwarts level discombobulator tech that the US special forces had that apparently had hundreds of Venezuelan security guards, the people protecting the president of Venezuela puking and rolling around on the ground. Apparently, the US has some space age weapons that they deployed in this situation and were able to literally grab this guy out of bed without taking so much as a single casualty, which is already pretty insane and scary if you're a foreign leader messing with America. But it just shows that America is willing to do whatever it wants. And unlike times of the past where of course you had presidents like President Bush talking about weapons of mass destruction or spreading democracy in the Middle East. No. When asked why he's going into Venezuela, he said very simply, \"We need the oil. We need the oil. We got to have the oil.\" And love him or hate him, he's being real. He's telling you the truth. America needs Venezuela's resources, not just for ourselves, but to make sure that Russia and China don't take advantage of one of the richest oil deposits in the world. And there's a lot of other natural resources there as well. Apparently, they've already sold half a billion dollars worth of this oil. And I'd imagine that things are just getting started in so far as America taking control of Venezuela's oil reserves. The punch line is this. For the first time since the Second World War, America is simply taking what it wants. And it's not even making excuses about it. It's not pretending like it's not playing empire games. It is playing a very strategic game against China and Russia. And it's simply not respecting the sovereignty of other countries despite spending nearly a century trying to enforce an international code of conduct that would prevent exactly these things. Now, it's hard to talk about all this stuff without getting just a little bit political. I know for myself, it's very shocking to see all of these things play out. And without getting political here, the truth is that there's been a certain status quo that America has actually been the enforcer of and this is how we've lived our entire lives. But as we look forward to the next era of technology and innovation and understanding the true arena of global conflict that is emerging between the United States, Russia, China, it is my suspicion that as controversial as these decisions are today, Americans may look back in 10 or 20 or 30 years and understand that if it didn't act to protect its access to rare earth minerals, to energy itself, and some of the things we'll talk about in just a minute, the overall continued success of the country as a whole may have genuinely come into question. Now, all of this is just a little bit of a prelude because what we saw last week in Davos really shows and underscores the global tensions that are rising. And nothing really highlights this so well as the reports coming out of Davos where Howard Lutnik called Europe a kaleidoscope of beautiful but fragmented powers. And we saw nothing short of an absolute thrashing of the United States's relationship with the rest of the world. Here you can see how Howard Lutnik fullscale calls globalism a complete failure, saying that the postcold war economics of globalism have completely failed the American people. >> And the Trump administration and myself, we are here to make a very clear point. Globalization has failed the West and the United States of America. It's a failed policy. It is what the W has stood for which is export offshore farshore find the cheapest labor in the world and the world is a better place for it. The fact is it has left America behind. It has left the American workers behind. >> Christine Lagarde the head of the European Central Bank actually supposedly walked out of a dinner in which Howard Letic was speaking. Larry Frink was hosting it and they had to cancel the dessert. That's right. No French pastries will be served tonight. And look, you know, we're not fans of European Central Bankers. Certainly Christine Lagarde pushing the Euro CBDC and what feels like fullscale authoritarian dystopian society where they control your expenses, your digital ID. That is what Europe is pushing for. They are on the front lines of pushing for full socialization and socialist government. This is one of the scariest things that we've seen in our lifetime. And I could really care less if she's mad. If I'm going to be completely honest, I don't care about Christine Lagarde at all. It just shows you that the distrust between America and its former closest allies is only growing. And it's all due to a game of chess, very high stakes chess that Trump and this administration is playing. And the impacts of these changes are going to be some of the largest that we ever experience in our lives. But before we get to all that, I think that it's important to highlight one comment from Christine Lagarde from precisely this event. She said this. I'm not going to tell you that central banks will always be around either. It's a weird comment to slip in there, but she's hinting at the fact that central banks themselves might be a dying species. We see the tensions between the Federal Reserve and the United States that's only served to amplify this distrust of America with President Trump's administration threatening Jerome Powell with a criminal investigation. effectively crossing a red line that has historically separated the Fed from any kind of executive branch intervention. These things make it hard to trust the system, the US dollar, the treasuries, the actual debt in the United States that has been so beloved globally as it's brought so much peace, so much predictability, and so much trust to a global financial system. And Larry Frink weighed in on Davos, too. He's a big part of this. He controls more money than most countries have in GDP. He said postcold war capitalism has failed most people. Davos is an elite gathering trying to shape a world that belongs to everyone. Of course, behind the scenes, he's working on a trillion dollar reconstruction plan for the Ukraine. And since he's gotten his hands on our grubby little digital assets, they haven't really been performing so well. Who knows if there's something behind that. Meanwhile, we're actually seeing countries try to pivot away from the United States. We saw Canada try to form a trade deal with China which was stricken down because President Trump threatened them with a 100% tariff increase to which they rapidly responded that they would not be doing this deal. And to add to that, Emanuel Maccron is pushing for more trade between France and China. It's very clear your daddy's either United States or it's China and both sides are vying for control. So let's talk about why all this matters and what's actually happening. After World War II, the world got together and made a deal. The United States would be the enforcer of peace and prosperity across the world so long as everyone used dollars. Effectively, the United States became the enforcer. It also became the marketplace. If you wanted to trade assets or invest, you put it into the American system. That's where it was safest and could grow to be the strongest. Over time, China became the factory where you could build anything. Japan became the lender where interest rates remained permanently cheap. Europe became effectively the consumer and a tourist destination. Shout out to my favorite place to travel, Epana. And all of it worked because effectively the US dollar was backed by B-52 bombers and the strongest military in history and of course the laws that separated the Federal Reserve and the executive branch. And in general, the US used its position of power to maintain peace and order. Well, that was for about 80 years. And then 2022 happened. America froze $300 billion worth of Russian reserves. Whatever you think about Russia, whatever you think about Putin, that was the first time in history that America had exercised its ability to freeze out a country of its open markets and to effectively show that the United States dollar was a permissioned system. And that, my friends, changed everything. Governments stopped hoarding US dollars. And slowly but surely, China, Russia, and countries around the world started buying gold. And just last week, gold flipped the United States dollar as the most valuable and most commonly held global reserve asset in the world. This is a regime change that we haven't seen since the mid 1900s. And so, it's time for us to talk about how this whole world is changing, what it means for our assets, and finally, I'm going to give you a little bit of a crazy conspiracy theory as to why I think all of these things are happening. Cuz we all know that behind the political theater, there's genuine and real intent. There's the story we're told and then there's the real story, the stuff that they can't say out loud because it's just too difficult to digest. So, let's get into it. First and foremost, we've seen an intergalactic bull run come to gold. Currently making new highs as I record this video at $5,200 an ounce. Absolutely an astronomical performance from gold. But gold isn't the only one. We've seen silver break out of a not 10, not 20, but a 50year high. Originally formed in December of 1979. You can see silver has finally bust through. You can see it tried to do this in 2011, but it couldn't pull it off. And it ended up falling up to 75% 76% from the highs before going on an absolutely astonishing near 1,000% run. And this is from the second biggest asset in the world. What's very interesting is if you look at gold versus the S&P 500, you'll see that it's actually starting to break through trends that it has been experiencing for nearly 100 years. What I found fascinating is that if you look at the chart of gold versus the S&P 500, you'll see that it has been going down steadily since its peak in 1979. It made an attempt to run back up and make new highs back in 2011. That was the peak of the great financial crisis. And then it's formed a shallower cup here and it's trying to push back up. It broke out against the S&P 500 recently. And we can assume that at the very least it will go to try to tag this trend line. But if it is able to get through here, it might end up going much higher to maybe this high. Or maybe, just maybe, it will look to challenge its 1979 high, which if you do the math, means that gold could grow against the S&P 500, which will be growing on its own. Gold may outpace the S&P 500 by over 1,000% over the coming years. If you zoom out even further to the monthly chart, you see that there is, and I don't know how valuable this actual chart is when you go back this far, but you'll see that there very well might be forming an inverse head and shoulders here on the 100year chart or the 75- year chart. This is one of the craziest things we'll ever see. But these are the effects of the sell America trade, of the scary trade, where people across the world stop looking to hoard dollars and stop looking to hoard US debt and stop looking to recycle that debt back into public markets and instead they focus on things that they can control, things that they can trust. And we have an entire precious metals bull run. As you can see, silver's been going crazy. And if you measure silver against the S&P 500, it too has now broken through this trend line that goes back to the 1979 tippy top. As you can see, it's on its way to challenging that 2011 top. And if it makes its way up to challenge these highs, it's looking at a growth of nearly 25x. And that's against the S&P 500, previously considered the most important investment vehicle in the history of mankind. But now it's time to talk about the conspiracy of what's going on behind the sell America trade. Why is Trump rocking the boat like this? Why is so urgent to go into Greenland, to go into Venezuela, to make the moves now that maybe no one was really even talking about, no one was even worried about? Why is all of this happening? Well, the first part of the answer to this may sound simple. It's AI. But the second part of this is maybe a little bit more complicated and maybe, just maybe, something that nobody's talking about. Now, you might have heard now that the actual chips, the Nvidia chips that everyone was looking to hoard as they were looking to get access to the AI trade, well, those aren't really the bottleneck anymore. Chips aren't the reason why AI will be bottlenecked and growing. In fact, AI's real bottleneck is energy itself. And the only way that we can meet the energy demands of AI is with new types of energy. And that means turning to nuclear energy and to solar energy. And that, my friends, is why the silver trade has gotten so crazy. Because it's actually the most conductive metal that's used to create most of the solar energy around the world. According to the ex head of commodities at Bridgewwater, Ray Dalio's investment firm, one of the biggest hedge funds in the history of the world, silver starts to eat into the profit margins of solar energy producers around $120. Now, a week ago, this sounded like a far-off problem, but that was a week ago when silver was trading at about 60 bucks. And guess what? It damn near hit $120 yesterday. And based on the way the charts are going, if you get down to the 15minute chart, this thing is pushing for all-time highs minute over minute. It could be that silver becomes economically unviable to use in solar energy or in energy production in general in the very near future. And that means that the world needs to turn to copper. Copper is a viable substitute for silver. And it's going to start becoming required to use copper. And it might not surprise you to learn that Freeport McMorren is one of the biggest copper producers in the United States and it is pushing up against its high from 2008, a nearly two decade high on a chart. And if you've been following along, you know what happens when multi-deade highs are challenged and broken. They go on absolute rampages. So yes, just for full disclosure, I've taken a massive position in copper and a significant position in Freeport McMoran. And the reason why I think all these things are happening is that the future of a tier one, tier 2, or tier three society will be determined by a society's access to robotics and AI. Those are the things that are going to fix all the problems in society. Are there going to be robots to look after grandma? Are there going to be robots to harvest crops all day for nearly zero cost due to solar power? Is there going to be AI running companies helping make sure the world runs smoothly? The access to unlimited inference from AI and unlimited embodied AI in robotics will be the driver of both military strength, national sovereignty and safety as well as the finest things in life, the best lifestyle known to man. And without energy, without extreme access to energy, which is nowhere near being sufficient, countries will be unable to protect themselves and countries will also be unable to offer their citizens the highest quality of life. So although it seems like Trump is acting crazy, I think there's some credence to the idea that he could be acting preemptively to make sure that America remains a dominant country, that it's able to maintain its status as providing Americans themselves one of the highest qualities of life, as well as remaining a dominant military force across the seven seas. So to recap, in a changing world, I think that traditional American equities, well, not the AI stocks, those are going to go crazy. the Googles, the Teslas, the Amazons, which are now going to be automated. Really, the entire mag 7 is set to benefit. But the truth is that traditional American equities have started to wildly underperform. And as countries stop collecting dollars, stop trying to hoard US treasuries, and generally get become suspicious about the US, it's no surprise that emerging markets, Latin American indexes, Asia, and Canadian indexes have all started to break out against the US dollar and against the S&P 500. The United States is engaging in all kinds of tom foolery under Trump. They're rocking the boat, to say the least. But I believe the reason is that they know without certain resources, the United States will be unable to live up to the demands of the embodied AI robotics future. They will fall behind in the global competition, one that China has been well prepared for. In this regime, it makes sense to be betting on the resources that power that AI future that power energy such as uranium, which is needed for nuclear energy, such as copper, which is needed as a substitute for silver in the production of solar, many other uses related to electrification. It makes sense to bet on the companies that are leading the charge in digital AI, like anthropic, like Google. I'm going to go ahead and say it. I will never buy or support OpenAI. I personally don't support Sam Alman. I hope that they go down. and I hope that they are the MySpace of this AI era. But I think it makes incredible sense to bet heavily on gold. Now, no doubt this chart looks absolutely parabolic. I mean, it looks like all of the charts that have snapped and gone back to zero that we've seen throughout our lifetimes, but I don't think you can put this cat back in the bag. I don't think you can start building up that national trust that America spent so long constructing. I don't think you get an Americaentric regime anytime soon, if ever again. And in a regime that lacks a central character like America, I don't think China takes over. I don't think any other country can fill that void. I think a neutral non-s sovereign asset like gold is what people will want to hold. That being said, I know what you're thinking. Isn't this precisely the situation that Bitcoin was designed for? And the answer is yes. However, I believe that Bitcoin is currently facing a few headwinds and that is why it's lagged behind the gold trade in what feels like the picture perfect storybook background for Bitcoin to thrive. And I think the big reason is that people are scared of quantum computing cracking Bitcoin's algorithm. They're also scared of the Trump administration being so closely tied to Bitcoin, thinking that if they can't trust Trump, why should they trust an asset that is so closely tied to the Trump administration? I believe that working through some of these narrative issues around Bitcoin is the current reason why Bitcoin is lagging behind and that eventually it will play catch-up, but for now there are just some headwinds. And in the midst of the chaos, the world is turning to the most sturdy, trustworthy, and tangible things that it can get its hands on. In a world where you can vibe code any kind of software, I think the value of enterprise software more or less goes to zero. You can build whatever tools you need right there on your own computer. In a world of infinite replication, the world is turning to things that cannot be replicated. Rare earth minerals, precious metals, robotics, and I believe eventually Bitcoin, but not necessarily today. Of course, I still hold a significant amount of my net worth in Bitcoin, but that's the way the world is working today. And the people who understand this investing regime, the sell America regime, are the ones who I believe will benefit most the investing regime we're in right now. Now, we're going to be making some more content on this channel about crypto, long-term price predictions, how I'm managing stuff in the short term. But I sincerely hope you guys have enjoyed this. I believe that the global chess game around a new cold world war that we're currently in, around protecting America's interest and the vast deficit of critical minerals and resources that it needs to provide power to the AI and the embodied AI future that we're coming into. I think that's the entire game we're seeing. It's pretty obvious and I think best of all, if you crack the code, you can make a crazy amount of money on it. Oh, also don't hold dollars. Those aren't going to do well. Anyways, I hope you guys enjoyed this video. My name's Leot Trades. If you did, make sure to like this video and subscribe. And I'll see you very soon on the next one. [music]",
        "summary_hu": "A világ egyre inkább elveszíti bizalmát az Egyesült Államok iránt, míg a globális hatalmi viszonyok gyorsan átalakulnak. Trump Venezuelával és Grönlanddal kapcsolatos politikája egyértelműen mutatja, hogy az Egyesült Államok az erőforrások megszerzésére összpontosít. A videó hangsúlyozza, hogy a globális deglobalizáció által kiváltott feszültségek miatt az amerikai adósságok és trezorok iránti kereslet csökken. Az amerikai tőzsdék teljesítménye gyengébbé válik, míg a feltörekvő piacok és a nemesfémek, különösen az arany és az ezüst népszerűsége nő. A globális gazdaság jövője a kimeríthetetlen energia, az AI és a ritka ásványi anyagok köré szerveződik, amely új pénzügyi stratégiákat igényel.",
        "summary_en": "The world's trust in the United States is dwindling as global power dynamics shift rapidly. Trump's policies regarding Venezuela and Greenland clearly indicate a focus on seizing resources. The video emphasizes that the tensions stemming from globalization's failure are leading to a decline in demand for U.S. debts and treasuries. U.S. equities are underperforming, while emerging markets and precious metals, particularly gold and silver, are gaining popularity. The future of the global economy hinges on unlimited energy, AI, and rare minerals, necessitating new financial strategies.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 35,
        "key_points_hu": [
            "A világ egyre kevesebb bizalmat szavaz az Egyesült Államoknak.",
            "Trump erőforrások megszerzésére összpontosít Venezuelában és Grönlandon.",
            "A globális deglobalizáció feszültségei miatt az amerikai tőzsdék gyengébb teljesítményt mutatnak."
        ],
        "key_points_en": [
            "The world is increasingly losing trust in the United States.",
            "Trump is focused on seizing resources in Venezuela and Greenland.",
            "The tensions from globalization's failure are causing U.S. equities to underperform."
        ],
        "main_topics": [
            "Global Power Dynamics",
            "Resource Acquisition Strategy"
        ]
    }
]