[
    {
        "video_id": "0qtXPw_Rr3E",
        "title": "Why a deeper Bitcoin reset could be healthy #shorts",
        "published_at": "2026-01-30T17:00:02Z",
        "sort_date": "2026-01-30",
        "url": "https://www.youtube.com/watch?v=0qtXPw_Rr3E",
        "transcript": "Overall coming back to Bitcoin, I think we we may get here quite fast and we should actually be hoping for it. If you are a bull, you should be hoping for a fast 200 week moving average. It is just 20%. Yes, all coins are going to nuke a lot, but looking at Bitcoin, it's not even that much, but this will allow us to reset the whole market and be ready for the next multi multi-year adventure. As bulls, we don't want the market to just, you know, continue from here and up and up and up. Why? Because when you have such a short bare trend like we've had up until today and it just recovers, the bull trend may be small also. I mean, look here, it actually happened back here. We had a bare trend, but it was kind of weak bare trend. Yes, I mean, it went down a lot, but then it also recovered quickly. But you see the bull trend, it lasts like few weeks and then bam back into big mega bar. So, now that we're down anyway, you're all considered down anyway, let's complete the job so we can actually have a nice multi-year adventure."
    },
    {
        "video_id": "ymCD6uF738E",
        "title": "New FED chair. Markets react immediately. #shorts",
        "published_at": "2026-01-30T13:39:17Z",
        "sort_date": "2026-01-30",
        "url": "https://www.youtube.com/watch?v=ymCD6uF738E",
        "transcript": "And we have the big news that Kevin Worsh is going to be the next Fed chair. And the markets don't like that. The markets now don't like that they fall. The dollar is strengthening. Why? Because Kevin Worsh historically has been a super super hawkish um governor. So during the '08 crisis, he was saying all the time, all the time that inflation is the problem. And you can read all of the quotes here, but he is basically known as a hawk in the Wall Street circles. He's known as someone who wants the inflation down, who doesn't want the Fed to print and go bananas."
    },
    {
        "video_id": "FSBDYffIDv4",
        "title": "BITCOIN AND ETH: NEW FED CHAIR (he is hawkish wtf)!!!! 🚨🚨🚨",
        "published_at": "2026-01-30T10:32:58Z",
        "sort_date": "2026-01-30",
        "url": "https://www.youtube.com/watch?v=FSBDYffIDv4",
        "transcript": "Yes. Oh, yes. Yes. Yes. Guys, welcome to another episode. And as you can see right now, Bitcoin is falling further. We're now at 82. We're going lower, lower, and lower. And we have the big news that it's very likely, almost 100% certainty that Kevin Worsh is going to be the next Fed chair because Trump said yesterday that he will announce the next Fed chair today. Today, on Friday, Friday morning. Listen to this. Dave, will you be announcing your Fed chair pick next week? >> Uh, tomorrow morning. >> Tomorrow morning. >> Tomorrow morning, aka Friday morning, he's going to wake up. He's going to announce the new Fed chair. And now, probably due to internal leaks, probably due to insiders. It's pretty clear looking at Poly Market, looking at Cali and everywhere else that Kevin Walsh is going to be the one nominated because he is now at 90 94% likelihood. So, everyone is just betting on him. Likely this has leaked likely the insiders in the white house maybe Baron Trump or who is traing there someone was trading this probability like there's no tomorrow and the signal has spread so the whole world basically now believe is going to be Kevin Worsh and the markets don't like that the markets now don't like that they fall the dollar is strengthening why because Kevin Worsh historically has been a super super hawkish um governor so when you look at the Fed he has been involved with the Fed very very long time he's been working with the Fed very very long time and he has been making statements all the time that inflation is bad. Inflation has to be combed during the the during the '08 crisis. He was saying all the time all the time that inflation is the problem and you can read all of the quotes here but he is basically known as a hawk in the Wall Street circles. He is known as someone who wants the inflation down who doesn't want the Fed to print and go bananas. So, it's very interesting that Trump likely will choose him this morning. I think likely as some kind he must have some kind of dirt or something [laughter] because Trump said when he appointed Jerome Powell because you remember Trump appointed Jerome Powell. Um you may people may not remember that because they're so anti- each other. They're they're they're really not friends today. But back in the day when Powell was appointed, it was Trump that that appointed him. But then Trump said listen they are good friends but then once they get the job everything changes. So how will he ensure that this guy Kevin is listening to him? I don't know. I mean there are probably ways to do it especially because this guy has been a super hawk and now suddenly he will do what Trump is telling him and Trump is basically telling him to cut cut cut as soon as possible. We should be paying lower interest rates than any other country. He said on on true social he's been saying that they they need to lower interest rates now now now now. So it is a very interesting situation we're in where it needs to be a per the guy he nominated needs to be a person that is accepted by Wall Street meaning that Wall Street doesn't just dump all of the treasuries. The global investment community don't just dump all of the treasuries treasuries because they don't believe in the credibility of the Fed. So you cannot just put in you know his friend or someone random. It needs to be someone who is credible enough. So the dollar survives and then treasury market survives. Also that person needs to be accepted by the Senate. So he himself cannot appoint uh the person. He needs to choose the person and then person needs to be accessed by his son. So he needs to be a credible person. He's not be a random you know friend. He cannot be his son or someone. He needs to be a credible person. And he picked probably the most credible person he could have. I mean, he basically is picking a hawk. Someone who's been saying all the time that we should be very careful with cutting. We should not cut. But does Trump have a plan? Let's see, guys. Let's see. All in all, the dollar is recovering quite um quite nicely. I mean, everything is falling. You see silver falling 12%. We've been warning to be super careful with silver, especially at this highs. You look back our streams during the last week, we've been super super careful. We've also been saying that likely at some point it will come back and retest the 50week moving average either here or a bit later. I mean it is going up but that's very important to be cautious of because the volatility in metals now is insane. And the way to trade metals as you remember it was to buy them when they just entered bull trend which was approximately a year ago. So now that you're so late in the trend there are other trends that are starting now but silver already seven months ago in the bull trend. uh platinum 8 months uh lithium 5 months gold uh one year over a year. So if you're fully new to this markets now is is very very bad time to for instead if you want to build for long-term wait for moving averages we've been discussing that at length. Gold also having a bit of a pullback the same idea here. If you've been part of this rally fantastic you can still ride it by the way because we're still in a bull trend. If you're new to the rally be careful to wait for touch of the 50 week and dollar strength index. I mean, we've been saying it the whole week. Basically, everyone is saying dollar is going to go to Z00 Z. We said, listen, relax, relax. It's the dollar strength index is the same as, you know, last decade. Basically, [snorts] nothing special. Nothing special has happened. And now with Kevin Worsh, it's another reason for everyone to be bullish dollar because he is very protective of the dollar. Kevin Worsh when you look at what he's been saying, what he's been doing. So the reason why Trump likely is going to nominate him, I mean my guess [laughter] my my guess would be is that he has some way to get him to comply and also he has been more um more pro-Trump lately. I mean pro easing uh lately for example um he's you see here I asked Cloud to summarize um everything about Kevin Worsh and so he is a hawk. He's a hawk and you can read here about his history but basically we discussed already that he's a hawk but recently he has been doubbish recently and so people are saying that he's doubish just to get the job just to you know appease Trump uh once he's in office he doesn't really have to follow Trump too much but now he's doubish I mean maybe just to ensure that Trump Trump appoints him also uh when you look at his previous statements one thing he's famous for is that he's been saying inflation is a choice if we don't want inflation we can fix it easily by being by being hawkish by controlling the balance sheet and so on so forth. This is why he's quite credible when it comes to Wall Street. So from that perspective is good. Also see I asked him if he has some dirt if Trump has some dirt on him to ensure compliance. Let's see. That's the milliondoll question according to Claude or that everyone on watch is asking and honestly the answer appears to be no obvious leverage but you never know. I mean was he on some island? You never know. Which is precisely why some Trump allies are nervous about the pick. Okay. So, uh he's independently wealthy and connected. He has a track record of defiance. So, previously he was basically the one that was against a lot of decisions that the previous Fed chairs have made. So, he's a independent thinker. You can say his intellectual framework gives him an out. The a productivity argument has led him to justify cuts. Now, so one thing he's also known for is that now that with AI, he's saying that we can cut now because AI is here. So when you have productivity gain, that will offset the inflation pressure of the uh rate cuts. And so it's okay. It's okay. So he has a way out intellectually. He can explain why he was a hawk. Now he's a dove. But if inflation ticks up, he can pivot back to hawkish and claim intellectual consistency. And also you know these guys I think that at the end of the day if Trump really has no leverage over him then in it is in his interest to be a good Fed chair. I mean that's what he will be remembered for. How many times in your life can you be fed chair you one time? One time. So uh I mean once you're in I fully understand that you you just want to do your job as good as possible. So you're remembered as a good Fed chair. For example, Powell I mean likely he will be remembered as a good Fed chair that navigated all kinds of stuff with the COVID and the inflation and blah blah blah and I mean still managed. Okay. I mean look at the state of the economy. The US is growing faster than any country. You look at the EU versus US, it's non-comparable. I mean US is a powerhouse when it comes to GDP, when it comes to innovation, when it comes to AI and so if you actually look beyond, you look beyond the political bickering back and forth. You look at what Powell has done. Yeah. I mean pretty good a pretty good pretty good uh fantastic you can say fant. I mean all in all if you look past the politics I think Powell will look back at his tenure as quite okay uh maybe even good because he did manage the inflation blah blah. So all in all uh once the guy is in his incentive now is to be remembered as someone who who did who did well. Now Elizabeth Warren Pocahontas is saying the following. Senator Warren public worried that Trump would appoint a sock puppet to do his bidding. He the interesting thing is that Worsh was specifically chosen over Kevin Hasset partly because Hasset was seen as too close to Trump. Okay, so that's interesting that Hasset basically was a risk that the Wall Street um investors and I mean global investment community would seem as too too biased and too uh unc not credible. How say uncredible? Do you say uncredible? Not credible. Uncredible. Noncredible. Anyway, Jamie Diamond reportedly signal support for Worsh at a private conference specifically because he's not a yes man. So, it is credible. It's it's very this credibility thing is so key. Bond investors communicated concerns to Treasury that Hasset would cut race aggressively just to please Trump. Worsh is the credibility pick someone Marcus will trust precisely because he's not obviously controllable. Let's see [laughter] what leverage might there be against um Worsh. Let's see. La louder. You can read here. I don't know what what all it is. Some kind of relationship. Career ambition. Yeah, exactly. He wants the job. He wants it. But once he has the job, he has the job. He cannot be removed. The audition dynamics. Trump reportedly pressed Worsh in their Wednesday meeting on whether he could be trusted. [laughter] Exactly. On the race, Worsh apparently said the right things to move to the top of the list, whether that was sincere or just interview. Yeah. I mean listen at the end of the day how let me ask another thing. How long is Fed chair tenure? You see um tenure you see Trump is out in 28. In 28 he's out and the Fed chair will basically outlive the Trump by a few years. So I mean listen he he okay so it's 4 years and uh he will uh yeah so 2030 basically 2030 until 2030 he has the job he's going to he's going to outlive Trump on this position so he just needs to get the job he needs to get the job once he has the job great if there's no leverage let me know guys what you think in the comment section about everything that's happening welcome everyone who is watching live but current market reaction is that uh daughter is strengthening people are seeing him as a hawk that's going to that's going to uh trick Trump. That that that's what we're seeing right now. Bitcoin is falling. Stocks a bit shaky. Dollar is coming up. Uh six year people. Yeah, I also remember six-year term. Exactly. I also Why does it say four year term? Fouryear can be reappoint. Isn't it six? Let's see. Claude, what the hell? Isn't it six years? I also remember six years. Let me let me just double check. you is it says it says four is Claude BSing us guys double check in the in the comment section let's not to waste too much time but it's going to be longer than Trump anyway that was the main point now welcome everyone who's watching live smash like big shout out to Guzman who is time stamping us Guzman is um trying to figure out a way to esca escape Netherlands because Netherlands is having a big fat tax on realized gains in 2028 as well So ensure Guzma that you leave as soon as soon as soon as possible. Uh let me know how you're doing this fantastic uh Friday Friday Friday yet again. Uh and um also I have a bit of news to everyone who is in Bulmania because we just launched all kinds of new markets. So if you go to stocks you will have now Saudi Arabia here. So you can see Saudi Arabian stocks and actually one of you guys in the comment section yesterday I believe commented that Saudi Arabia is opening up their stock market to the public basically outside of Saudi Arabia on February 1st and that's correct. So on February 1st, Saudi Arabia opens up their market, opens up their stock market to the world. So you can invest even if you're not from Saudi Arabia. The same thing happened in China long time ago but when China opened up to the world stocks skyrocketed. So we added Saudi Arabia. They have all kinds of uh companies here and uh yeah. So now you just go here, click Saudi Arabia. We also added a bunch of China stocks. A bunch of China stocks. Like a lot a lot a lot a lot of China stocks. You can just keep scrolling scrolling scrolling. We added the whole Shenzhen index. Basically, you can just scroll scroll scroll scroll scroll scroll scroll. So yeah, we have full support for China. We also added European Union as a button. We already had all of these separate countries, but now we just added them as a button. So you can speculate whether EU is going to decouple from the US, build their own military, build their own everything. And basically it's a bet on the fact that they're going to have a lot of government contracts and government is going to be pumping a lot of these companies in order to decouple from the US. Then also we add the South Korea. So you have all of the Samsungs of the world and and so on so forth. Hyundai and LG is is LG also South Korea or no? But yeah, Samsung, Hyundai, Kia, all of them you can speculate. Next, Japan. Japan, Toyota, Toyota is here. Everyone is here. Everything is here very nicely. Japan. We added also we added um Turkey. Um yeah, I don't know if you are from Turkey. Is this uh this gains seem big, but the problem is that currency is inflating a lot. So, [laughter] you just need to keep that in mind. you know this this gains is going to be the biggest gains since the bullish flip because it's inflating so much then also we add that Russia I mean currently super sanction but let's see I mean if the conflict ends if there's some kind of change to the situation could be interesting but yeah it's a kind of depressed market currently as you probably understand and a lot of these companies are I mean they're kind of state controlled it's not too many you know fully independent like I mean you look at most of them it is either some kind of energy gaspro L oily rasv then you have bur bank which is the biggest uh I mean it's like it's even hard to call it like a stock market because it's mainly government controlled um oligarchy but anyway you have it here here so you can if you want to dip your toe uh then what else and then we have everything else here also that we that we always had but now it's even easier to access as we added all of these buttons here at the top so you can access the biggest markets quickly. So all in all, if you want access, go to bullmaya.com, watch the free video. I mean, you really need access for many reasons, including knowing how trading works. Um, looking at the current Bitcoin price, uh, look here for us to go from here to approximately within 10% of 200 week is just 23% down. Guys, I think we may get here quite fast. Okay, overall coming back to business, I think we we may get here quite fast. Okay, quite fast. Uh, and we should actually be hoping for it. If you are a bull, you should be hoping for a fast 200 week moving average. It is just 20%. Yes, all coins are going to nuke a lot, but looking at Bitcoin, it's not even that much, but this will allow us to reset the whole market and be ready for the next multi multi-year adventure. So, as bulls, we discussed it yesterday, as bulls, we don't want the market to just, you know, continue from here and up and up and up. Why? Because when you have such a short bare trend like we've had up until today and it just recovers the bull trend may be small also. I mean look here it actually happened back here. We had a bare trend but it was kind of weak bare trend. Yes I mean it went down a lot but then it also recovered quickly but you see the bull trend it last like few weeks and then bam back into big mega bar. So now that we're down anyway your allins are down anyway. Let's complete the job so we can actually have a nice multi-year adventure, okay? Where lives are going to be changed again because uh uh this is the best riskreward area to buy ever in history of mankind. So yeah, that that's my stance on it. And if the the bare thesis is proven wrong, I mean somehow we we start pumping above 50 week obviously we're going to be bullish also. But I think it is the optimal scenario that is playing out right now that we break down, we go, we reset everything and we can have a nice bull market uh ahead. So yeah, let's let's see how that goes. Interesting comments from Kevin getting back to Kevin Worsh. Look here. Interesting comments on uh crypto. >> Um you made reference to bit. >> So this is the new fed chair. This is Kevin Worsh >> coin and I thought I heard a little bit of condescension that people are buying Bitcoin in these >> Exactly. See this uh host tries to be condescendant against Bitcoin and Kevin Worsh the new Fed chart corrects him. Don't be condescending things. >> But doesn't it Charlie Munger this is two or three years before he died. Charlie Munger attacked Bitcoin. He called it evil in part because it would begin to undermine the Fed's ability to manage the economy >> or it could provide market discipline or it could tell the world that things need to be fixed. Uh >> Bitcoin does not make you nervous. Uh, Bitcoin does not make me nervous. I can hearken back to a uh a dinner I had here in 2011 um with a someone who is another guest on your show. I won't say his name. Um um Okay. I just did Mark Andre who showed me the white paper that was the original white paper. I wish I had understood as clearly as he did how transformative Bitcoin and this new technology would be. Uh, Bitcoin doesn't trouble me. I think of it as an important asset that can help inform policymakers when they're doing things right and wrong. Um, it is not a substitute to the dollar. I think it can often be a very good policeman for policy. And if I were to >> I mean, you get more broadly, >> you get the point that he he says nothing new that we don't know, but it's just that he is the next Fed chair with 94% probability. He has a orange tie and he's saying all of these pro Bitcoin things. So potentially potentially we do have a solid guy here who is hawkish. So all the Wall Streets everyone respects him. Uh but at the same time he's reputable, respected and maybe he can uh get the Bitcoin reserve and everything. [laughter] Let's see if we can get the Bitcoin reserve. Let's not get the hopes up. Let's not get the hopes up too much. Um but this is going to be super interesting to follow today. probably the biggest news of uh of today that the announcement and everything else. Now guys, before we go to Q&A, there's a lot of fat against Binance because now everyone is again waking up and accusing them of October 10th. H and uh I mean listen, on October 10th, we were already derisked. Why? Because we started to risk on October 8th when Bitcoin did a fake alltime high. So personally, I have no you know personal experience with how Binance messed up. There are many many many many many accounts on Twitter going around saying that Binance API was down. It was impossible to add margin. It was impossible to manage your leverage position. So everyone just got liquidated. So if you probably have seen that there's a lot a lot a lot of hate against Binance. CZ has come out said that you know FUD doesn't hurt the target. My followers increase. FUD hurts the market. Everyone Binance do Binance do not sell in any meaningful amounts. Also now everyone is accusing that Binance is dumping everything. That's why we don't pump. My selling is that I swipe my card and $5 worth of BNB gets converted and sends to the coffee shop. I don't run Binance. Binance only converts a portion of the revenue to pay for expense. They are a large net hoarder. Binance also have a global regulator now who can review every trade on every account. Don't be misinformed. So all in all, the truth probably somewhere in between. There is I mean there's just so much so much so many videos so so many accounts uh showing proof that their uh account is weird where they you know the time stamps have been changed for example they get an email when they're liquidated with one time stamp but then when they log in it's another time stamp and that time stamp in the email should be the system time stamp not the delivery time stamp or like email provider it should be the system time stamp from the back end and so they should match with what Ashley said on the page I mean there there's a lot of stuff like this happening And you know there is uh no smoke without fire. Do you say like that in English? Uh how do you say there is there's no smoke without fire? There is a lot of smoke. There's a lot. So I would say I mean probably somewhere in the middle. Probably somewhere in the middle. Uh are they crystal clear? You know white bunnies over at Binance, you know, fluffy bunnies. Super crystal crystal crystal clear. No no issues. No listen. I mean he went to jail for for some uh for some business for some shady business. uh with allowing us clients. So I mean likely uh can it happen? I I I I wouldn't say obviously I don't know but I wouldn't set the the probability to zero. At the same time there are many people who are saying oh it's manipulation. Everything is manipulation. Bitcoin stamping is manipulation. Gold pumping but dumping manipulation it's due to the evil market makers due to evil Binance and that's obviously not taking responsibility. It does obviously you know it's uh crying cry baby cry baby cry it's yeah what is it I I think we've been pretty spot I mean for us it's not the news that Bitcoin is dumping it's not the news if you're watching this channel for you it's not the news it's not you know oh manipulation it's going to be manipulation if it goes up it's no manipulation it's purely organic but IF IT GOES DOWN THEN IT'S mfing manipulation [laughter] Yeah, yeah, yeah, yeah. Guys, let's go to Q&A questions, answers, debates, discussions. Big shout out to Guzman. Check out bulmania.com to join Bulmania. Get our tools, get our education. You need it uh as soon as possible. You need as soon as possible. Let's actually see what's happening here with in our sharing gains channel. Uh look here, anti-gravity. We have D5 Wolf X putting a very nice trade uh with CC um entry 0.16 exit 0.17 nice 30% gain using the mechanical rules that we teach in bullming.com fantastic uh next I mean even if you have a you know basically no price move if you use leverage correctly you short you long can still be 10%. So that's what happened with who is this? Mooncat. Very very nice. Uh oh. Sui Sui shorting the crap out of Suri. Kajoro. Kajoro in Bullmania. Shorting the crap out of Suie from 1.4 to one 1.3. Um using mechanical rules position management. Very very nice. Uh fantastic gain. And the other ones I think I already show showed you this yesterday. This guy uh 77% just shorting Bitcoin a small distance from 87 to 85. I mean could have made way more but it's all about capturing the move in a risk adjusted way with risk management. So if if he has this uh setup, he needs tight stop loss, he needs very good position size. And we teach all of that in bullmania.com. And even if you are a holder, you also in boom.com because I mean the holders, they it's also a curse. They huddle to zero. Okay? Diamond hands, diamond hands, diamond hands, and they sell. So even if you don't uh trade in this way, I just showed you on on the shorter time frames, you you more want to trade on the longer time frames. Buy the correct altcoins before the next Valhalla. Uh not huddle them down to zero. Many people say, \"Ivan, I I roundt. I roundted again, man. I It's my third cycle. I'm going to roundtrip all of them [laughter] because you're a hot like people have this idea of being a holder of something positive. In reality, it is the dum dum. When it comes to all coins, it's the rough reality that the holder is normally the dum dum. Okay. Uh, of course, if you are in Bitcoin and anything else, even if you hodddle, it's going to be very tough. Your life is going to be very bad when your bags are down minus 80%, 90%, your your wife, your family is going to notice that you you have problems with the portfolio based on your mood if you don't uh follow the trend. But you still going to be okay. You're still going to make it. You going to lose a lot of nerves, but you're still going to make it at the end of the day. But with all coins, it's mainly dumb dumb. You know, you you buy something, you think your community, your um yeah, you like Dumbo, [laughter] big ears. like, \"Hey guys, let's hodddle. Let's hodddle.\" The founder is out. Team is out. Early insiders out. Everyone out. And he's like, \"Let's hodddle.\" Guys in the Telegram was happening when Binance listing were down 80%. Then you get nervous. You get banned from Telegram because they don't like you being nervous. You you you say something that is kind of, you know, not too positive. You're you're banned. You're banned. You're like the the the one the holder who is left. They ban you because they don't want fud in the telegram. Okay guys, [clears throat] listen. I am I am telling you that because I've been there. You've been there. I know most of you have been there. Most of you maybe are there still. You need to go to bulma.com. Watch the free video. I educate some guys. And if you want to trade, go to bulmania.com/partners. Exchanges I use. It's a link in the description. Exchanges I use. Click it. Click click click. Go to Pionex. You can trade stocks, crypto, anything. You can do bots. Go to buy bitunix weeks. You can go long. You can go short. You can make money on crypto password. And you get big fat signup bonus on all of them. On all of them. So that's that guys. Let's go to Q&A questions, answers, debates. Let's go. Let's go. Let's go. Let's go. Let's go. Let's go. As soon as possible. What about Cardano? Exactly. What about Cardano? How fast will we get to the 200 week moving average? I don't know how fast. I don't predict the time, you know, how fast or how slow. It's impossible to know, man. Uh instead just focus on the big picture that um it's not that far off. Uh we just need another leg down. I mean we need another leg down like this. It can be in a few weeks really. I think it can be quite fast because you know we've been the sideways here and so now if we break down it's going to be another leg down. So how big is it? Can it be something like this? Yes. I mean we could be here quite quick guys. We can be here quite quick. And again uh don't wait until exact dollar amount of 200 week because maybe we front run it. We don't know. So you know getting within 10 to 5% starting to accumulate here already it's I think it's pretty smart. And also remember we can go below uh 200 week. Uh sorry 200 week not this is 200 week. Did I say 50? It's 200. So also remember we can get below um for example in the last bear we went how much below we went. So just you you know mentally you're you're prepared to be a bit underwater but it's it's not it's not too big of a So here it went 20% below. Okay it went 20% below. So you need to be mentally prepared for a short period of time to be underwater because it could go below the 200 week as well. It could but based on simulations based on the statistics uh if you look at the 200 week moving average and you see the let's see 200 there it is. There it is. And you see the results of buying uh around uh 5% buying within 5% of 200E moving average is very nice. You see here it's very nice. One month, six month, one year. So just based trust the process. Trust the math. If we come close there, click click click click click click click. Don't go all again. You don't have to go all in, but start accumulating. We're going likely going to get there while we are still in a bare trend on the money line. But just from a risk perspective, you know, building long-term position at 200 week, you can do it even when my line is bearish because this is such a deep value. This does not apply to all coins. Okay? Some people they they hear what I say about Bitcoin, then they think their [ __ ] is going to be the same. No, on all wait until actual bull flip. With Bitcoin, you could frontr it because it's it's Bitcoin, man. It's it's going to go to a million bucks. Now that gold has moon so much, the potential of for Bitcoin has also increased. Now that you know that people have seen how much gold can pump and how quickly as soon as Bitcoin puts in a few nice green candles, the whole world is going to follow because then they they saw what gold did and now Bitcoin is waking up. It's going to get crazy. So uh here that's why we here we're going to start buying even if the bear is uh still red. We will be anticipating going below 200 week but just knowing the statistics it's okay. And then once we actually also go green on the money line, that's, you know, that's the, you know, mortgage the house kind of uh moment. Not really. I mean, not financial advice, but you know, it's such a nice like risk from a riskreward. This there's nothing better. There's there's nothing better. There's nothing better. So anyway, that's that uh silver at 98. Do you think I think it can go down way more? I mean, it's it's way above the moving averages. It's I mean, you see yourself, man. [laughter] It needs to go to like 52. Okay. So, uh this thing but again just to remind you guys this thing is going up. The 50 average is going up. I think it's going to touch on some at some point. I think we can easily see silver at like 70 80. It can definitely happen. But also we're still in a bull trend. So as long as we are above 94, we don't close uh the week below 94. We're still in a bull trend. And yeah, don't over complicate it. For now it's bullish. If you have a position here, don't sell. Don't sell everything. You can you can you can start taking profit obviously, but follow the mechanical rules. Don't don't sell just because it's a red. It may continue to the upside also. But from a riskreward perspective, if you have no silver buying here, I wouldn't do it. Instead, I would wait for a return to some moving average. It it's going to happen at some point. Uh from a riskreward, always moving average is is the best is the best. Um so yeah, all pump you can look through history here. It pumped it came back to the 50 week. Now you see 50 week actually increased a lot here but it came back and you know accumulating here it's uh very nice and then also it actually went back to the the white one. So you know in this pumps you know it's going to get attracted down both to 50 week 200 week it's uh yeah so the value is in the moving averages guys. Uh and if you can get it at 200 week is then it's a no-brainer. It's a no-brainer. Even again, silver is kind of like what we said with Bitcoin here. It went below a bit, but who cares? It's still a no-brainer. Uh, you average in somewhere here. Fantastic. So, this is I mean, you see, historically, historically, it actually goes to 200 week. Not only 50 week, but 200 week. So, now we're so far above the 50 week. It's going to come back and likely also going to go to to 200 week at some point also that. So, yeah, that's that. [snorts] From a risk perspective, wait for them to um Yeah, wait for them to come. If you have zero silver, if you have zero, but I know many people they follow you in anyway, so yeah, good luck. Ivan, have you already set your limit order down to where? No, I I don't have a limit order. I should I should, man. I should uh that that's a good point actually. uh I I will set the limit orders around 10% from the I will start like having 10% maybe then 7% 5% boop all the way to 200 week um but I don't think it's guys don't listen it's not like it's going to be boop and you missed it I don't think it's going to be likely [laughter] it's going to be that we go to 200 week we relax there for I mean just look at all the previous times this is not a Vshape Bitcoin will not have a V-shaped recovery there is no V-shaped recovery with uh with highest like I mean never say never but with highest likelihood always when we come to 200 week I mean we relax here for a long time uh you know a long time uh here it was long time after this uh after this bull boop how long we were here from November until April so he had a long time here it was fast but this was not I mean this this is not the this wasn't from the peak like the time from this peak the real bull market peak to the next pump that we spent at 200 week. I mean it was all of this time and then all of this time also. So you had a lot of time here. Uh then let's check in the last uh in the bull market before that. If we check here yeah also here was a long time you had a long time. So it's not guys it's not going to be Vshape that will come here a millisecond and it's gone and Bitcoin is at million [laughter] but is it smart to set a bit of automated it's smart it's smart um but then automated I would probably set actually let me think about I would the automated ones I would probably set them maybe below 200 week in case there is like some u you know crash some something happens a flash crash you can grab super cheap because within 10% % you don't have to hurry with that. I mean I I think it's going to you're going to get the uh if you want to set some dry powder automated set at cheap cheap cheap so in case there's like a flash crash when when you're sleeping. So you actually can capture something which is hard to capture manually within 10% of 200 week I think you will be able to capture manual. You can still set that automated order but it's not going to be you know some that you you you capture some alpha that's uh but if you set below 200 a week or at 200 week maybe it's going to be some capturing you can do that would not be possible otherwise. I mean, do you buy actual silver or trade? I don't have any like precious metal except the watch. Except the watch. That's it. I don't I I don't I don't like like physical guys. I don't like I don't like I like mobility. If uh like you Guzman, for example, you have a new tax coming that's going to tax your unrealized gains. Uh how you going to transport it? You're going to take it to the airport. How you going to transport it? I I don't know. So, I like mobility. I like mobility. That's why I think Bitcoin is going to come back big time because it's simply not practical for the average person to have a bunch of gold like you where you put it on you can put in your tooth. I mean I the what I like is in case you can like put it in your body, you know, you have like teeth like so it's easy. It's easy. There are no questions. There's there are no questions. Uh you can you know put a freaking diamond in the to [laughter] the exact rules but basically where they don't ask too much [laughter] otherwise I would be I would be uneasy you know it would be uneasy. How do you transport it? Let's say you need to change you need to change uh location. How would you transfer? Goldman [laughter] escapes Netherlands with a big fat gold grill [laughter] in the teeth. So is a problem with precious metals. It's a big problem. So yeah. Hey, ETH looks dead on the monthly. A potential drop. Let's see. East, east, east on the monthly. Let's see on the monthly. What's happening on the monthly? Uh yeah, I mean it is enormous. Yes, it's kind of I I I wouldn't say anything crazy has happened yet. It's kind of still in this uh range that uh it's been in a long time since forever. So yeah, I mean let's not over complicate it. It it is in the range here. It starts breaking this range then it's going to be some but yeah absolutely. Oh yeah you said it can go to it can go to 800. It can go to not 800 but it can go to 900 without actually like breaking the range. So can it go to 800 900? It can go here get support and yeah exactly. So that's a big fall still. Uh yeah, I can still fall like yeah 60%. So ETH is in a range and the range bottom is somewhere here at Yeah, like 1,900 somewhere here. When we go down, you think scooping up soul or you see new players? I will probably scoop up Soul. Yes. If Bitcoin goes to 200 week and then Sana flips bullish on the weekly, I need Sana to be bullish on the weekly though. That's going to be a signal. Absolutely. Absolutely. I I I think that Sana it's uh I mean I I really think it's the best uh platform. There's nothing else like it with retail adoption. Everyone has Phantom wallet this and that. I'm a use case enjoyer myself of Solana. I don't have Sana now because price is bad and since October I don't have it. But uh for I'm a use use case enjoyer. So I hope Slana goes to 30. [laughter] You know let's if we are to make some evil plan if Slana goes to 30. Holy macaroni. It's going to be great. It's going to be great. Let's play some classical music and do evil plan. Ah, brain massage. Let's see. Let's see, guys. [music] Our evil plan is that Sana dumps 75% and we buy it at 30, you know. >> [laughter] >> Like clock C clockwork orange. You know Clockwork Clockwork Orange. You don't know. You're uneducated or you're educated. Let me know. Exactly. A Joker. Exactly. And that would be very nice. That would be very nice. I mean guys, Sana still 115 is like too expensive. I want it demolished. I want it I want it demolished. Okay, let's check now with Sana. You have to look at the market cap because the staking rewards are too big. So, it's inflated fast. Let's look at market cap. [music] You see, market cap hasn't really broken down bigly. I want it to break down bigly. Bigly big. Sorry. Sorry. This we cannot play. We cannot play this. We'll have to cut it out. So, bond villain. Exactly. Exactly. Exactly. But you see, I play Tchaikovski real music and then this pop comes. I don't like this. This is how can the classical music not be this uh that everyone listens to. It's crazy man. We need Chaikovski back in the educational system. Bov 9. I like Chakoski. He's very nice. I hear he's canled now. Is he canled? This is another one. >> [laughter] >> It was my girly playlist. Exactly. Exactly. Exactly. Is the is the girly playlist. I don't lie. It was your girl. Exactly. Exactly. It's like this grew, you know? It's like evil grew. Despicable me. Exactly. Uh so uh basically market cap in soul if we get back to it's too high still we need soul demolished demolished before it's u like nice value it's still kind of at this heights you know from the previous uh 2021 um we need it demolished demolished further so yeah let's hope for that I think if you are I mean listen if you are in soul uh Yeah, close your ear or something. If you're not install then uh we should um yeah if it gets towards uh that you know 50 40 it will be very nice actually. Same for ETH. Yeah, let's check ETH actually the market cap. The market cap. Yeah, I mean ETH is also too high. I mean to be fair, it has a long way to go still. The fall can be quite fast. I mean, listen, it can be within a few weeks, we can fall from where we're now to Yeah, but maybe if it goes to like 200 I would love it I would love ETH to go here 200 billion something like that. That would be very nice. That that'll be like nice fair value. You know, it kind of returns back to good old times before the But wait, wait. it. Yeah, it went all the way here already in in 2025 actually. So, you see ETH has a nice support here at around 200 billion. If it goes somewhere here, it would be very nice. M maybe a bit higher, but uh around like 200, 250, 220. I don't still open for the idea of page penguin coming back or will we be watching for we'll always be watching for new coins but I think page is gonna come back Luke is working everyone's working I like P but I'm for sure in the if once we get to the next bull is going to be it's going to be different it's going to be different uh action I don't so if you were to predict what are the next two or three narrative I have no clue I don't want to predict that I don't care also and I don't know I don't know why I care about narrative I don't want to predict narrative. I It's not good. You get wrecked predicting it because how can you predict that you know in 2021 that freaking monkey NFT is going to be worth $400,000 or like penguin? How you predict that? No, no one can predict. You just need to see what's happening and follow the trend. That's it. That's my philosophy. I don't know. I don't care either. It's too unpredictable. Dog with hat. How do you predict dog with hat? Dog with hat like the biggest meme coin of last cycle. Okay. H how you predict it? I don't know. Yeah, I don't know how you predict it. So, no one can predict um things. Don't be too smart. You see something taking the taking off, be part of that. Otherwise, you let's say, let's say I give you prediction. You wait for that. You miss everything else. It's it's Dumbo. You don't want to be Dumbo. Don't be Dumbo. Instead, let's see what you know ordinals. I think it's Yeah, it's a bit [ __ ] but it was pumping a lot. JPEG on Bitcoin. Fantastic. Then they stop pumping. So [snorts] let's not over complicate it. These things they come and go. Things that don't make sense pump. Things that make sense don't pump. Then they we just react. Privacy are I don't know. I I don't know. I don't know. I don't care. I don't care. Wigsor it's don't worry too much about that. Just follow the sh. Why you care so much? Don't don't don't worry. Be happy. Don't worry. It's going to be okay. We We're going to see what's going to happen, what's going to pump. We're going to be part of that. That's it. That's it. I think it's impossible to predict. It can be some, you know, randomass thing in time. O Bitcoin minus 14% since the bare flip. E minus 23. Solana 3. Yeah, bare flip. Bears are running the show here. Guys, you have to be careful, man. You have to be careful. You see this? This is the problem with alts. This is the problem with alts. Oh my god. Yeah. You cannot give them the benefit of the doubt. They're going to take all your money. All your money. That's why we don't huddle in a bare trend. We don't. We don't. I mean, see yourself. So, this is why if you are a wrecked altcoin holder, you wrecked I mean you wrecked like 88% anyway. So, let's hope that we go actually to 200 week moving average for Bitcoin. We reset and we continue. How low you see Avax going. I think it's going to go to alltime [laughter] low. It has such a crazy downtrend. But again, I don't know how low. We just see the trend now is bearish. So, it seems to be going to new alltime low. But if it turns bullish out of nowhere, we're going to be bullish. But but now it's bearish, guys. It's going to new alltime low. Okay, it's going to new alltime low. Any insight on Pango? Still holding your bag? I still hold my airdrop. My airdrop. I still huddle. I don't sell airrop. Um and uh I I hodddle the penguin also. What about moving to Russia? I know this sounds crazy, but uh for some, but Wigs, why you know the questions today? [laughter] Big shout to Wingsor. No, definitely don't do it. I've seen a few people. Some guy moved from Texas to Russia. Uh it's he cannot be helped like he cannot be helped like the people have some kind of picture which is not correct. I mean listen we can we discuss it at length but let me just tell you it's you don't want to go from Texas to Russia. I don't [laughter] want to do. Exactly. Well, I think he got sent to the front line also. I think he he kind of got out. He got out, but uh yeah, it's um that's a real dumbo, guys. When you go from, you know, like that guy, so he was from Texas. He went to [laughter] he went to Russia. Great. Yeah, that that's the thing. You cannot drink the Kool-Aid too much. You cannot drink the Kool-Aid too much. what you hear online is um yeah traditional values [laughter] from EU to R. Yeah, it's uh don't move from EU to Russia. Don't do it either. I mean this is the thing. I mean we obviously we joke about EU this and that but u I mean you need to also keep things in perspective like EU is not competitive against US. It has many weird things but uh like Russia it's another level man. It's another level. It's another It's It's It's another level. [laughter] It's another level. But it's crazy like Westerners like LA, let's move to R. La. [laughter] [clears throat] I mean, the propaganda is working very nicely. Very nicely. Uh they they do a bit of uh pictures from Moscow. Westerners are like, \"La, let's move.\" Fantastic. Fantastic. Wow. It's the best. Propaganda is the best. Yeah. Anyway, man, if you move to Russia, let us know. [laughter] Oh, guys, thanks a lot for being here. Big shout out to Wigor for the spicy question. What propaganda? Where? Yeah, I I leave you with that. I leave you with that. Everything else is up to you. If you move to Russia, definitely let us know. I mean, I'm actually interested how uh if if you if you do it, [laughter] we're going to follow your journey. Uh okay guys, thanks a lot. Big shout out to Guzman for time stamping us. Big shout out to everyone who ask questions. Great questions. Really love and you know even when sometimes you know I comment, I joke about the question, you know. I love you guys. I love you guys. It's it makes the show fun. It makes the show fun. So smash the like, subscribe. See you all Monday. If you are in bull menu, we're going to have a private stream in approximately four hours. Enjoy. Have a good day. And goodbye, guys. Goodbye. Goodbye."
    }
]