[
    {
        "video_id": "GKzxlzpbx3s",
        "title": "The Shocking COLLAPSE in Iran&#39;s Money - what it means now",
        "published_at": "2026-01-10T20:44:35Z",
        "sort_date": "2026-01-10",
        "url": "https://www.youtube.com/watch?v=GKzxlzpbx3s",
        "transcript": "$1 now gets you nearly of 150,000 Iranian tommen. So a massive crash, a massive depreciation in the currency. By the way, in case you're wondering why my friend is collecting them, well, I think it's a hobby of his, but also I think he believes that these kinds of currencies could have enormous value uh in the future. That would get you nothing. You cannot buy anything. You would need 1,000 of these 10 to paper currencies to be able to buy a loaf of bread. Guys, I personally think that given the way the Iranian currency, the Tomman, is moving right now. I think that a major news event is around the corner. What you're seeing here right over here is panic. Massive panic. Hey guys, Allesio. Hope you're well. This is going to be an unusual video because even though you probably know that I've visited Iran many times, I've been to Iran multiple times in the past. I don't usually talk about Iran's currency or even show you these kinds of charts about what's happening to Iranian money right now. And by the way, let me just say that what's happening in Iran right now with the currency is by no means a shock. I've been expecting pretty much this to happen. Some of you probably heard the news about what's happening in Iran. So I'm going to go into this bit more detail for you about what's happening to the Iranian currency. Explain to you also why there are people out there who are collecting these these old Persian Iranian uh currency notes. So that's going to be quite interesting. And also my projections. is going to talk to you about my major projections about uh the Iranian currency going into these particular charts here. So, this video in my view could be interesting to you whether you live in Iran or not. Okay? So, if you're just interested about what's happening in Iran right now about the currency situation or if you live in Iran and you're worried about what's happening there uh with the currency and I think by the way guys this could indicate some major news coming out about Iran uh because the charts seem to indicate that it may be some major news around the corner soon. All right guys, let's dig into the charts. Join me All right, guys. Welcome back. So, as I said, this is going to be quite an interesting and perhaps unusual video because I don't usually talk about Iran's currency, even though I've been there many times. By the way, you probably know that the majority of people on social media and in the mainstream media who talk about Iran and the situation there, most of these guys, probably all of them have never visited the country. All right, guys. Again, most of the people in mainstream media have never once visited Iran. They're not even familiar with the culture, with the people there. Now, as you probably know, I go to Iran at least once every year. And in fact, I went there last year. I got friends there. I got people I know, and I have a great time there, as I'm sure you know. I love Iran. I love going there. I have a great time. And hopefully at some point in the future, you'll have a chance. One of the places in Iran I highly recommend is the historical site going back to 2,500 years, Xerxes and Cyrus, who built Procepilus. Uh let me just say also one more thing that because of the internet shutdown in Iran, I have not been able to contact any of my friends uh in Iran. Okay. So, you know, I've been trying to contact them and, you know, ring them and uh indeed there's been only one tick on on WhatsApp. There are no two ticks on WhatsApp when I message them, which goes to show because the internet blackout at the moment as I'm making this video, nobody out there, none of my friends are able to receive my messages or even to call me or contact me or probably the same with you. And by the way, guys, let me know in the comments section if you have friends or family in Iran, have you been able to contact them and message them? All right, guys, let's dig into the chart. First of all, what you're seeing here is a chart of the US dollar versus the Iranian currency, the Iranian Tomoman. This chart is from bonbas.com. You'll see it says all prices are in Iranian Tomman. And that's the currency that people use in everyday life over there in Persia. Uh, by the way, as I'm sure you know, Persia is just another name for Iran. As we can see here, you can actually see the depreciation of the currency a lot better if you just invert the chart. back in 2017 when I went there. Okay, I remember at the time one British pound would have got me 5,000 Tomman or $1 would have got me about 4,000 Iranian tomahan. You can see there. Okay, now you can see the depreciation uh from 2017 all the way to 2026 more recent times here. So $1 now gets you nearly of 150,000 Iranian tommen. So a massive crash, a massive depreciation in the currency uh which again a lot which has caused a lot of worry and and I know a lot of my friends in Iran have been extremely worried about this. By the way guys let me just mention one important thing. Over Christmas a friend of mine who's an investor in many things including currencies in fact old currencies and notes he was very kind enough to give me a gift of these old Iranian currencies. He said to me he's collecting these kinds of again old Iranian Persian currencies which as you can see here they're quite old because uh the picture on the front of the currency is the Shaw the former king of Iran by the way in case you're wondering why my friend is collecting them. Well, I think it's a hobby of his but also I think he believes that these kinds of currencies could have enormous value uh in the future. Now he's more of a long-term investor. Uh some of you probably may think that collecting Iranian currency is crazy but anyway everyone has their own point of view. Going back to the chart of the Iranian currency. Something I should mention here is that some of people who are watching this video may not realize exactly how Iranian currency like what you could buy with Iranian money. But let me just give you an example. This particular currency that I'm holding here which is 10 tomoman 100 Iranian real at the time in 1975 1976. this currency at the time of the sha uh this currency would have got you again 10 tomoman would have got you about $1 or just over a dollar which by the way taking into account inflation in today's money would have got you about $5 but let me say this today 10 tomoman okay if you had 10 tomoman today all right so if you had 10 tommen of any particular currency that would get you nothing you cannot buy anything with 10 tomman you would need 1,000 of these 10 tomman paper currencies to be able to buy a loaf of bread. So that's why you can see a lot of people over there are in Iran again extremely worried about the currency situation where $1 just to just to give you some idea here when I was in Iran. So let me show you this. When I was back in Iran last March or April, $1 would have got you about a h 100,000 of the Iranian currency which by the way then dropped down to about 80,000 uh the next few months. But now it's shot up as you can see here. It's gone from that. It's gone from 80,000 in just a few months. It's gone up to nearly almost 150,000 to massive again depreciation the currency and as I showed to you earlier you can actually visually see this much better uh in this upside down chart. The question you're probably wondering is okay, where is Iranian currency going and what could this mean? Guys, I personally think that given the way the Iranian currency, the Tomman is moving right now. I think that a major news event is around the corner. Uh because usually, again, usually when price becomes parabolic like this, like we're seeing here, in fact, let me just zoom in here so you can actually see it better. So, this go this chart goes back to January of last year. So usually when price becomes parabolic and moves too far too fast like you're seeing here uh I think that it's coming close to a turning point. I think price here is coming close to an inflection point or a turning point. I don't mean necessarily has to happen immediately. This could take some weeks or months but I think that we are coming very close to a major top in the price chart. In other words, a major top of the dollar versus Tomman. I think that's around the corner. Now let me let me say this. When I say top, I don't mean necessarily it has to be a long-term top, but I think we're coming to an intermediate temporary top before a major pullback. Now, in case you're wondering, well, how could that happen given what's happening in Iran right now? Especially, some of you are probably wondering, well, if the US attacks Iran, you know, if President Trump, for example, launches an attack on Iran, some of you probably thinking, well, that could cause even further massive inflation with the Iranian currency depreciating even more, and this price could go even more parabolic. Actually, that's not the case. Let me explain this. Usually when a war begins, it brings about more certainty than uncertainty. Okay? When price moves parabolically like this, when price moves in this way, this shows fear right now. Okay? So, what drives price action, as I've said many times in my videos, the news or fundamentals is not actually what drives price. What drives price is sentiment. So emotion, fear, greed, panic, euphoria, again, anxiety. These are the things that actually drive price action. So it's the psychology of market participants, the people who are buying and selling this currency. That's actually what's really driving the price. This massive parabolic rise of the dollar versus the tomahan, which again shows massive depreciation. The currency shows fear. What you're seeing here, right over here, is panic, massive panic among people in Iran right now. In other words, people are selling and ditching the Iranian currency, seeing it as worthless, and buying the dollar. This sounds like common sense, but we have to remember, guys, that market prices price actually does not follow common sense. We have to remember markets are chaotic, which means they're unpredictable. They're nonlinear. When I say markets don't follow any common sense, look at this. This is the Iranian currency during over here during the Iran Israel conflict right there. So when Israel had control over Iran skies back in June of last year, that was here. Notice despite the spike in the price, it did not move above the prior highs. You would have thought in the Iran Israel conflict with all that bad news going on at the time, you would have thought Iran's currency would have gone up massively, spiked to 200,000. That's not what happened. In fact, you can see it then soon after dropped back down again. All right? But it took many, many weeks and months before the Iran's currency could move to where it is right now. So personally for me I do think that a major news event is around the corner but I think that's going to be an effect of after the Iranian currency there's a major turning point. So I think there's a major turning point inflection point coming and then I think that's going to be followed by a major news event. Now I don't know what that news event is. I don't know if it's going to be good or bad or positive or negative. The news might be that perhaps Trump is going to attack Iran or it might be something else. It might be something that happens in the country. All right, guys. So, I think that given the way that the price action is moving parabolically right now, I think we're coming close to a major turning point. So, even if let's say President Trump were to announce some kind of war with Iran, that does not mean that the tomahan is going to depreciate even more or that the dollar is going to skyrocket even further. No, in fact, that's usually about the time when we can see a major turning point, a reversal in the price. Okay. Okay. So, where do I think the Iranian currency could be going against the dollar? Well, here's the thing. I think that on the balance of probabilities, so I've gone back to 2017 here, and I've plotted what I think is a reasonable wave count. And I think that we're in the final wave five or wave three. If you're familiar with Elliot wave theory, again, as I mentioned earlier, usually diagonal patterns occur. These kinds of parabolic rallies occur in wave five. Usually wave five of wave three or wave five or wave five. In other words, if we go to this particular model, I think it's quite possible and probable that we are here in the wave five of wave three, which means a major turning point could be coming soon. Even if the dollar against the Tomman, the Iranian goes higher, even if we see a rally continuation, uh I think a major pullback is coming, a major uh turning point or topping point is coming. I think that's going to be a wave four before then we continue in the wave five. By the way, in case you're thinking, yes, there is another possibility that wave five of wave five is about to complete. In other words, there is a potential that the Iranian currency could be about to top versus the dollar. But at the moment, I'm going to keep this as my main higher probability wave count for the wave five or wave three. Uh, and I think that, by the way, if you look over here, uh, some of these projections actually show, so I'm going to show you this. Take a look uh going back as far as 2017. Look at this. I plotted this and the 61.8% golden ratio extension gives us the price level we almost reached just recently about 142,000. The next target for 100% projection could be 180,000 potentially. But between these two price levels there is also another possibility which as you can see here is yeah there it is. So 164,000 uh approximately there. By the way, this this calculation also seems to indicate approximately that same level near 166 to 157. By the way, if this extends further higher, then we could get to 180. So we have a few projections here for the dollar versus Tomman, Iranian Tomman, approximately 157,000 to 166,000 to potentially 180,000. Okay, that's as long as as long as the price. So, let me just go to the chart again. That's provided that the dollar versus Tomman stays above 130,000 support. So, that's our support level, 130,000. In other words, as long as dollar versus Iranian tomament stays above that support level, that level at 130,000, there is potential here that this rally in price, which actually is a depreciation of the Iranian currency, uh could extend to the 160,000 level to potentially even 180,000 level as long as it stays above 130,000. Now, what does that mean? It means if if the dollar versus to man were to drop below that level that may indicate a top whether an intermediate top or a long-term top. Now let me say this. We may get a pullback a pullback is always possible. Again price does not always move in one direction. So we may get some kind of pullback. All I'm simply saying is that as long as price again as long as price uh the dollar versus uranian stays above 130,000 this support there's potential here for again this particular chart this price action to move to 160,000 potentially even 180,000. So before I finish this video I want to send my love to my friends in Iran who I hope I'll see again. So thank you very much indeed guys for watching this video. Let me know what you think. Let me know your thoughts in the comment section. Thank you very much indeed. Cheers."
    }
]