[
    {
        "video_id": "YBCCOApxC2E",
        "title": "Is The Crypto Market Being Suppressed?",
        "published_at": "2026-01-10T14:00:56Z",
        "sort_date": "2026-01-10",
        "url": "https://www.youtube.com/watch?v=YBCCOApxC2E",
        "transcript": "Have you ever heard of the Bart Simpson pattern? >> Bart Simpson. >> It's when a chart jumps suddenly in one direction, chops sideways, and then snaps back to the previous level. Kind of funny, right? >> Well, maybe not. >> Bart patterns can actually signal market manipulation, and they've been appearing a lot lately. >> I rumba. >> That's why today we're going to answer the question on everyone's mind. Is the crypto market being manipulated? And if so, who is behind it? and when will it ever end? Well, let's get into it. Before we begin though, you do need to know that I am not a financial adviser and nothing in this video is financial or investment advice. It's educational content intended to inform you about crypto market manipulation. If you enjoy content like this, then prove it by punching that like button. Now, have you ever looked at a crypto, waited for what felt like the perfect moment to ape in, sat back expecting gains, only for the chart to move the opposite way? You're not alone. Crypto traders everywhere face this constantly. Even when a trade looks like a winner on paper, it could go against you in practice. And that isn't always down to sheer bad luck or ineptitude on your part. Behind the scenes, large players pull the strings to make sure your money ends up in their pockets. This is market manipulation, and it's not exclusive to crypto. In fact, it's a tale as old as time with examples stretching back centuries. But crypto is the easiest market for the bad guys to manipulate. Why is that though? Well, in short, it's because crypto is still new compared to other asset classes. The result is that market surveillance is far weaker and it's made even more difficult by the pseudo anonymous nature of the crypto industry. While major progress has been made in recent years to build the regulatory framework crypto needs to thrive, it's still very much a work in progress. For now, gray areas remain and market manipulation knows it. And it's easy to manipulate the crypto market because liquidity is so much thinner, mainly because it's spread across many exchanges, blockchains, and protocols. This makes spreads on buying and selling wider. For those who don't know, the spread is simply the difference between the price sellers are asking and the price buyers are willing to pay. Wider spreads can lead to wild price swings, creating opportunities for large players to exploit air gaps in liquidity. They can manipulate order books to push prices up or down for their own profit. Even moderately sized orders can move prices significantly if they hit these air gaps. This is especially true when it comes to newer cryptos, which are the easiest to manipulate because they're the least liquid. For just a few thousand, anyone can create a project promising to be the next big thing. This lurs retail investors hoping for a ride to the moon only for their investment to collapse while insiders cash out. It's not just low liquidity either. Most crypto traders are retail investors, ordinary people like you and me. And yet, the largest share of trading volume comes from the so-called smart money, which is a flattering term for large investors with lots of cash. And because they're the smart money, that apparently makes us the dumb money. The point is smart money wields far more influence on the market than dumb money. And the worst part is that the dumb money is actually pretty predictable. Broadly speaking, we all follow the same news, the same technical indicators, and react with the same emotions of fear and greed. Smart money investors know this and pull the strings to their advantage. But it is important to note that not every whale is a market manipulator and many institutions and large players trade crypto OTC to avoid moving the markets. Logically, this suggests that whales who trade public markets are potentially doing so with the intention to manipulate and mislead. Food for thought. And by the way, if you're buying and selling crypto and want to make sure that you're using an exchange that isn't trading against you, then you have to check out the Coin Bureau deals page. That's where you'll find exchange signup bonuses of up to $100,000, trading fee discounts of up to 50%, and deposit cash backs of up to 75% on the best crypto exchanges. Just hit the link in the description or scan this QR code, which will take you right to the deals page. There you'll see all of our offers across a range of exchange partners. Simply click one of the sign up now buttons, and that should take you right to the deal. These deals won't be around forever, though, so take advantage of them while you can using the link below or by scanning the QR code. Now, this begs the question of how can you tell if what you're seeing is genuine market activity or just bad actors creating false impressions. Thankfully, there are a number of chart patterns to watch for, one of which we mentioned in the intro, the Bart Simpson. To refresh your memory, the BART pattern refers to price action that looks eerily similar to Bart's head and hairline. It starts with a sudden move up the left side of Bart's head, followed by a choppy sideways action, his spiky hair, then ends with a sharp drop back down to the previous levels, the right side of his head. There's also the inverse Bart pattern, which is basically Bart upside down. It starts with a sharp drop followed by choppy sideways action and then a sudden rise back up. Bart patterns are assumed to be market manipulation because this is exactly the kind of price action that you'd expect from a group of whales looking to profit off of retail investors. A big jump or drop distribution or accumulation and then another big drop or jump. And Bart patterns mostly show up on short and medium time frames because it's easier to manipulate prices over short periods. So, how can you tell if a Bart pattern is manipulation or just normal crypto volatility? Well, just check two things. The first is volume. A Bart pattern usually shows a surge during the initial move up or down, which then tapers off during the sideways consolidation phase. Once volume is low enough, then the price snaps back to its starting point, accompanied by another spike in volume. The volume tells the story more clearly than the chart. The initial surge, well, that's bad actors pushing the price up or down. the low volume during consolidation, retail investors getting caught up in the move and the final surge, that's the price reversing as manipulators cash in. The second thing to watch for is a market catalyst or lack thereof. Simply put, if there's no obvious reason for traders to be rushing to trade the crypto in question, ask yourself, why is the price moving like that? If no clear reason exists, it's likely manipulative whales trying to catch you out. Note though that sometimes it can be hard to find this catalyst and it's important to remember that macro catalysts can also affect crypto prices as well. So it's not just crypto catalysts. Now while BART patterns are worth watching, there are other ways that malicious whales try to take as much money as possible from the rest of us with classic pump and dump scheme being one of the most frequent. Another manipulation tactic is called spoofing, which is a bit more nuanced. Basically, it involves placing fake orders to influence the market's direction. Wills place massive orders without ever intending to fill them. Then they withdraw them before they can be executed. If that sounds a bit pointless, well, think again. By placing massive orders, often worth tens of millions of dollars. Whales send false signals of high demand at certain levels. This illusion manipulates other traders reactions, making them buy or sell unnecessarily and pushing prices to levels that benefit bad actors. The worst part is that spoofing is one of the hardest manipulation tactics to spot. Detecting it usually requires digging through large amounts of trading data and closely comparing bid and ask prices with the order book itself. Another common form of market manipulation is wash trading. This is when a bad actor repeatedly buys and sells the same crypto to create fake activity, inflating trading volume and making it seem like there's high demand for their token. This tricks investors into thinking that the project has a bright future, when in reality, it's probably been dead from the start. But the additional buying pressure pushes the price up, letting the bad actor rake in significant gains before abandoning the project. And the final manipulation tactic to watch for is insider trading. This is when individuals use non-public privileged information to take advantage of or even manipulate the market. These insiders may know about major upcoming milestones, a new exchange listing, or even negative [clears throat] news like a key team member leaving. They trade on this information before anyone else, profiting when the news goes public and the market reacts. The frustrating thing about insider trading is just how hard it is to spot. In many cases, it requires thorough investigations into the trading history of the insiders. And these investigations usually happen long after the fact. The best way to avoid falling victim to insider trading is to just stay alert. If you see prices pumping or dumping right before a road map deadline or an upcoming announcement, it's a sign the crypto project is subject to insider trading. The sudden accumulation or distribution by a few wallets ahead of any news breaking out is a big red flag. Thankfully, other manipulation methods are much easier to avoid, and we'll come back to how you can do this later in the video. Okay, so by this point, you know, market manipulation takes many forms. But you might be wondering who's behind it. As noted earlier, the worst offenders tend to be whales, traders with deep pockets and advanced knowledge who deliberately move the market in their favor. That said, most whales are just like us, crypto enthusiasts who love the tech and want to make some money. It's only a small subset of whales that have turned to the dark side, so to speak. Unsurprisingly, their true identities are rarely known. That said, this smart money usually comes from four groups. Venture capitalists or VCs, institutional investors, exchanges, yes, really, and a handful of elite individual traders. Let's start with VCs. Venture capital has become a key part of the crypto ecosystem. And just like whales, most VCs are good for crypto. They provide huge amounts of market liquidity and fund early stage projects, offering strategic guidance to fuel their growth. Essentially, they nurture innovation while taking high-risk, highreward bets in exchange for tokens or equity. However, not all VCs play fair. Some with large stakes in crypto projects use their positions to influence prices, aiming to maximize profit regardless of the cost to others. They don't care about the tech. They just want to rake in as much money as possible. The second cohort of manipulators are institutional investors. Once again, institutional investors are a good thing for the space. They help drive trading volumes and liquidity, serving as a lifeblood of the crypto market. However, some institutions use their size and scale to create artificial price levels, deliberately swaying market sentiment and triggering waves of buying or selling among other investors. Perhaps the most surprising group of bad actors is crypto exchanges. Most exchanges are hyperfocused on regulatory compliance, especially as rules around crypto tighten globally. In this new era, no exchange wants to be left behind. Some exchanges though, especially poorly regulated ones, have been known to trade against their own users. To be clear, the exchange itself isn't always directly manipulating the market. Often, it's traders on the exchange doing the manipulation. Poorly regulated exchanges simply provide a space for these tactics. Fortunately, crypto regulation has come a long way since then, and stricter market surveillance requirements make this activity much easier to identify. Unfortunately, unregulated and offshore exchanges still pose a significant risk. The final group of manipulators are the worst offenders, and that's elite traders. These are a small number of experienced, well- capitalized individuals anticipating the moves of dumb money like us. Many use their knowledge and capital simply to find the best entry and exit points, which is fair, but others act maliciously, manipulating market sentiment to boost profits at the expense of retail traders caught by FUD and FOMO. All right, folks. Let's be honest. Everything we've covered so far is pretty scary. It's not nice to know that there's sometimes someone in the shadows pulling the strings, making sure they win while you lose. So, the big question is, will crypto market manipulation ever end? Well, I hate to break it to you, but the short answer is no. >> No, >> no, no, >> no. >> At least not completely. And that's just because market manipulation exists wherever money and humans intersect. And that's simply because human greed has no limits. That's why market manipulation won't just persist in crypto, but in every financial market. Stocks, bonds, real estate, art, gold, forex, you name it. As we mentioned earlier, though, manipulation is easier to do in the crypto market for the time being, and this will continue to be the case until the crypto market matures. Market manipulation should also become less common as crypto regulation improves. Stronger market surveillance and clearer rules for exchanges will make it harder for whales to exploit ordinary traders. And as the crypto market matures, liquidity will deepen, making it harder and less profitable to move prices. Investors will also become more aware of these tactics and learn to avoid them. Pain is a brutal but effective teacher. Like everything else in life, staying educated is key to your success. And now, let's wrap things up. Let's look at how you can avoid falling victim to the very tactics designed to trip you up. First, be on the lookout for any signs of manipulation on the price charts, like the BART pattern. The charts should look normal, not choppy, especially on longer time frames. Second, do some basic research on the cryptos that you want to trade or buy. Look for plenty of holders. The more the marrier, and make sure no single wallet holds an outsized share of tokens. Check that liquidity is locked and review vesting schedules to avoid sudden token dumps. Third, and most importantly, base your decisions on your own judgment, not hype, no matter how noisy it gets. Remember that market manipulators like to play on emotions. They will push prices up or down to the point that you can't help but buy or sell. Some will even go as far as paying for articles to push the narrative. Also, don't forget that one of the best ways to protect yourself is to trade on a reputable exchange and stick to large, highly liquid pairs. Recall that smaller cryptos with lower liquidity are easier to move. That said, even large cryptos, including BTC, can be manipulated. So, no matter what you trade, stay vigilant and never take price movements at face value. Do your own research, analyze everything, and act carefully. Do this and you'll not only prove you're not the dumb money whales expect, but you might even outsmart the smart money. And with that, that's going to be all from me for today. If you're wondering which trends to watch out for though, check out the video right over here. And if you want to learn about six major risks to Bitcoin in 2026, well, check out that video right over here. Thank you so much for watching and I'll see you again very soon. This is Lewis signing off."
    },
    {
        "video_id": "m_BxqDIBoQ0",
        "title": "FUD &amp; FOMO: Bitcoin, Zcash &amp; ETH on the Brink After NFP Numbers!",
        "published_at": "2026-01-10T00:50:41Z",
        "sort_date": "2026-01-10",
        "url": "https://www.youtube.com/watch?v=m_BxqDIBoQ0",
        "transcript": "Welcome to FUD and FOMO. Crypto headlines high and low. Markets move, emotions flow. It's the F and FOMO show. Yes. Yes, it is the FUD and FOMO show. Was anyone expecting that? I'd forgotten about the the reggae intro theme over there. We really playing around with our genres of music between that and our live stream team on Monday had some experimentation in terms of the best intro music for this and they settled on that. So to end a Friday off listen I I people push back on it but I said hiring a house reggae band to just be here and jamming in the office, you know, five days a week. I knew it was I knew it was money well spent and I stand by that. I think you were right. I think you were right on that. Sorry for the push back guy. That's that's that's all right. I know everyone I know some people, you know, it's a bare market and stuff, but every crypto channel should have its own in-house reggae band. And I think I've just proved that. Welcome every FOMO. People are watching the stream. It's like, what the hell happened here? Coinb is going live on a Friday on the main channel with this goddamn reggae music. What is FUD and FOMO? Exactly. Exactly. Well, this is FUD and FOMO. Everyone, welcome. This is a new live stream format uh that we thought we'd play around with. Um longtime viewers of the Coin Bureau may be aware that we already do a live stream news show on Mondays. Um but you know, we thought it's a bit of a long seven days is a long time to leave you guys without a glimpse of us live. So, we thought we'd try something a little different for Fridays. This is going to be a lot less sort of structured, a bit more chilled, a bit more of a kind of meandering discussion really about some of the stuff that's been going on uh in crypto over the last week. Um so please do let us know in the comments whether you are whether you like this new Friday live stream um or whether it's just uh interrupting you from getting out of work and going to the pub. Um but yeah, do keep us posted on what you think. I'm joined of course by uh Lewis. Hello Lewis. Good to see you. Thank you very much. You're in the uh in the jungly coin screen there. It's got a it's a green screen, right? It's a green screen set up. Oh, it's a green screen. Oh, sorry. It's actually a new tech new technology. Uh it's a green screen where if you put your hand close enough to it, it actually moves what's what the green screen is presenting. So, it's really cool. New tech. New tech. Nano nano green screen technology. Actually, AI AI. It's wild. Again, money well spent. You know, I knew I knew it was worth it. I knew it was worth it. Yeah. Um, meanwhile, we've also got Nick um in his in his It looks like an Airbnb there. But, uh, how are you doing, Nick? It's a VIP pad, man. Uh, it's cool, man. I'm cool. Enjoying your Nick crypto in the background. Um, you know, the Airbnb host must have known that you were coming. So, they set it up exactly. I personalized it for me. It's a special service on Airbnb. Perfect. I like the uh I like the slightly sleazy purple light as well. I'm here for that. That's brilliant. That's brilliant. That's Friday vibes, you know, not red, not green, just just sleas. Brilliant. Okay. Uh so folks, um today we are we're talking about a few things. We're going to be talking about um some interesting stuff happening with Ethereum at the moment. We're also going to be talking about privacy and the perpetas. Um both of which, as you've probably noticed, uh there's been quite a lot going on there as well. But also, we're kind of looking ahead because today, believe it or not, is a pretty consequential day for not just the crypto market, but markets in general because we have two big uh big announcements, big things coming up, if you like, um, a little later on today. Um, so we thought we'd dive into that. Nick, can you talk us through the first of these things that we that we need to be aware of that's happening a little later on? So literally within tminus 26 minutes we've got the first NFP employment numbers for the year 2026. Uh so these are coming in uh 73,000 is the expected number. So that's a number to watch guys. Above or below expectations it will determine how the markets move because this will of course inform the Fed rate decision uh in terms of January. Now, in terms of expectations for the Fed, uh the interest rate cut um expectations for January, it's about 80% chance of no cut, but that could very quickly change if the numbers are to the downside and it looks as if the labor market risks are uh there are labor market risks. And if you recall back to the FOMC minutes from last week, it was revealed again that uh the Fed is now more worried about the downside risks to employment than inflation. So this will be a big determinant factor in terms of how uh markets react um and how the the Fed thinking goes into the next FOMC. So that's coming out now and I'd say in 25 minutes. Okay. So non-farm payrolls and uh yeah as you said this is kind of a a bit of a focus for the Fed now. They're concentrating more on uh they're more worried about employment than they are about inflation. Yeah, exactly. Um I think that inflation is still above target, right? Um but I think that now they're worried about employment and uh I think also to the effect that the inflation itself hasn't been that badly impact impacted by tariffs which many people had worried about earlier last year. Uh so I think that and then of course there's Trump that's hot on their heels. So they're worried about any sort of hiccups in the in the jobs market. Yeah. Do you guys remember that time? It's only a few years ago now when uh when we us, you know, when we would do crypto streams or whatever or we do crypto videos and we we never seem to worry about things like non-farm payrolls or Fed interest rate decisions and then a while back everything changed and now we all have to watch data like this like a hawk. It was it was much more fun just crazy coins popping off, right? The concept of crypto bros sitting over there watching the listening to the every single word of the old fiat boomer as he determined the future of the magic internet money. How far? Satoshi w what does he think of this? You know, all these guys standing around waiting to see what and passing the language the feds speak of Jerome and co or what tie Jerome Powell is is wearing, what color and then that will determine what size before this the meeting itself like people are actually bet and now they've got you've got prediction markets that are actually like going into the drilling into the details not just of the the actual interest rate decision but in terms of words that are mentioned in these in these actual FOMC um you um presentations and and briefings. Yeah. Yeah. Yeah. They they bet on on pretty much everything. Um I even saw a new thing that was coming out where it's like you can create your own prediction markets, but I don't know how that would even work because, you know, that seems like you could just create your own uh bets on things that you know what you're the outcome's going to be. I put a prediction on the I put a prediction on Lewis taking his hat off and during the stream and insider trade that Lewis. Yeah. I mean the the the big thing with these prediction markets is is just that I mean they're so they're so obviously being used for insider trading, aren't they? I mean we got these examples of sort of massive bets from newly created wallets being placed right before something consequential happens that only How about last year? How about last year? the example of the uh green dildos on the basketball court and the guy who was caught. That's how far we've come and that's that's the future of prediction markets. People rigging um but that's it's not only um to not lose track of the convers that's happening today. It's obviously there's NFP numbers which are now coming in like 12 like 22 minutes but there's another big event today as well. Right. There is. Yeah. So you mentioned tariffs a little earlier uh Nick and obviously they were the kind of big economic story of last year um and had a huge effect on the crypto market uh as much as anything else but uh they those tariffs were challenged in the Supreme Court um because uh there was an argument made that um Trump wasn't actually able to act kind of unilaterally like he did. Um so the tariffs were challenged and the Supreme Court is actually delivering its ruling on that challenge on that particular case later today as well. In fact I think uh within the next hour or so. Um and what this means is that there is a possibility um that they will rule that the tariffs are were were not lawful or you know not legal um and therefore need to be rolled back which could and I do underline this is you know this is one of several possible scenarios but it it could mean um that the administration has to pay the tariffs back uh to all those you know American companies that have paid them um which is of course hundreds of billions of dollars already. Um so there is there is quite a lot on the line here. Should mention though that there are there is more than one outcome or two outcomes. It's not binary. There's a few other options here. One is that the Supreme Court rules that um on you know the more optimistic side they say okay well all future tariffs so essentially what's already been collected is not going to be refunded. So the president can't implement any more new future tariffs and they won't be applicable going forward. So retroactively uh they won't go retroactively. And then also there's another option where they say certain tariffs could be still applied if assuming they fall under the wrapper of national security threats and that's the ones that relate to the fentinel that's potentially Mexico and Canada. So that's another potential option. So there's at least you know four different rulings that could happen here and three that are kind of like medium ground. Well, two that are on medium ground and one that is basically complete uh refunding of all the tariffs, striking it all down and then the other two in the middle. So, it will be really interesting to see what happens. I think the main thing people in terms of the markets, if it is a complete strike down and the the government will have to refund those tariffs, that's going to be a massive risk on move for the markets because it's going to be fiscal stimulus. uh but then you know potentially rates could uh shoot up because of concerns around the fiscal uh fiscal position of the US government because now they've lost those tariff revenues. So it will definitely be something to watch. I think that's within at least maybe an hour it will come out. Yeah. And in fact if the uh if the court does strike them down then the White House um is expected to immediately try and reimpose them um but just using different legal authorities apparently as well. So um it might just be that it's a case of okay you say you can't do them well we're doing them under this particular section or whatever it is um which would in itself probably trigger another legal challenge. So although I guess there's a there's a sense that we might get some kind of closure on this, actually what it likely means is we could just be a whole load more um a whole load more deliberation which I guess probably accounts amounts to a lot more uncertainty in the long run. Yeah, I was that's what I was thinking. I for some reason I just don't think they're going to come to a hard decision on it today. And it did say like today's like decision day for handing down opinions. Does that mean that it's literally like they have to uh you know come up with a with a legit decision right now? Like one of those four decisions or is it like today is the day that's the final decision day on what could possibly happen in like like in the future? like they need to come up with their mind of like of those four different you know things and then be like these are the options and we'll we'll figure out the op we'll figure out like what what's what you actually decide later down the road. Yeah. There always seems to be something like that that that that ends up happening like it it just from in the government from what I've seen you know. Yeah. Like it it would be really shocking to me if today if if all of the sudden someone you like they just came out, oh hey, yeah, you have to repay all of these like and like that was that was the decision, they come out with it like today. I don't know. It would I don't think they're going to come out with that ever to be honest. It's just like it's it's too it's that's like the most extreme case, right? And I think like typically it's more in the middle of like where where things end up. But I don't know, that's just that's just me when it comes to these these tariffs. I feel like it's been such a long time since we started talking about tariffs, you know? It's like a lot of people are like, \"All right, like even if even if there is a decision on it, it's like it's like how many people are going to be so emotionally caught up in it to make huge decisions based off of it at this point.\" Now, also like if this happened, you know, like originally, then it's like, oh man, like we're all caught up in it, right? But now it's like, dude, it's been like a long time. So, yeah, it's like, okay. Oh, yeah. Okay, whatever. I guess there's a sense as well that a lot of people are sort of like, we've moved past tariffs. Like, tariffs, what tariffs? Like, you know, what's happening with Venezuela? What what's happening with Greenland? You know, are you guys still talking about tariffs? Why why are we even talking? That's next week's problem, guys. But um it's time for a quick we'll come back with the next topic top topic in a bit, but I think it's time for a shout out for our brand sponsor. Right. It is indeed. Hey, I want to give a big shout out to the sponsors of this live stream, Binance. Now, if you need an exchange that has loads of trading pairs, loads of liquidity, and a fantastic interface to boot, then Binance is the place to go. And if you sign up using this QR code, you're not only eligible for up to $600 in signup bonuses, but you'll also get a 20% trading fee discount for life. Yes, that is for life. So, a big thanks to Binance for sponsoring this stream. And speaking of which, let's get back to it. There we are. I was reading the comments and and one of them said like, \"Work, aren't we all in crypto? And and it's like, well, yeah, we are, but we're probably going to have to get jobs pretty soon. I mean, although now I I heard McDonald's stopped taking in people that were crypto bros, so we might really be screwed at that point. I I think I think if McDonald's haven't put a hard cap on on Crypto Bros by now, they they really have not been paying attention. Um, so yeah, I think we we may all have to try Burger King instead. Um, okay. Let's let's move on. We were talking about tariffs. Um, so we're going to see what happens there. But, uh, yeah, I kind of think it's probably going to be um quite messy, but um, I wanted to also talk briefly about some good news cryptoreated and actually some good news for ETH. And I say this as an ETH holder, so you know, make of that what you will, but actually like things are things are kind of looking up for Ethereum at the moment. The Fisaka upgrade went ahead last year. We've got Glamsterdam, the wonderfully named Glamsterdam coming up soon uh as well. Um but uh we've there's also the recent news that Ethereum's validator exit queue has dropped to zero. Now I just want to share my screen uh with you guys here. Uh there we are. Validated Q. So no validators are leaving essentially. Is that what that means? Uh yes. So let me bring this up. So yeah, basically um there but there's still a long queue uh of people wanting to enter, people wanting to stake their ETH, but the uh ETH unstaking um has basically come to an end. Now this was a kind of big hangover um something that was hanging over ETH uh you know especially when these um ETFs launched um that the validator exit queue was looking pretty long and a lot of people is this like is this like when people you know uh originally in I think 2022 uh started staking all of their ETH and they have to they had to stake it for a certain number of years and then like from that point and then like as they continued to stake it like you know 2023 and there was a certain time that you had to stake it and now it's no I think that's is different I think that you validated exits or most um proof of stake networks have um an exit queue of some description right such that you have an orderly change in the validator set and it's not dropped immediately so there's generally queue it up and then there's an unstaking period but I think in the case of ETH when you have a spike in the validator exit Q it slows down the unstenability so I think in this case the fact that it's dropped towards zero means that it's it's good news to the extent that not many people who are staking are deciding to unstake. And in fact, it's not just the fact that less people are choosing to unstake, but also the fact that there's more staking taking place, right? Because we've got upcoming ETFs that BitMine has just been staking all of its all of its ETH regularly and a few other DATs as well. So, um this is great news for the Ethereum network. Yeah, there was also a bit of a change to the way staking worked as well. This is the um these are ETF inflows for for ETH and I I want to talk about these in a minute but there was also a change to um the dynamics if you like of ETH staking as well because it wasn't I think I forget which recent upgrade it was whether it was Fusaka or the one we had before that but basically changed so it used to be that the maximum you could stake was 32 ETH um and that maximum was massively increased so you know it so I think there was a lot of withdrawing in kind of restake with with a with a higher maximum Denun right I think that was the one in March last yeah I think yeah I think you're right I think you're right it was Denun so the dynamics around ETH staking have changed a lot so obviously a lot of people I think who were um you know having to run multiple validators because you know they had an absolute absolute ton of ETH that they got very cheap um were probably consolidating those validators but um just looking back at that at that earlier screen active valid validators 973,646. I mean that is the sort of decentralization that most most others would would kill for. Um but also having a look at these uh ETF flows I think as well because there's something interesting here. If you look at the top there um there are only two ETH staking ETFs currently live. Both of which are operated by uh run by Grayscale. Um but if you see here all of these other ones including of course Black Rockcks um are pending on staking as well. So eventually uh these you know if staking is approved for these ETFs which you I I imagine is something of a formality um the amount of staked ETH is going to climb even more. Right. Yeah exactly. I mean that's if the if many of these ETFs are going to try to be staking ETFs. think that they allowed to I I guess the question is is it is it appealing enough and that the mechanics of how that um that staking reward is given back to the users um and um you know if there's still appeal for people filing for staking ETFs but uh as much ETH that is staked in that obviously is beneficial for the network uh it secures the network um well it secures the network in the short term but I guess the the other angle some people could take is like does this mean because the proof ofstake network has more it's more susceptible to control via resources in terms of stake control. So if Black Rockck has most of the power of the stake and Bitmine, you know, it's that is a question, but for the short term, it's bullish. I wonder if the rewards get back to the person that is to the retail person that is investing into the ETF like a dividend. Yeah, there should be uh there should be but I think that there's either that or the in or there's a prorate um it's what's the term when it compounds it compounds the the interest or the staking and rewards themselves compounds in the price so they don't pay it out it just increases in the actual value of the ETF so um yeah I forgot the exact term for that but that could be another option instead of paying out dividends is basically the value of your your ETH per that you hold per share goes up mm I wonder. Uh well, we'll figure that out once it becomes live. Fingers crossed. Yeah, it's I think it's big news though because and and I think this this thing from the block makes it kind of clear, you know, this is this is big institutional news as well because institutions obviously they they love yield. Yield is a really important important consideration for them. And Nick, you mentioned Bitmine as well. obviously you know the DATs and and Bitmine uh Ethzilla and others are are staking theirs too. So but it really points I think towards an increase in just you know institutional kind of validation for Ethereum if you like. Um yeah and I mean I you know that that kind of seems to be the way it's going now. Yeah, it seems to be I mean I think that uh it's the next one down the stack from Bitcoin. If institutions are starting to to move into alts, that's the first place to watch the rotation from Bitcoin to ETH and therefore the you know ETH BTC ratio. Yeah. Yeah. And institutions don't don't look for a 5,000% yield like the crypto dgens do. You know, they'll be okay with like 4% or 5%. So you mean you you mean Lewis that the institutions aren't going to be aren't going to be sitting up late into the night farming DeFi yield farming going across various protocols to get I don't think they're going to be doing that. So Ethereum is is the logical choice. Yeah. I I like the idea of some of someone paying like a Gen Z intern at Black Rockck just to sit up late into the night just be like just go just go hunt yield. Here's here's 5 billion USDC. Just just go and farm that and it's gone. Then black rock black rock suddenly crumbles. Um okay. So I mean good news for yeah good news for Ethereum and I think like I mean it does kind of it does kind of also I think point the point in the direction of travel for the for the crypto space as a whole. I think because like do either of you know when those are supposed to come out by the way like the staking for the different ETFs. I can't remember when they're going to be approved. I think I I can't there was some I think there was some sort of delay on on why exactly it was happening. I mean it may be tied up with the innovation exemption um which the SEC is is is putting into place. I mean, supposedly later this month, which, you know, given that we're given that we're almost 10 days into the month, you know, it must be fairly close, which is obviously going to make all um all crypto stuff kind of legal in the US for a period of time. So, it may just be a case of waiting for that innovation uh exemption to go live. Um, and then we'll see all those uh all those spot ETH ETFs tick over into into staking, which like I say should should mean that validator queue, you know, for entry gets a lot longer. Yeah. Okay, that is uh that is the latest happening with Ethereum. Um, thanks for hearing me out on that one guys. Um, so we should also talk about two of the hottest sectors uh in the market at the moment and those are privacy and perexes. Now, I want to start with privacy because we've had some interesting news recently. Zcash, obviously one of the massive performers of last year. Um, uh, I don't I can't remember whether either of you guys have, uh, Ze in your portfolios, but if you do, it's kind of been an an interesting week, right? An interesting few days. Yeah, I do hold a bit of Ze. It has been a crazy few days. Um, I think that it was, you know, it was beginning started the year off with a nice little pump. uh everyone was getting on board the privacy meta again and then we got this shock news at the beginning of this week uh that the team the entire team at Electric Coin Company which is the developer behind Zcash had resigned due to um basically irre irreconcilable diff differences with relation to the board members over strategic matters etc. Um and obviously this led to a complete collapse in the price of Ze. Uh but it was later you know later it turned out that it wasn't as bad as many had thought because they was said that the team said they'll still continue working on Zcash under a new corporate structure after the disagreement with Bootstrap which is one of the companies behind them as well. So it was quite a volatile week and you can see that in the price of Ze itself. Yeah. Yeah. Yeah. if you uh hang on, let me add this to let me add this to the screen. So yeah, um nearly 20% in 4 hours, but I mean it does seem back up right now. It it just jumped to 18%. I'm sorry I had to laugh. The trending coin at the top there on your screen. Which one's that? You see that? The trending coin guy. You see the top toprending trending on your Twitch on your on your screen. What's happening? What's happening? Oh, which one is it? Oh, I can't hang on. Go to your screen. I don't know if we're allowed. Are we allowed to see guys? Can we go long testicle? That's a test. Okay. Well, that's that's the danger of sharing a Twitter screen, I guess. Yeah. You know that you know that the suggested and what's happening on Twitter is personalized. So, it's done according to your browsing history. Listen, I've been doing a lot of research into testicle and I can tell you I can tell you there's some interesting stuff going on there. That's all I'm going to say. That's all I'm going to say. Um, yes. So, uh, well, yes. So, bearish bearish zeb bullish testicle. Is that is that the take away from That's the conclusion from this video. That's the only conclusion that we can draw, I think. Um, but yeah, it wasn't uh it wasn't all that nice for uh for Zeke, although uh as as as you were saying, Lewis, it has kind of recovered, right? 18% in the last few hours. So, yeah. Yeah, it's not too bad. Um I Yeah, I don't know what I I have no idea what's going to happen with it at this point. I was short and then I was long, then I was short, and now I'm just like I don't know what's going on. So, we'll see. We'll see. But is it like is it as bad as as what people say or is it like you know a nothing burger? It's probably not nothing burger but like but like you know who knows. I've heard a lot of rumors. It's a pretty involved story. I think we've actually um we've actually got a newsletter piece on this coming out I think uh on Sunday. Um because there's it's quite you know there's there's quite a few moving parts to this story. But yeah, it I mean it is interesting that you know when I when I saw that when I saw that collapse I was that 20% collapse I was like oh this is this is not good. But yeah to see it recover like that suggests that you know maybe um you know maybe people don't really care about the dev team and maybe the dev team, you know, leaving isn't necessarily all that important. Well, for the sake of Nick's bags, let's hope so. Yeah. Yeah. Pray for Nick's bags. Pray for my bags guys. Another meta that you mentioned of course that seems to have picked up a lot is this start of this year and that's because of a new per well it's the perex meta and that's because of a new perex that hit the scene that everyone seems to be making a fuss about and this is lighter now lighter or uh by the aptly named ticker lit uh pretty cool ticker there. Uh it's come out and it's actually done quite well out of the gates. Uh it's got I think it's a pretty strong competitor for Hyperlid. Now we've seen a lot of competitors come to you know from for Hyperlquid over the past few months you know ATA edex a few others but lighter seems to potentially can give it a run for its money in terms of technology it's an ETH layer 2 it uses ZK technology um it's uh did a pretty it's ran a pretty lengthy points campaign which I think has rewarded quite a few people who were involved early uh so yeah and we actually did a complete deep dive into lighter and a comparison with Hyperliquid in the Coin Bureau uh Telegram. So, if you guys aren't following our Telegram, uh scan it right over there in the in the bottom left, but we broke down a comparison between Hyperlid and and um and Lighter. And we these are alpha posts we do regularly like once every two days only in our Telegram. So, definitely go and follow that. Yeah. Yeah. Um have either of you guys traded on lighter? No, I have not. Louis, I've only traded on hype. I've only done hype. Okay, I want to share this with you. I this this dashboard from DeFi Llama I thought was quite interesting. I mean, it really shows, doesn't it? Like obviously Hyperlid is still kind of top of the tree. Aster is running it fairly close on a lot of metrics. Then you have lighter and edgex, but really it's, you know, it's mostly about those, you know, those four in in what is getting an increasingly sort of crowded field. But I wanted to draw your attention to a couple of other entries sort of further down the list. Now I know to interrupt. Sorry to interrupt guy. Just very quickly guys, we got the NFP out and it's come in at 50K. So that's slightly lower than expected. So you know that is potentially good uh from the perspective of more likely for Fed cuts. We'll have to see how things adapt and adjust over the the spa the span of the next few hours, but yeah, that's just broken. Okay. Okay. So, the the NFP numbers are good. I'm seeing uh Bitcoin 90.5 at the moment. Well, they're not good. They're worse than expected. So, it's that's that's bad news is good news, right? Oh, yeah. Yeah. Yeah. Yeah. Okay. So, so we take we're pleased about the bad news around people's jobs. Yeah. Okay. Um that's that's great news unless you're looking for a job. Unless you can't find a job. Yeah. Yeah. Well, let's see how let's see how crypto reacts to that then. Um, but yeah, just going back to these uh just going back to these perexes. Um, if you look, so I'm scrolling down here and it's only here at number 36 that I come to Phantom. Um, and then a little lower down, even lower down at 49 is MetaMask. And the reason I think that's interesting is because obviously these the two most arguably the two most popular crypto wallets certainly for retail users. um with an honorable mention I think to to Rabby wallet as well. But oh my god, I love Rabbi for eB and base. Rabby has been so good. I switched from MetaMask a while ago to Rabby and like yeah, I like it. And Jupiter just came out with not just but Jupiter did come out with its own uh wallet now because everyone uses Phantom for Salana. Um and then they attach it to the Jupiter DEX to do their trading. But now Jupiter has its own native wallet so it's a little bit faster. You don't need to manually approve everything. Uh and it's it's native so it you know syncs better with the Jupiter exchange. So, those are just two things that that I sort of recently did. Uh, switch from MetaMask to Rabby and switch from Jupiter to I mean switch from Phantom to Jupiter. And I've been I've been enjoying uh Jup wallet and um and Rabby. They should, you know, shout out if they want to sponsor us or something, but like always always got an eye for business, Lewis. That's great. That's great. Um, I mean I think one of the things that uh the fact that you know both Phantom and MetaMask are fairly low down on the per list because I noticed that you know Phantom especially um and they both plug into Hyperlid in the back end if I'm if I'm not mistaken but Phantom especially I thought had really kind of simplified the whole per interface you know because the the kind of classic um Pers interface on you know a lot of centralized exchanges isn't I've found in the past the most sort of intuitive things. So, it's not, you know, the easiest thing, especially for beginners to get to grips with. And then Phantom comes along and kind of makes it a whole lot easier to do. But obviously, these are the kind of number one ways for, you know, MetaMask and Phantom are two of the sort of most popular ways for PE for kind of retail to interact with with their with those respective chains with Salana and, you know, Ethereum and its layer 2s. Um and yet you know that suggest those low volumes suggest that retail are not really uh trading per all that much you know and per depending on who you ask is is accounting for an enormous amount of actual just general volume in crypto at the moment. Yeah, I mean fair but to be honest if you if you're a complete noob retail and you're used to Robin Hood and you're used to some of these easy onboarding sex with these sexes using a DEX is still a pretty big step up in terms of uh you know UX uh and you know especially if you have to bridge funds and all this kind of stuff and I think still many people are complete newbies are still you know intimidated by the concept of full self-custody um in these decks per deck so it will take some time before they get fully on board. Yeah. Yeah. Yeah. Well, I mean it's it's kind of a good thing in a way really, isn't it? Because you pers are, as we know, per uh, you know, not something to be taken lightly. So, it's probably best that retail isn't um isn't going crazy on per left, right, and center, right? Yeah. No, indeed. Yeah. More spot. More spot, please. Yeah. like less people per trading more spot. Yeah. So, should we maybe take a look at some of the questions, guys, to finish this thing off with? Uh maybe some people have some questions in the comments and we can just answer them. That's another format, guys. We want to try and include in these Friday streams, by the way, is we wanted to try and give you guys more of an opportunity to ask us questions you had that we may not have been able to answer on the Monday live stream. We can we can discuss it now more in depth with you on a Friday. So that's why uh feel free to ask your questions in the comments. We can try and get to them. Yeah. Can you Nick can you remind us of those unemployment uh non-farm payrolls again? So the actual number was 50K and uh the expectations of 73K. So you know we still had grow we still had non-fame payroll. So it was still job growth but it was less than expected and markets always priced on expectations. Right. Yeah. Okay. Um are you are you guys bullish or bearish this year on the whole space? go first. Lewis, go first. You you catch up. Okay. Okay. So, if you're talking like by the end of the year, I'm bullish. But it's it's actually it's more like like down for down down flat flat flat and then and then it goes back up to the point where I'm bullish where it's going to end like a few percent higher than where we are now. But before that happens, I'm I'm very bearish for in most of the year. Yeah, most of the year I'm very bearish. But I think we'll end the year at least for Bitcoin bullish more than than what we are now. Fingers crossed. So you're saying basically buy and hold and just not look at the charts. Buy and hold and see the rest of the 300, you know, six 350 something days. Yeah. I think I I I think uh not I think I know uh typically um people should uh not financial advice or whatever but like statistically if you buy something you go and you go allin you have a better chance most of the time at outperforming dollar cost averaging because most of the time uh markets do tend to go up and to the right. But if you go in all in right when you know things are starting to go down after you know say Bitcoin went from 15k to 120 you know and then you start and and then you go all in then that's not good. So, I think now is probably the best time where I could say like, hey, like it's probably a really good time to dollar cost average into Bitcoin because there is a probability of it going down and you want it to go down when you're dollar cost averaging because that lowers your average buy price and then when it eventually goes back up again, which I'm pretty sure it will, uh, then you'll have a much better buy price and you'll make a lot more money. So, I'm going to be dollar cost averaging like now is the point where I'm going to be dollar cost averaging into Bitcoin because and hopefully it keeps keeps on going down and I get to keep on buying more and collecting more stats as it does. Okay, Nick, how how are what are your thoughts on this year? Are you bullish? Bearish? Um, slightly more be I'm bearish on on on altcoins. Bullish. I think Bitcoin my view on the markets is Bitcoin still has uh the macro environment looks good to the extent that we're going to have liquidity that will go and flow into Bitcoin. I think Bitcoin is going to uh go back above its all-time high again. I don't think too much more than above its all-time high and then it will start retracing down again as we move into you know a bare market. I think have got a lot a lot of headwinds for them uh for many factors. Uh so as a result I if I was thinking about structuring a portfolio now uh it would be quite bitcoin he which which is what it is. It is bitcoinheavy and um look I mean uh yeah I just I think alt just got too much competition I think and also it's the question of rotation rot rotation right now is called into question through the structural dynamics of ETFs and everything. So, I think Bitcoin if in terms of Lewis's point around towards the end of the year whether Bitcoin will be up. It all depends on um you know whether you think you're going to have a blowoff top or if the one last year wasn't a blowoff top. Uh I I think um we still could we still got room in the tank for Bitcoin to continue above its all-time high. Whether it tops out this year or that's next year will depend on where we where I think it's going to be in December. But I think by if if by June we haven't hit all-time highs again, then that's um not necessarily bode well for the end of the year. Okay. Okay. Interesting. I think that the two things I'm kind of eyeing up are the innovation exemption which I talked about earlier because I think how a lot of altcoin projects react to that are going to be that's going to be really important because I think this is this is probably going to be the opportunity for a lot of altcoins to kind of show what they're made of and a lot of the projects behind them to be like this is the value proposition. we weren't able to offer this beforehand because we weren't sure of the rules or whatever and the regulatory environment was you know unclear at best, hostile at worst, blah blah blah. So I think you know if if if a lot of projects are able to take advantage of that then that could you know that could make the case for altcoins and strengthen you know strengthen the sector as a whole. And of course the other big one is the the small matter of the midterm elections in November which obviously still you know still quite a long way away. But I do think you know I I do wonder whether um you know Trump and uh and those around him will remember their debt to the crypto industry that funded them so lavishly. uh and is I think you know ramping up funding once again um for you know for for for Republicans and you know it should be said you know pro- crypto lawmakers on the other side of the aisle. So um but yeah I do wonder whether that might uh that might give us a pump. Um human being is asking can you guys start over from the beginning? I just got on. I don't have time to rewind. You don't you guys don't mind. So we have a Jamaican themed song. We can restart. That's the that's the highlight. You just need to go to the intro to the to listen to the song and that's all that matters mate because the rest is kind of just garbage to be really to be honest. It's just three crypto bros talking nonsense like you Exactly. Exactly. Um will Trump take Greenland? Oh god. I mean I mean that's the next thing. Next week that that's next week's problem. Hellberg. We'll we'll see. Um interesting one from Cornelius. Will onchain options become more widely adopted this year especially by institutions uh options uh per in my opinion? I mean I don't I can't say I can really see institutions going to DGEN um in terms of what I mean because they're they're obviously kind of you know fiduciary duty and things like that probably prevents them from from getting too uh barack with what they can do. But I mean it would be interesting wouldn't it like in as we say we're you know institutions are becoming more and more interested. It would be it would be interesting to see what they you know what aspects of crypto they you know decide to engage with. Yeah. I mean I think don't think institutions I don't think institutions are getting involved with per dexes or per options markets at all because I think that there's just too much fidu um they got fiduciary duty for their shareholders their investors. there's risks there's um you know for example I know that many of the institutions didn't even want to touch um centralized exchange options like the likes of derbit etc and the only reason everyone was so excited for the um the black rockck IBET options is because these were them options to they were you know settled on an exchange when you've got uh no counterparty risk and uh it's all within their current structures so I think institutions will be very wary of doing much of the onchain option stuff. Although it'd be good to have an onchain DEX of some description, I think that some do exist. It just never seen the same amount of uptake uh compared to from crypto native investors as per Dexes. Yeah. Yeah. Um one other one, are we in a controlled bare market or should we just expect less volatility as more fouryear cycles move forward? That's an interesting one. I think we should definitely expect less volatility. I mean, if we're talking Bitcoin specifically, I think it's because of the market structure has changed, ETFs has changed that deeper liquidity uh and naturally as an as an asset class matures, it becomes way less volatile. And that's just that's not just a statement. That's a fact in terms of how Bitcoin's bare bull market draw downs and bare market and and bare market troughs compared to previous cycles have been. It's been decreasing every every year. Uh and there is there will be solid bids for Bitcoin. I think if we fall even below 80 to 70 I think by 70 in terms of this year a low we could potentially see is at most is 70k but even then you think that's the lowest. Yeah that's I think deep value territory. I think 50k is the is I think that's where we're going to bottom out. Let's go we'll we started we'll we'll start a prediction market on this. We'll go and use your the Louiswis and Nick bit. Interesting. Interesting. Okay, the final the final request is um simple one. Nick, can you tie up your hair and look like Legalolis? I'd love to see guy grow his curly hair and look like Frodo. My hair does actually go curly when I grow it out. Louise. Louise could be arrogant. We just need a dwarf. The company will be completed. There we are. You can do your golem voice, Louis. Okay, my precious. Take the good hand. Well, on that uh on that bombshell. Um I think we will leave it there for this week, folks. So, look, let us know um what you thought of this. Did you enjoy it? Do you want us to see do you want to see us do more Friday live streams like this? Like I say, a little less formal, a little more of a kind of meandering discussion about uh all things crypto. Um or did this has this already completely ruined your weekend and you never want to see our faces again? Let us know in the comments. We we love to hear your feedback and we do take it on board. Um we will be back. Um we all three of us will be back. Um Lewis will be back in the form uh with his TA on Monday. Nick and I will be back in the studio presenting uh the live news show as usual. Um, and of course, uh, lots of other content to come as well. So, Nick Lewis, I hope you guys have a wonderful weekend. Thanks for joining today. Likewise. Yeah. And don't forget tariff news, guys. Like, you know, next half an hour. So, get those orders in, those orders in place. Yeah, it's it's all kicking off, folks. Weekends are weekends are interesting again. Um, but h yeah, thank you everyone for watching. Have a great weekend and we will see you very soon. Bye-bye. Cheers, guys."
    }
]