[
    {
        "video_id": "hnFY-RRfXLg",
        "title": "Leaked: Trump’s $500 BILLION Defence Stock - The Opportunity of a Lifetime!",
        "published_at": "2026-01-10T14:00:06Z",
        "sort_date": "2026-01-10",
        "url": "https://www.youtube.com/watch?v=hnFY-RRfXLg",
        "transcript": "Something absolutely wild just happened to defense stocks. Trump posted on Truth Social and within hours, defense stocks crashed 7%. And then they saw 7% back up. And buried in all that chaos is what I believe could be one of the biggest investment opportunities we've seen in a decade. We're talking about a potential five or even $600 billion flood of government money into defense stocks. and I'll tell you which ones because most retail investors have no idea this is happening. So you get this wrong and you could be buying at the worst possible time. You get this right, you could be positioned for what could be a multi-year bull run in defense. So today I'm going to break down exactly what happened. Which stocks are positioned to benefit the risks you need to be aware of and how to think about this as an investor. I'm Felix Primo for investment banker. That's Winston back there who's just smart. And we spent years analyzing these kind of market moving events. Actually, when I was in banking, one of my jobs was to look for eventdriven things. And we could look at exactly this kind of stuff. So, I'm also, if you didn't realize, the founder of the code academy. We've helped over 20,000 students learn to invest more like professionals. I'm also the co-founder of tradevision.io O where we give you the news and the data that actually matters and that's going to be really important for what we're doing here today. So I'm going to share some of that with you. So my mission is simple. I want to help regular investors well I used to be to understand what Wall Street Wall Street already knows because they already know it. I'll I'll show you the proof in just a second. So I want to give you the tools to make more informed decisions with your money. But we're not just going to give you the news headlines. We've dug deep into the actual executive orders, the budget proposals, the contractor financials, so you can understand not just what happened, but it actually what it means for your portfolio. So what just happened? The Trump bombshell is this. Let the bigger picture of what happened. Trump posts on truth social gets reposted on Hex absolutely blasting defense contractors. He specifically called out Rathon RTX, saying they were, and I quote, the least responsive and most aggressive in spending on shareholders rather than the needs of the United States military. But the serious part is this. He didn't just complain. He signed an executive order. This order bans defense contractors from paying dividends or buying back their own stocks until they, and I quote, produce a superior product on time and on budget. He also capped executive pay at $5 million, which is a massive cut for these CEOs. Now, do you think that's a good idea, by the way? Put it in the chat down below. Say good idea or bad idea, good or bad. And we'll get a bit of a poll going here. So, what does the market do? Rocky Martin, North Groman, Rathon, they all tank, right? Billions of dollars in market cap just gone. But then two hours later, the Donald keeps it entertaining. He posts again and this time he announces he wants to raise the 2027 military budget. That's next year in case you hadn't realized to one and a half trillion. Now at the moment it's sort of 900 billion to a trillion depending on what you're counting. But that's at least half a trillion increase. So what does the market do? Well, defense stocks didn't just recover, they they search, right? So Loy Martin went up and the defense stocks ended the day up. This is a sort of a Trump whiplash, right? Now, if you understand this, you can profit from it. No, it's not too late. We're just getting started. And I'll tell you, I show you a little bit of a little bit of insight here. This is the Loit Martin stock chart tanked down here all the way to below 500s. We covered now. But look at what institutional trades were doing. This is in trade vision software we built. There was in a highly unusual trade. It's so unusual. It's incredibly unusual. And somebody spent $400,000 on an options trade that Lo Martin would go to 540 or not general direction. It would go up. By the call option, it goes up. Now you can click on that. nothing gives you the details if you're a bit of a bit of a nerd, but I've done it for you. That trade right now is up almost $200,000. They made $197,000 already. They're not complaining about this. If this goes a little bit higher, I mean, let's just say, let's say it goes to 570, right? They will have then made 169% return or $670,000. So, the smart money sometimes is just smart, right? In this case, they are. So, how will we track this kind of stuff? what we actually see live every day or the darkpool data does. So those are the corporations. And on Friday, the last trading day as I'm recording this, look at RTX is one of the most bullish flows we've seen. Again, that's very unusual. You can click on that and then you can see what people are buying and it's call options, call options, call options. Quite big trades here. So, I'm not telling you to go out and buy it, but I'm saying to you the smart mind is following the story and they're putting their money where they're, you know, whatever is. So, if you want to get access to that, by the way, there is a here, here it is. There's a free trial for you guys to check that out. Felix/tradevision and you can get access to exactly what I just showed you. Um, there are also training videos on there and everything else. Felix/tradevision. I'll put the link down below as well. But let's get back to the opportunity because it isn't just Rathon or just you know one or two stocks. Think about what 500 billion actually means. The current defense budget 900 billion or so this year. So this is a 66% increase in spend. That's an enormous jump. So where's the money going to come from? Well, Trump says tariff revenue will pay for it. Now there is something called the bipartisan policy center. They estimate that tariffs last year raised about 288 billion. So there is a bit of a gap there, right? Um bit of a gap there. And that actually is weirdly good news for you as a short-term investor. Why? Because this is money printing. This is stimulus. This is pumping up the economy. And when you print money, where does the money go? Well, money does not like to sit around and not earn any money. So money will always flow into assets, stocks being one of those assets. So we're getting a pumped market for 2027 for defense spending. Maybe that's too far away. Well, the market is going to position themselves earlier as in this year, so shortly now in to take advantage of what's coming in the following year. So what are they going to spend it on? Because that matters because then we can figure out who we want to invest in. Right now Trump announced the Golden Dome. It's a massive missile defense system for America. Think about Israel's Iron Dome, but for the entire United States. Now, the United States is just a little bit bigger than Israel. So, how much is that going to cost? That's about $175 billion for one project, but it could be it could be more. It could be a lot more, right? the the Congressional Budget Office, they say it could be 500 billion over 20 years, I guess, as a recurring cost to maintain the thing and pay all the contractors and the the palents and so on. So, who benefits? Where is the money going to go? Well, Loit Martin is likely the lead partner on this. SpaceX has a $2 billion contract for 600 satellites. SpaceX is going public this year. And also likely to go public this year, but Northrup Groman is listed in RTX. They're all in there. Those names are all in there. Here's what I'm going to do. I'm going to set up a watch list in Trade Vision here. I'm going to call it Defense. You guys spell it with a C, don't you? I spell it with an S. And I'm going to add in here some of the guys I'm interested in. Loheed Martin, RTX, uh, NOOCC, Palanteer. You can think of some other names. Let me just pop that in here. And what I'm then going to do is go to the homepage, click on the news alert settings. I'm going to make sure that my news alerts are on, right? Because I want to be updated on those. And you know what that's going to mean? That means every time something happens to those stocks, I'm going to get little updates like these ones here. I mean, I I have a lot of stocks that I I'm interested and you might be interested in a lot less. Um, and the beauty of that is that you don't just get random news. You only get the news you actually care about only about the stocks you actually care about and that way you know when it's happening like in the mode. So, that's what I would suggest you you you do um in in Trade Vision if you want to take advantage of that free trial that we've got there. Here's the here's the link again. Now, this is more than just the Golden Dome. Um, there's going to be air and missile defense. Um, there is extra money for nuclear forces. There's extra money for the B21 mama production and and and Trump wants to build the Trump class of ships, so ship builders. And you look at our last video on on defense, we talked about the ship builders and some of those Korean ship builders have done very well over that, for example. So, all right, let's talk about the specific stocks that's at the center of it. what everyone's talking about and we're going to talk about the ones that are a little bit less talked about. This is the world's largest defense contractor and they're positioned to be the biggest winner from Trump's defense push because you might think these new companies are coming out of the woodwork are going to replace the big defense contractors. Well, not so fast. It just doesn't work that way. Yes, companies like Andural I think will be massive. Obviously, Palanteer has already become massive, but it takes time to build up the infrastructure and the factories and the skill bases to build like ships or big bombers or big drones or so. These guys, the classic contractors are still going to get a lot of this money because these guys make, just think about the few of the things these guys make. They make the F-35, right? The most advanced fighter jet in the world. They make the F22. They built the THA missile defense system. They're the lead on the whole Aegis, which is sort of electronic warfare type stuff, combat systems. They're publicly stated they want to lead the Golden Dome. And if you look at their financials, well, their revenue for last year was about 75 billion or something like that. But they have a backlog of orders of 179 billion. So if you do 75 billion per year in revenue and you have 179 billion backlog as an orders, well that's two and a half years of guaranteed revenue. So they're already cho blocker full. They delivered 191 F-35s last year. That's a record. So they're cranking up production and the contracts just keep coming. Right. They just got a new contract almost 10 billion for Pack 3 missiles. the largest ever for their missiles division. They got a 10 billion increase to the C130J program. They got over a billion dollars for missile tracking satellites. They got 500 million in contract modifications just in December. So that's how it works. You get an order and then you just crank up the amounts like bit by bit. You always ask for a little bit more. So while other defense stocks like RTX were up 60% this year but I say this year last year right glorious year for RTX well let's look at our friends LMT loed Martin nothing nada n z right and why do we like that because this is actually a classic textbook breakout pattern this is what happens this is what I always look for you look for an industry that's pointing up and then you look for what is What do we call it? What do we call it? Who knows? We call it the heartbeat pattern. We a little bit of a of a of a breakout there. We pulled back and now we're doing the heartbeat thing again. And now we've gone up and we've taken out the recent high. And now it's very, very good. We're doing it on big, beautiful, bouncy trading volume, which means institutions are nibbling on this at some extraordinary speed. We got a little indicator for that. See that little yellow line down there? That's pointing up. That's volume increasing. That's what you want. And some analysts, I was going to say some sheep, but that would have been rude. They're saying it's undervalued compared to its peers. It's trading at a discount while they have the strongest position in the industry. But what about this buyback ban? Well, here's the thing most people are missing out. Yes, the ban hurts shortterm shareholder returns, but it forces companies to invest in production capacity. More production capacity means more output, more revenue, higher stock price in the long term. So Trump is essentially forcing these companies to grow instead of just handing the cash out to you and me. Now there are some risks here, right? I've told you the opportunity. Let me tell you what could go wrong. Well, there's political risk. Trump's proposal needs congressional approval. A 1 and a.5 trillion budget is massive. Even some Republicans might push back. If you only gets, you know, trillions or a trillion and a half, that's 500 billion less than expected, which is where we are right now. The buyback ban could also backfire. Defense stocks have historically been attractive because of their dividends and buybacks. Those go away, some investors might just walk away. We already saw some of these stocks drop, but they have recovered. And then the Golden Dome thing, look, it might not work. The Pentagon says they can only demonstrate the technology by 2028. Full operational capacity, well, probably not happening in Trump's term, and the technology for space-based interceptors is still unproven. This could be another Star Wars program that never actually delivers. You could have massive cost overruns. Defense programs always have cost overruns. Um, she's trying to fix that, but that's what they always have. the the F-35 is 183 billion over budget, right? It's kind of kind. Now, I'm not quite sure actually why I put this on as a risk because if the US focused defense shield triggers a new arms race, well, from a defense contractor point of view, I'm not saying for humankind and and sort of the grading good of, you know, Winston, this is a good thing. But I'm saying for defense contractors, that's actually the perfect outcome. But what I'm saying essentially is that defense depends on government budgets. So, midterms coming up this year. um Trump's got to win those for this to play out as we expect. Now, the way he's pumping the economy, um that seems more and more likely from where I'm sitting and I don't really care about your politics. I'm not an American. I don't live there. I pay only a little bit of tax where you are for sort of, you know, tax reasons, but other than that, I don't get a say in what you guys do. So, it's your call. But I just look at it from an outsers's point of view as an investor. And they're like, well, there is a little bit of risk there. If Trump loses that midterm election, a lot of these things are not going to happen. Right now, what I'm therefore implying is how do you deal with that? Well, position sizing. So, don't bet the farm on a single stock. Diversify. Don't just be in one defense stock. If you want to go into defense stocks spread across multiple companies here, this is also a multi-year thesis. So, it's not a quick win by Friday. Uh, you always want to set your exit points before anything else. And there are other defense stocks, right? Loheed Martin isn't the only game in in town. So, let me quickly run you through some other defense stocks worth watching. RTX, Rathon, Trump called them out, but they do have also a $251 billion backlog, even bigger than Loheed Martin, 251 billion. Their Patriot missile system is is in massive demand. I mean, everybody wants it. Um the stock was up 60% last year but they are in Trump's crosshairs so they have to deliver. Northrup Grumman which is a brilliant name isn't it? Northrup Grunn is like a sort of angry Scott or something he came up with that name. Anyway they built the B21 bombers which is again getting accelerated funding almost 5 billion. They're also involved in the Golden Dome. I think it's a solid pick for long-term defense exposure. We also have we talked about them before and this is a small cap play so it's more risky. They focus on drones and hypersonics. Stocked at 196% last year. Higher risk, higher potential reward. Then we have General Dynamics, GD. They build submarines and tanks. It's more stable. It's a little bit less exciting. It's good for more conservative chaps. And then you have some ETF options as well, index funds. You don't want to pick an individual stock. Again, I'm not telling you what to buy. I'm just saying something to research. There is ITA and there's XAR. They give you exposure to the whole defense sector. little bit less upside but also a lot less risk because it's more it's more diversified. So what's the big picture here? Let's zoom out for a second. What's the framework for thinking about this opportunity? Well, the bull case is simple. Geopolitical tensions are rising. The US is committed to military modernization, right? Trump likes to kidnap dictators and he wants to spend an extra 500 billion more on defense. The Golden Dome alone could be a multi-deade program that'll hover up a lot of money. And defense contractors have massive backlogs. And Loy Martin is trading at a discount. Right? And there is another name we haven't mentioned yet in here which is um Palanteer. Right now Palanteer had an extraordinary year. It was a very good year for Parlants and blue-blooded girls and all that sort of thing. 146% up. Um doesn't mean it's the end of it. Generally speaking, stocks at all-time highs tend to go up. Not forever, but the likelihood when you are near an all-time high that you're going to go higher. Now, at the moment, it is essentially done this sort of zigzaggy hard pattern thing. It is, however, below the 50-day moving average line there, which is a little bit of something to watch out for. If I look at institutional positioning, oh, that's off today. Maybe because it's the weekend. Um, so it's in a consolidation phase. So, what do I want to see? Well, I want to see it break out of these recent highs here at least, which realistically is $200. You pop over $200, I think you have a tremendous opportunity to go even higher, even though valuations are stretched. But think about it. You spend $500 billion on defense. What are you going to spend it on? You're going to spend it on all autonomous things, aren't you? You're not really going to build a new type of fighter jet with people in it. That would just be silly, right? You're going to build one without people in it. You're going to build ships without people in. You're gonna you're going to make everything autonomous. You're going to build drones and drone defense, and everything will be autonomous. And even if you build things with people around, you still need some people. They're going to be connected and hooked up to all the stuff. So who's going to float to the top of all this stuff? Well, it's going to be the Palanteer ecosystem, isn't it? Because that is the operating system of the US military. And therefore, these guys are going to get more and more and more and more recurring revenue from the US government who is going to keep paying them. Right? So that's one of the reasons I still like Palanteer. And you know, we've been talking about Palunteer since here, that little green level there, 2021 February. Check the channel. We were trading at about $28, $26. And even if you just held through all the misery, and it were better entry points than that, in my humble opinion, it'd be up 550%. I'm not saying I therefore will predict the future on LMT or anything like that, but I'm just saying um that's been a been a great run for us. So, what's the risk? Budgets can be cut. buyback ban and dividend bans is uh not great for the stock market in the short term and the whole golden dome thing might fail. It might get cancelled. It might never work. But given that Israel's got one, is this just the same thing? It's just a bit bigger, isn't it? Um given that SpaceX already has I think 9,000 satellites up there, what's an extra 600 or so? Um I I think it's technologically very feasible. Obviously, I'm not the guy putting it together. And if anybody's going to make sure that these defense contractors don't just take the piss, which is what they used to do, right? Um I think it's this administration because the defense industry has been broken, right? They you know how they charge. They say it's cost us a billion dollars to make this piece of equipment. We're going to charge you 50% on top of the billion dollars. Now billion dollar cost base goes up to 2 billion. We still want our 50% markup. That's literally how the contracts have been with the US government, which is just insane because it encourages you to spend as much money as possible because you have zero downside, right? Which is just crazy. So they they're I think they're they're fixing that. And I think that's a that's a big deal. So really, all I'd ask myself is, do you believe military spending will be higher or lower in 5 years? If it's higher, defense stocks make some sense. If lower, stay the heck away. It's really that simple. If you're a pacifist and you're still here, this wasn't the video for you, was it? Let's face it. You're more like Winston back there, right? He's a He's a pacifist, aren't you, Winston? Come on here. Come on, Winston. Come. Come on. Come on. So, some of you guys are always thinking this guy isn't well or something. And he's always tired and all that kind of thing. It's because he lives a very, very busy life. He hikes every day. He plays with wild packs of dogs. So, he comes home and he's exhausted. I think that's what makes a happy dog. By the way, you should try it. Um, so let's wrap it up, right? Let's wrap it up here. Trump defense push potential half trillion dollar opportunity. I think Loy Martin is is the primary beneficiary there on the real cuscal defense contractor side. The risks are of course political execution midterms. Do your own research. Understand your risk tolerance. Understand the size of your positions. The bigger lesson here is what opportunities like this come from understanding what's happening. Yes, getting the news alerts. So you set that up in in um trade vision. In fact, why don't I show you what I usually do? So, I go into something like any any old AI LLM Grock and say, \"Give me just the tickers of the top 30 defense stocks listed in the USA. Separate them with a comma.\" Right? You do that and there you go. Right now, you copy that. You go back into the watch list, click on the little plus symbol there, and then you just Oh, given us some text. So, you open a notepad, dump it in there, and cut out all the junk. And then you just copy those in there. Plus here. So, now they're all in there. And now the beautiful thing is also if you go to the homepage on the heat map, you can change to your new defense heat map. You see that? You can see them all. So, you can see what's going on every single day with these. These are now in the size is the the size of the company. You can you can make them equal size if you wish. And it's a really really nice way to keep track of like an industry, right? So now I have things like that open for robotics and software and crypto and and obviously the NASDAQ and so on. That's standard in there. And that's a really nice way to see, hey, what's actually going on? What why are certain things moving? Why is Kratos moving 9%. Let's have a look at that. Um and and you can just click on it, go to charts, and then you can see all the details. You can see the dark bull trades and everything else if there are there are any here. and and and to me again this is a very nice setup. Why? Because we've exceeded the previous high here, closed above it. Right? So this is actually quite bullish. Even though it looks like it's extended, I actually think it's the opposite. We've had two gap gaps up here. Again, I'm not telling you to buy cratto. It's a small gap. It's risky and all that, but it actually looks beautiful from where I'm sitting. So if you got some value out of this, what do I want you to do? Grab yourself the trade vision um news so you get custom news. And secondly, share it with somebody. That's that would be all I ask. share with somebody so people are informed about these opportunities and how it works and the risk and everything else and I wish you a beautiful start to the year. All the best. >> Heft around and he found out >> 300 billion barrels. That's more than Saudi Arabia, more than Russia, more than anyone. And if you think this is just"
    }
]