[
    {
        "video_id": "zMKUR0gYgHk",
        "title": "BITCOIN: HOW LONG WILL $90,000 HOLD? Trump, Tariffs, Wells Fargo",
        "published_at": "2026-01-10T20:08:33Z",
        "sort_date": "2026-01-10",
        "url": "https://www.youtube.com/watch?v=zMKUR0gYgHk",
        "transcript": "clicking the button. Oh yes. Oh yes. Oh yes. Oh yes. Guys, welcome to another episode. And as you can see right now, we do have an interesting situation here where Bitcoin is stuck at $90,000. And guess what? Each and every week, each and every day, each and every hour, the probability of a breakout increases. Either break out to the upside or break down to the downside. Why? Because I mean, by definition, we cannot be sideways forever. And we've been here for quite some time now already since November. So the question is for how long will this 90k base hold and will we break to the upside or downside? There are a few catalysts that we have to discuss. There are a few very very very important uh catalysts that will happen next week and that has to do number one with the tariffs because potentially Trump tariffs will be cancelled next week. Yes indeed, guys. Next week there will be a Supreme Court decision that we'll be speaking about and if the tariffs are cancelled, it will be chaos. It's going to be chaos. You do have the Treasury already now saying that they're ready to refund if needed. Besson says Treasury can cover any refunds from tariffs if they're forced to, but that's very important. And then of course, we do have the market structure bill which is being discussed and they really have to push it very very quickly through. There is a lot a lot of pushing when it comes to the market structure bill and the next week they will be having their first vote on the market structure bill. You probably have heard about it but the thing is it's so important that we get it through because it solidifies all of the crypto progress that we've done on the legislative front and if we can have a market structure bill passed then it means that it cannot be reversed. the next administration cannot go after crypto and be against crypto like Biden was is so important and guess what they have to hurry they have to hurry a lot because the midterms are coming urgency is real okay urgency is real lawmakers have about first quarters of 2026 to pass the bill before members become focused on election and also after midterms the situation may look very very different and Republicans may not have the control and democrats they don't like cryptog they don't like it they don't like it partially I mean I can understand them partially Because Trump has uh all his money in crypto. Look at here. Elizabeth Warren. Elizabeth Warren is she doesn't like that Trump has so much money in crypto. Listen to this. But nobody wants weak crypto rules more than the president of the United States. A majority of President Trump's wealth, as much as 7 billion dollar worth, is now based in crypto. from issuing his own stable coin to issuing his own memecoin to owning a Bitcoin mining company and to controlling a huge portfolio of crypto investments. But >> so yeah, I mean Pocahontas is she she doesn't like crypto. She's been trying for many many years to kill crypto. she's not successful and unfortunately crypto is a bit um partisan of an issue because Trump is so involved and uh that's why if Democrats get control after midterms is going to be tougher definitely tougher to get it through but not impossible absolutely not impossible. So, but you need to understand there is urgency and next week is going to matter a lot a lot a lot lot a lot in terms of the trend as you know we're solidly solidly solidly in a bare trend which puts the scale of probabilities towards the bearish resolution here but we will of course be monitoring in real time and also on the short time frames if you look at the different CME gaps we did close this massive gap right here now during the last um few days and then we have another small CME gap right here at around 88 uh 89. So don't get surprised if we get here within the coming uh days just to test it. This would not really mean that we have a resolution of this multimonth pattern which goes all the way to 80K. But still shortterm trading could be done based on the CME gaps if you are on the shortterm uh time frame. So this is actually the 2our chart. So it's super super short term but even on the 2our chart we do fill the uh the gaps. So what do we look at? Number one, let's start from the beginning. Next week, next week, there's going to be the decision about the tariff. If the decision about the tariff means that, holy crap, I'm very bright. Okay, there you go. If the decision about the tariff is that tariffs are removed, the yields the yields on US debt will likely spike. Why? Because when the yields go up, it means that the overall invest investor community, the banks, the hedge funds and so on so forth, when they see uncertainty in a country like the US or any country, they sell off the bonds, they sell off the debt, what happens? Yields go up. But at the same time when yields go up now you can park your capital in bonds and that and then you have basically risk-free uh return because the the return from bonds normally is in finance is denominated as risk-free return in quotation mark because there's always inflation risk but um in finance when you compare different returns for example how much you expect from your stock portfolio how much you expect from your crypto portfolio is always compared to the this risk-free return from the government because uh that's the that's the lowest risk you can have on the market. So when that goes up that will put sell pressure on Bitcoin and on other risk assets. So that's number one. Number two, uh if you look at the uh poly market and the odds here whether they're going to rule in Trump's favor, uh it is quite low. It is 26% chance currently. So likely there will be a lot of volatility due to this next week. And um uh it it may not be that they fully ban the tariffs, it could be something in between. Uh but Bessant has come out and said that they're ready to refund. Okay. If they have to refund any of this revenue is going to be is going to be possible for them to do. Uh I mean I guess in order to reassure the the bond holders that everything is okay. So, uh, like the news says, President Trump's most sweeping tariffs face a landmark test of presidential powers as the US Supreme Court is set to rule on the implications and legality of Trump's global duties on trade partners. And um, this is um, yeah, this is going to be super soon. On January 14th, there will be news. So, keep an eye on that. That's number one. And then very very quickly thereafter you have this uh uh hearing or actually a vote on uh on the market structure bill is also going to be next week. Let me let me quickly see when it is. I believe it is uh here here here. They're going to have the uh the hearing on 15th and vote on this on his version I guess also on the 15th. So that's super soon as well next week. So both of the things are basically on the same time. In the meanwhile, what do we see from uh the institutions? If we go to bullmay.com/charts, which is by the way the free site uh uh we made you can use it yourself fully free. There are many things we added here by the way guys. I mean number one we have this bubble map but not a normal bubble map that you may have seen with some special effects. Look here. If you click tornado, look here. Black hole. Boom. Boom. There you go. There you go. There is also chaos mode. Okay. They just go nuts. And also there is something we call the nightmare mode. Something you don't want to see. All the tokens to zero. This what happens when you don't follow the mechanical rules. But anyway, here also you have the ETF. Again, it's available to everyone. So if you go to boom.com/charts you're going to see it. So uh this usions skip dumping we do see minus 250 million yesterday and altogether the January total is at minus 209. Okay and this is in comparison to December which was at minus 1 billion approximately. uh January so far is uh minus 200 and uh yeah let's see how the month develops but uh if we break down it's going to accelerate towards the something like November if we break down towards the next support which I will soon show you uh likely is going to be like something November minus 3 billion or so next we also added the Fed's Fed balance sheet uh this chart is very important long term because as you can see the balance sheet has started to go up and likely it will and seeing you and it's likely to be a long-term increase in the balance sheet. Why? Because Trump is going to replace Fed chair next uh well not already not next because it's May 26 now. So it is this it's not next May, it's this May. In May he will replace Jerome Powell and they're going to print like there's no no tomorrow. So I think we're going to have an increase like here uh like we had in 2019. But it doesn't mean that we can be super bullish yet. Why? Because here you see the increase in the balance sheet started in September 2019 and Bitcoin was around 10K. Then Bitcoin went to 3.7K in this COVID dump. So basically 60 70% loss if you just bought the beginning of the uh of the balance sheet increase and then it took like a year for Bitcoin to really skyrocket from this uh initial price when they started to increase the balance sheet. So one very important um caveat with the balance sheet is that yes it's going to go up. Yes, it's going to pump us eventually. It can still take a year and in that year, of course, all coins can nuke another 90%. So, be very careful here, guys. I see a lot of um opium when it comes to the balance sheet. And I fully agree it's going to go up. It's going to pump us. The question is when Bitcoin is going to look when we actually see this acceleration to the upside and also even if when we see it, how long time is it going to take before Bitcoin followups? It can be basically a year. So, we added that one. Keep an eye on that. uh social risk I already showed you uh basically looking at the Google trends and when many people are looking for crypto on Google trends it is red and otherwise it's green so this stop we did see a bit of former here around the Trumpcoin and Sana alltime high not really comparable to how it was before but around here uh and hyperlquid uh P&L and distribution of positions based on P&Ls for example this uh PL PNL wallets here that have P&L 10K or 100K profit, they are now slightly bearish. They were bullish a few days ago. Now they're slightly bearish. And then these 100K to 1 million P&L wallets, they are mainly bearish, but they've been that for quite some time. Basically since October, they've been like that. And then here uh the Giga Chads, uh 1 million plus in P&L, they are also bearish. So I check this every day just to we get we get the understanding of what the big wallets are doing on hyperlquid which is like decentralized by bit decentralized perex and the news here we actually do have some news and that's that these wallets have gone from bullish to slightly bearish just a few days ago they just yesterday I think they were they were bullish now slightly bearish. Uh also guys another thing we speak a lot about the 200E moving average and as you know this is the ultimate buy area uh we've been speaking about for quite some time but now we also have a bit of stats here that we put also on booming.com/charts. If you click here at the 200E moving average you will see all of the different times when Bitcoin was within 5% of the 200E moving average and we simulate a buy here. Here we were 5% uh from 200E moving average here. here basically sixth time in Bitcoin's history this has happened and here are the results uh basically you have average draw down of 11%. So if you buy when Bitcoin gets within 5% of 200 moving average on average throughout Bitcoin history your max draw down on average is going to be around uh 11%. Uh okay so it's you basically buy super close to the bottom in most cases. Uh average recovery so it goes on average 11% down and then how long time does it take to recover after this draw down? Around 77 days. And then if you look ahead and you look at the six month return you have 53% on average and if you look at one year uh you have 215%. So you can look at all of this data in depth but it's very important because we've been saying that if we go here is going to be a buy signal like there's no tomorrow. Okay very important and this is where Bitcoin is now being magnetized attracted towards. So this is my expectation within the coming quarters that we that we get here. Whether it's going to be at 55 or 61, I mean, let's see. But as long as long as Bitcoin is like this and we're in a bare trend, uh here is where I will be deploying. Um next, what do we have? Oh, yeah. Another thing with Sana, guys, with Solana. I know many people ask about Salana. I have no Salana since uh since October with like there's no tomorrow with all coins. But here we added a pump fun dashboard because as you can see the pump fund revenues they correlate with Sana price a lot. So as you know uh PM fun is a platform where memecoins are created. The biggest use case for most blockchains is the trading meme coins. When you look at what the average retail is doing they they're speculating. Okay we are speculating. Most people they speculate in crypto and of course most of that happens on Solana. And one way to see this business business business activity of all of these launches is how much revenue they have. So uh by looking at this if there is a discrepancy let's say that you have a lot of launches but Solana price is lagging behind that could be a tradable um uh discrepancy that sooner or later is going to catch up. uh and vice versa in case you have the activity go down but the price is not going down eventually it will likely go down as well. So uh click around here as well. You can look at the Sana revenue like measured in soul or USD revenue. It's a bit different because when Solana price goes up then their USD revenues also go up. So it's actually better to look at soul revenue because this is a signal of platform usage and it's not getting elevated when the USD price of Solana increases. Instead this is more you know real usage basically. Uh so that's that. We added this one also and it's it's also a pulse of the uh of the trenches because you have different kinds of uh of personas in crypto. Some people are here just to DCA Bitcoin. Some are here to DCA so-called blue chip all coins and suddenly they go down 90% as well. The you know the optimisms and orbit rooms and ethos all of them are down like 90%. Uh and some people most new retail that came in around the Trump launch and and so on they are here to trade the memes. So you can kind of get an idea what what's happening here with the pump style. So we have it in the trenches uh category. Uh then what else we added the the bubbles. Don't forget to try out the black hole mode right here. And of course let me know what kind of other ideas you have for charts. We can add any chart. I have some ideas myself of the charts I will add in the coming days. But the goal is that all the charts are in one place that I check every day because before this before booming.com/charts I had to you know go to this website that that one website is super slow that website is done by a boomer is ugly this and you have to connect like a all of them I have 500 tabs I don't want to have 500 tabs open I want one tab one tab with booming.com/charts it's everything is here super super easy and that's it u so moving on to the next thing as you know one of the big things that uh has happened in 2025 is that it was a signal for all crypto traders to be uh 360 trader. What do I mean by that? If you're only crypto, you're in a very weak position if you don't see what else is happening in the world because if you look at crypto, you have now 80 uh let it load 86% of coins bearish. Okay, eight. So even if you're the greatest investor ever, you're losing money in crypto. Okay, 86% bearish, bearish, bearish. And then of course, if you compare to other asset classes, they're more balanced. I mean, it's like 50/50 in in stocks, it's 50/50. And especially if you look at tech stocks, a lot of them are super bullish. So looking at Nvidia, looking at Alphabet, looking at others, I mean, look here, Alphabet, freaking you know, freaking Alphabet. Google is up since the bull flip on the money line 87% since 6 months ago. I mean, it's it's Google. It's Google. How many altcoins are up that much? Apple the same thing 20%. Nvidia 43%. You know it's not that much time we're speaking about this. You have Taiwan semiconductor seven um seven months ago bullish 80%. So that's the biggest lesson and the good thing is that uh there are platforms like by bit but also Pionex that actually support stocks trading also. So recently during the last few days I am testing here to open Applebot to open silver because precious metals have also been uh pumping also we've opened if you check here uh one second here if you check the uh copy bot link if you click the booming.com/partners in the link below you find this and then you click copy pinx bots bam you're going to see this so basically now we're trading Tesla with the bot bots, Nvidia, silver, and Apple. Why? Because they're still in a bull trend and then the bot strategies work. For example, Bitcoin in bare trend, we cannot deploy the same B strategy as we did before October, but they were very good. I mean, if you remember the boss earlier, they were fantastic. As long as the asset overall is trending to the upside, the bots are very nice. Now, of course, you can do short bots, but I don't like that. I I mean when it's not the same as the long bot that can use the volatility within a bull trend when it goes sideways and it both captures the volatility and the upside move. Short uh bots you you have to be way more careful with them. But um uh the idea is that you can apply basically the same lessons you've learned with a bot on the uh on the things that have a bull trend. And the things that have a bull trend right now are the following. the uh tech stocks. Uh look here at the Nvidia, Alphabet, this and that. Uh they're super super bullish. Uh then um you also have precious metals of course. Let me just quickly open here MAG 7. Here you go. So MAG 7 currently Nvidia, uh Alphabet, Apple are in bull trend. Uh you have Microsoft in bare trend but likely it's going to be bull trend in the near future. So keep an eye for example if you want a tradeable opportunity look when Microsoft goes into bull because if the stocks are to continue to pump this will be bullish within the coming weeks. Then you have Amazon also another one of them which entered bare trend but uh the bears cannot push it down anyway. So when it flips bullish uh also an opportunity because you want to be in early bull trends and then Tesla up a lot 40% since the bull trend bull trend flip on the weekly. So all in all we will be trading with the bots on bullish assets which are currently this plus of course precious metals commodities uh 100% of precious metals are in bull trend. If we go here bam precious metals gold massive I mean you see you see this numbers it is it's like all coins it's like all coins and with uh the bots it's nice to uh use the volatility in a sideways because a lot of them are consolidating now. A lot of these assets they're consolidating. It's not like you know up and up and up parabola but they are consolidating. So of course bots make money in in the consolidation pattern because they buy low sell high within the consolidation and then as they continue to the upside fantastic as well and we do it until they turn bearish. That's it. Many people make the mistake they just you know for into silver into gold big time around this high numbers and that's I don't think that's too smart because you're not really optimizing your entry in a good way. With the bot you not following it. It's going to be trading volatility and utilizing the bull trend. If you follow in and you do it, you know, with too much money, you could just be unlucky. It can happen. You can be unlucky and it's the end of bull trend. If you want to be exposed to bullish assets, the best thing is to lather in, take a bit of a time, deploy a bit of a time once the while the bull trend goes on or use something like a bot. But just remember, you can always be unlucky. Even even if you have a good probability, let's say you have 80% probability of success, it's still 20% that you're unlucky. And so it can always happen. So making big moves in in any market is uh is not is not great. You have to be either with a boss or lad. But anyway guys, use the link below. It's called exchanges I use bulmania.com/partners for pionex and then also for copypbot. Let's see how this goes with the trady with the trady assets. And I see in our bullmania group people are people people are going nickel buying nickel very sophisticated everyone is now a very sophisticated commodities investor but it's what we have to do as the market evolves and the uh the pumps are elsewhere I mean there is a pump somewhere there's a pump somewhere and as soon as the bull trend comes back to bitcoin obviously uh that's that's where we're going to be and especially if it goes to the 200 moving average we're even going to be front running the bull flip because as you see by research by statistics buying around 200 week moving average. It's It's a no-brainer. Now, listen to this from Matt Hogan from Bitwise about why Bitcoin will be pumped. Listen to this. >> So, in 2023, Central Banks bought a 1,000 tons of gold. The price didn't do much. In 2024, they bought a,000 tons of gold. The price didn't do much. In 2025, they bought a,000 tons of gold and gold went parabolic. And the reason it took three years is because of those first two years there were existing holders who were willing to sell and they were willing to sell and miners were willing to sell and then they ran out of gold to sell but the demand was still there and when that moment happened the price went parabolic. So I think what we saw in 2025 is you had institutions playing the role in crypto that central banks did in gold. persistent buying demand. You mentioned the statistics by more than 100% of the supply and you had some existing people that were willing to sell and maybe in Q1 or Q2 of this year they'll continue to be willing to sell but it's not an infinite supply. At some point they will run out and Bitcoin will have the same experience that gold did in 2025 which is I think the price will go parabolic. So according to him, there is a supply supply crunch coming up in 2026. Let's see that as soon as that happens, the trend will flip bullish. Look here, you have Senator Tim Scott saying that the upcoming Bitcoin and crypto market structural session is about to make um is about making America the crypto capital of the world. Blah blah blah. They have to make it. They talk a lot. I mean this they talk a lot including Trump by the way. I mean Trump has done many good things for crypto but when it comes to reserve they talk a lot. This guy talks a lot. Let's get the legislation through and then we can discuss because it's still not done. And finally guys the banks are also accumulating. Wells Fargo just purchased 383 million worth of Bitcoin. Let's see when it's going to be but when when this kind of demand will hit the will hit the supply crunch. uh but there is something to what Matt Hogan is saying that they are buying they're buying but there are simply too many sellers okay and uh for the price to go up there has to be an imbalance when there are more buyers than there are sellers and ETF flows you can clearly see here that whatever Wells Fargo bought here uh not really registering on the ETF not really registering will it register at some point will we see the dry out of supply that the people are selling at some point yes uh for now it's not registering Let's also see MSTR with uh strategy is bearish and bearish and bearish and down and down and down. Even though it had the best news possible just a few days ago with the Msei uh resolution, basically they're not going to be removed from the indexes and there is no pump. So that's why trend is the most important thing. In a bull market, this news would pump it to the skies. Uh now not really. Instead, uh, we see another dump, another red week, and we didn't even get a green week. It didn't even get a green week with the news of MSI. Yes, it did have a bit of pump, but then it lost all of that uh during the week. So, that's also a signal that, you know, all of this talk that Matt Hogan is saying that institutions are buying and we're going to run out of supply, it's we don't see it yet in the chart. We don't see it yet. Theoretically, yes, theoretically, it should be at some point, but in the chart, it's not there. Is it in this room with us? It's not there yet. And we need it in the chart because the chart is what affects the portfolio. So even if you're correct, but you are six months too early or eight months too early, you're incorrect. You understand? Because in that time, your back can dump 90%. Especially if you have alts. I mean, Bitcoin is okay. I mean, if you just have Bitcoin, you you're going to be okay in one way or another. Even if we go to 200 moving average, it's not too bad. It's just another minus 30%. You're going to be okay. When people hold alts and they're saying, \"Yeah, soon market structure, soon this, soon that, soon we're going to have all of the inflows.\" Man, you know, if you're six months too early is the same as being wrong. If you're a few months too late, it's uh you have all the upside anyway. And that that's the key lesson because if again, if you're down minus 98%, you know how many excess you have to do to recover? You have to do 50x and and many coins are like that. Many many coins are like that. If we look at the the cryptos and how much they've lost since the weekly bare flip, that's why I'm telling you to take it very seriously. If we only look at the bare flips and if we look at the losses, yeah, I miss you yourself. Safe. I mean, freaking safe is down 94% since uh almost two years ago. Celestia 95%. Holy crap. Uh, Unibase 98. Popcage. It's wreckage. And the the bad thing is it may not be the bottom because Bitcoin if Bitcoin goes to the 200E moving average. You understand that this coins it's only the beginning for them. If Bitcoin of course bottoms out here goes to Valhalla it's another story but you have currently so so no one knows what what's going to happen. We don't know the future but we can assign probabilities. So there are four scenarios here. Scenario one is just that we go down. Scenario two we can continue chopping. Scenario three, we get here and we get rejected from the 50week moving average. And scenario four is that we pump to the sky. Okay, so you have four scenarios. In three out of four of these scenarios, all coins get destroyed. If we go down, they get destroyed. If we go sideways, they get destroyed. If we go up here and they get rejected, they get destroyed. So the only scenario where they keep pumping is if you break above the 50 and you keep going higher. So just on the scale of probabilities, the cards stacked in your favor. They're not stacked in your So yes, I'm tired. I have to go to sleep. Let's go to Q&A. Go to sleep. The cards are not stacked in your favor. That's why we don't have als. So guys, let's go to Q&A. Check. Check. How is the chat? The chat is rolling. uh Alia Alleg I saw Weming before some familiar faces also many new faces guys big big welcome it's if for us it's a bit the other side of the of the moon normally we do streams morning my time now we do evening late evening so it's a lot of new faces it's the other side of the moon where are you guys you're in the US you're in San Francisco where you are big big big shout so uh as we go to Q&A number one check the uh booming.com/partners for exchanges if you want to follow our journey with the bots when it comes to the stock stons big tech and silver you can see their copy bot and um yeah uh and and if you want free data go to bullmayan.com/charts then you have all of this and let me know which chart charts you want guys we can add them super fast here we have all of the data ingested like we have all of the crypto prices oh yeah one thing I will add uh very soon is is uh this uh uh you know gains every quarter how much Bitcoin goes up and Q1, Q2, Q3. It's a fun content to discuss. Um, and u, what's it called? It's periodicy. Periodic. What's it called? Bitcoin periodic. Seasonality. Seasonality, guys. See, I mean, I need coffee. Seasonality stuff. Exactly. Seasonality. So, seasonality stuff I'm going to add because that's I don't want I don't want to go to any external website to check some of this like standard Bitcoin metrics. So, we're going to be adding seasonality. We can see you know every Monday it goes up this every Q1 Q3 and see seasonality is it's not helpful to trade but it's still interesting to discuss the trend is helpful to trade we trade the trend we trade the price chart but still a lot of this charts it's it's interesting to discuss it's like you know crypto culture we need to discuss will we pump in Q4 or not well this Q4 we did not pump so all of this data I want to have it here we could add the like uh pure multiple, but I I think we're going to add it because I mean it doesn't work. It doesn't work and yeah, we don't discuss it too much. So guys, let's go to Q&A. Q&A. What company uh is this bare shirt people ask? Yeah, exactly. Ruren. Exactly. Exactly. I just found that they have this bear collection. So I have this one, I have and then I have one white Wimbledon and I have another white which is not Wimbledon. This is super interesting. I mean, we're kind of in bearish times. So I thought let let me try and they also have compliment not complimentary not in the sense that it's free you know complimentary is a very interesting word in English because it means free but in my head complimentary is that it goes together you know so this is complimentary mug it's not free definitely not free but it complements the the attire okay why why is it complimentary for you guys you you guys who are English speakers language is very interesting But it doesn't make sense. Anyway, this one is complimentary, not free. It goes together. It compliments. So, we got it also. Yeah. The word complimentary has two meanings. There you go. Another word I find interesting is itinerary. You know, what is it? I know what it is, but why? What do you mean itinerary? Like a travel plan, you know? Itiner your itinerary. What is that? Why so complex? Why? Why it doesn't like it's not referring to you travel plan? You can say, you know, it's your travel. No, I What is that? I never understood it. You just have to learn. You have to learn. Ivan Zcash, guys. Zcash is in bare trend. I know there is, you know, this news with the drama. But I just want to reiterate again that uh drama only matters in bare trend. In bull trend, no one cares about it. So, uh yeah, I mean, we keep it simple. We just follow the trend. It's bare. That's it. Uh apparently some drama, some dev quit or or not. No one knows. Maybe they quit. Maybe they not quit. They just established another company. But trend is bearish. So you don't touch it. Okay. Uh that that was the signal here to get out. And that's why again I I want really everyone to understand that the trend is the most important thing here. I can assure you that in a bull trend this news would not affect the price. What happened there with the drama whatever uh in a bull trend no one would care. It would pump. Now let's check Monero because Monero is looking very different. Uh it's still bullish. Let's open on Kraken. Monero looks very good. Uh but the issue is it has is gravity. Bitcoin is bearish. So yeah uh it's but uh the chart is very good so you can uh uh you can trade it for sure you can bet on it u to go up as a short-term trade okay with tight stop lossing because if bitcoin guys if bitcoin uh breaks down this thing is going to follow it uh so it's working against gra but shortterm um you can trade this breakout I mean if it if if it starts breaking out from the from this uh resistance at this kind of alltime high. I mean real alltime high is this. But when you look at weekly closes and opens, this is the big resistance. Um so yeah, it looks very good. But again, don't confuse it. This is this is not good for you know long term because if Bitcoin goes down, this thing will go down. And so if you're trading, use a tight stop-loss and uh you can still make I mean you can still make a lot of money even with the short term. When people sometimes they get confused that when they say you can trade on the short term, they think ah but it's small move so it's not a lot of funds. But I mean if you use buy bit, you use bionex, you can amplify it with leverage. Of course, I mean you have also look at all of the forex traders. Forex is a big area as you understand in trading. It's a big industry for trading. Forex goes up, you know, 0.5 or 1% or 2%. But why are so many trading forex? Because of leverage because you can still amplify the moves a lot. Of course, you need risk management, you need the support, resistance, you need the takeprofit and stop loss and so on so forth. But um uh that I mean that's how it's done. So for the short term you absolutely need u uh something like Pionex or Bit or B I mean any of this and you get nice Oh, by the way I forgot to tell you. So on on Pionex there is the reason why we uh we also want to share with you is that you get the $200 Nvidia grid position if you use the link below. This is between 9 and 31st. They now run this TRDFI because they also understand that listen the thing that works with the bots now is the Tradfy stuff. So they run the TRDFI deal. So if you use the link below, uh you go here to partners and then you sign up on Pionex, you're going to see this page. Okay, so that's the uh that's the situation with the trady. That's also the situation with anything that's any altcoin that is in bullish you want to trade you. It's got to be on the shorter term. I mean it is worth it. You got to be on the shorter term. You should have the XM. Yeah, true. True. We should have XMR bot. That's very true. I'll check it. So 122 was the top. Was it? I think it was higher. It was 126. Uh I mean for now it is. Listen, we're not going to know. We're not going to know for sure until it's uh until we go to 200E moving average. If we go to 200E moving average, then I think we can call it that it's uh it's it is bare market. But then the bare market is kind of over also. I mean that's that's the interesting thing with the bare market. when everyone is is is sure that is bare market uh it's over the bare market is over so now many people are not sure they're saying oh no Ivan you know you got to be bullish I mean we just follow the trend so we are risk offers you know we are bearish u but uh if we go here to 200 moving average I think everyone will say oh yeah probably it's a bare market but I think that's where it's going to end as well because that's where we're going to be buying and uh you have the stats here and the cards are stacked in your favor if you buy around the 200E moving average. And again, this data is from bullming.com/charts. If you go here, uh you're going to see it. So, I think that's what's going to happen. All everyone who is not sure whether we're in a bear or not, they're going to be sure then, but then the bear is over. That's the best part. Then it's time to be bullish. But that's how that's the life cycle of a plebe. You know, you have the cycle of the water. It goes to vapor then it goes drip drip drip rain then goes into the earth then ocean vaporizes drip drip. Yeah. Okay. So that's this cycle of water. You have the carbon cycle. You know some uh uh fox eat something lion eat fox then lion die. They go into earth then flower comes rabbit bum bum bum rabbit eat flower fox eat. So it's like a cycle. And the same thing is with the plebe plebe formos in too high. Plebe thinks it's b bull market still we go lower. Plebbe loses 90%. Plebe understands holy crap it's probably bare market and that's when he sells and and uh uh bare market is over. Then plebe buys back high thinks bull market is here. Bull market maybe even maybe even when PV becomes a bit rich but then you know he doesn't see the bare trend he listens to all the influencers telling him the old that all season is soon here it's soon he's going to do 20x he's going to do 30x this I love Alex Becker I think Alex Becker is fantastic but he's saying all the time that stuff are going to do 30x and if you look at when he first started to say 30x like stuff are down 97% since then so if they do 30x they're just going to come I mean, and also I mean, big shout out to Alex. He also said that his altcoin position went from 30% of his portfolio to 3%. So, if that's true, then he's been holding skin still in the game and lost 30% of his portfolio. But you see, this is this life cycle. Yes, it's life cycle. It's life cycle of the PL. Why are you calling me plebbe? It's a say it with love. Listen, we've all been pleb. I've I've been wrecked plebbe many times. I've been Oh, guys, by the way, let me know something. Let me know. Let's do Let's do an experiment. Let's see if you're pleb or if you are lil. Okay. Uh, one second here. So, we have the different uh kinds of wrecked pleba. Well, I mean, I don't think anyone here or maybe you are. Let me know if you have any kind of wrecked plebbe that you lost 1 million or more or if you are a little ouchie and you lost 0 to 10k. Okay. Um let's see. I think we we need to rename these two. What what kind of fun names we can have? I drama I think we just put something here for now. We need some fun names for these two. Drama mode and liquidation season. But let know which one you are. if you're little ouchi or if you're wrecked pleba or like where you are if you're more towards little ouchi or more towards wrecked pleba but we've all been a bit there wrecked pleba I mean I I've been there many times you know I I enter crypto in 2013 I was the I was the other the holder exactly which this one should be the holder but you know I I entered as a tech guy uh in 2013 I entered as a developer I mean and as a developer you I mean you have the bit of wrong understanding what market is so I thought yeah you know I I will understand tech is going to be and know it is advantage for the long-term beliefs knowing tech it made me understand that bitcoin is going to be big no matter what but knowing tech and like basing on tech when it comes to all coins is it's been very bad like all coins and tech they're disconnected but bitcoin and tech it's nice to know how bitcoin works because that helped me to be early and to keep believing in it and not listen to any [ __ ] that you know that CIA is going to take it over or whatever uh or that you know Satoshi is going to pull the plug and so on. So tech has been good from for from for the long-term belief has been very bad for trading all coins in the beginning. So I learned the hard way. I mean big big hard way and that's why we trade based on trends and everything else is secondary. So yeah I mean I I've been in all these situations. That's why yeah I mean I know that's why we have in bulmania we have the full package how to escape mental prison. I'm telling you that because I've been there myself. You know you're down like 80%. You're refreshing telegram. Hey guys, any news? Any news? And you went by a bit when you when Binance every every day you're opening is down. Oh crap. So then you then I I remember this. I mean this was long time ago. I remember waking up checking. Ah [ __ ] crap. It's down. And then okay but maybe stock market open bullish. Maybe it's going to pop. I I' I've been there. Yes. I've been there. So wrecked pleba. It's if you've been wrecked pleba it's actually like a medal of honor in a way. And by the way, uh the the important thing is to just stay in crypto. If you stay in crypto by being wrecked play, you learn so much that uh next cycle you have such an advantage. So uh and you'll be surprised how quickly you can recover in crypto. It's the only industry where you you'll be surprised. It's not like you know you mess up your stock market stock market portfolio. You buy like in 2008, you have to wait like until 2015 to recover. Or like in Japan if you bought in the 80s I don't think have have they recovered their stock market since the 80s? Uh you know it took like decades to recover in in crypto it's it's faster. So that's that's the good things. Just stay in crypto. Stay in crypto. Uh let me quickly check if I missed some update. No, we we include everything. We include everything. Aan uh what you describe the current Casper situation? Let's check uh let's check Casper. What's happening? Uh is Cuckoo in the Oh my god, guys. Yeah. Yeah, it's bad. Let me see which chart is the longest. Is it maybe Palonics? Uh well, I mean, all of them look uh horrible. Oh my god, guys. Yeah. Yeah. Yeah. I mean, you What do you want? 80%. Well, uh it's not worse than optimism or like arbitrum or any other, you know, the ETH maxi uh pump and dumps. Where is the longest chart? Uh cool coin. Is this the longest chart? Let's see. G. Oh, yeah. Here, here is a bit longer. Uh but yeah, I mean it's uh yeah, I I don't know what what you want me to say. It's not Don't huddle bearish guys. Don't huddle bearish stuff. Uh yeah, I mean when Bitcoin is in B and you see yourself it's people are surprised how fast they fall but we've been here many times. Even the best altcoins fall a lot. Uh so that's why we're not taking any prisoners. We're not giving them any benefit of the doubt because Sana fell 96% in the last bear. And here's what I mean. By the way, I let me use the Solana chart as the lesson here because let's say this is the bottom here in December 2022. And let's say you bought it like 6 months too early. This is what we just said. You know, you bought it here at minus 87. Let's imagine you bought here at minus 87. Okay, minus 88%. And this is what I just said. A lot of the macro, a lot of the theories people have why we should be bullish, they are correct. just that they may be six months too early. This is what happens to your altcoin in 6 months. If you're 6 months too early, you have another distraction here of another 70%. So, it was down 80% and then went another 70% down, man. So, this is what I mean with being too early in a bare market is the same as being wrong. But being a bit too late, for example, you see here when the bull trend flipped bullish, it wasn't at the very bottom. It was a bit too late. But it doesn't matter. you still have all of the upside. Yeah, it was bullish here. You still got all of the upside. Okay, so if you want to learn this for real, go to bullmania.com, learn about the mechanical rules because if you want to really understand this philosophy of trading that we have, stop losing money, stop, you know, drawing trend lines or draw support lines and still get wrecked. Um, you you need to do it as soon as possible. Uh, and uh it's it's not only the tools. People ask about, you know, money line, money sc tools. It's really about the philosophy. We need to understand the philosophy first. So go and watch the video booming.com. So maybe that's the biggest lesson today, guys. If you are six months too early in the bare market is the same as being wrong. If you're a bit too late, it doesn't matter. You still have all the all of the upside. So yeah, write it on a piece of paper, tattoo it on your forehead because that's that's quite key, man. That's quite key. U it's like Cheds, you know Cheds? He says, \"I would rather miss a party than to come to the wrong party or how to say I I would rather miss a pump than to be like on the other or to be in the wrong pump or something. I if you watch cheeses, you know, he does something like that.\" It's true. It's true. Bitcoin has been embarrassing for over a year. I mean, some assets are always embarrassing. Gold has been embarrassing for over a year as well before start to pump. Um, so look at Sana. It's been very embarrassing. Then it did uh uh how much it did? 3,000%. So I mean everything is embarrassing. Everything is embarrassing until it's not. When the bull uh trend flips, that's when you know to go heavier. Weekly bull trend. Super important. I mean, look at Tesla. The Tesla is the latest. If you look at Tesla, you remember Tim Waltz? He was saying that Tesla is dropping just uh when was it? A year ago or something like that. Let's go to Tesla. Let's go to Tesla. Let's check stocks. Let's check Tesla. This thing was also embarrassing and until it wasn't. I mean, here it went down a lot. I think here Tim Walls was saying that it's going to go down and down, but and then it's bullish and then boop boop boop. Uh and now almost back to alltime high. Let's see. It got kind of rejected here. Hopefully, it will not go into bare trend. You don't want a double top, but still bullish. As long as it's bullish, likelihood boop is gonna continue to the upside. So, all assets are embarrassing until they're not. I mean, Bitcoin was embarrassing in 2018, 2017, 2018, 2019 until it wasn't. Bitcoin was also embarrassing in 2014, and 2015. Um, you just need to know what you're dealing with. I mean, that that's the only thing. I know some people are angry when you tell them the u the re not the probabilities but the possibilities the possibilities of what can happen for example when you look at the midterm years which are the bearish years for Bitcoin you have a loss of approximately between 60 and 72% here the different midterm years and we're now in the midterm year and uh you have Bitcoin here pumping a bit the first week of the year just like it did in 2014 14 and 18. And in fact, those years pumped even more. They pumped even higher here. 2014 pumped 20%, 2018 pumped 30% first week of January before they started to go down and before they went all the way where to minus between 60 and 70%. So it's important to note the the possibilities of what can happen here. And if you take if you take the average, I mean it's we are tracking the average. So, within the coming week or so, we should we should know where where we stand here. Uh, are we going to follow the average or we're going to deviate? I mean, this one is going to be interesting. I'm looking forward to next week also for this reason because I mean, you see the white thing is the average of all of the midterm years. I just select here. So, that I mean this is going to be super fascinating. We're right on track. How How can be like this? Isn't it crazy? Is it Why is no one speaking about it? I think it's it's quite crazy this thing. We're right on it. We're now we're the green chart. Uh if you have missed that, but 2026 is the green chart. Yeah. So, uh this is the midterm years and then it will be time to go heavy heavy heavy after the midterm year. Let's see. Is it the No, it's not the hovering. Let's see. We have the topping here. We need to add another category which is the like after the mid like early bull prehoving gear, I guess. Johnny Johnny, what's up? $50 donation. That's very generous. Do you own a Tesla and which model? If you I don't. I don't. I don't. I uh I mean you are you new on this channel? We had this discussion before. No, I don't have Tesla. I I'm uh in that regard. I'm still uh I'm not an early adopter when it comes to the car stuff. Uh I I want uh it just has to work. I don't want too much uh new innovation there. I mean I believe in Tesla but I mean to to me myself I'm I need gasoline. It works. Diesel diesel works. many gas station. It takes uh two minutes to rechar not recharge to refuel. That's it. That's it. That's it. I also I'm I'm guys I'm too big also for a Tesla, you know. I I don't know if I look big here on the screen on the screen, but I I need like big ass car. Okay. I think Cybertruck is too small also. Uh I mean people I don't know if you some people think I'm like a [ __ ] Sometimes I meet at conference, people say, \"Holy crap, I thought you were you were smaller.\" But I I'm quite a big dude. So for me, it's it's too small, man. Like all of the Teslas, it's too small. Also, I need a bit of, you know, it needs to feel a bit luxury. I don't like the super minimalistic uh like there's nothing there. And the at least early on Tesla build quality was very bad. Uh maybe they fixed it now, but uh you know, maybe five, seven years, it was very bad. Like it's you know, plastic. I don't want that. What is this? Who is this? I don't want plastic. Yeah, it's uh maybe they fix it now, guys. I I loved Elon. I mean, just to say I love Elon. I love X. I love Tesla stock because it pumps. But I I don't want I don't want electric. Uh not now. I have a toothbrush already. I need another toothbr I'm joking. It's like a toothbrush. Minimalist design. So maybe in the future I will but um I just I I don't want another of a headache you know we learn how many VAT or what the hell it is I have enough with crypto so see I I cannot be early adopter in all regards I'm early adopter with zil exad or I'm early adopter in crypto regard but when it comes to this car man I I I don't want to have any range anxiety where you going to refuel it repump it also uh In Europe, what happens? A lot of the so-called doctors and engineers, they they cut the charging wire because it's a lot of what is it like uh copper there or what the hell it is. But there there's a lot of a bit of theft sometimes, you know. I mean, it's not a big problem, but it can happen. You know, they cut that they cut the freaking wire, the the the cable. So, I I've seen people come, they want to charge their Tesla, the cable is gone. Is like copper. What the hell is inside there? They come there with a big fat scissor or whatever do they cut it now. It's not a big like decision uh affecting issue because but anyway I just I don't want any new stuff there. Maybe I'm going to try let me know if I should try it. Uh but man why also they they get uh so they get obsolete so fast. Like another problem with this electric look at what happened with Porsche electric like everyone is saying no we don't want any electric. So Porsche it's so horrible. Like the re resale value if you care about that is it tanks like instantly. Why? Because all of the electrics it's like iPad you know you have one iPad today tomorrow there's a better iPad so you no one wants your iPad like you know what you which Tesla you have 2020 it's too old man it's still there's a new one there's I don't know why the consumer behavior is a bit different there versus uh diesel or traditional cars because I guess because everything changes and develops so fast in EV. So, uh, yeah. Anyway, I mean, that's that's my five Satoshias on that. Uh, I'm not the the EV enthusiast maybe that you wanted me to be, but that's the that's the truth. That's the truth. Let know what you drive. I mean, I guess you drive it. Volvo. Yeah. I mean, Volvo is popular. Tesla is popular. I mean, Volvo, you know, the XC90. You can buy go for Mercedes. I mean, if you if you want uh you know, people buy Volvo, okay, XC90, it's it's not as big as a GLS, but it's super expensive anyway. It's like too minimalistic. It's uh Anyway, it's uh I I think if Vol for me is also too minimalistic, man. If if I don't want stuff, I I want a bit, you know, a bit of premium, you know, you come there, it needs to be big car, nice seat, like nice everything nice. Okay. I I I don't want Volvo. It's It may too minimalistic. It's too And also Yeah. I mean the the price to to to value is not there. I mean my in my opinion my opinion. It also depends which one because if you know I'm in the market for the biggest uh cars. If you look at those like middle SUV I think Volvo is quite okay. Like XC40 versus like Mercedes equivalent. What it is it's better. I mean there I would maybe even say is better because the Mercedes ones in that where is it like GLC what else guys I'm not the car fanatic either as you can tell I just know my stuff but anyway that that Mercedes equivalent to XC40 it's uh I think it looks worse also. So for that segment Volvo probably better self-drive uh u yeah I mean maybe in the US it's possible now but in most place in the world it's it's not even possible check out the new No Hammer not Hammer not Hammer Hammer unfortunately it has become a bit of a bad uh brand with you know it's like how to put it like small D brand. Okay. I don't know. White I mean maybe it would even be fitting for me but it's like I I don't know. It's it's it's not somehow even I you know I see it. It's like either it's a strip club or it's uh I don't know someone that wants to show show that he has it. Let me know what you think. But um it's uh it's it's not my style. There is something with it. It's in my head it's a bit ruined. Maybe it's all these strip clubs that have it. You know, this uh hammer like limousine hammer. Model S is nice, but not as luxurious as you would like. Exactly. Super fast and fun to drive. Uh yeah, I mean that's probably true. That's probably true. Guys, when it comes to cars, I I don't want like, you know, fast and fun. I mean, I want it comfortable. I want it comfortable. I want it safe. I don't want that some car is bigger. I mean I I did I wanted comfortable and safe that it's nice you know that uh because at the end it's physics you have it's physics you have the smaller one is physics so you you need bigger one that's it that's it so I don't want like fast and fun I want comfortable safe nice fantastic yeah merc said as Mayback SUV. Exactly. Now we're getting closer. Exactly. No. So for for me is the GLS because G Wagon I'm too again I'm too big for it. Uh I'm too big for it. G Wagon it's I mean I would love to have it but uh I mean number one it's a military car so it's not comfortable. It has you know this it's not too much leg room. Like it's Yeah, it's a bit too boxy. like I need comfortable. You cannot compare to uh GLS. It's it's a different kind. I mean listen, if you're normal size, you have no problem. I I have an issue there. I have big issue there. It's uh I will not Yeah. For me, it would be like Ryan Air, you know. You go to Gwagon, it's like you fly a Ryan Air. It's where where your knees going to go on the freaking dashboard. Where you going to go? Guys, listen. That's it. What are we speaking about? I don't know. But thanks a lot for being here. Thanks a lot for contributing to the chat. Smash up the like, subscribe to the channel. Big shout out to everyone who has great question. And uh enjoy enjoy enjoy enjoy your Sunday. Likely we're going to be uh back uh Monday or Tuesday. See, Monday I'm a bit busy. Uh so either Monday evening or Tuesday. Let's see guys. But just so you know. So guys, enjoy. Smash it up. And goodbye, guys. Goodbye. Goodbye."
    }
]