[
    {
        "video_id": "dCkbF_4tDcU",
        "title": "Bank Of Japan Rate Hike Will CRASH CRYPTO!?",
        "published_at": "2025-12-18T15:01:17.000Z",
        "sort_date": "2025-12-18",
        "url": "https://www.youtube.com/watch?v=dCkbF_4tDcU",
        "views": 77769,
        "duration": "00:09:27",
        "transcript": "While the crypto market has been obsessing over the Federal Reserve and Jerome Powell's next pivot, there's a big old storm brewing on the other side of the world. A storm that history suggests [music] could send Bitcoin crashing by 20% or more in a matter of days. We're staring down the barrel of a potential $4 trillion liquidity shock. But unlike the Fed, this central bank isn't looking to print money. They're looking to drain it. The date you need to circle in red on your calendar is the 19th of December because that is when the Bank of Japan makes its next move. And if the last few times are anything to go by, you do not want to be caught on the wrong side of this trade. So, is this the catalyst that sends Bitcoin back to 60K? Or is it the ultimate bear trap before the next parabolic run? Today, we're diving deep into the yen carry trade unwind to separate the FUD from the facts. My name is Guy and you're watching the Coin Bureau. First up though, I must make one thing clear. I'm not a financial adviser. I'm just a chap on the internet trying to decipher Japanese monetary policy so you don't have to. This is educational content meant to show you why your portfolio might be more connected to Tokyo than you might think. If that sounds interesting, smash that like button and let's get into it. So, what exactly is the yen carry trade? Well, it sounds like complex Trady jargon, but it's actually quite simple. Imagine if you could borrow money for free, literally 0% interest, and then you could take that borrowed money and put it into a savings account, paying 5%. Well, you do that all day long, right? It's essentially a free money glitch. Well, for decades, that is exactly what hedge funds and other institutional investors have been doing. Japan kept its interest rates at rock bottom, often negative or near zero, to fight deflation. So, investors borrowed massive amounts of cheap yen. They then converted that yen into dollars and they use those dollars to buy high yielding assets like US tech stocks, US treasuries, and yes, Bitcoin. Now estimates on the size of this trade vary wildly. Conservative estimates put the direct exposure at around $1 to2 trillion. But if you include derivatives and offbalance sheet exposure, some analysts peg the total yenfunded complex at a staggering $4 trillion or more. And this works beautifully until it doesn't. Because here's the kicker. The free money era in Japan is ending. And that brings us to point number two, the catalyst. On the 19th of December, the Bank of Japan or BOJ is widely expected to raise interest rates. According to a Bloomberg survey, 100% of economists expect a hike. Prediction markets, meanwhile, are pricing in a 90 to 98% probability. The BOJ is expected to raise rates from 0.5% to 0.75%. Now, I know what you're thinking, guy. 0.75% is tiny compared to the US rates of 3.5 to 3.75%. And you'd be right. But in the world of leverage, the rate of change matters more than the absolute number. Let's look at the receipts because the historical correlation here is brutal. In March 2024, the BOJ hiked rates. What happened to Bitcoin? It dumped roughly 23%. In July 2024, they hiked again and Bitcoin dropped 26%. And we saw that massive crash in early August 2024 when BTC wicked down to $50,000. So when Japan turns off the liquidity tap, crypto feels the pain. Why? Well, because when Japanese rates rise, the yen gets stronger against the dollar. And when the yen gets stronger, those hedge funds that borrowed yen suddenly owe more money in dollar terms. they get hit with margin calls. And when you get a margin call, you don't sell what you want to sell, you sell what you can sell. And Bitcoin, being the only asset class that trades 24/7 with massive liquidity, is often the first thing to be sold to cover those debts. It's a liquidity drain, and it sucks capital out of risk assets and sends it back to Japan. But it gets worse. Japan is the largest foreign holder of US government debt, holding over $1.1 trillion in treasuries. If Japanese domestic yields rise, Japanese investors who've been funding the US government for years might decide to bring that money home. If they sell US treasuries, then US yields spike. And as we know, when yields spike, risk assets like tech and crypto get crushed. It's a potential double whammy for your portfolio. Now, before we get into the price targets and how to protect yourself, I want to share something that could help you navigate this volatility. If you're looking to trade this event, you're going to need a reliable exchange, and you might as well get some bonuses while you're at it. This is where the Coin Bureau deals page comes in. Here you'll find signup bonuses of up to $100,000, trading fee discounts of up to 50%, and deposit cash backs of up to 75% on the best crypto exchanges in the industry. To get these offers, all you need to do is hit the link in the description or scan this QR code. And once you get on the deals page, find a deal that suits you and click one of the sign up now buttons. These deals won't be around forever, though, so take advantage of them while you can using the link in the description below or the QR code on your screen. Okay, so is it all doom and gloom? Are we destined for a 30% crash on the 19th of December? Well, not necessarily. There is a counterforce in this liquidity war. While Japan is tightening, the US Federal Reserve has quietly restarted the money printer. They don't call it quantitative easing or QE, though. They call it balance sheet stabilization or buying treasury bills. But make no mistake, the Fed is injecting roughly $40 billion a month back into the system to keep the plumbing working. This is the so-called liquidity wall. Japan pulling money out, the US pumping money in, and Bitcoin loves global liquidity. So the question is, which force is stronger? Currently, the market has priced in this BOJ hike with a 98% probability. Unlike August 2024, this is not a surprise. Traders are already shorting the yen and hedging their bets. So this could mean that the event itself ends up being a nothing. However, we need to be prepared for the potential downside. So, let's talk price targets. If the unwind is violent, where does Bitcoin catch a bid? Well, onchain data shows a massive wall of support between $80,000 and $84,000. This is where the short-term holder cost basis sits. It's where the ETF buyers stepped in. If we lose $80,000, though, things get ugly. The worst case scenario, if we see a full-blown panic like we did in August, is a wick down to the $60,000 to $70,000 region. But remember, Bitcoin has never dropped below its electrical production cost, which sits at around $71,000 today. So, if we do get close to that number, well, it could get interesting. So, what's the strategy here? How do you position for the 19th of December? Well, number one, do not use high leverage. Volatility is going to spike. We could see a 10% wick down and a 15% rip up in the same 24-hour period. If you're leveraged 50x, you will get wrecked. Number two, watch the USD JPY pair. If the yen starts strengthening rapidly, dropping below 148 or 145 against the dollar, that is your early warning signal that the carry trade is indeed unwinding. And number three, maybe have cash ready. If we do get that 20% flush, if we do see Bitcoin test 75K or 70K, recognize it for what it is, a liquidity event, not a fundamental broken thesis for crypto. The fundamentals of Bitcoin haven't changed. The havinging happened, institutions are here. The Fed is cutting rates. Japan is just a speed bump on the road, albeit one that could wreck your suspension if you hit it at full speed. So, the verdict, expect volatility around the 18th and 19th of December. We might see a sharp sell-off as the algorithm bots react to the BOJ headline. But with the Fed easing and global liquidity trending up for 2026, any dip caused by Japan could be an opportunity for the patient investor. But what do you think? Is the yen carry trade the black swan that crashes the market, or is this all just a nothing burger that's already priced in? Let me know your thoughts in the comments below. And if you want to understand more about how global liquidity actually drives Bitcoin's price, then check out the video right over here. That's it for now, though. As always, thank you so much for watching, and I'll see you next time. This is Guy signing off."
    }
]