[
    {
        "video_id": "mibQ1O4bxgY",
        "title": "21 Million Bitcoin Is a Lie...",
        "published_at": "2025-12-18T10:45:37.000Z",
        "sort_date": "2025-12-18",
        "url": "https://www.youtube.com/watch?v=mibQ1O4bxgY",
        "views": 59340,
        "duration": "00:04:10",
        "transcript": "Bitcoin's 21 million supply cap is one of its most famous features, often treated like gospel. But that's not the whole picture. Sure, no more than 21 million BTC will ever exist. But not every coin that's been mined is still in circulation. Some are gone forever, lost to history, accidents, or sheer bad luck. And the [music] missing pile might be far bigger than most people realize. Estimates vary widely, anywhere from 3 to 7 million coins. So, where did they all go? Well, the story starts with Bitcoin's mysterious creator, Satoshi Nakamoto. Whoever they were, mined over a million Bitcoin in the earliest days. And ever since then, those coins have just sat there. At this point, people just assume it's untouchable. Either the keys are gone or Satoshi decided never to touch it. So, that's already about 5% of the supply off the table. And of course, it doesn't stop there. Over the years, Bitcoin has slipped through people's fingers in every imaginable way. You've probably heard about the guy who tossed out a hard drive with the keys to about 8,000 Bitcoin, spending the last decade trying to dig it back up from a landfill. But for every headline, there are also countless quieter losses. [music] forgotten passwords, corrupted backups, owners passing away. Personal [music] accidents weren't the only way coins have disappeared. Mount Gaus alone lost around 850,000 Bitcoin when it collapsed. About 200,000 were recovered, but most of it is still unaccounted for. One wallet linked to the hack holds over 80,000 Bitcoin, and not a single coin has ever been spent, probably because every blockchain analyst on Earth is watching. Then there are other cases like when Quadriga's founder reportedly died with the only known keys, locking away millions in user funds. Accidents and hacks aside, a tiny fraction of coins have intentionally been sent to Oblivion. About 3,000 Bitcoin have been burnt, deliberately sent to unspendable addresses. It's negligible, but a quirky reminder that not all Bitcoin disappeared by accident. But the majority of potentially missing coins don't have a story to tell. They're just silent. Glass node tracks long, dormant addresses with no activity for over 10 years. Nearly 1 million Bitcoin are locked in them, excluding Satoshi's stash. Could some of those be held by hardcore holders? Sure. And while many may be lost wallets from early mining days, it's impossible to know for sure. So if we step back and consider the bigger picture, from Satoshi Stash to zombie wallets, that's how we arrive at the estimate that three maybe even up to 7 million Bitcoin are effectively out of play. If that's accurate, this changes how we think about supply since far fewer coins are circulating than most people assume. If you're pricing Bitcoin as if all 21 million coins are available, your math could be way off. Of course, not every dormant coin is necessarily lost. Some of them could simply be in deep storage by long-term holders who never sold. And every now and then, a wallet thought to be gone suddenly stirs to life, reminding us that the line between lost and hodddled isn't always clear. But maybe the most important part is what it reveals about the whole system. Bitcoin is powerful because nobody can inflate it, but it's also brutally unforgiving. Over time, that's made Bitcoin not just limited by design, but scarcer still through loss, time, and human error. And that's exactly why it pays to understand what happens when crypto gets sent to the wrong [music] address. Because most of the time, it's gone for good."
    }
]