[
    {
        "video_id": "DV-SmKAS9SY",
        "title": "Palantir Rises Overnight After Trump's National Address!",
        "published_at": "2025-12-18T03:42:48.000Z",
        "sort_date": "2025-12-18",
        "url": "https://www.youtube.com/watch?v=DV-SmKAS9SY",
        "views": 4794,
        "duration": "00:10:04",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope you guys are all having a decent day. We have a ton of things to talk about, especially right now. There's a lot going on as we speak. Uh this is because Trump is currently addressing the nation and there's a ton of stuff that's being posted right now on all the remarks that he's saying on X. Uh long story short, the media today, everybody was basically predicting that Trump was going to be talking about the addressing of the geopolitical tensions with Venezuela. and was that going to further escalate? None of that that not even the war in Venezuela was mentioned in this address and it's more of kind of all the positive things that are happening within the economy and what the predictions are for 2026 in terms of economic activity, the lowering of interest rates, talking about the Fed chair. We even have uh military active military that's going to be receiving a stimulus check right now. So, a lot of interesting things that are happening right now affecting futures. We'll be talking about that all during a strong draw down with what we've seen in a lot of these AI stocks all experiencing like a 30 to a 50% pullback. Uh we see that that continued to be faded today and even with the S&P 500 that came down to about a percent. However, we're seeing demand that is still there. Micron Technology comes out with earnings that are absolutely groundbreaking. So, we're going to be talking about that what my personal perspective is. Let's try to hit 30,000 subscribers. Pop it up on the screen here. Let's get into the news. First, Palanteer. Palanteer has been pretty resilient during this whole draw down, the fading of this whole AI and a lot of the top callers and the uncertainty that is being brought into the market. Palunteer is still here at 178 and you know at 17875 down about 5% on the day. Palanteer was at 188 here. It was kind of at the top of this consolidation zone in terms of resistance. We've seen a lot of resistance during this whole base that's being built out in this accumulation area. Uh and you see Palanteer that basically kind of joined along some of the uncertainty and selling pressure that we saw today and comes down here to about 178. As long as Palanteer technically is within this consolidation zone right here and it's has a lot of support to rely on at 170, I really don't care about its price action. uh the longer that it kind of forms its base in here, the larger the potential breakout once we do get a macroeconomic environment that allows it to exceed past its resistance point if we see enough push through. [snorts] Recently in terms of bullish perspectives, what we've seen, we talked about this yesterday, Bank of America came out with this $255 price target uh amidst with a strong AI growth within Palanteer specifically and you know looking at that price that sounds crazy uh you know at the current price to earnings. However, Palanteer has doubted all the criticizers all the way from like $10 and look at where it's at right now. So, people that have been sitting at the sidelines saying it's too expensive have missed out some pretty astronomical gains. Um, in in terms of flow that we also see here, we see a lot of bullish um February and we see a lot of bullish January calls that are being bought to open right now. So, a lot of bullish flow that's coming in in terms of call volume and so not necessarily a bad thing. Talking about some of the other things that are occurring right now, let's talk about the general market because Palanteer, I do like where it's at. Uh you see the S&P 500, like I said, closed right here at 6721. The last time this happened was kind of mid- November, I believe. Uh it's lost currently closing beneath that 6,800 kind of support level that we've seen. Uh so last time we've been at this level was in November 25th right here. The thing that could possibly change though depending what's going to happen. It'll be interesting to see. Uh there's a lot of variables out there. The SPY is at 672 right now. Uh we see it up just slightly up about 60. You have Trump out here coming a lot of saying a lot of stuff right now announcing here over 1,450,000 military service members are going to get a warrior dividend here worth $1776. saying that the checks are already on their way. Uh, nobody deserves it more than our military. And on top of that, you're seeing, you know, the nation here addressing the nation concludes no mention of Venezuela. We all thought he was going to. And in terms of further possible escalation, brought a lot of fear and uncertainty into the market and I think that could have probably dumped the market and brought more selling pressure uh on top of that. You know, of course, that still could happen at some other time, but right now we're not seeing it. Also, we're seeing here here him talking about the largest tax refunds are coming here in 2026. Americans saving between 11 to $20,000 a year. So, how is this going to be priced in tomorrow? We'll just see what happens. Uh, in terms of the price action other than just the nation's kind of address that we're seeing right here, the big thing that we need to look for tomorrow that a lot of eyeballs and investors are going to be looking at is the CPI data. Uh this is going to be the first CPI data report that we're going to get regarding inflation since the government shutdown. So it's going to be an important one. Uh e um economists right now they are predicting a headline inflation growing at 3.1% pace on a year-over-year basis. So we'll see what happens on top of these stocks like I said are coming off of a rough trading session. Uh talking about high capital cost and these massive data center deals. That's kind of Oracle and Broadcom. So Oracle and Broadcom are kind of the two companies that are really bringing a lot of uncertainty into the market. We're still continuing to see the further breakdown of Broadcom that lost about like another 4.5%. Uh it's kind of just bringing this whole consumer sentiment AI type of uh idea that we're possibly at the top. However, what I don't agree with regarding that statement is the demand that is still underneath within these companies. You could have all these people on X that are calling these tops for AI. However, Micron here regarding AI memory demand is nuts. You can see here their sales right here coming in at 13.6 billion versus 12.9 billion. Earnings per share at 478 versus 396 with an operating income of 6.4 billion versus at 5.4 billion. But in terms of their actual guidance, look at this right here. for earnings per share of 8.42 versus 449 nearly a double of what the street expected in terms of their earnings per share guidance. And what this is showing you here is that the demand especially for memory and AI memory is continuing to be unprecedented. I like this. Why I like this personally is because you see everybody on X that is starting to capitulate. You're seeing everybody all the bears that are just screaming this is the top. However, within the actual fundamental kind of these individual companies here, we're seeing good earnings and demand that is continuing to soar even [snorts] though we have a lot of capital expenditures that are continuing to raise. I mean, the money's got to be raised from somewhere to build out these kind of AI data centers. As long as the demand can stay afloat, that keeps me bullish. um in terms of the long term and it's a 2026 and long term. I mean regardless of whatever this whole 15 to 20% pullback that you're seeing all these people talking about now um you know it's interesting because we saw Tom Lee that was calling for this end of the year rally and huge move and it's now just kind of flipped the script and it's now talking about a possible 15 to 20% pullback in 2026 before the rally resumes and you're starting to see a lot of analysts are agreeing with that. So, I mean, I don't know. Uh, you know, that's the whole beauty of the market. We don't know where it's going to go, but nonetheless, looking at crypto right here, Bitcoin's just kind of hanging out here at 86 and Ethereum right here at 28. So, you know, it's just kind of been hanging out in these zones. We've been seeing this kind of happening since November. Uh, ever since we've seen Bitcoin that took this $30,000 selloff all the way up from 110, even all the way 120. And Ethereum right now just hanging out at these levels. And how does that relate to BMR? you know, BMR is at a pretty important support level right now at that 30 basically slightly underneath. Um, in terms of BMR, you see, you know, big funds like Kathy Wood continuing to buy Bitmine under 30. And as we know, Tomley is accumulating at still at a rapid pace. I mean, we're seeing Ethereum, we've talked about this before with the tokenization, uh, traditional and trady is really really getting involved into adding cryptocurrency and we see, uh, easing regulations that are kind of just unfolding right before us. So the papers being sent out uh it just depends how much I think we want to read it. Uh in terms of like things like Cipher, you see Cipher here that actually is up about 1%. Um I had came down another 7%. You can see here right at 34, but now seeing a little bit of buying pressure in the overnight session. So we'll see if this continues. Uh one thing that we have seen uh that we should definitely be skeptical of is a lot of pre-market kind of overnight and futures green moves. Um, however, and then that is met with a sell-off pretty much when the market opens or early when the market opens. This has happened for the last four trading sessions. So, we'll see if this sticks or if this will be sold off again. Um, nonetheless though, still kind of maintaining that bullish sentiment. Um, when everybody, you know, starts to freak out, that is when I get more greedy and I'm personally liking these prices. you know, I ren was just at like 70 or 80 bucks not that long ago and now it's sitting at 34, you know, 22. One other big thing is I like to use Palanteer as a barometer for the whole AI trade. This thing's been holding up quite well. Uh, so in terms of the whole AI draw down, you know, Palanteer is still at 178, one of the highest valued company out there right now. Um, so for a lot of the top callers, I'm personally just not seeing it quite yet, even though we're starting to see a lot of fear that is spreading across the markets. Let me know what you think down in the comments. Peace. So, take care and I'll catch you guys later."
    }
]