[
    {
        "video_id": "iR1TBbDaUQU",
        "title": "BITCOIN: WTF JUST HAPPENED...",
        "published_at": "2025-12-18T18:19:05.000Z",
        "sort_date": "2025-12-18",
        "url": "https://www.youtube.com/watch?v=iR1TBbDaUQU",
        "views": 24217,
        "duration": "00:07:54",
        "transcript": "All right, guys. It's time for us to address the blatant manipulation, the shameless, shameless manipulation that is now taking place on the Bitcoin chart. If you look at the hourly, you see something insane. Yesterday, we had one of this uh pump and dumps. Today, I mean, just now, just now, during the last few hours, we had another one of these pump and dumps. Here is another Bart pattern. Here's another Bart pattern. And by the way, for all of you who don't know, we say Bart pattern because it is like Bart Simpson when it's up and then bum down. Uh here is another B pattern. Here is another B pattern. Here's another B pattern. Here's another B pattern. This is quite insane. If you really look at this is quite insane. This is retail getting fleeced. Absolutely fleeced because the current situation of the market is that many people have not been risking off properly. As you know on this channel, we have been risk off since October 8th. We have been selling all all coins. I just have Bitcoin now and it's only 30% of my portfolio because that is the long-term huddle. And so we've been managing in a very very good way. If you contrast that to most traders, they are now trying to make the money back and fast and fast. And if you remember the video from this morning, you see something insane when it comes to the losses that people currently have in all coins. This is uh just a screenshot of the you know top so-called blue chip you know for some reason people call them blue chip altcoins you have celestia layer orbitum options you see they're down like 90% since the beginning of the year but also during the last few months they're down 50 60 70%. I mean you see yourself right here just last two months and this is by the way a lot of people who have been believing in this global M2 cycle that global M2 is going to make them rich that all of the cryptos all of the altcoins are going to follow and as you can see we're now deviating from global M2 for the for the past two to three months and you see the losses the losses a bit of deviation means heavy heavy losses and to come back from this for example you know that to come back from a 50% loss uh you need to do 100% pump [laughter] Okay, you go down 50%, to restore your capital, you have to now pump 100%. So this is something that most people only are now finding out that holy crap to even get back the amount of money you have to make is so much. I mean percent wise, it's a lot. It's a lot. So what do people try to do? A lot of them go to leverage and they try to leverage their way back. They try to revenge trade which is as you know oneway ticket to Rex City. And of course the market makers they see that they see that there there's a lot of u uh desperate people many desperate people and uh they just want something man they want something and um they are taking big leverage and uh wouldn't it be nice wouldn't or more correctly wouldn't it be a shame if we just liquidated all of them both the longs and the shorts and then we can do the same thing again tomorrow we liquidate all the longs and then all the shorts or vice versa in this case liquidate all the shorts and then bam liquidate all the longs then liquidate all the shorts then bam liquidate all the longs. So the message here is that less is more guys in this kind of situation less is really more. We need to see where this market bottoms out. This market right now is in a ruthless position. It's in a ruth ruthless state where if you are just a few weeks a few weeks in the wrong direction if you're just you know for a few weeks you're mis misposition your your portfolio is wrong for a few weeks you see the price you pay Celestia - 40% in the last four weeks a minus 40 - 35 30 - 53 start man start and this is the price you pay this is the price you pay for not following the trend not respecting the Bitcoin bare trend because we're now bearish we're below the 50 week um and uh the question is how you going to make it back and it's one thing that you know you have all the different macro guys saying that global M2 is going to make us pump then it doesn't work you see the I mean again look at the price the price just 30 days you are mis mispositioned is a big price or now people are saying ISM the liquidity this and that the problem is we don't know when the catchup is going to happen we're not correlating to global M2 maybe we will in the future now we don't we don't correlate with global M2 we're diverging and so each month that passes, if you lose 50% in your portfolio, the amount of percent you have to make back, it's in the hundreds and thousands of percent. Even if at some point global M2 and Bitcoin start correlating again, the catchup you have to do in your old coins is insane. It's absolutely insane. And so that that's why the best thing ever guys is to just follow the damn trend. I mean, please listen. Please listen. But no, people of course they want to have someone said that the ISM is going to go up and listen. Maybe it will go up. If it will go up, we will see assets turn bullish uh on the money line. You we will see that we're not going to miss them. As soon as let's say Bitcoin turns bullish or your altcoins turn bullish, we will also be bullish. Let's look for example at Celestia. Okay, Celestia so-called blue chip. Okay, shield by VCs, shield a lot by many VCs. Okay, let's say it goes bullish here on the money line. It's going to be at 1.3. Okay, it's the same. So if you want if you want to buy it back, you really believe in the tech, don't buy now. Don't buy before it turns flips bullish because when it flips bullish, that's the beginning of a new bull trend and likely is then going to continue in a bull trend. When it is bullish for now, you're not going to miss anything by not buying it at this level because it is in a bare trend and in a bare trend things likely continue further. You have to wait for the flip, guys. So all in all, I think that what we're seeing right now is manipulation. The market makers are seeing desperate desperate people trying to make a buck trying to do some revenge trading. They get liquidated both shorts and then longs liquidated like there is no tomorrow. How do you protect yourself? You stay on the sides. Currently the best thing to do is to not trade. Don't use leverage now. Don't we have market which doesn't know where it wants to go. It's a limbo state and uh you need to see where the hell it resolves. Okay, that's number one. Number two, watch. If you want to learn trading for real, watch the free training below, bullmanion.com. Click it as soon as possible. Uh so you can at least learn the mechanical rules so next time you're prepared. Mechanical rules is all about knowing what to do when the trends shift when we are in a bare trend, bull trend, how do you position yourself? How do you ensure that no matter what happens in the news, you know what to do? Because the mechanical rules tell you based on the chart. So, watch pre free pre-training and you have to do it this week if you still want to join us because we're closing now uh after Friday. Basically, tomorrow we're closed for the remainder of 2025. Why? Because it's vacations and all of that. And in Bulmania, I will be disclosing the 2026 uh uh market uh strategy. So, watch it right now if you want to join us. Free training below. The the way to join Bulmania is to watch the free training. And guys, yeah, that's it. It's manipulation. It's clear market maker market makers want to make money. They cannot make money with old coins. Normally market makers, you know, they make a lot of money with altcoins. When there's a new altcoin, you can do market making. You can have big spread. You can have also fee from the pro. Now there's not too many new projects. I mean there are no new projects now. No new altcoins. So there's no way to for them to do that business model. So their business model now is to take your money and eat your life. Basically, when you're trading long or short, like long or short, they're going to come for you. They're going to liquidate the crap. They're going to you see it on the chart. It's quite insane. It's very tragic. But listen, it's uh permissionless. It's permissionless industry. And if you are in this industry, then you're playing then you have accepted the rules and this is the rule of the game. Uh someone can liquidate you to the upside to the downside. And uh yeah, that's what we're seeing right now, guys. Smash up the like. Let's get to 4K likes. We're going to be back tomorrow. Enjoy your evening and goodbye guys. Goodbye."
    }
]