[
    {
        "video_id": "rQzHYTFlu5Y",
        "title": "This Is A Bear Market! Why We Could Be Heading Lower | Markus Thielen",
        "published_at": "2025-12-14T12:45:07.000Z",
        "sort_date": "2025-12-14",
        "url": "https://www.youtube.com/watch?v=rQzHYTFlu5Y",
        "views": 24208,
        "duration": "00:46:44",
        "transcript": "We are in a bare market. The only question is how long this bare market is going to last. When you just follow, for example, the global liquidity, it seems to go like up and up and up. So, Bitcoin should also go up and up and up. Bitcoin experienced a 60% draw down. We could potentially see this next year in the midterm election cycle. I think there's a very high chance that the Democrats are going to win and then probably like 70,000 should be like a lower level in the sense. We were already like at 80,000 so we weren't really that far away. I can only assume your outlook for altcoins is probably a bit worse. No, altcoins are going to continue underperform in Bitcoin in terms of the Bitcoin dominance continue to go up. Salana overhyped or underpriced. Who influences crypto more today, CZ or Black Rockck? I mean, this is really good morning and welcome back to another podcast episode here on the Coin Bureau. Now today we are being joined by Marcus Tin. He is the CEO and head of research at 10X Research, a top tier crypto research shop. So Marcus, welcome to the Coin Bureau. Hey Nick, great seeing you and thanks for having me. My pleasure. Before we dive in, guys, quick disclaimer. Nothing in this episode is financial or investment advice. Please consult the disclaimer in the description for more information and consult your financial adviser before making investment decisions. Now, Marcus, as I was saying before the recording, I've been following 10X for over a year now. And this year, you guys have been having some pretty remarkably accurate calls from rotational players into and out of Bitcoin, ETH, and other alts. So, let's start off right there with an open-ended question. How are you reading Bitcoin right now? I think unfortunately it's pretty straightforward. I think there's no debate. We are in a bare market. The only question is how long this bare market is going to last. I think there you know when you look at everything from you know from technicals from market structure from onchain analytics from macro even from from the fed so I mean I'm giving you a lot of discussion points here but whatever you look at I think you can spin a bearish narrative unfortunately and I think at the end of the day you know we can discuss you know everybody has their own view but if you look at the real capital inflows into Bitcoin if they are not there then the market cannot really go up because we need capital to push the market up and unless this capital is coming I think it's very difficult you know for Bitcoin to even like stay up here and we have been talking since actually June that this you know OG uh selling is kind of keeping the market in balance and it's going to really prevent the market from rallying but what we have seen actually post the October FOMC meeting that actually this this balance turned into imbalance because the ETFs were suddenly also selling and that was kind of like really what I think took a lot of people by surprise. But when you look historically whenever the Fed meeting was sort of like more on the hawkish side, it was really I think an indication that the ETFs were selling and that really pushed the markets lower. So I think there's a lot of you know arguments here why we in a bare market. You know we have a theory of course how long the bare market is going to last but but I think it's just pretty straightforward. you know if you really follow the data and you know neglect what you know we all wish that the market would just go up but but it's not and I think uh we can point to various data points as I said from onchain to to market structure to macro um and it's just you know winter right now I think we just have to really realize that okay honing in on one of those or two of those points there so let's start on the market structure point what exact data points should we be looking at to confirm this so of course One data point is always you know retail activity. When we look at the spot volumes for example in Korea, Korea always a very heavy uh you know retail market volumes have been really low this whole cycle. You know there were some pumps for example last year in in March. Then there was you know another kind of October November last year but this year the pumps were you know a lot smaller that there wasn't really a lot of activity in the retail market. And I think with this with this activity in the retail market or lack of activity, usually you see movement in the funding rates. So both are really highly correlated and the funding rates haven't really been, you know, massively bullish either this cycle. I think even the last couple of weeks we really traded just a few a few basis points, few percentage points really up in in Bitcoin. there wasn't really a lot of leverage and I think nobody will you know nobody will claim really that this is like a retail leveraged cycle. It's more like a you know wall street ETF cycle and I think without retail it's really difficult to see how the market is really you know pushing up and you know on the other aspect when you look at you know what else's market structure is of course how many billions is going to move being moved in into stable coins and that actually trickles then down to the crypto market but I think we have also seen couple of waves of stable coin inflows but not a lot has been you know pushed down to sort of like the the altcoins and I think we see is in the Bitcoin dominance which has for example sort of just been rising I think up until a few months ago. it was one of the the highest sharp ratio trades I think of the cycle that since sort of like the the end of 2022 uh that really the Bitcoin dominance has been rising you know and as you know Ethereum was sort of like neglected up until you know the summer this year basically but I think it this indicates that it was first like a a Bitcoin only bull market and then altcoins have only you know joined here and there but not really for an extended period of time so so it's a very strange market but but it's a very strange bull market but it's mainly I think driven really by institutional investors and those institutional investors base their views really on you know on the macro on you know on the fed and then you know we are lacking really the support from from the micro structure and I think there's a lot of indicators we look at but those ones have been kind of really like muted and I think that's really you know the unfortunate and I think that's really the sign why why those uh rallies for altcoins for example didn't really last long yeah that's all true indeed I think that we haven't seen any retail participation and alts have been perennially underperforming Bitcoin. But just honing in on the fact that right now we've seen this institutional interest in Bitcoin. We've seen the institutionalization of Bitcoin ETFs and all these big firms like Goldman uh JP Morgan, Vanguard, Schwab, etc., etc. that are now looking really bullish for Bitcoin in terms of uh offering it to their institutional clients. And then I question well is the argument that we need retail to extend out the bull market for Bitcoin really that you know relevant in the sense that we've got now these massive institutional bids or what do you think is going to be driving that institutional interest in the new year and why do you think it could be lacking? So when we you know when we look of course how you know I mean when when we start really you know the you know basics for institutions which I would say is sort of like the Bitcoin ETF flows you know in 2024 the Bitcoin ETFs attracted around $ 33 billion I think 33.6 billion so almost 33 34 billion. This year we're sort of like getting only 22 billion. So there's already like almost like you know a third less this year than last year. And of course the higher the market cap the more money it actually takes to push Bitcoin up and we can calculate this how much money has come in and you know we have of course a good indication what is the multiplier of this money. You know when we for example looked at Bitcoin is a $2 trillion asset and we have seen you know a bit more than1 trillion actually being invested in Bitcoin terms of inflow. So we have a multiplier of around 2x really. So to push really bitcoin up you know like 50% from here we actually need a lot of capital coming in. But I think the the interesting aspect really is I think with institutions yes they have deployed capital but bitcoin is you know just marginally down year to date versus the the most money that came in to bitcoin that we can of course measure from all aspects including like you know futures leverage or again the ETFs. It really indicates that the ETFs have sort of like really overallocated because those $22 billion that came in actually has come in at at a loss because Bitcoin is sort of like year to day down versus a lot of the ETFs that were bought this year, you know, were bought, you know, much higher. And I think that's sort of like the the aspect that actually Wall Street has been, you know, a poor allocator of that risk, you know, unfortunately. And I think we have seen this of course a lot through the DATs where people bought at two or three times you know the NAV and of course they have been underwater so that's really challenging you know right now versus I think the the the futures market you know per se and you know of course we saw a lot of futures being unwound around the you know October 10th you know flash crash that that we had but the the uh futures leverage is actually pretty neutral compared to where we started January 1st. So a lot of the leverage has been unwound and sort of like is not holding the back basically versus the Bitcoin ETFs again you know bought $22 billion this year versus you know the market is down so they are certainly at a loss here and I think that's kind of like the you know the difficult aspect I think where you know how can you really push the narrative if you run a wall street book and you you know multi strategy book and you have 10% of the bitcoin but bitcoin is down I mean how can you get bigger risk limits for next year if bitcoin hasn't really not performed and of course you can of course you know paint the picture how this is like very you know bullish because it hasn't performed yet but I think it from from a wall street from a portfolio allocation perspective it's quite difficult how you know those wall street traders can get bigger allocations if bitcoin hasn't performed this year and I think that's a little bit the challenging aspect and you know I agree with you we don't really necessarily need retail we just need somebody but the somebody I think it's just not not there right now because the performance has not been there and because we had so much you know selling from these OG wallets and I think the other aspect is that of course we have a lot more derivatives now in the market. I think that's what's really not that much reported is how open interest for options has actually increased you know quite a bit and is a big driver of of the market and I think a lot of the options that are being traded is really called selling and of course sell called selling means somebody's capping the price and of course it also means that somebody's not going as long delta as you know you would expect because usually people buy the ETF and they sell options against it and they harvest sort of like the option premium and I think this is why we have seen volatility come down over the last two years quite sharply so since the ETFs were were launched because there's a lot of people suddenly that are looking at you know extracting yield really from Bitcoin and not necessarily looking at the open-ended upside that we you know I guess you and me we looked at last cycle and and the la and the cycle before versus now it's more people okay how can we capture the yield that's available in the market and because Bitcoin implied volatility trades at, you know, 40, 50, 60%. Versus S&P only trades at 20%. And people look at, you know, how to harvest this volatility, especially Bitcoin really hasn't moved that much this year. It hasn't really been that volatile. So, yeah, there's many points I want to hone in on there for sure. I mean, for one, the option uh writing, I believe I was listening to a podcast with Matt Hogan from Bitwise and he said that a lot of these OG sellers instead of just selling a spot, they basically also writing covered calls to earn yield on their bitcoin to not realize the gain. So that's also you know having a suppressing the price and that impact and then also I tend to agree with you from the perspective of factor investing. If you think about how mac um large institutional asset allocators think about allocating to asset classes in the new year, momentum is a big factor and um if you have a lot of these other asset classes that have performed on the year and then Bitcoin hasn't, it's kind of like doesn't lend itself well to that thesis. The one of the the bigger um arguments that's been made now by a lot of people in the macro side of it who who analyze crypto as well is this concept of global liquidity coming in next year. And they point to a few factors like one is of you know we've had a rate cut yesterday. We've had the QT ending. I think believe the Fed in the FOMC also mentioned they go into limited bond buying which is of course limited QE and then there's also talk of this banking reserve ratio which will be decreased and that could be liquidity positive and then potentially a doubbish Fed with with Trump's pointy. So this argument of global liquidity going into the markets is going to help lift all risk assets including those down the risk curve like Bitcoin. What do you say to that argument? So the you know global liquidity is of course you know p I think you know a big driver but I think it's very important to figure actually out what global liquidity is and when it really comes. I think when we look at you know some of the the misconception uh that we have you know people look at you know the money supply the M2 and you know and claim this is really like a big driver and of course intuitively intuitively it makes sense you know the more liquidity there is so you know the higher bitcoin and the higher bitcoin and other risk assets really should rise but when you actually look at the the correlation with bitcoin and let's say m2 over you know 15 years it actually shows you that there is actually kind of like really like a cyclic ical movement. So every two years the correlation is very high and then it breaks down. You know some people of course have adjusted this time series and moved it forward by 13 weeks. I think nobody can really explain why it should be 13 weeks. It's not that it takes you know 13 weeks to carry it from you know Washington DC to some exchange you know in the far east to bring it you know the liquidity there and then suddenly moves or that it takes so long to the pipes and everything. It just fits. But I think you know our view during the summer was that this actually is about to break down because it's sort of like you know the timing that it would break down and I think the the other aspect that people make a mistake here is they look at as a linear relationship versus it's a power relationship. So the power regression. So which means basically if liquidity goes from you know 40 trillion to 90 trillion it has really like a you know a multiplier effect. But if if it reaches a 90 trillion and we around like 105 110 trillion but if it reaches above 90 trillion bitcoin can go literally anywhere from 30,000 to almost infinity because it's a power regression and not a linear regression. So I think the the question is also how much of this really money supply feeds into you know the crypto market and I think the one point we pointed out earlier this year was actually that that the the change in global liquidity this year was a you know quite big impact was actually driven by the weakness of the US dollar because its liquidity from 29 central banks denominated in US dollars but of course if the ECB you know pumps liquidity in the market you know it's in euros and if of course the euro gets stronger, it actually looks really that liquidity gets gets strong. But if it's really, you know, just a US dollar devaluation, then it's not really a lot of net liquidity in the market. And I think that's why we were, you know, quite hesitant to really sort of like embrace this this metric. And we look more kind of like, you know, some some real Bitcoin metrics, how much money is really moving into Bitcoin. We look of course stable coins or some other real, you know, data points. And I think the other aspect is of course people pointing to the you know treasury general account but here also of course it has been refilled from you know 300 billion to 900 billion and any moment I think people were initially expecting as soon as the the government in the US reopens after the shutdown that is going to be depleted and suddenly you know there's all this liquidity that's going to that's going to you know pump bitcoin up but I think we had this similar aspect in February um this year where it actually took two months to really, you know, deplete, you know, really just release all the liquidity from the, you know, Treasury General account. And it really took from February until April, you know, until really, you know, it was, I think also from like 800 billion to around 250 300 billion. So there was suddenly liquidity coming in. But if you remember during this time actually Bitcoin fell. So despite the liquidity from the TGA coming into the market, Bitcoin fell and Bitcoin only started to rise after the whole Trump tariff tantrum basically. So that's also like an aspect and I think I would actually argue that you know the the additional aspect here that yes the Fed cut but the Fed cut for the third time and the last two times in 2019 and in 2024 when the Fed cut for the third time they actually paused and in both instances Bitcoin fell down fell I think 7% and something like 20% over a period of 30 days post the meeting. So in both of those cases, we rallied into the meeting and then we sold off. And I think that's quite a high chance that we're going to see this again now for the simple fact is that the hawk I think the the statement itself was hawkish. I think Powell started to talk sort of like hawkish or tried to talk balance and the longer he talked the more dovish he became. you know he indicated of course that the employment data was overstated and the you know other aspects of course but I think the market actually would look through it because it you know the market I think realizes or knows that this was probably just like Powell's comments or interpretation versus the committee has clearly indicated you know based on on the statement based on the dots that they only expect one cut next year and you know another cut you know the year after. So there's only really two more cuts priced in over the next two years, which is not really, you know, as dobbish as people hope or as dobbish as people expect. And I think that's why it's kind of really difficult to expect a lot of, you know, tailwind from, you know, from the monetary side because a we need to wait, you know, for the data that's going to come probably next week, the employment data, and more data is going to come in January. But I think Powell has also indicated that you know I think that's how he started the press conference you know that the interest rates are sort of like at the neutral level now where they feel very comfortable. So it indicates actually that there's going to be a longerterm pause. And if you recall last year in September the Fed cut by 50 basis points and we had this monster rally into the Trump election. But then by December last year the Fed also cut for the third time. Powell actually talked more hawkishly. Paul suddenly indicated of course with Trump's election that there's going to be tariffs and the inflation it's going to be avoided and of course that's sort of when we when we peaked out of course we bumped around a little bit until the Trump inauguration on January 20th but then we quickly sold off because there were no rate cuts coming and we had to wait again until this year September and of course we have a very similar playbook now where when are the next rate cuts when is the next liquidity injection I don't think there is going to be a lot of liquidity injection right now but my my biggest worry is of course that the unemployment rate is above the 12 months moving average and every time this has happened in the past and it only happened now the fourth time in the last 30 years. So it doesn't really happen that often but usually you will get a recession down the line and I think the question really is at one point do we accelerate in that level in that unemployment rate and if it does I think it's a little bit boring also for risk assets you know of course stimulus will come but usually there's first some more pain so that's how kind of how we look at from a macro perspective wow there's a lot there to to focus on okay I'd like to take a moment to thank the sponsors who make this show possible SVM's ecosystem has been missing been a high-speed, low latency chain. Until now, Fogo delivers 40 millisecond block times, 1.3 second finality, and near zero fees. All backed by high performance validators colllocated near major exchange infrastructure. Made for traders by traders, zero compromise. It's not theoretical. It's live and blazing fast and ready for you to test. Head to fogo.io/start io/start and experience the future of trading a few of those I mean obviously yes it's a good point that there's only one rate cut priced in in terms of the dot plot for next year and you know two over two years so that's in that's true in terms of like the impact on liquidity there and then I'm curious though so you say employ un unemployment should be a concern now whereas a lot of the fed officials and it's seem to have a concern around on the inflation side do you not think that they would if you point to the fact that they consern should be concerned about unemployment. They should be more doubbish and be more accommodative to rate cuts next year than now where they kind of a bit more hawkish. So of course I think the main question really is you know what do rate cuts really you know do for the labor market and I think you know we have seen you know now I think 175 basis point cuts you know over the last I think like you know 18 months two years and it hasn't really done much for the US housing market for example so you know the question is you know before you know meaning I guess you know 20 30 years ago when there was a lot more you know as I call it fixed capital investments. So of course you built a factory because you have to like employ all these people you know a bank loan with lower interest rates was really helpful but I think these days there's not a lot of you know fixed capital investment so you didn't you don't need to buy the land you don't need to buy or build a factory you don't need to you know have all this massive capital expenditure where interest rates really you know matter you know in in that sense so I think these days you know start companies like relatively easily and so interest rates maybe doesn't really make such a big difference. And I think there was also, you know, this concept of course that interest rates takes like, you know, 18 months lag until you really see them in the economy because again, it took so long time until you built the factory. You know, you you set it all up and it just takes a long long time. But these days, the transmission mechanism is actually probably a lot faster, less clean. And I think the question really is it's more pro probably I would argue on the forward guidance, you know, what actually the central bank chief really communicates. You know, we have seen this with Draggy. We have seen this with Yellen before. And it's not maybe the actual level of interest rates that that that really matters because, you know, does it really matter for Nvidia? Does it really matter for I don't know Microsoft or Facebook where interest rates are. I mean, you know, they can, you know, they they have a different borrowing rates anyways. It's more the stories that they can spin. It's more the the narrative that they can tell to attract investor capital. So it's not really that actually people people really need I think a lot of the money because you know all these tech companies have the money and they're really the ones who really driving this whole you know capex expansion really and it's not really financed through through debt. It's more you know financed you know through the free cash flow up until I think you know of course recently when they started to build more these data centers but I think even those investments are not really dependent on interest rate cuts. So that's why I think it's very difficult you know to pinpoint and it's probably you know if we get into this scenario that suddenly there's not a lot of hiring because people becoming more cautious or using you know more AI and you know not really willing to train a lot of junior people. I mean that's the stories we hear from you know from US banks that the hiring you know is down. So the question really is I mean what can the Fed really do in in that scenario and I think it's maybe yes I mean they can cut interest rates but the question really is how low can they cut interest rates right I mean when as you acknowledged inflation is at 3% and it's quite sticky there and it should be lower and of course Powell you know kind of tried to hide between the argument or behind the argument that yes it's you know it's all tariff driven and it's transition transition here but when when you think how you know Can interest rates in the US really be below the inflation rate right so inflation right now is at 3% and interest rates are at you know 3.75 around so you know how many cuts can we have right so if inflation might be sticky here at 3% and two cuts are priced in I mean then we are almost like at 3% already so it's not that we have a massive tailwind and I think the biggest tailwind for risk assets is really when we having this you know change in inflation expectations. For example, we came out actually with a really bullish uh report in end of October 2022, literally like a week before FDX blew up. And it was built on the argument that based on our models, inflation in the US should fall from back then from 8% to 3% in a year's time. And of course, Wall Street, basically all the Wall Street economists for 2023 expected a recession because of the permanently high inflation rate as people expected. But of course, inflation came lower. We had this big bull market and that was really like an inflection point. But I think here the question really is I mean you know where's the inflection point? If you're cutting in twice next year or once or three times, it's not you know at the margin it doesn't really make a much difference. And I think that's really the problem with risk assets. they really need this big shift where it's going from, you know, from bearish to, you know, to bullish, from, you know, from hawkish to doubbish versus right now we're going, you know, it's kind of like the stop and go. And I think that's why we had this Bitcoin run this cycle as a stopandgo cycle because, you know, the Fed cut three times and they didn't do anything for six months, then they cut for three times, and then maybe don't do anything for six months. So, it's very difficult, I think, for for Bitcoin itself to find its footing because there's not a natural buyer in the market for equities. equities have all these insurance funds, pension funds that are always buying versus Bitcoin. You know, Bitcoin depends more on those micro factors, but the micro factor is not a massive tailwind. So, that's kind of like how I look at, but I think there is an aspect that that the inflation rate the inflation rate is sort of like on the back burner. I don't think you know people can do much about it. You know, usually you know maybe the tariffs you know kind of like work itself out. But I think the other aspect really is that the employment rate historically once we have started to ramp up in the unemployment rate that it actually has really you know spiked a little bit out of control until there was a recession and I think if you just look at a chart from you know 20 30 years history I think it indicates we are sort of like at this you know bottoming period right now and as long as we are above the one-year moving average I think it's sort of like quite a negative sign and yes you know there will be more stimulus if goes a little bit out of control but it will also come with pain in terms of risk assets first. Yeah, you made a very some very good points there especially as it relates to inflation expectations. I mean if you look at where 10ear rates longer term rates are trading the markets are worried about that and that longerterm rates obviously are impact more on the real economy than just the shorter end. So that could also be a drag. I just want to quickly hone in again on the liquidity argument because as a researcher you have many different proprietary indicators and I'm sure you gather information from lots of other data sources for a crypto investor and taken from the perspective of trying to have ascertain how much liquidity is going to impact on price of crypto. Do you like to look at these larger bigger macro data points like you know the TGA or M2 all that stuff or do you prefer to hone in more on cryptonative liquidity like the stable coin supply as you mentioned? I think crypton native liquidity you know is a lot more relevant for the crypto market. I think the other aspect is really sort of like hypothetical you know if I mean you know people like to look at for example like M2 before but you know they they confused you know money supply you know with with real liquidity hitting hitting the the crypto market and I think you know when we look at you know onchain data how much money really goes into Bitcoin I think that's a lot more relevant and I think that's kind of like that's kind of the data point we actually feel most comfortable with because I think the the other aspect is sort of Like I think it's almost like um you know a misconception right I mean you mentioned before that also you know the $40 billion that the Fed is going to start buying now in short-term bills but you know to be really QE it needs to be be longer term treasuries right it needs to be 10 years plus to keep really the the longer bond yields anchored because a lot of let's say corporates you know if they make interest rate decisions it's really on the longer terms right it's not really on the short-term borrowing that really that really matters because the short term is already very low right the the twoear is at 3.6. So if the Fed buys more of those or even shorter, it's not going to really I think move the liquidity needle. It's really more more the longer term things. But I think it's interesting when you look at a year ago in December on a 30-day window, there was a hundred billion was moved into crypto. This was around of course, you know, post the Trump election. You know, this summer we have seen around $60 billion. You know, this is of course around the, you know, the Genius Act. There was of course a lot of you know hype of course with the circle IPO and a lot of positive momentum a lot of stable coin issuance also and that was like 60 billion as I said but right now the last 30 days we have seen 4 billion so we're coming from 100 billion being moved into bitcoin a year ago to 60 billion during the summer and now we only have four billion so I think we can easily explain by those flows by real flows you know that are literally you know we we can of course detect how you know, money goes into Bitcoin and and out of Bitcoin. But we can easily, you know, explain why we are here and not not higher versus when you just follow, for example, the global liquidity, it seems to go like up and up and up. So, Bitcoin should also go up and up and up. And I think it has really failed to to explain once Bitcoin has reached this, you know, call it, you know, escape velocity above like 90 trillion. And above 90 trillion, as I was saying, it's more kind of like like a power regression where, you know, we can be like literally anywhere. we can explain any level you know from 30,000 per BTC to literally you know 500,000 or a million uh because there's no kind of you know it's escaped velocity really right it's almost like you know flying into orbit but I think what really matters for Bitcoin is the actual money that's being moved in and out and I think we we have shown for example that also the Bitcoin ETFs they really depend on on sort of like like a dobbish uh guidance so it's not just the cut itself is that beyond the cut there also needs to be the prospect of probably another cut and only then the Bitcoin ETO ET the Bitcoin ETF flows come. I think one of the the you know the most you know people of course look at the ETF flows day by day but I think the most interesting aspect is when you aggregate them and look at them really based on a lot of these central bank meetings you know since the October 29th FOMC meeting Bitcoin ETFs have seen around 4 I think 5 billion of outflows versus you know yet to date we have seen $22 billion of inflows so it's almost like you know once power shifted to a more hawkish tone own at the October meeting the Wall Street investors have started to sell and I think that's why yes it's all very positive if the Vanguards of the world and you know the Morgan Stanley's and so on they can all buy now or their clients can buy but what we have seen with the real flows on the ETF side is actually Wall Street investors have been selling since the October FOMC meeting and this is why Bitcoin actually sold off it didn't sell off because of the you know October 10's crash it didn't sell off because of you know something else it sold off because of you know the hawkish FMC meeting and that kind of kept Wall Street investors away and Wall Street investors were the ones that were buying from the OGs and there was this balance going on as long as you had both parties um you know sort of like matching matching off each other's flows but then suddenly these ETFs also turn sellers and I think that's why we sold off from you know 120,000 to sort of like 90,000 and we really struggle to kind of rebound here because ETFs are still not buying. Sorry, I wish I had better news. So, yeah, I mean my hopes and dreams are fading away. No. Um, okay. So, 2026, another thing obviously in 2026, apart from all the other factors you mentioned is is it's an election year. And in a recent CoinDesk interview, you warned that um in previous cycles of Bitcoin or previous election years, Bitcoin experienced a 60% draw down. We could potentially see this next year in the midterm election cycle. Do you think that's possible? 60% down next year. So I mean we sort of like are around already like 30% down we can argue but I think what's interesting is you know of course we have you know used the having cycle we have of course used you know all these models from from stock to flow to liquidity and try to understand what what really works and I think there is really this this somehow this this concept and this is why again we had this um you know CoinDesk actually you know since you mentioned CoinDesk but they wrote this story you know on October 28th 2022 when we came out with a really bullish estim estimate and it was mid of the bare market nobody wanted to hear it right everybody was really depressed but it indicated that 15 months before the havinging it's usually the time where you know where bitcoin bottoms and of course there's not many data points around the h havinging so it's very difficult to make really statistical reliable indicator here but I think the the aspect is that actually is more relevant is sort of like the US midterm elections and it the US midterm elections is every four years in November and almost by clockwork around 12 months before Bitcoin tends to peak out. when you look at you know the peaks of you know the the the the you know the bare markets we had of course was in 2014 2018 and 2022 and you know these are all of course US midterm election years but the peaks the peaks were of course always the year before but the peaks were always between October to December primarily actually in December and of course you know the peak for example in December 2017 it was sort of like a you know a mixture between the the CME Bitcoin, you know, launch, but there was also some enforcement regulatory enforcement action. Then there like peaked the bull market, you know, the bull market in 2013 peaked also in in December. It was sort of like also driven by some regulatory action in China and everything. And it's, you know, and of course we know that the bull market in 2021 peaked in sort of like November because people expected the Fed to turn hawkish at the December meeting. So it's always like this sort of like end of the year kind of scenario which is sort of like where where we are now or where we have been you know since October since we peaked there. So it falls into this scenario and what what we have is actually between January to October of these you know US midterm election years is that the US stock market tends to go sideways. So there's a clear indication, you know, the four presidential years how the stock market performs. And the worst year is always the midterm election year because that's usually when the sitting president loses a lot of votes or his party loses a lot of votes in the House and the House of Representatives and then of course you know he becomes sort of like like a lame duck because usually the other party wins and I think there's a very high chance that the Democrats are going to win and then a lot of you know the Trump's expansionary policies might not be pushed through and I think that's kind of the argument why sort of the stock market might be running out of you know steam here as well and sort of like goes sideways. There might be some sector rotation and I do fear there might be this void then for Bitcoin as well that you know Trump was of course the Bitcoin president but what if he cannot do his policies anymore maybe there will be some nothing is going to happen really and I think that's kind of like the the risk where that sort of like we are so like foreseeing because when you look at historically during those years Bitcoin actually had a sharp correction can it go down really 60% I think you know I would say uh probably like 70,000 should be like like a lower level in the sense because there's some super technical support there and so we we we haven't been you know we were already like at 80,000 so we weren't really that far away but it's very difficult to identify what's really going to push Bitcoin up from here our scenario is more that we that we just trade around this sort of 80,000 to 100,000 you know for for a while but we fail to really break out and I think there is a drift lower because of that okay well I mean that's If it's if it seems like a bit of a bearish outlook for Bitcoin or for the next few months, I assume I can only assume your outlook for altcoins is probably a bit worse. No. Well, yeah. I mean, I coins, you know, we have, you know, we have actually been since the beginning of the year suggested to people to hedge bitcoin within, you know, diversified altcoin portfolio because it's difficult to argue why altcoins should rally. And I think the argument is really that we have around $59 billion per year in in unlocks and a lot of those unlocks are, you know, VCs, early investors. But I think the focus is really on the on the VC side or on the, you know, on the, you know, hedge fund side here where a lot of the investors that again invested in the VC funds in the last cycle or even the cycle before probably want their money back because a lot of those, you know, VC investments sort of failed to list on, you know, on the IPO market. you know, we didn't really have a lot of IPOs coming, you know, this year. Of course, we had Circle, of course, we had, you know, Gemini, you know, we had bullish, but I think there's a lot money trapped really, I think, unfortunately, from from these LPS, and the LPs want their money back. So, I think there's this constant pressure of, you know, selling some of those those holdings. And again, it's like $59 billion per year. So, there's a natural seller in the market. It's almost like the opposite of the US stock market where there's always a natural buyer. And I think that's a little bit kind of the tricky part how to argue. But I think the the thing that's I think a little bit the really unfortunate thing is that there's not a lot of real narratives and not a lot of stories, right? I mean this RWA, you know, how can you really make money off of of you know holding the token, right? I mean you know even the lighter token really passes on not a lot of you know of of the revenue that they're generating. I mean when you remember like last cycle it was all exciting. It was all DeFi. It was you know I mean you know last time there was so much to learn almost versus now it's just to learn where where the capital is flowing but there's not a lot of I think you know exciting protocols and I think that's a little bit the the unfortunate you know time and I think that's kind of like where I would argue that you know not a lot of money is actually being used to really be deployed in DeFi. So it's you know the narratives have really changed and you know last was also a lot of minting you know on the NFT side so you needed to buy Ethereum versus now it's more kind of like well I can make 3% staking yield I mean after all the cost and everything it's a lot less versus you know versus a 10-year Treasury pays around you know 4.1 4.2 too. So there's actually a negative carry to move money from Trefy into crypto versus last cycle, you know, thanks to, you know, three arrows and Alama who were paying of course, you know, massive, you know, yields basically that could be passed on to various instances versus uh, you know, treasury yield were just like 1%. So there was a clear incentive to move money from Trefy into crypto just to harvest the higher yield versus now it's the opposite. I think that's why it's very difficult because if you know the more and more yield is being E is being staked for example I think the less and less will be really be used unless of course it's liquid staking but I think a lot of the E are being staked is just like laying around and not being used and I think that it's a sign you know where we are in the cycle so I would say we need more exciting protocols exciting stories exciting narratives but I think the VC investors have not really put a lot of money into crypto and that's why a lot of protocols didn't really have a lot of I don't know marketing budget to drive like great narratives or something. Interesting. So, so you think the narratives are the right are the catalyst which could take Alt higher. Uh right now there's nothing that's compelling from your angle in terms of what's come out this cycle. Well, I think when you you know when you look historically, right, people always try to look at the the havinging cycle as sort of like why we rally, but I think in you know in the end it was always like an exciting story or a new way to acquire Bitcoin. It was it was you know it was it was something else was was really going on. It was not suddenly that the mining rewards were cut you know in half that suddenly bitcoin would be rallying you know it was for example in 2013 it was suddenly you know bitcoin was available in China discovered it you know bu which is like the the Chinese Google was accepting you know bitcoin payments for some of their services that time really when bitcoin went up 10x in a matter of of weeks. So there was like a great you know story really around right and I think really like a sort of like a use case versus this this cycle it's more about buying and storing the asset but not really using it and I think that's really kind of like where where the narrative runs a little bit you know foul because we don't want people to just sort of like just just stake their ease we want the people using their ease for something exciting you know we want you know people using ease to I don't know mint NFTts or or something else right but but using it and I think that's really the I think the you know the problem we have is that historically when there was you know when when the cost structure went lower for example when when batteries for cars you know when when the cost for batteries went lower and lower and lower suddenly of course Tesla exploded because it was cheaper for them you know to buy these batteries and put them in their kind their cars and everything so there was a lot more uh you know volume going on versus I think right now is of course we having these finally Ethereum you know, fees, gas fees are lower and lower, but not a lot of volumes is happening. And I think that's sort of like the the mismatch, right? Historically, you know, you might know this as well, right? But, you know, used to be quite expensive to download anything on your phone, right? Because, you know, the the servicing fees were were so high, you know, you couldn't, you know, even download a picture. But now it's like so cheap that uh, you know, it doesn't really matter. The cost doesn't matter. So, the volume is exploding how everybody's using, you know, the data services for example. But we don't see this in crypto yet despite the low gas fees. So I think something needs to happen there. And when this happens, I think then we have a new narrative. Then we have a new bull market. A new bull market will come for sure. The question really is, you know, when and you know, I don't think we can rely too much on macro on that side. Got it. So just in terms of next year, you think that um altcoins are going to continue underperforming Bitcoin in terms of Bitcoin dominance continue to go up? Yeah, I think so. I think I don't think there's a real com I don't think there's a real compelling story for altcoins. I think selectively you know for example like I think BM B&B is probably one of my my my favorites simply because you can generate some some higher yield you can participate on the launchpads you can participate on some of the the you know token launches there and historically this year you would have made another 10% in terms of yield and I think it grows with the ecosystem I think we have shown in some of our analysis that you know the BMP actually grows with the number of of you know wallets in the ecosystem but I think a lot of the the the the other projects, you know, a lot of the protocols they really like last cycle, they sort of have become like, you know, dead ends. And I think when you look at a at a 10-year chart or six, sevenyear chart, some of them look really, you know, look really depressing, you know, in terms of like the waves, but they always need a new narrative. And I think with the new narrative, then more crypto sort of like investors come and, you know, that was, you know, when we started the conversation and we talked about, you know, Korean retail investors, you know, they need to get excited. So retail money needs to come in to really push prices up because Wall Street money cannot buy the altcoins, right? I mean that's why we really need you know the retail investors and I think that's so like where where you know the narrative needs to be you know aligned but you know so far we're not seeing that. Yeah. No, makes sense. That narrative is what drives retail. So Mark just to finish off here quickly got rapid fire questions one answer that's all and then we're done. Firstly Salana overhyped or underpriced? overhyped. Okay, sorry. Second one. If you could use only one chart forever uh price flows or macro to influence your decisions, what would it be? It would be the 21week moving average for Bitcoin. Okay, perfect. 21week moving average. And finally, and this kind kind of relates to your your writings as well in terms of the control of crypto. Who influences crypto more today, CZ or Black Rockck? Excellent question. I mean this is really black rockck and I think if I may you know take this question here. Yeah. When you look when you look back at this is really like a very very important question. When you look back each cycle had different promoters. Each cycle had different people you know to bring into the crypto market. You probably remember like Bitcoin Jesus right? It has all changed. You know of course now it's more Larry Fring or you know Tom Lee for example who is of course on you know CNBC every day or three times a day. So I think it brings in different different people and I think even like last cycle we had a lot of more retail um you know proxies right people that were close to the retail market you know versus this cycle these are all institutional players there's nobody you know we haven't really heard much from you know Vitalik we haven't really heard much from CZ I would say I mean CZ seems to tweet you know every couple of weeks you know some some you know keep you know hodddling or something but I think this cycle it's really institutions and I That's why these Wall Street players, these Wall Street promoters are the ones who are really most influential. But I think to really to bring up the retail market, we need those people that really resonates with the retail people, right? We need somebody young, dynamic, you know, somebody crazy. And I think we're missing really the crazy people this cycle. And I think that's why we're not bringing in the new retail crazy people. And I think that's what we need. Totally agree. We need more Vitalic tweeting, CZ tweeting, and less of Larry Frink singing about, you know, tokenized assets. Well, thanks a lot, Marcus. I I really gained a lot from this. This was super insightful. Um, albeit relatively short, but there was so many more questions I could have asked, but you know, you're a busy man. Um, I'll leave a link to your Twitter and your 10X research website below for our viewers. Where else can people follow you and get your insights? 10xresearch.com. You know, we on Twitter as you said, you know, we publish frequently. you know, happy to, you know, help out everybody who needs needs some help and we are there to, you know, provide our honest views about the market because we want to make some money. Of course, no investment advice, but we want to kind of look the market from what really drives the market and that's kind of like what we, you know, project in our research reports. Yeah, not financial advice, but following 10, subscribing to 10x is well worth your while. Thanks a lot, Marcus. Really appreciate it. Have a great day, guys."
    }
]