[
    {
        "video_id": "qPiVeHjTRT8",
        "title": "Palantir Stock Slides as AI Trade Faces New Uncertainty!",
        "published_at": "2025-12-14T04:59:15.000Z",
        "sort_date": "2025-12-14",
        "url": "https://www.youtube.com/watch?v=qPiVeHjTRT8",
        "views": 3593,
        "duration": "00:10:27",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope you guys are all having a good weekend. We're going to be talking about Friday's market close, what we're seeing in terms of prices. The broader market comes down about 1% and some interesting headlines that are really bringing more uncertainty uh into the market, which isn't necessarily a bad thing, especially for a lot of the AI bubble kind of bear top callers that are out there. Uh why I actually don't mind that and think that's important for the markets, especially for some healthiness and a little bit of a pullback. um and kind of what are we expecting for the end of the year? What my own personal prediction is um and also talking about um you know some of the indications or you could say opinions and perspectives that Tom Lee has offered. I really like listening to him especially going into 2026 how that relates to some of the big AI trade stocks like you know Palunteer AI data center names and now you got these AI data center space names uh you know all catching a lot of attention right now. So we we'll be breaking it down. If you're a new or returning viewer hit the like button, subscribe for daily videos. We're trying to hit 30,000 subscribers. Let's see if we can do it. Pop it up on the screen here. Let's talk about Palanteer. Now, Palanteer is here at 18215. It came down about 3% on the day. Not necessarily a bad thing, especially with a little bit of uh uncertainty that was in the market on Friday. Now what you do have with Palunteer here, if we can zoom out and get the right interval here, um, in terms of this consolidation zone, we know Palanteer has been spending a lot of time now just building out this base here between the 171 and the 188. Anytime that has fallen below, it has quickly, you know, recovered with a fair amount of confidence back into this consolidation zone. Um, right here in this range, Palanteer is right there in the middle of the range. We don't have any particular, you know, individual news or catalyst for Palance here, but as long as it hangs out in this range, I'm not necessarily concerned. And overall, you know, looking at the price to earnings, it's at 429 right here. Market cap of 437 billion. You know, Palunteer is, you know, highly valued. I think we can all agree about that in terms of its valuation. So, what I like about Palunteer here is I really use this as a barometer um of how the whole AI trade is going. If we saw any huge breaks in a bubble or anything like that, that's where I think you could see Palanteer that could possibly fall relatively quickly just due to its price. However, we're not seeing that. We're seeing actually a lot of resiliency. So, this is keeping me bullish on the overall AI trade. I like to use Palunteer as a big indicator on how the general AI speculative trade is going uh in terms of just not just sitting on the sidelines waiting for this whole crash that could possibly not be as extreme as uh a lot of people are expecting in terms of what the news was that we saw on Friday. The big thing is, you know, these bears and what we're seeing across the board is looking for any type of basically bad news, any type of bad news related to AI to really bring down the market. And that's what we saw here on Friday. Oracle um there was this headline came out here that there were going to be these delays uh with Open AI in terms of building out uh their contractual commitments. Uh what we saw here was actually not true. It came out later. Oracle was at like 198. It dropped here to about 188 and they had a nice recovery after Oracle came out and basically said that there have been no delays required to meet their contractual commitments. Um I agree with this post here saying the market is highly on edge waiting for any headline to call an AI bubble. And um when you have that basically these bears are trying to just wait on the sidelines waiting for any bait uh in order to grab on. Um, I do like that uncertainty because that means that we aren't at the top if everybody was calling the top right now saying we're only going up and up and up and you know the market was not able to uh accumulate any type of return or increase in market capitalization because on good news because everybody's already bullish that is more of a top indicator. However, this kind of selloff that we're seeing and the fact that this fake news right here brought down the actual general market down about 1%. Now we have some interesting different varying opinions uh you know this move was kind of sold off basically on Oracle by the end of the day that the market was basically calling BS afterwards or afterwards. So you know on the day here for Oracle you can see you know it popped up to 193 at the nice recovery here and the market just kind of faded that again back down here to about 188. So, not necessarily the best move in terms of a close out on Friday, but the market down here at 6827 at back still above 6,800. Uh, that's very strong for the S&P 500 index. Uh, especially right here as we've seen a decent rotation out of tech stocks. This is keeping me relatively bullish because above this 68 right here at this level and with the uncertainty uncertainty that we're seeing here, Oracle talking about here raising its capital expenditures. That's kind of the main indicator of uncertainty that's entering into this whole AI trade. You know, a big thing is that we're still seeing a lot of rotation out of these tech stocks. And that's why we're seeing possibly, you know, a lot of questioning. You know, why is the S&P 500 index holding up above the 6,800 even though a lot of these individual names may be selling off at a more aggressive pace? Uh is because we're seeing a nice rotation and more to these valueoriented type stocks. uh that could benefit from an you know a economy that is continuing to grow but just trying to take some profits out of these AI kind of growth oriented names that is not a bad thing taking some of the frothiness out of the market diversifying within the market in terms of profit taking uh and I think that's still bullish for an end of the year type of price target. Um, in terms of what we have from Tom Lee for next year, it's interesting to see right here. We're starting to see this narrative that's popping up all across the board, and you know, we'll talk about this more as it occurs, is that people are expecting a decent correction in the beginning of 2026. Um, even Tom Lee is coming out here talking about some uncertainty in the beginning of 2026. He calls for a price target for the S&P 500 at 7,700 by the end of 2026, but says that it could feel like a bare market before the year ends strong. He actually came out with a podcast with I don't know who it was, but he was on a podcast that's about an hour long. You know, if you research, I encourage you guys to listen to it cuz it's very interesting on what his remarks is and his whole kind of sentiment, his whole type of persona kind of changes a little bit. Not what we're typically relatively used to uh for more of a type of, you know, strongly bullish thesis. cuz that's what we're more used to. Uh calling for possibly a 10 to 15, even a 20% draw down followed by a strong rally back up to that 7,700. Now, I guess we'll see what happens. Uh he still does of course have these crazy price targets for the end of the year on cryptocurrency calling, you know, saying here thinking that Bitcoin is going to double over the next uh 50 days at 200,000. That would be quite incredible. Uh especially, you know, we've seen his calls for Ethereum. these year-end targets, you know, were coming up here uh in just the last few short weeks. If they do come true, I think you would be a legend. However, I think a lot of people are just getting skeptical. And I'm personally, I'm getting a little more skeptical myself just because we're not seeing it. However, I think that's when some of the biggest moves do happen. So, uh we'll see see what happens. Uh basically, we don't know. We'll let the market decide for itself. But this whole narrative of a pullback in 2026 in the beginning and then a push to around the 7700 a lot of people are kind of starting to agree with that. Personally could be a decent move. Uh however when the market all expects one thing typically we have a reversal. So I guess we'll see what happens. uh he calls it here this White House put uh put tailwinds and with quantitative tightening ending uh talking about some of the big indicators that could help with the reversal if we do see a profit taking cascade that continues. Um you know I'm just going to continue in terms of a long-term portfolio just dollar cost averaging because you know we'll see what the market price is in uh maybe holding more cash reserves for get you know accumulating at a lower dip if we do to get that you know 10 to 15% draw down. Uh in the short term, I'm still uh you know, in the short-term portfolio, still bullish towards the end of the year. I think we can have another pop. People predicting for a euphoric type of rise. My gut feeling is that's where it's sitting at right now. We'll see what happens, especially with crypto here that it's just not catching a bid. We see uh Bitcoin still at about 90,000. Uh we see this kind of selloff here. And it's just kind of hanging out here. Uh down still about 8% over the last month, hanging out at about 90,000. And that's the same thing with Ethereum here hanging out about 3100. You know, how does that relate to BMR? BMR currently at 3465. We saw, you know, that nice run for BMR that bottom out here at 24, popped up here to about 42. Now we see back here at 34. This is kind of an interesting area. BMR has a good amount of support also at the 30s. So, nonetheless, you know, Tomley is still buying a lot of Ethereum. You can see right here another 46 million worth trying to accumulate to that 5% of um that alchemy of 5% in terms of the power of numbers before staking is also going to begin. The amount of revenue it's going to be coming into staking uh I think is also kind of I would say not priced into BMR uh we're kind of underplaying that. I think it's a little underwhelming in terms of the data center stocks. Let's talk about that. I like the data center stock still there is more room for draw down. The thing is, you know, IN is at this strong support level right here, right at the 40s. Kind of a triple bottom right here. Uh, we need some volume to come back in for INE, I think, to see a little more bullish price action. Uh, but you're seeing things like Cipher right here at 17. Corweave, which has, you know, a lot of controversy behind it at 78. I mean, even NEA is down here, is down at 87. So, you know, this was up here at 140 not that long ago. Uh so this shows you that the amount of draw down that we've had in some of these stocks. A lot of frothiness has already been taken out. So it's just depending you know what's going to be a possible reversal into the end of the year. Um but shortterm I'm still bullish. Long-term also still bullish on these AI data. I've seen down in the comments you know you talked about I ran and you know my long-term thesis on the whole AI played is still bullish. However, uh you know, I could see and align with some of the opinions that we're seeing with a pullback in the beginning of 2026 and preparing for that if we're seeing a lot of the indicators that point towards that. But I guess we'll see what happens. Peace out. Take care and I'll catch you guys later."
    }
]