[
    {
        "video_id": "PZjwB0_VL7Q",
        "title": "Palantir Stock DROPS Below Key Support As Market Selloff Accelerates!",
        "published_at": "2026-01-21T04:23:20Z",
        "sort_date": "2026-01-21",
        "url": "https://www.youtube.com/watch?v=PZjwB0_VL7Q",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope you guys are at least having a somewhat decent day since the S&P 500 had its biggest draw down since October 10th if you guys remember that. That's about 3 months ago. It's crazy how long, you know, it doesn't seem that crazy long ago, but it's already been 3 months. Dang, time goes pretty quick. Uh, but nonetheless, what you're seeing here is a lot of selling pressure, especially out of the M 7, which is a big reason why we're seeing uh the S&P 500 index that gets dragged down. One thing that's a little bit different here, we're seeing some of the more high beta names that are still actually relatively resilient. Um, and could this be because they literally just went through the 50% draw down uh since we saw the last breakdown of a lot of these names. Uh, in terms of Palanteer, we'll also be covering that it's at a very critical support level and if it doesn't hold, that's where we could possibly see a further breakdown depending on the macroeconomic situation cuz I think this is having a big influence on a lot of these names. So, if you're a new or returning viewer, hit the like button and subscribe for daily videos. Let's try to hit 30K. I pop it up on the screen right here. Palanteer is currently at 169. Now, in terms of the market open, we did see a little bit of resiliency. I talked about this yesterday, and this is because uh over the time period, the last 3 to 4 months, Palanteer has had a large, you know, amount of basing between the 170 and the 184. We've seen a lot of consolidation between here. This has been a good area for Palanteer to basically hold the base. Uh at that 170 is where you do have a critical support because if that breaks down, that's where you could see a quick draw down I think here to the 150s. Uh in terms of the resiliency though, what we saw was that Palenterer once the market opened up, it quickly kind of reclaimed that 170 support at 172 here. However, that move kind of got faded and this kind of happened with a lot of the individual names we'll be talking about here in a few moments. Currently, it's at 16894. It's up about 25 quarter percent uh in the overnight session right now. Futures actually don't look quite bad, which has me typically kind of bullish that a lot of traders are they anticipating a possible type of deescalation or a taco type trade that could play out here. Um however, we just don't know with Trump what kind of moves could be coming. Nonetheless though, Palanteer if it doesn't hold this level like I said in the short term I could see a draw down bound down to the 150s just due to kind of the valuation and criticism that holds behind it. However, if things look all right, I think this goes right back into the middle of the 170s. That is like a magnet for this thing. Uh Palanteer right here, you can see the CEO big news for it. The company tells the company um right here uh through Reuters that they signed a multi-year deal with Hyundai worth hundreds of millions of dollars, deepening its push into Korea. So still continuing to expand of course it's different type of niches that Palanteer is getting involved in in terms of enterprise and you can see right here Alex Karp also on the media talking a commercial lessons of AI saying that what's valuable is doing something that no other enterprise in the world can do basically saying Palunteer doesn't really have any competitors pairing a trial knowledge uh with efficiencies that no one else has. So, Palanteer has efficiencies nobody else has and basically pairing that with uh something no other enterprises can do and that's how you see Palunteer is really a market leader kind of in the AI software solutions segment in terms of the general market. Let's talk about that. What we're seeing, why we saw the selloff here, especially with the S&P 500. Now, it's down about 2% on the day below 6,800. That's is this is an important area. There's been a lot of support at that 6,800. If we lose that, if that's not reclaimed, uh we could see a further breakdown into the mid6700s here, possibly even touching the 66s. We'll see what happens. Uh but in terms of the market itself, all make sevens are down about 3%. So like I said, we had a nice rotation. Uh right now you got fear and greed index that's almost pushing into fear, which means we could still definitely have a further draw down if we're still basically right above fear right now at neutral. uh in terms of why we're seeing this type of uncertainty is because of the escalations that continue to increase with Greenland ter greenland tariff threats ahead of the scheduled appearance in Davos on Wednesday. Uh in terms of that you also have the uncertainty with what's going to be happening with the whole tariff ruling with the Supreme Court and you also seeing a spike in US Treasury yields. On top of that, he threatened today to impose 200% tariffs on French wines and champagne after the um president right here reportedly snubbed a seat on Trump's board of peace on Gaza. So you can see here Trump announced that eight NATO members will face escalating levies that we saw. The tariffs are going to start at 10% and rise at 21 25%. You also see here this Danish pension here is starting to exit their treasuries and US assets right here exiting a roughly $100 million position. So this is where you're starting to see these two different entities that are really starting to butt heads. Uh so not a major pullback yet. However, I think there is a possibility that we do have more negative to go. Uh in terms of the long-term portfolio, I'll probably still just keep continuing to buy on these big red days. I mean, I'll take a minus 2% day. Uh the thing is though, futures are actually being relatively resilient. Uh we see right here up about a quarter% at 25 basis points. SPY is currently at 679. Uh so hopefully all the dip buyers don't step in in the um after hours, the overnight session in the pre-market right here. [snorts] Uh but you see US 500 right now is at 6817. So at 68's kind of already been reclaimed. The market's probably going to open up around there. We'll see what happens. Uh we do have a lot more earnings that come out today. Uh however, Netflix shares actually slid in the after hours trading after the streaming giant here posted a narrow fourth quarter earnings beat. So the market just wasn't as happy with Netflix earnings even though they had a narrow beat. Uh we do have more big ones like Johnson and Johnson, Travelers, etc. reporting tomorrow. Uh so this is where the market sits. Now let's talk about some of the individual high beta names that are on my radar for the long term. The big themes for 2026 starting with Agentic AI, Zeta right here, Zeta only comes down about 1.2%. And in the overnight session right here is up 2.2%. So we see a decent amount of support. Zeda actually dropped down here into the 19s and you saw an immense amount of buying pressure that came in. I do like that in terms of resiliency during a draw down here that Zetta is not doing nearly as bad as the broader market. You see PATH that's kind of doing the same thing. And Path actually has a green day today at 1439 up 21 basis points. And you see that continuation in the overnight session just slightly right here. So Zetta and Path, I like these for long-term themes for 2026. And also talking about that, what about the data center names? Currently, I like Cipher. And Cipher is being relatively resilient at 1812 right here. Not doing horribly with what we've seen in terms of some of the other names that have experienced more draw downs. And you have IN here that's getting to a specifically kind of interesting area. [snorts] I miss this kind of last move on IN. If this opportunity presents itself to get back here into possibly the mid-40s, that's where I'll be more attracted at looking at its current price and trading and you know type of zones and behavior. Uh in terms of these names, like I said, pretty resilient. You even see NASA here drops below 100 again currently at 99. and Nebius Lakes 100 area. So, we'll see what happens. Uh, but nonetheless, the story kind of continues to develop that a lot of these names have been relatively resilient. And are we not possibly going to see a decent amount of draw down? Who knows? Because, you know, a lot of these names, like I said, experience a strong draw down that we saw uh during the last breakdown. A lot of these individual names even have hooded right here at 105. So, we'll see what happens. But these are possible moves that could play out to be well if the market does show more kind of bullishness behind it uh here in the to the short term and hopefully into the long term once this kind of deescalates and this uncertainty gets behind us. And toggling over here, what are we seeing? Oh, Ethereum below 3,000 again. You got Bitcoin under 90,000 again. I literally talked about this yesterday is that Bitcoin's not doing anything right now. Uh we had this move up to 97 and this thing is already back here to um it even dipped down to 87,000 for a little bit. Currently at 89. Same thing with Ethereum. It loses its 3,000. Currently at 2978 trying to reclaim that dip down here to basically 2900. What does that mean for the BMR holders? Oh no. BMR right here is currently at 2829. Now, ladies and gentlemen, hold your horses because in terms of BMR, if this gets down here into the 25s, that's where I could personally be looking at a possible entry depending on how things move. This is because we have Tom Lee that is still continuing to stake, accumulate Ethereum, and it's getting even closer to that 5% number at a rapid pace. I don't know if I 100% agree with its recent management decisions and the shareholder meeting stuff about you know the investment in Beast uh industries with Mr. Beast and then you also have of course the um developing of the app and stuff like that. So on top of that, you know, in terms of where this is lying at right now below 30 at 2830, I don't know how greedy I can get in terms of a dip, but 27 even at 26. We'll see what happens if we do have further draw down. That's where personally I might be looking at BMR with more of an attractive type of entry. Other than that, that's really all that I have for you. I guess everybody just stay safe safe out there especially during these extreme times of volatility where we don't know what type of headline can be dropped at any moment that could cause these markets to swing uh by just Google's amounts of money. So, peace out. Take care and I'll catch you guys later."
    }
]