[
    {
        "video_id": "gmrUiPgM3ok",
        "title": "Bitcoin struggling. Rolex still ticking 😀 #bitcoin #crypto #markets",
        "published_at": "2026-01-21T20:04:13Z",
        "sort_date": "2026-01-21",
        "url": "https://www.youtube.com/watch?v=gmrUiPgM3ok",
        "transcript": "If you have Rolex Patek lead high-end watch market rebound as Bitcoin struggles. Okay, there you go. There you go. That's why we have this thing right here as an as a hedge in case everything goes to uh to toilet. At least there's something at least there's something. And again, people want hard asset, hard asset, gold, silver. Now again, Bitcoin should be hard asset and it is hard asset, but it's not traded as hard asset. The way it is now is not traded. If it uh shifts the way it trades, you know, we see massive pump above 50 week is going to be"
    },
    {
        "video_id": "nEwIXEOuWzE",
        "title": "Was this the worst thing Denmark could say to Trump during negotiations?#politics #geopolitics #news",
        "published_at": "2026-01-21T18:02:31Z",
        "sort_date": "2026-01-21",
        "url": "https://www.youtube.com/watch?v=nEwIXEOuWzE",
        "transcript": "they have some confrontation between [clears throat] Europe and America. Uh Denmark, they don't like that that Greenland is kind of getting uh stolen or or purchased or blackmailed or something else. So listen to this. This is from Denmark. What they're saying to Trump, >> let me put this in words you might understand. Mr. President, off. [laughter] Trump will not like it, guys."
    },
    {
        "video_id": "qyW1LkoOLKg",
        "title": "BITCOIN: URGENT URGENT URGEN!!!!!!!! 🚨🚨🚨",
        "published_at": "2026-01-21T09:53:23Z",
        "sort_date": "2026-01-21",
        "url": "https://www.youtube.com/watch?v=qyW1LkoOLKg",
        "transcript": "Oh yes. Oh yes. Oh yes. Oh yes. Guys, welcome to yet another episode. And as you can see right now, Bitcoin is going down below 90K. This is a big deal because Bitcoin has been holding above 90. We've even been trying. We've been trying to go to 94, 95 here all the way to 97 Bitcoin was running. But unfortunately, Bitcoin is a chicken with clipped wings currently. Okay. In a bare trend, Bitcoin is kind of like chicken. It's flapping. Flap flap flap flap. What happens? It cannot fly. It cannot fly. And then boop, comes back down. Now, at some point, it's still possible that we go to the 50 moving average. But you do see the weakness here. And that's why I really want to ensure that you understand the emergency here because so many people are still in La La Land. They're in La La Land, you know, Vshape recovery. The some kind of V what Vshape? Some kind of Vshape recovery. But what we have to do is to look the truth. look the truth in the eye and say listen we need to be prepared for the coming home to papa coming home to papa which is at the 200 week moving average we have to be fully fully fully prepared and for us it's not a big issue I mean we've been preparing for it since forever I mean we've been on top of things since October 8th since uh really the fake alltime high that Bitcoin did when we started to de risk on October 8th but maybe it's still la land it's still la land still maybe maybe this maybe that maybe ISM is going to pump us Maybe maybe but listen anything can happen. Maybe we'll pump the signal to get back in in 2026 and to go heavy is going to be if we go above the 50 book moving average heavily heavily with size or if we go to 200 week I mean it's super simple. So for us the plan is simple for us it's uh really really what we've been expecting. I mean just imagine last few days what has happened with Greenland with Trump. I mean we're going to discuss a bit of that but there's been volatility. Bitcoin has been pumping to 97 then Trump green the conflict with the U a lot a lot of volatility in people's brains emotionally but also on the chart if you try to time all of this it's been crazy meanwhile meanwhile if you follow the mechanical rules you follow the money line it's I mean it's clear as day it's clear as day and uh what we've been saying is is basically coming to reality now uh on the bullish flip side Tom Lee is buying 110 million worth of ETH it's a little it's not a lot it's very little. It's kind of like this, you know. It's uh Yeah, it's it's not it's very little. Uh now look here, you have Michael Seller buying two billion of Bitcoin. That's bigger, but also I mean at this point he's like the only buyer. Okay, he's he's the only buyer now. So let's see if it's it's going to help. I think the overall market Wall Street has to come back for now. Wall Street, where is Wall Street? If we look at the ETF inflow outflow currently, they they're they're outflowing. So yesterday was a bit of outflow. 479 million in outflow yesterday from uh from the wall street. So guys uh super simple just as a reminder in terms of our plan here Bitcoin is super super fantastic price it's going to be very very nice or here bulls are back above 50 week is also time to uh to change towards bullishness for now it's raining we have umbrella on it's fantastic fantastic and also what's happening now is a continued pump in the precious metals we've been speaking about precious metals for quite some time and we also I mean I also told you last week the fact that precious metals are pumping a lot doesn't mean that it's time to sell. Absolutely not. Something that pumps in a parabola can still keep pumping. And you see gold is 76% since weekly flip one year ago. Silver is 175% gain since the weekly flip 7 months ago on the money line. Then you have platinum 143% since 8 months ago when it flipped. And they just keep going. I mean it is quite insane. Obviously it has to do with the fact that the geopolitical landscape is getting a bit spicy. But here we see weekly candles. I mean another week, another big fat candle for gold. It's soon $5,000 for gold is going to be magnificent. Likely there's going to be a bit of resistance here at 5k because it's a round number and psychologically it just feels a bit expensive for people when we go to a new round number. So potentially going to be some profit taking here. But that's fine. I mean again when you have a parabola and it goes vertical it's not a reason to sell because uh like we've been discussing you have a parabola like this then a bit of consolidation another parabola a bit of consolidation another par so in a in a parabola you can have consolidation and then it can continue at some point it will stop we're going to see when the bare trend starts but uh gold like a rocket like a rocket then silver let's see silver silver silver also like a rocket another week another pump and here is going to go to 100 and uh yeah 100 likely is also going to be a bit of resistance because it's a big fat round number. People don't really see round number as cheap. So when it's 100, they maybe start taking a bit of profit. But it could just be like here, you know, we have a few weeks of sideways and then it uh and then it continues. So what's happening now in the world is directly affecting the precious metals pricing with Trump and everything. We're going to be discussing that. It's not really affecting crypto prices yet. doesn't mean that it will never affect it but we need to trade the market we have not the market we want I love the saying from uh from Ben he's saying treat the market you have not the it's correct it's correct that's why we have the saying here of 360 you got to be 360 investor whatever pumps you need to be part of of bullish trend not just huddle down to zero and by the way if you want free newsletter sign up using the link below we sent out the first newsletter yesterday it's super short like super to the point what's happening to Bitcoin what's what is likely going to happen next. And uh I mean it's literally you can read it in like 20 seconds. It's like a daily pill. You take a daily pill very very nice. You you understand what the market is doing. Let me know if you got it yesterday. If you signed up, if you got it yesterday, it was super nice, super short. We have crazy open race. I mean that's when I know it's good because the open rates in in the email are crazy. People click click click click click click click as soon as possible was happening. So if you also want go sign up in the link below fully free bullmania newsletter. So guys, let's discuss the the events. Holy macaron, we have some confrontation here. We have some confrontation between Europe and America. Uh Denmark, they don't like that that Greenland is kind of getting uh stolen or or purchased or blackmailed or something else. So listen to this. This is from Denmark. What they're saying to Trump. >> Thank you. Let me put this in words you might understand. Mr. President, [ __ ] off. Trump will not like it, guys. This will not help the negotiation. This will not help them. You have also um Macron. Macron had glasses on. I was I asked a question on Twitter. Why? Why he has glasses on? uh yeah you you you can check if this is the reason where's the reason but he was also saying that you know we need to take a distance we need to go to China he said that we need to go to China uh and that's I don't think that's going to be taken well either but uh you have escalation basically between EU and US big fat escalation so Macron came out saying that hey we're going to China >> look here >> but what we need is more Chinese foreign diet investment in Europe in some key sectors to contribute to our growth to transfer some some technologies and not just to export towards Europe some devices or produces or products which sometimes don't have the same standards or are more are much more subsidized are the one being produced in Europe. So he he he's talking about the fact listen we need to produce stuff trade with China not only buy from China also sell to China develop new trade routes and and so on so forth and you know the only guy who is really supporting Trump at this point guys it is Bellarus Bellarussian dictator Lucas Shenko has now signed the document on Bellarus assession to Trump's board of peace guys listen this would not be in my bingo card for 2026 that you have alliance between the US and Bellarus. We're best friends. We're now the best friends. Best friends. Denmark is is telling him, \"F you.\" Norway. Norway did not give the Nobel Prize. Freaking Norway. Where is it? Where is it? He did not get the Nobel Prize from Norway. Which controls? Who control the Nobel Prize? Listen to this. told Norway's prime minister that you not winning the Nobel Peace Prize made you feel less obligated to think purely of peace. >> Well, I lost a lot of respect for Norway and I believe and I believe very strongly that Norway controls the Nobel Prize. >> But you have to understand I settled eight wars. I've had uh every one of those wars, every participant wrote I didn't ask them to do it. They sent in strong recommend, you know, they make recommendations for that. But I settled eight wars. No president's probably ever settled one war. I don't know. Think of it. I did eight. The reason I do it is because it's easy for me to do. And I didn't do it for a Nobel Prize. I did it because I'm saving a lot of lives. I'm trying to settle the final one. I'm trying to do Russia Ukraine. Hey guys, it's crazy. So, let's see how that partnership goes. But the conclusion out of all of this is that markets of course don't like uncertainty. It's just like in 2020 when was 2022 when Russia Ukraine started Bitcoin did not like it. Uh now what's happening with uh everything Greenland? By the way, this is another one which was quite interesting. Listen to this. >> Oops. Sorry. Sorry. Sorry. Sorry. Sorry. Here. >> How far are you willing to go to acquire Greenland? >> You'll find out. >> Guys, don't like it. Morgans don't like it. Gold and silver, they love it. Gold and silver love it. Markets don't like it. And unfortunately, right now, Bitcoin is trading more like stocks. Uh less than than like gold and silver, more like stocks, but also a bit weaker than stocks because it is in a bare trend. And again, it's not like that forever. Uh in most bull markets, as you know, Bitcoin is outperforming everything. But again, we trade the market we have, not the market we want. And that's the market we currently have in front of us that we need to uh deal with. Uh now, guys, moving on to other stuff. Oh yeah, by the way, another thing I need to show you this where Bessant is saying that he's not afraid of anything that Europe EU could do when it comes to selling US debt or somehow else re retaliating against the US. Listen to this. Just to follow on that, so you do not believe that the EU or the UK have any retaliatory financial instruments or measures in their bag that the United States should be worried about? >> No. Guys, isn't isn't it crazy? Isn't it crazy what's happening now with the with the US and the EU? It's fascinating, man. It's fascinating. It's fascinating. uh only Barus is supporting us in this very difficult time because you know the historic historic partnership between US and Barus the historic history that the two nations and what I loved also is that there's going to be basically Kazakhstan, Albania, Bellaris and America who are going to be working together for peace in the world. Isn't that crazy? Look here. Uh currently this board of peace consists of United States, Bellarus, Kazakhstan, Albania and Usuzbek is man what a party that that's the party I want to be at. That's the celebration of peace I want to be at. I would never imagine that the two brotherly nations Bellarus and the US would go hand in hand for world peace. Meanwhile, France attacking us. Greenland don't want to go to US. Norway didn't give the Nobel Prize to US. UK doesn't support US. Crazy. Look here. Look here. EU. EU attacking attacking us. Look at this. And the decision to delink the US dollar from gold. In an instant, the foundations of the Bretonwood system and the entire global economic order set up after the war effectively collapsed. But it also had two major effects. It inadvertently created the conditions for what would become a truly global order. And it provided a sharp lesson for Europe and on the need to strengthen its economic and political power. It was a warning to reduce our dependencies in this case on a foreign currency. The world may be very different today without any question. But I believe the lesson is very much the same. That geopolitical shocks can and must serve as an opportunity for Europe. And in my view, the seismic change we are going through today is an opportunity in fact a necessity to build a new form of Europe. >> Yeah. Yeah, I mean listen actually when it comes to Europe if they play their cards right they may be coming ahead here at the at the other side. Why is it so? Because as you know Europe versus US they have been losing they have been losing GDP. I mean Europe has not been growing a lot. They haven't been growing at all basically. I mean it's been super slow growth. So now that there's a bit of you know shake shakeoo shakeroo around the the table you know shaking the pan you let's say you were a meatball that was on the cold side of the pan. Now sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh sh shaking the pan. Now maybe you're a meatball, you you go to the warm side of the pan. If you have an uneven heater sometimes, you let me know if you had it. I sometimes maybe I need to replace my stove, but you know, sometimes I put, you know, half of the pan is not really the same as the other half. So uh listen, it could happen. They they also announced that they will now do make it easier to do company formation and all kinds of stuff. Let me actually do EU Inc. They they now launch, you know, com if you're an entrepreneur, come here. Here, here. EU Inc. is is announced. Let me play you here. So listen to this. Do you hear? You don't hear. >> Aim is to create a new truly European company structure. We call it EU Inc. We live in an age where >> Yeah, I mean then she explains more, but you know, they see some opportunity here. They see some opportunity. Maybe they're going to come ahead. Who the hell knows? Let's see. But one thing is for certain, man, is it's going to be it's going to be spicy here. Uh it's going to be spicy like hell. Precious metals love it. Bitcoin theoretically should love it, but not for right now. Above the week moving average is the signal for us to to get back into Bitcoin or at the 200E moving average. Now uh look look at this. Uh Scott Bessant is saying comply with the US. Don't escalate against us. Listen, >> four years in, the Europeans are still financing the war against themselves. >> All right, let's talk about >> But but Joe, what what I do want to say is same thing that I said after Liberation Day on April 2nd, everyone take a deep breath. Do not escalate. Do not escalate. And President Trump has a strategy here. Hear him out and then everything will be fine. when four years. >> Let's see. Let's see. Let's see. If you are in the US, I don't know what you think about that. I mean, it's definitely a new reality for the US. You know, before it was US, UK, France, now it is US, Bellarus, Albania, and Kazakhstan. I think it's going to be great. I mean, at least Bellarus and and Kazakhstan are dating upward. Okay. So, I mean, I think it's quite interesting. quite interesting proposition you know US Barus Kazak and then you know UK like France like get out they're not invited they're not invited this uh you know it's some developing third world countries big shout out guys welcome everyone welcome everyone who is watching live we have a lot of news a lot of discussion still how are you doing big shout out to DAB who is time stamping us it is uh Wednesday man time flies time flies time flies as always uh newsletter. I already told you about newsletter and then also check bullmania.com/partners exchanges I use. So on Pioneex for example you can copy my bots you can uh trade US stocks actually there's a competition now trading US stocks then buy bits you can trade US stocks gold you want gold you can do it on buy by buy bit or pionex easily easily easily buy bit un next weeks they all have US stocks and gold and bitcoin and crypto and you can go with leverage go long go short you get nice signup bonus and all of that so anyway go click as soon as possible you get signup bonus you get avenues venues to trade 360, meaning crypto, gold, precious metal, stock. You support the channel and you get my sign up bonus if I didn't mention that, which I think I did. Now, guys, let's check a bit of stuff here. When it comes to number one, the ghost of Christmas past, we've been speaking about it a bit, but let me check it again. So, Bitcoin yearly performance chart midterm year. As you can see, we're kind of aligned here. We're kind of just like all L2s are ETH aligned. Here we have uh yearly performance, midterm year aligned. So yeah, I mean it's I don't know guys. Some people say you cannot compare previous years. I don't know guys. I don't know guys. I mean since day one this year we've been looking at it and I mean this far so far so good. Basically we're on the average. The white line here is on the average. So I I don't know what people are complaining about. I think it's this far spot on. Bang on. Bang on the money. Is that how you say it? Bang on the money. Uh let me know how you say it because now we Russians and Americans, we got to work closer together. You got to teach me more of your more of your sayings because now we're best brothers through history. So, uh let's see. Uh here is since hing bum. Very very nice. Um what else? Uh global liquidity was happening here. It doesn't update too often. Yeah, we need another data point here. Uh let's see what is happening to uh ETFs. ETFs we already mentioned. Let's check hyperlquid. May have to reload. Check. Check. Check. Loading. Loading. Loading. Anyway, we're going to get back to that. Uh, let's check the bubbles. Someone said there's must be a bug in the crypto bubbles. Is they all look like nightmare mode? Well, I mean, many alans are down. Many are down. It's true. It's true. Uh, XMR down a lot, but also has been pumping. So, it could be just one of these, you know, reloadation periods to just reset the parabola. Let's actually check that if it's like full collapse or not yet. Well, I mean, listen guys, if if it closes weak like this, you have to be super careful because it is in bare trend. Now, on the weekly, now the week is not closed. If it pumps back above the the flip, then it's still bull trend. It's going to flip back to bull. But if the week closes like this below 520, get out. Get out. It's time to get out. It was oh my god. Like, it's a very ugly chart. I don't like the week. The weeks I don't like, guys. I mean, you remember we said short all of these altcoins pumpkin pumps, they're for short-term tra trading. They're not for long term. Please, please confirm that you heard that because sometimes I'm telling you things, guys. I I don't I don't understand like do you remember stuff? Please confirm that you you remember that. During the last like few weeks, I've been telling you you can trade the old coins that are pumping but short-term because Bitcoin is in the in is in bare trend. And I mean it's kind of example here because they are working against gravity. They are they are you can still make money. You can still trade leverage. I mean they go up let's say 20% with leverage is a lot. So it's still opportunity but uh you cannot be okay now I buy now I relax I go on vacation for two three weeks I come back I check it back. Uh yeah I mean you understand. So please keep it in mind. Keep it in mind always. Uh now uh let's check more news guys. We have quite a lot of news. We have macaroni. He's saying we do not prefer we prefer respect to bullies. Let's listen. Let's listen. I mean it's it's a kind of the zeitgeist. Uh we have to check the zeitgeist from all perspectives. Listen to this. >> But we do prefer respect to bullies. We do prefer science to plotism. And we do prefer rule of law to brutality. We have a place where rule of law and predictability is still the rule of the game. And my guess is that it is large. It's interesting that the kind of the you know the moderator like the boss here is laring from Black Rockck this is you know some student giving his homework and you see the teacher is right here right here he decides the what's going to happen here okay he has the the monies okay the trillions and the trillions and the trillions this guy has big problem his big problem with that his big problem with national I mean look at France just Google France IMF bailout France debt crisis they they they're in a bad spot guys they have the highest taxes in the world. They have a super high crime like have some of the highest. Look at the wrench attacks in France. Like it's crazy. It's crazy. I don't know why you pay so much. Like what do you get back? You get back nothing. Nothing. ly underpriced by the market. having a place like Europe which sometimes is too slow for sure and is to be reformed for sure but which is predictable loyal and when where you know that the rule of the game is just the rule of law it's a good place and here the >> I mean I have to give it to him there is opportunity for Europe now overall is to basically listen Rampolino. He's crazy. He's crazy, man. Maybe he's right. Maybe it is art of the deal. But you got to admit, it's a bit crazy. It's a bit crazy. It's a bit shocking for business, for long-term investment, for uh capital placement. It's not too great, man. It's not too great when it's when it is up and down like that. You need stability. I mean, capital love stability. Money likes stability. They likes quiet. And look here. Larry think is sitting right here listening and uh it's for a reason. I mean he's the one that is deciding where monies are are going to go. So yeah, let's see guys. Let's see. It's quite fascinating. Quite fascinating. Uh now uh let's see what Brian Armstrong is saying about stocks going 247 because it's kind of what we talked about yesterday that actually it may be good for crypto that they have 24/7 trading in stocks. Listen to this. If everybody can do the same thing, >> what happens in the end? >> Um, customers win. >> New York Stock Exchange uh just announced yesterday a new platform that I imagine will compete with you to some degree, a new tokenized platform. Everybody seems to be introducing all sorts of programs that frankly look a lot like things that Coinbase does. And I wonder just what you think the whole industry looks like, you know, a year or two or three from now in terms of what you're doing relative to what everyone's doing. And by the way, at the same time that you're trying to get into everybody else's business. >> Yeah. Well, I mean, I was thrilled to see that. I think New York Stock Exchange announcing their interest in tokenized equities is just one more data point of like crypto is updating the financial system and we want everyone to be able to do that and make make our capital markets more efficient. >> But does it take a moat away from everybody's business? If if everybody can do the same thing, >> what happens in the end? >> Um, customers win with competition. I mean, we we we shouldn't have policies being created in the United States that um favor one set of companies over another. There should be clear rules of what's allowed, what's not, and then everyone competes. That's how the customer benefit. I mean, basically saying, listen, we're going to compete with with the stocks. Okay? And I think it's good. I mean, like also he's saying, Coinbase has very high fee. So, you know, you trade on Coinbase, man, it's you have a noob tax. You have a bit of dumb dumb tax. I mean, it is like that. Sorry, it is like that. I've been there also. Uh, you know, I'm just checking how much in fee I paid. After a while, it's like, man, I'm a dumb dumb. I'm a what am I doing? They they know that the newbie they doesn't look at fee. Noob. Noob doesn't look at fee. And then noob wake wakes up and he he wonders where's the money. But the money is gone. The money is in the coin coinbased stock chart. So this is why I mean he he should get some fire under his buttocks because why uh a lot of his compet competitors in shroud fight they have quite low fees nowadays man they have quite low fee versus coinbase coinbase currently is not comp competitive so they he will have to cut big time big time the fee so he's correct in that regard competition competition competition customer will win in at the end but he will have to reconsider a bit of stuff next if you have Rolex Patek lead high-end watch market rebound as Bitcoin struggles. Okay, there you go. There you go. That's why we have this thing right here as an as a hedge in case everything goes to uh to toilet. At least there's something at least there's something. And again, people want hard asset, hard asset, gold, silver. Now again, Bitcoin should be hard asset and it is hard asset, but it's not traded as hard asset. The way it is now is not traded. If it uh shifts the way it trades, you know, we see massive pump above 50 week is going to be different. So business is not going to go to a million bucks without us noticing that the returns bullish. But uh just I mean just a fact. It's not currently it's not. It it will be at some point. That's why uh as you know I have 30% in Bitcoin anyway even though it's bearish because I do believe in Bitcoin. I'm a Bitcoin believer. Longterm I think it's going to do fantastic. It's going to go to a million bucks. But uh I'm not going to go down in uh like you know like people do with all coins and in in bare market like they go down a lot. Solana went from $250 to $8 last bare market. So just keep it in mind. But Bitcoin eventually is going to trade as a hard asset. When who the hell knows now it is trading more as a stock but even weaker because it's in a bare trend. So we're going to be keeping an eye on that guys. If you love near soon you're going to have an ETF because Grayscale is going to convert their u near trust into ETF. Let me know if you have some uh some um if we have some near holders here in the in the chat. Make some noise. Probably super wrecked. Uh let's see. Near USD if you have it. Yeah. Well, yeah, man. Not too great. Not too great. Not too great in Bren. Not too great. I mean like you know. Uh okay. Next you have Trump advisor calling for compromises to pass crypto bill. He wants the bill passed but Coinbase doesn't want the bill passed. Cardano don't want the bill passed. Charles Hosen doesn't like the bill. So the bill now is too much uh against crypto. As you know the bill now says that you cannot have stable coin yield and many other things that favor the banks. So the bill actually is very bad for crypto the way it is right now. The only ones in crypto supported are Ripple, but they're kind of banker. They they're half half banker. So, the US Senate crypto market structure bill must be passed quickly while lawmakers still can cut deals to advance it. But it will require concessions, says a top White House crypto advisor. There will be a crypto market structure bill. It's a question of when, when, not if. Um, and assuming a multi- trillion dollar instrument will continue to operate indefinitely without a compensatory framework is a pure fantasy. So, yeah, let's see, guys. Let's see. I mean, Coinbase don't want the bill. Now, they don't want it. Crypto industry doesn't want the bill except Ripple. So, what's the point then? Now, let's see. Let's see what's going to happen there. But it's not I mean, one thing is clear. It's not this, you know, mega bullish catalyst that it was in the beginning. Now, it is um something, you know, it's it's not super bad. It's not super it's a bit slightly bad. Uh next, next next. Um uh so in in terms of bullishness there is uh not that much interest in Bitcoin now overall which is I mean you can argue not too bad not too bad um so when no one cares about an asset it's very very good that's why as soon as it enters bull trend uh very important to buy and if it goes to 200 week average also very important to buy because you look at Google trend like in 2025 no one search for it u I mean you see with the social interest is uh down down down the it was high here around Trump. Okay, Trump uh coin and the Sana alltime high but 2025 down down down down down down down down down down down down down down down down down down down down down no down and we see it also here I mean just doing the social media content you know in the in bull market we have maybe double the viewers we have sometimes triple the viewers so we haven't really had a proper bull maybe since 2021 I mean think thinking back at it uh in terms of viewers and so on so forth now some people say that it's some kind of excuse that we will not go down it's not guys it's it's really not like chart is is telling us where it's going uh but um uh from a long-term perspective, it should be the fact that uh the mainstream will be interested at some point. It can still take years. So that's why I'm telling you it's not a good thing to trade based on because this thing can deviate for years and years and years and it takes just a few weeks for an alan to go from where it is to minus 90%. So it's not helpful from a trading perspective. Next, next we have u oh yeah uh Novagrat is doing a new hedge fund. Uh he's going to do some crypto stuff. Um not too interesting because he's going to long, he's going to go long, he's going to go short. I don't know what's he needs to go to buy bit, guys. Again, if you want to go long, go short. Click booming.com/p partners or exchanges. So you just go to buy bit. So no grass. He's going to do some kind of fun like that, you know, a bit long, a bit short, a bit some equity, some AI. Yeah, that's it. Um let's see. Oh, guys, today I think Trump is going to speak in Davos. Uh, that's likely going to be spicy. Let's see. Likely going to be spicy. So, let's keep an eye what's going to happen there. Now, with Trump, as you know, he could just uh turn everything around and say that now there he has a bunch of deals, but uh I don't know how easy it's going to be for him when the Denmark guy said FU basically. So, let's see. Let's see. Um, Zcash adds a new RAD DNS to improve network reliability. This is for code monkeys, but you can read a bit more here with what Zikesh is doing. So guys, on this note, let's go to Q&A. Big shout out to Dab for timestamping us today. U prepare questions. Prepare questions uh and ask them in the comment section while you are thinking about questions. Number one, go to uh newsletter in the description. Sign up free newsletter. Uh every day I send the a short short summary of what happened today. Uh I mean you you you don't even need to watch a lot of content. Just get the newsletter link below and that's it. It's you can the newsletter is very short like that's the whole point. It's like daily pill it takes you I mean maximum like one minute to read and you know what's happening to Bitcoin, what's happening to all what's going to happen in the future. Boop. That's it. That's it. That's it. Super nice. And then of course if you want to learn about the mechanical rules, get access to the money line, get access to the money scanner, uh get trained how to actually become a profitable, consistently profitable trader, then use the link bullman.com also below. So let's go to Q&A. Check check check check. Um let's see. Oh yeah, some guy asking about Pal, bro. I mean, there's nothing more to say. I I think we said everything uh that that that uh what was supposed to be said. I mean, you you understand everything. It's uh Good luck to you. That's it. That's it. I I think it's pretty clear. Pretty clear. You You have to hope and you have to beg. That's it. Ivan, have you claimed Oh, I have to I have to do the uh SKR SKR. How How much are people guessing? I haven't checked. I actually just loaded the phone. Like, I loaded the battery so I can actually do it. Let's see. I I haven't claimed it. I'll do it after the stream. But do it. Do it. At least so at least you get something for the phone. And then in the bull maybe it does 20x. Fantastic. Do you think we won't see 94 96 again until uh at least next year? We could see. No. No. I mean we could go to 50 moving average still. We could still go here and get rejected here. Um so I mean anything is possible. I'm not saying that this is out of the question that we're not going to go here because last bear we did go there and if you measure the time from the peak to when we got there in the last bear I have this line here in in uh February that would mark the same distance from alltime high to when we touch it. So I mean technically Bitcoin still has a few weeks to derp around and maybe go to these highs. It better start ascend ascending soon. Um but uh from a long-term picture I think that the likelihood of us visiting here just increased because I mean yeah this got sold into so brutally that uh yeah so long term I think we're going to be here and long-term meaning you know in the coming in the coming quarters like during the summer like that I think it makes perfect sense uh but in the short term um you still have the chance to go to the 50we uh moving average which goes like What do you think about the midnight project? Uh, I don't like that Cardano has two coins. See, you you you would be a Cardano buyer. Now you ask me about this Midnight. Uh, that's it. I mean, from a like listen, what everyone cares about is is making money. ADA is not really benefiting from it. from tech perspective maybe it's good like I don't know where are the apps where is the use case where is the volume where is the adoption I mean ask that ask that when it comes to the pumpamentals is not too great because now like it's one of the you know core coins I mean speaking about uh pulse that's like the recipe to get wrecked because when you have one coin everyone buys one chart you have two coins now you know you have to spread now these guys they have a million coins and so Cardano is kind of doing the same. You had just one adder before add this privacy stuff to other why you doing new coin you add it to other add to other no okay so I'm not a fan of double coin triple coin ecosystems guys it's normally bad it's normally not good and from a tech perspective I don't know I haven't seen anything yet maybe it's going to be great like all of the use cases it could be good but it's not u we look at the manice you know bullmania it's bullish in your portfolio So yeah, uh that's that bull market right about to start says lucky look. Let's see. We're going to notice we're not going to miss it. We're going to notice it. We're going to notice it in real time. I wish Bullmania was cheaper. Why so expensive? I think it's very cheap. Super cheap. I mean, imagine learning how to become consistently profitable. It's a skill that you have for life, which means that you can trade any asset, whether it's crypto, whether it's uh stocks, whe I mean anything, and you are consistently profitable. You're not uh part of minus 90% drops in uh uh in uh in markets like when Bitcoin has a bare market. You get access to the tools where literally I mean, look here since the weekly flip. This is since the weekly flip. This is the just the stocks. This is the stocks. So, I don't know. I don't know what you mean. It's expensive. I think it's too cheap, man. It's too cheap. I mean, people can make millions with this kind of stuff. Okay. It's too cheap, man. And you have that for for life. Like, the skills in the education, that's for life. That's for life. Like, how do you put a price on a skill that you can trade any market and you're profitable in any market for the rest of your life? Like, how how do you It's too cheap, man. It's dirt cheap. So yeah, I mean it depends on um uh at the same time depends of course on your budget this and that. Uh it's because it's a it's a premium program. We we don't just allow anyone in either. I mean you need to watch the free training. You have to like you really have to be committed here. So that that's why if you want to join go to bullmay.com watch the free training then you book a strategy call. So you know it's not like buying a chewing gum. You want to buy a chewing gum. It's not buying a chewing gum. You just come you know you buy a chewing gum. a process. It's a transformation. It's transcending the plebrec. It's a Yeah, you see yourself. You see yourself. It's crazy, man. But if if you're just beginning like build up some capital, you know, do some vibe coding or something, you need to have a bit of money like that. That's true. That's true. But you know there is um uh work to earn. You go to job you you get you you work to earn. Okay. Uh so there is in the in the real world outside of internet there's work to earn where you you apply for job you get work and then you earn. Very interesting protocol work to earn. Have you heard that? So yeah I mean if you're at zero you need to do work to earn. Yes. Yes. Um why? Because it's a I mean we put our heart and soul. We have white it's a you know I learned a new word white glove. We're white glove. Have you heard that? White glove. We are turnkey. White glove and turnkey solution. So yeah work work to earn. Boom. Join Bullmania. Bam. Financially freedom. Financial free. You will not learn English from us guys. We're going to financially free financially freedom. Exactly. Exactly. Um, that's it. That's it. That's it. So, anything bullmay.com, watch the free training, do the call. That's it. That's it. That's it. Uh, Ivan, should we buy a physical or online go? I mean, I I would do a bit of both. Do a bit of both. The good thing with physical is that you don't um you don't worry about the price too much. You just have it. It's somewhere there, you pass it to your family and that's it. Like the bad thing with physical is of course if you need to travel, if you're like digital nomad, you're international person, it's not that easy. uh I mean to bring along and to check in and uh figure out how to transport, pay tax, potentially pay tax. But if you are in one location, um you you're fine with having it in one location, then have both. What do you think about stocks and shares on Dusk uh blockchain? I I think stocks and shares on Salana is better. Why? Because there I can use it the phone easily. Dusk, I remember Dusk since 2017, I think. Weren't they a privacy blockchain before? Uh I haven't even seen that they have stocks, but uh yeah, where do you trade them? Because on Slana all of them are Slana ones are in Phantom Dusk. I have I haven't seen too much. Where do you trade them? You have to go to dusk.com or where you find it. Ivan, do you think Aster have future? What do you think Aster have future to hold for five? Bro, no old coin is future to hold for five years. See, and then people ask me, Ivan, is bullmania too expens like when people ask me, do you think like this Chinese coin is is should I hold it good enough to hold for five years? Listen, all coins that are all all old coins go to zero versus Bitcoin long term. So, you can only be bullish on them in a bull trend. In a bull trend. Once they're in a bare trend, you're out. That's it. You're out. That's it. Hold for five years, man. Most coins don't survive five years. Look at coins from last cycle, you know, five years ago, then they're not here. Now, could it be that Astra does well? Maybe. But it's not again, it's about being consistently profitable, not being lucky, you know, that you you you you have 90% chance that it goes to zero, one time 10 times chance that it goes up. Like this that kind of question. It maybe it it is it is fantastic but not for hodddling. It is fantastic to enter when it is in a bull trend now. Oh yeah I mean yeah I I I don't want to blow smoke up your donut. It looks very bad. It's going to go down way way more. Even though it is alltime low, it's still going to go down way more. So only have it. Let's say you want to trade it. You can still trade. You can make a lot of money trading. You can trade when it goes into bull trend on the daily. Here you can you can be bullish. Could be a short uh bull trend like no one knows. But you can trade if you want to trade. This is how you trade. Okay, that's it. But no holding any alcoin. I mean again ask the hexacons. Hexagons, you know the, you know, you always have a kid in the class who is a bit special and is used like a bad example is a hex. Hexagons, they lock up the hex for how many years? 30 years or something. I mean, even locking up for five years would take you to zero, but this guy is going to be locked up for 30. So, yeah. I mean, just ask them. Ask them. Uh, yeah. That's it. That's it. That's that's it. So I mean I I I I want to keep it simple and to to keep it um so that's why you know I don't want to sugar coat too much. Some people are saying that Ivan you're so harsh when you explain because people they lose money because no one told them like no one told them they they hear oh you know have a long-term perspective hodddle I would rather be harsh and brutally honest with you and say how it is put the record straight and for all of you who watch bull.com we have a turnkey solution wide glove approach but you first work work to earn then bullmay.com exactly Why does why the f does mron have glasses? I mean people saying he has issue with the eye. There are different u uh philosophies, different uh schools schools of thought when it comes to this approach. Some people say that he had he had issue with his husband or wife which is Candans is saying his husband he's saying his wife. Uh we will not get into that but there is a bit of a dispute. Isn't there a lawsuit? Didn't they sue Candans? So, I guess we're going to see some discovery material. And um so that's one that he's in some some physical altercation with that person. The other one is that they he did have a bit of fun on the plane. You know which fun? Um with maybe with Schultz, maybe with Stormer, who the hell knows. And then some people are saying he has some medical issue with the eye. Some medical issue, some um nothing big. nothing big. So these three solutions is the ones you have to pick from. Okay. Uh I hope I love the no kumbaya death hodddle vibe. Too bad 99% of people in the space are not down to earth like you. Yeah. Listen, I mean I I I I have found my place where I'm comfortable where you know some people they say they tell you to be bullish because they don't want you to disappointed. They think that you only watch if if if they're bullish. Okay. So I I don't care like the thing is you're not going to forget manually listen I tell how it is. It's only going to be oh I forgot. In fact, and some people actually do stop watching because they they're they're mispositioned. And so, yeah, I mean to to hear every day bad news when it is like this, I understand it may be a bit tough, but I think long term, I mean, they're going to see, man, Ivan was right. It's been many Pulse as well. I mean, Pulse now, many of them is starting to click for them for many years. Man, I was right. I was right. I was right. So, that's going to happen. That's that's going to happen, guys. That's it. Thanks a lot for being here. See you all tomorrow on the channel. Big shout out to Dub for time stamping us today. Uh enjoy your your uh Wednesday, your Wednesday. Time flies. Uh and see you all tomorrow. Smash up the like, subscribe, and have a good good day. Thanks a lot for tuning in. I appreciate all of you. I mean these streams are very fun. Without you tuning in, it would not be fun obviously. So fantastic, guys. Fantastic. Have a good day and goodbye."
    }
]