[
    {
        "video_id": "R5R10Ivm2c8",
        "title": "Bitcoin’s Next KEY MOVE, Huge 2026 Crypto Predictions, Metal Squeeze &amp; More!",
        "published_at": "2025-12-29T14:14:30Z",
        "sort_date": "2025-12-29",
        "url": "https://www.youtube.com/watch?v=R5R10Ivm2c8",
        "transcript": "[music] [music] Silver Steel Spotlight. Bitcoin endures another dull week as shiny metals prove more attractive to investors. In the mix for 26, we dust off the crystal ball to predict some of the stories that could shape the crypto market over the [music] coming year. From trouble for Trump to altcoin action, here's where we think we may be headed. And we'll have the tweets of the week, TA with Lewis, and your final opportunity to [music] participate in our portfolio competition before the big giveaway. This is the Coin Bureau News Live. GM Coin Bureau fam, happy Monday and welcome to the final Coin Bureau News live stream for 2025. My name is Nick Guy. How you doing? >> I am I am pleased to be waving 2025 goodbye. >> I think we can all say that. Yes. It has not turned out as we had hoped. >> You cast your mind back to the end of 2024. Uh all those dreams and aspirations, you know, [laughter] >> it feels like a very long time ago. In part because, well, it was, but it feels longer than that. Yeah. What a year it's been. Um, yeah, I decided to put my most violently colored item of clothing on to to celebrate the fact that we're waving but goodbye to 2025 >> and to satisfy some of those people in the comments who are going to comment on the white shirt. >> Yes, I could. Yeah, I could already hear the knives being sharpened for guys wearing a boring white t-shirt. Again, someone was actually suggesting a poly market on on guy's shirt color. Please do do one of those because then I can >> and you can bet inside a trading [laughter] all the way moving the markets beforehand. You can tell in real time, get a sense of what the crowd thinks about guys is going to be wearing during the stream. Anyways guys, so yes, this is the final live stream for the Coin Bureau live this year and we've got a big one lined up for you. Firstly, we're going to be taking a look at Bitcoin's price over the past week and how the spotlight was stolen by a precious metal, not gold. >> [laughter] >> Yeah, >> gold, but silver. So, we'll be taking a look at that. And we'll also be uh having our try at some of our own coin bureau proprietary predictions for 2026 as it pertains to the crypto markets. You know, those are quite fraught, but hopefully we're going to put try our thing there. And then we'll of course be looking at tweets of the week, TA with Lewis. And on last but not least, this is the final week where you can uh vote for the Coin Bureau portfolio giveaway uh because we're going to be choosing the winner next week. So you guys have to stick around till the end of the stream to participate in that uh vote and see what the portfolio ends up in terms of value at the end of this week or end of next week. That's the when we're going to be giving it away. So your final chance to impact on that portfolio value. >> You've got to be in it to win it, folks. Um, and you also uh you also need to hit the like button as well. If we get to what how many likes are we aiming for today? [laughter] >> 10 12. >> Can we aim for a like and some >> like? >> No, no. I think let's let's aim for a thousand. We'll see what we get in the stream. We'll see how time is going. But there could be some interest in alpha we share around not just uh crypto in our portfolios, but how we thinking about adjusting our portfolio in the new year as it pertains to other assets as well, you know. So, hit those likes to uh and let's track it at that progression bar down below. >> But let's of course start with the Bitcoin price from last week. Now, if you'll recall, cot your mind back Monday, uh strategy, uh true to for well, not true to form because Sailor announced prior to that the he was adding another dot to the green of green to the sailor tracker and that is now a signal for uh stacking more fiat currency as a reserve and they therefore increased their USD reserve to $2.19 billion and this can hopefully help pay for those dividends uh uh to those preferred shareholders Even strategy is stacking cash. >> Even [laughter] even sailor the the one asset that he said he was losing value on that he was he fel feels like that that's the reason he went into Bitcoin. Now he feels like actually in a bare market having some cash is nice and handy. >> Better have a little bit on hand just in case. Yeah. >> Um Bitcoin however just kept on falling. It didn't care that that Sailor was moving into cash. [laughter] The old Ashton Hall there. Um so uh yeah it um it fell below 88 half,000. That was that was getting squeaky bum time. >> Exactly. Yeah. And um at the same time we were actually having Don't talk about altcoin season. This the metal season. The metal season. Gold, silver, copper, and platinum. >> Yeah. >> Industrial metals outperforming your your magic internet money. Who would have thought? Crazy times, man. >> Things that actually have utility. >> There we go. [laughter] There we go. Age old utility. Back to the Byzantine times. Um, US GDP growth did come out on Tuesday. The were the Q3 and they were, you know, gang busters. 4.3% economic growth from July to September. Uh, so that was obviously bullish for the markets. Well, at least the Drafi markets. And the next day, Trump actually came out and made posted the one one of the most bullish uh truth posts ever. So, truth what or truths ever. >> Yeah. So, and I think the main takeaway there was basically he said, \"Look guys, um if the Fed chair doesn't do what I say and agree with me, then um we are then he's not going to be Fed chair.\" So, basically that means he's going to run it hot, rates down, bring out the money printer. Trump is gunning for the Fed chair. >> He's basically saying the quiet part out loud. And and of course 2026 is an important year in US politics because of course it is the midterms. So, there's a lot of the midterms are coming up in November. Um, and there's going to be, well, I I think the consensus view is that Trump is going to want the markets running absolutely hot as hell. >> Screaming hot. Yeah. So, own any assets. Sorry for those people holding fiat, which is >> Don't forget about crypto. Yeah, >> Mr. President, >> cuz you [laughter] that seems to have been forgotten about recently. >> Whatever happened to that Bitcoin strategic reserve? >> Yeah. Yeah, I'm sure I remember something about that. [laughter] Um, Bitcoin wasn't impressed with Trump's bullishness, though. Um it uh it was I mean it was mostly going sideways around 87K on Christmas Eve. It was not in the Christmas spirit at all. Um and that continued on Thursday. Um except we we did see an ever so slight drop on on one exchange. Right. >> Slight. Yeah. Just just down to 24,000. Yeah. [laughter] This was actually to be fair this was a very illquid USD1 pair where Bitcoin collapsed to $24,000. I mean, I wonder if anyone had set a a limit order down there. >> I'll just [laughter] I'll just just on this pair, I'll put a limit order in at 25K just in case. >> Yeah. Um Okay. And then Friday, whilst everyone was nursing a Boxing Day hangover, we had a short-lived rally presumably that was hangover people um cheating it cheating their Christmas money into Bitcoin. >> Yeah. Although um it was a bot. I mean, to be honest, liquidity hunt, scam hunt, whatever you want to call it, >> unfortunately, if you'd been if you'd been optimistic about that rally continuing, Bart showed up to show you who's boss. >> Bart Simpson is becoming one of crypto's latestage main characters. >> He'll show he'll make another appearance in the stream in a bit. Don't worry, guy. >> Great. >> Okay, fantastic. Meanwhile, as we mentioned earlier, silver just silver was off on a run of its own. Um, making new highs all the time. It's crazy. I mean, it looked like this really looks like the signs of a blowoff top and the re and I don't think silver bugs would really appreciate it because it's happened so infrequently. >> The last time was 2011 and then in 1970. So, they don't really have long lot of longevity to be able to make the decision of or to be able to determine has this been a blowoff top or not? And we'll see. It actually has collapsed. Well, not collapsed. It shot up by like another 5% on open this morning and then collapsed 10%. Yeah, it's a it's a difficult one to it's a difficult one to trade, I think. Um, but it's interesting. There's I mean there's a lot of interesting context to this silver rally and stuff because obviously as we've mentioned before, silver is in a kind of unique position and not only does it it does it serve as a sort of store of value, a monetary asset a bit like gold, you know, obviously sort of in a slightly smaller scale, but it's also got a lot of industrial uses as well. And I think Elon Musk has recently or you know in the past 24 hours or so come out and said you know this this silver rally is kind of bad news for manufacturers because silver is found in so many different products. >> Yeah. >> Solar panels and F-35 you know era frames airframes. >> Uh but we actually explained in much greater detail what exactly has been happening in the metals market in our coin bureau inside our coin bureau telegram. So if you guys are not within that telegram right now, you can do so by scanning that QR code over there, we share these daily alpha posts which is exclusively within that telegram channel as well as a lot of different news updates as well, breaking news updates. So go and scan that QR code and get the alpha ASAP. >> Yeah, we've revamped our Telegram channel in the last few weeks and it is way way better now. There is there's a lot of genuinely useful information there. I mean there was before but we've you know we've curated it a bit more efficiently. Okay. So, what about over the weekend and into Monday then? >> So, uh Bitcoin over the week actually unfortunately we did have ETF outflows. So, um we missing the ETF outflows chart. Okay. Seems to be a technical issue there. E I don't know if we're going to show that chart. Probably not. >> It's coming. Okay. >> It's coming. It's coming. >> It's going to hit us any minute now. >> The the the suspense is killing me. these ETF outflows, >> but TLDDR people are selling out of people selling out of spot crypto. >> People wanted to sell out of their Bitcoin holdings to buy some Christmas presents. There we go. Uh the whole week we saw outflows. We did uh have a Sunday pump yesterday e well early morning Dubai time yesterday evening US time. But you know what they say about a Sunday pump >> uh because what that means is you usually could pump or crash you're going to create a CME gap or leave a CME gap. And we in fact did. And yes, guys, I'm bringing up the CME gap yet again. I know. I know. True to form. Going to finish 2025 off with a bang. Looking at a CME gap. Uh this one was between 87.8K and 88K. And actually, it was a really quick Bart a chart. Bart comes back into the picture again. As we went up to 91,000, 19,000, Bart came back, crushed us down, crushed hopes and aspirations for finishing the year on a high. And we actually closed that gap just before the stream started. So there we go. >> Okay. >> Uh I'd like to um update you uh Nick in the comments who's um who's been very good about highlighting this over the last few weeks. Sailor uh Sailor has tweeted again strategy has acquired 1229 BTC for a mere $ 108.8 million. >> Hey man, Sailor is Sailor still stacking. At least he's still stacking. >> So what's to come this week? Well, it's going to be relatively quiet. uh we've it's low liquidity as well. So I'd be careful. Um one thing to note though in the final few days we've got at least two days left and to be able to finish the year in the green and it's not it's looking unfortunately not likely. And the reason that's important is because if we do close in the red this will be the first posth haring year that has closed down i.e. down from a pre from a post hing. For 2024, we had the Haring and right now I think we're at about we need at least about a 6.3 to 65 6.5% rally to close in the green for this year. >> That's going to be one to tell the grandkids, isn't it? I was there in the first ever post year when Bitcoin didn't finish the year. >> We making history, boys. We making history. Not for the right reasons. >> It was a hell of a time. I tell you, it was a hell of a time. >> And that was the last time Bitcoin ever traded above 100K. >> But anyways, no. Um on the weekly chart, it's the sixth weekly close below the 50week moving average. So momentum is unfortunately not on our side. However, I will point out that given that we've closed that gap, we've we swept the liquidity down below. And if you take a look at the liquidity chart, you can actually see and that's why it's important to track these charts, you can kind of see how the market m if the theory goes that how market makers would move prices towards where a lot of liquidity clusters lies. That's potentially stop losses or market orders. And you see they've swept up earlier today and they brought it back down towards the clusters around the CME gap. But now there's uh additional um liquidity above >> just just I mean just look at that crab. [laughter] >> I mean sort of like oh >> Bitcoin shot just doesn't know what's going on man like on a drunk walk home you know. Uh anyways, on the bright side, one thing to note is over on Poly Market, Poly Marketers have uh the chance of Bitcoin versus gold versus the S&P 500 in 2026. They've got their money on Bitcoin outperforming the rest. >> Okay, >> so there we go. That's one thing to look forward to. >> Let's see. >> So, if you guys are bullish for next year and you're looking for a place to trade Bitcoin, we couldn't think of a better place to do it than Tubet, our first brand partner. Now, Tubot is a large international exchange uh and uh they have a solid interface, deep liquidity, uh competitive fees and a super simple onboarding uh process. All you need is an email. You scan that QR code over there. Uh you use an email and you sign up and you can see how it works. See, if you like the interface and then if you want to trade and you deposit something, you'll get up to 90k in trading rewards subject to meeting criteria as well as an immediate VIP level one upgrade which gets you 50% off trading fees for life. Um, so as I say, it's a super simple process. Just your email currently offering our Coin Bureau viewers that uh deal. So scan the QR code link down below. Check out Tubbit. >> Yes, absolutely. Okay. Uh let me give you a quick rundown of how sentiment is going in the comments. Um someone makes a good point here. Uh Eb Blanco 13. We traded SBF Doco Quuan and Alex Majinski for Tom Lee Arthur Hayes and Dave Portoy. I don't know which one is worse. [laughter] >> I think I think that's a little unfair to lump in Tom Lee and Arthur Hayes. >> That is that's terribly unfair also to compare them >> on Dave Porty. there making stupid predictions. I'm not out there saying eat the 12K. What are you talking about? >> That is true. Although to be fair, SPF, Docoin, and Alex Mashinski to compare them to those three. Maybe Dove Porter is better in the SPF Docoin crowd, etc. But >> yeah, >> I mean, let's be fair, terribly bad price predictions does not equate to fraud, [laughter] >> although it should. >> Oh goodness. >> Um, anyways. Uh, so yeah. What else is the >> uh We've got um people liking the uh people liking my shirt. Guy, that's the best fit check yet. I like it. There we are. There we are. Um and uh someone else is reminding us of uh the good old days. Back in my day, back in my day, you could go to a website and receive free Bitcoin. It was called the Bitcoin Well or Forcet. Yes. I I don't remember the Bitcoin forcet when it was operational, but I do remember reading about it, researching it. Gavin and Andre I think it was. Um yeah, you could just go on uh complete a capture and I think you got five five [laughter] >> man. If only we had a time machine. >> Meanwhile, here we are in the first posth year where Bitcoin hasn't finished up. >> Oh man, >> how times have changed. >> Well, anyways, that all depends on what happens. Uh well, I mean to be honest, even if it doesn't finish up next year, we'll we've got a few predictions we wanted to bring out to you guys and we're going to go over these in two different sections cuz we have quite a few predictions and um unfortunately uh we were decidedly less optimistic. Uh well, at least [laughter] that encapsulates how crypto guys feel. You want to be bullish. Everyone, all the things signs point into crypto 2026 being bullish at least. >> But uh I don't know, man. We kind of jaded crowd, aren't we? At least sentiment on crypto Twitter. >> Yeah, I think so. And I but I think it's important to remember as well that, you know, circumstance plays such a big role, doesn't it? like we're we're in a period where sentiment is is enormously low at the at the end of ultimately what has been a really disappointing year for crypto especially it would be disappointing you know given the price action we've seen anyway but I think it's extra so because we've seen other markets rip you know um and that's been that's been really tough to swallow but I think we do need to allow a little bit for sort of I think they call it recency bias isn't it this idea that you know your opinions are are sort of influenced very much by what's happening in the moment. That said, um, yes, I think our predictions for 2026 are leaning on the bearish side, but I think it's important to, you know, it's important to remember that things can change very quickly. >> They can. So, let's start with the most important, one of the most important pieces of legislation that everyone seems to be focusing on for next year and that is the Clarity Act, right? This is the market structure bill and personal opinion. I mean I don't know how you agree if you agree with this guy but I personally think that clarity will not pass. >> You shall not pass. >> It shall not pass. So there's a few reasons for this. For one um so early 2026 there's budget deadlines and you've also got the shutdown risk. They're going to have to go back with that whole shutdown negotiation. That's the end of January. So that could take up a lot of the mind share and a lot of the time off the calendar and delaying it delaying this legislation long enough until it gets be towards the midterms actually the the votes and that just unfortunately won't take precedent. >> Yeah. Yeah. There's also a few unresolved uh policy issues as well especially uh ethics rules around Trump's uh crypto interests because obviously Trump and the crypto industry are slightly entwined. Um there's also uh you know there's also disputes over how DeFi should be regulated. Um and uh you know the negotiators are apparently calling these deal breakers in private. Yeah, 100%. And and also the trady industry is lobbying hard against some of these DeFi rules. >> And then also as we mentioned the midterms are approaching and this could uh flip the incentives from compromise to delay and with some some Democrats preferring actually let's wait and see uh for the elections and and I don't think crypto vote is important to either well the Republicans think actually we've got them on board so we don't really they're not who they going to vote for. They're going to vote for the Democrats and it's like okay well we didn't get it done. We tried guys >> you know. So I I think that that's likely to be what happens next year. I mean I would love to be wrong, right? And currently the poly the poly market odds are about 74% it passes. So if you want to hedge the disappointment of no clarity act just go and short that. >> Gosh I I wasn't aware that poly market was so firmly in favor. So you're taking quite a contrarian position there. >> I am but I think that you know always bet on Congress being a complete cluster you know. Yeah. I mean so >> that's true. >> Yeah. Okay, I'm going to take a slightly more positive view and say that yes, there are a lot of challenges in the way of the Clarity Act. I I still think there's probably a sense that, you know, a lot of a lot of House Republicans want to get this thing passed. The Trump administration has an interest in it. I think, you know, there may be there may be enough horse trading going on behind the scenes that they're able to, you know, extract some that that certain Democrats are able to extract certain concessions from Trump on it because again, it's one of these great sprawling bills where all sorts of stuff can get inserted, can't it? So, >> I think there I I do get the sense that there is a will to get it passed. But, yeah, the longer it goes unresolved, the harder it gets because obviously, as we stated before, the closer we get to the midterms, um, the more okay, Trump is going to want the economy firing. But, yeah, the more the more incentivized the Democrats are, I guess, to dig their heels in, which kind of takes us to the next item on the list, right? >> Yeah, exactly. And this is that who's going to win the midterms. Now it seems at least from polling that the Democrats are likely to win the House and the Senate or win Congress and also the prediction markets uh you know the known the wisdom of the crowd says that there's a 76% chance that that the Democrats retake the House next year. >> Okay. So far prediction markets have been pretty accurate when it comes to uh when it comes to politics especially US politics in particular. So you've got to say that yeah on that on that evidence uh it does look likely that the Democrats will will triumph at the midterms. And again this is where the fact that we've spoken about this a bit haven't we? This is the kind of double-edged sword of of the Trump administration endorsing crypto so so wholeheartedly over the last year and you know over the last 18 months or so is that crypto is now seen by many as a Trump thing, a right-wing thing, a MAGA thing. Mhm. >> Um and of course I think a lot of people in the industry have you know helped to stoke that by you know by being so supportive of Trump and many of his policies as well. So, I think yeah, I mean this is this is going to be tricky because if the Dems win the midterms as they're predicted to do, you've got to think that we risk, you know, we risk sliding back towards that era of Yeah. you know, lawmakers actively distrusting crypto and the regulatory outlook changing very dramatically. >> Yeah, it's unfortunate. Um, speaking of Trump though, another uh important important prediction and this seems to be relates not just to crypto but the broader markets as well. And that is that um it seems as if everyone thinks that because Trump is trying to install uh his pro uh pro, you know, monetary or pro uh doubish Fed chair that he's going to be able to control the Fed. But our next prediction is that it's going to be much harder for him to do that than many people think. And there's for a few reasons. Firstly, in terms of who's the clear favorite, it's here Kevin Hasset, who I think personally will will be the Fed chair just because he's closest to Trump in in terms of history as well. He used to serve in the previous Trump administration. So, I think Trump will want his man there, although he does like the show in between in terms of the media speculation, >> but there's reasons why we think that um it'll be hard for him to actually control the Fed, right? >> Yeah. I mean, you know, it's this idea that just replacing the chair of the Fed is is going to is going to get Trump what he wants is is is very wide of the mark because there are several other members of the FOMC who he has to uh who he has to influence. And I mean, he's been trying this, you know, firing firing Lisa Cook um or attempting to fire Lisa Cook has not, you know, has not really gone gone to plan in in in those sorts of terms. So, it's not just a question of Trump being able to put his his person in the chair and then have them, you know, have them call the shots because that person also has to convince the the other members of the FOMC. >> Yeah. Exactly. And also, uh, the Fed has given their forward guidance for next year. So, it kind of limits the flexibility. So, they signal they'll have one additional cut in 2026 and another in 2027. So these locked in expectations mean that it's harder for the chair or whoever there is there in terms of the broader FOMC as well uh to take opposing views to that just because of Trump. >> Mhm. >> And one more prediction we have for this section is all related to the AI hype, right? >> Yes. So this is the risk that the AI bubble could pop or you know start to start to wobble over. Um, and I mean, you don't have to look far to find to find some expert expert opinions saying that this is likely to happen. There's Michael Bur, the this is the guy who um was made famous by the big short. He was the one who predicted the housing market and has been dining out on on that prediction ever since. Um, he is uh he is sort of actively shorting AI, right? >> He's actively shorting it. Yes, he's bought some options on that. And another fun GMO which has been bearish about this as well said that we could have negative returns for the S&P based on this. And then I think there's more scrutiny now these days on AI companies and they want to actually see the cash flows generated from this and we saw this more recently with the collapse of Oracle's share price. So >> I I don't think we're going to have a cataclysmic bubble collapse in terms of AI next year. Although I do think that there's going to be more focus on these circular financing deals. There's going to be more focus on fundamentals, actual cash flows, and as a result, we could start seeing some of these AI companies retracing, which because they are such a big component of the S&P, will drag the broader markets down with it. >> Yeah. Yeah. I I I definitely think individual AI companies could suffer. I mean, we're in this weird situation, aren't we? Where Nvidia is so seems like so systemically important now that I I think I think Nvidia is probably going to have another, you know, another gang busters year. So, I think it in terms of an overall bubble popping in 2026, I'm inclined to think no. Um but yeah, I think I think definitely the questions are going to grow louder and we're gonna, you know, as as time goes on, there's going to be more and more um need for these companies to sort of prove that they are, you know, prove that their latest LLM is actually, you know, better than better than anything that's come before. And that I think is going to get harder. So yeah, maybe not this year though for the bubble popping. >> Yeah. Well, next year. >> Next year. >> Well, maybe not. Maybe not 2025. Hopefully not >> the last few days of 2025. >> That's the last thing we need, bro. That's the last thing we need. >> Uh yes, maybe 2027, which is worrying. >> Yeah, but if you are trying to stack, you know, stash your sats in that cataclysmic AI collapse, uh then we couldn't think of a better place to do it than on a Tang hardware device, your all-in-one crypto solution with no seed phrases, middlemen, or compromises. It's just tap and go. And if you want to actually get your Tang device, you can scan the QR code over there or hit the link down in the description and Coinbers using these two methods will be able to get a 10% discount on their device on top of all the other offers and bonuses that has already been offered by Tandem right now. Yep. Okay. Uh so let's move on to our 2026 predictions part two. It's now time to go very cryptospecific. Will we see an alt season? What happened to altcoin season guy? Really? Shower thoughts every single day, man. It was promised to us. The prophecy was not fulfilled, unfortunately. >> Yeah. [laughter] Yeah. No, we did not get an alt season in 2020 2025. And well, news flash, I don't think we're going to get one in 2026 either. >> It's not looking good, brav. Uh, so firstly, the market structure still argues against a broad season. For example, Total 2, which is the altcoin market cap, has fallen 32% since October's peak, and it's also lost its 50week moving average, which is an important uh level for momentum. And um you know, this has flipped, we've also flipped multiple bearish trend indicators, and historically these have preceded deep multimonth down draw downs rather than recoveries. >> Meanwhile, just 8%, yes, 8% of altcoins are trading above their 50-day moving average. And the altcoin season index is uh I mean has got a chart like most altcoins >> it's going to go negative eventually is I mean it's currently at record lows and this is consistent with a phase of basic basically bitcoin dominance. >> Yeah. So this remains the core headwind. Bitcoin dominance is making higher lows. It's near 60%. And it's not dipped below the 50% level that has historically marked the start of altcoin season. So this suggests that capital continues to concentrate in Bitcoin. >> Mhm. Meanwhile, the institutional flows are very much in BTC's favor as well. Um ETF inflows are re rein basically reinforce a kind of structural preference for Bitcoin. Um they've got liquidity, they've got regulatory clarity, they've got balance sheet suitability. It just, you know, speculative capital I think is being is being crowded out by these spot ETFs. >> Yeah. So broad altcoin season which we know and love and have come used to the 2021 types. Unfortunately that's not happening anytime soon as we'd at least as we said throughout the year. To be fair, we'd said this wasn't really going to happen. But that doesn't mean that there aren't particularly exciting narratives in the old coin space which could which could like outperform next year. >> Yeah. Uh and that's comes to our next predictions and that's taking a look or more of a discussion around interesting narratives we can look at uh that see that have potential next year in the altcoin space. Yeah. So the first is stable coins. I know we keep saying it. I know stable coins are boring AF. Um but there is there's no denying that uh that they're growing exponentially. I think 2026 is going to be another massive year for stable coins in terms of development, in terms of market cap growth. uh you know etc etc. Um however there are some chains that are going to benefit from from stable coin growth. >> Yeah I mean look at the end end of the day Ethereum is still the dominant player here in terms of most stable coins being issued uh and RWA which we'll get to. Salana as well obviously has got a lot of stable coins issued on top of it. So those chains that you going to the where these stable coins are going to be issued take a look at where that liquidity is because that will create demand for those networks. Yeah. Um so that's one stable coins. Um but another broader topic and this a broader niche or narrative is is defi more broadly and that includes not just borrow lend and the defi we know but also per dexes, right? >> Yep. Yeah. Per dexes have been a massive breakout this year. Obviously hyperlquid led the way. Um but there's now a lot of competition in that space too. And I mean I I I think perplexes sit at a very very interesting intersection between obviously DeFi and all the wonders that it offers and gambling >> basically and you know as gambling is just one of these things that will that will just never go away. People are always going to gamble and I kind of think perexes offer a whole new you know as well as prediction markets which we'll get to but perplexes I think really speak to that degenerate streak in crypto. >> Yeah exactly just the speculation and and non-custodial uh speculation that you you're in full control of. Uh this of course this sector I think really also depends on what happens with clarity uh with the clarity act. Another sector that's got a lot of potential that is was actually the most profitable crypto narrative this year and that was RWAS. >> So this is real world assets which actually to be tech technically correct stable coins are also technically an RWA but uh we don't need to get bogged down in the details. RWA is like tokenized treasuries and tokenized commodities that's been also been doing very well recently. >> So that's another important and and tokenized stocks of course. >> Yeah. And I just posted something in the Coin Bureau Club research feed talking about this as well because I think RWAS are also going to play a big role next year in kind of redefining or changing the conversation if you like around what a token actually is and what it means. I think it was last week on the show when we discussed uh what's been going on with Ave you know the the dispute between the Ave DAO and the Ave Foundation and also Axelar um the Axelar being acquired by Circle but not the token and I think this is a conversation that is going to get louder and more urgent in 2026 the idea of like what are what are tokens for you know what are so many of the you know these governance tokens or tokens that might have some utility in the future what is the point of uh and these are very difficult questions that a lot of projects aren't going to be able to answer. And I think I think the question is is thrown into even sharper relief by the by the growth of RWAS, tokenized RWA because people can point to those and go, well, these things have utility. >> Yeah. >> Tokenized stocks, we can all understand that. We can all understand the idea of tokenized dollars. I mean, you know, tokenized dollars are already taking over the world. >> Yeah. Exactly. and what legal rights come with these things, right? Well, tokenized RWA, we know, but if you hold a governance token with some idea of a vote, what does it matter? >> Um, and then a final another narrative which I think which has also had an amazing year at least the second half of this year is privacy and privacy tech you know I mean we've seen Zcash's amazing run monos and also more recently the launch of Canton network on the institutional side. So privacy is one of those narratives that's been around for ages and I think it's increasingly in a surveillance state. Uh having the ability to uh you know keep your transactional history private is important >> and it's very important. It's particularly important for institutions as well because I think a lot of institutions are looking at crypto. they're interested in they're interested in diving in and we you know we have plenty of anecdotal evidence of this but then when they look into the details of it and they're like okay so you can see someone with a blockchain explorer can see every transaction that we're making and there are so many reasons why an institution would would not want that and you got to think well if if crypto is going to be adopted by these institutions and individuals as well this idea of everyone being able to track payments I mean, you know, look, we we know every time Arthur Hayes makes transactions from his wallets, Ditto Vitalik and all these other people, and there are a lot of people looking at that and going, \"That's not for me.\" So, yeah, I think you're right. Privacy is is is going to be really important. >> Well, we actually do want to continue tracking Arthur Hayes trades so we know when he's going to dump on us and inverse trade his his price predictions. >> We must keep tracking the Arthur Hazes of this world. But um yeah, there are plenty of there are plenty of suits in Wall Street boardrooms and elsewhere going, \"Yeah, we're we're not comfortable with that.\" >> And the final narrative we think that could be dominating 2026 is one we've talked about uh is prediction markets. Uh jeez, I mean the amount of prediction markets launching now, left, right, incentive. Coinbase just rolled out the prediction market as well. It's crazy. >> Yeah. >> And we've also got prediction markets integrating with sort of more established crypto platforms. So, I think MetaMask MetaMask and Phantom Wallet both now have prediction market integrations. I'm sure we're going to see more of those. And again, it's, you know, it's this intersection of crypto and gambling. >> Yep. And speaking of predictions, the final prediction we're going to look at for you today is the most important one, the one that is also the most fraught. It's price predictions. >> And in guys, I don't know if you know, but last week, the last the last full December week of the year, Tom Lee was actually out on CNBC with some new price predictions. Tom Lee on CNBC. >> I know. It's never happened. I could I could I never >> Who allowed this to happen? >> I never thought I'd see Tom Lee giving price predictions on CNBC, but yes, he was. >> Broken containment. [laughter] >> He's out in the wild. Okay, so Tom Lee was on CNBC giving price predictions for crypto. Surely these were pretty conservative, right? >> Very conserving his bets. >> Very. He's hedging his bets. He's brought them down a little bit to 7 to 9,000 for ETH in early 2026. So >> this is US dollars, right? This is US dollar. >> This is This isn't Kenyan shillings or >> it's mobile dollars, bro. [laughter] >> Okay. So, Tom Lee sinks early 2026 a seven 7,000 to $9,000 for one shiny ETH. >> Yeah, but no, his Bitcoin price prediction 200K. 200K. So, there we go. >> 200K. >> Uh so, that's Tom Lee. Uh put, you know, make that what you will. Uh city's forecast for 2026 puts a price range of around 143,000. they've got this nice uh it seems like a Monte Carller simulation going out to at least 2030 for the uh range of price predictions. So it could be anything within that range but they the circle of their confidence interval or their most confident price is about $143,000 um by uh 2026 end of 2026 and this is on the back of 15 billion in ETF inflows. >> Okay. I I I can see that. >> I don't think that Yeah, I can see that. I can see that. I don't think that's I don't think that's absolutely insane. Um, meanwhile, some some people have given up on on making price predictions altogether. Galaxy Digital uh uh recently released this very interesting report. I think we've actually broken this down in a video, haven't we? >> Um, and uh yeah, they held off making a a BTC prediction for next year. They did say though by year end 2027, one BTC will set you back $250,000. >> Yeah. So, I mean, basically, if you take them at their word, then it means just buy and don't look at charts for the next two years and hope they're right. I mean, but uh >> yeah, buy some Bitcoin, dig yourself a hole in the ground, live in it for a couple of years and then come out and uh and go forth. >> Yeah. But guy, more important than you know, Galaxy's price predictions, cities, or even Tom Le, >> what what are your predictions for Bitcoin? [laughter] >> Okay, so what so what are we going to say here? 2020 2026 end of year. >> Well, let's let's rather do it like this. Um, how do you think do you think Bitcoin is going to break an all-time high again next year? >> Yes, I think it can. I I would imagine it would be more towards the end of the year and very much predicated on the idea that Trump is really doing everything he can to juice the markets. >> Okay. End of end of next year, you think? >> Well, yes. I mean, when are the midterms? Are they? late November. So, let's say let's say start of Q4, >> I think Bitcoin could could easily break a new alltime high around then if if we're seeing stimulus, if we're seeing Trump as well remember these crypto people who did so much to put him in power last to win the last election. Um, so yes, I think we could see a new all-time high next year, but I don't think it's going to be I don't think it's going to be smooth sailing. >> Okay. And do you think we'll go much higher than that? we could do. I actually quite like that city prediction of 143. I think that's I think that's relatively sane. I think that is achievable um with a fair wind. Um, and look, you know, we could eventually see once people have got tired of of all these precious metals, you know, they've already gone from gold to silver, silver to copper, copper to platinum, you know, once they run out of metals, >> they're going to go, no, then they're going to go invest in coal, invest in like iron ore, >> lithium, >> you know, lithium so high right now, >> you know, pork bellies or like orange orange juice futures. [laughter] So once they've got through all the metals, all the pork products and orange juice, then >> wheat, >> then wheat and then the orange coin. >> Um yeah, look, I I think I I do think uh next year, maybe we're being, you know, a little bearish about next year. I do think it is possible, but I think a lot of things need to go right. And we just we also need crypto to to recapture some of that spark that it's had in previous years. And for me, the big problem is quite how it does that. >> Yeah, man. It's difficult to find that spark. You won't find it on on crypto Twitter, that's for sure. >> No, certainly not yet. Anyway, >> cool. Well, uh, this now brings us to the our giveaway competition, right, for our crypto port for the crypto portfolio that we're giving away. So, this is the final chance for you guys to participate uh and vote on this portfolio giveaway. So, first of all, if this is the first time you joining the Coin Bureau live stream, firstly, welcome. Uh, and this is the giveaway portfolio. So, what we've been doing over the past three three months for this quarter, final quarter of the year, is we've got this comp we've had this portfolio competition where we started with $5,000 in the portfolio. And then every single week, people who are in the stream can vote on the coins we allocate to, how much we allocate, etc. And the goal was by the end of the competition we give away the portfolio to one of our uh people in the stream. Now there's in order to participate you have to first of all have a bit BitGate account and you if you don't have one you can sign up right now using the QR code or here in the link down below. There's also a lot of other in bonuses and incentives you can get on BitGate in terms of trading fee discounts and sign up bonuses of up to $50,000. So that you'll also be able to get. But you have to sign up to the bitgget, have an account, you have to be watching the stream, and you need to vote on the trades. Uh, so last week I think we had in Bitcoin we've closed what what do we know what level we're at in terms of where we're at in terms of the actual portfolio value? >> Uh, the actual portfolio value is I can exclusively reveal $4,641. >> So given how bad Q1 was, to be only down by a little bit like that, you know, by like 10% is is not that bad. Or no, a bit more than 10%. >> It could be worse. Yeah, >> it could be worse. >> So, ah, yeah, it could be. That's true. Um, but less than 10%. So, I think that, uh, right now we're going to go and open up the vote for the, uh, kind for the coins that we can choose for this week. Uh, and the options are guy, what are they? Okay, so the options uh, for this week, we're keeping it fairly conservative. We're going to go with BT uh, Bitcoin BTC. Uh if you want to go all into USDT and just try and hold on to the value for the last few days of the competition, then USDT is an option as well. Uh we were talking about privacy earlier, so we thought we'd throw Ze Zcash in there as well. And hey, look, you know, we need to finish uh we need to finish the year. We can't forget about ETH either. >> Yeah. Tom Lee thinks it's going to, you know, 8K possibly. So >> uh we've thrown that in as well. So the choices are Bitcoin, USDT, Zcash, or Ethereum. vote vote now guys is putting up on the comments there. Go and vote for the coin. >> Okay. So, whilst you're doing that uh for a final bit of TA for the year uh for 2025, we are back with Lewis. So, let's see what Lewis is seeing in the charts this week. [music and singing] >> What's going on, guys? Okay, so once again, I'm so sorry, but there is no trade setup for me because I'm looking at Bitcoin and really, we've been in this range between 84.7 and 93K for quite a while now, since November, for over a month essentially. And when crypto is in a range like this, I don't like to trade it because I like to trade the trend. And so if something is putting in market structure or price action like this, it's very easy to trade. Also, when the price is doing this, this is very easy to trade actually. But when the price is just going sideways like how it's doing right here, this is where most people tend to get chopped up. And I learned enough of trading and how to trade from last the last two cycles, right? Um, so I'm just trying to preserve my capital and everything that I sold, you know, a while ago and just wait until something actually happens to where I could see a good trade setup. So, let's say it comes back down here and then it ends up putting in a really bullish long wick candle and then it does something like this. Okay. Well, I know I could buy here and I could put my stop loss down here or something like that and I could I could target up here, but like right now, just being in the middle of it not doing anything, I'm not going to take a chance and just and just gamble on this. Now, as far as coins that actually do have trade setups, there are a couple starting with Zcash ZEC. You could see that it formed this triangle, this ascending triangle and then busted out of it like really good. And so if it comes back down to say literally anywhere between 400 and let's say 455 to 475, then that would potentially be a good buy because it could be a retest of this. I'll bring actually bring this down a little bit. Could be a retest of this triangle and then, you know, potentially go back to alltime highs at or or the highs of around $700. And that is a pretty decent, you know, that's like 50% right there. So Zcash is something that I'm keeping my eye on for sure. And then there's also XMR or Monero. So if we go to that and we click on that, uh, this is one that I took a short lit. I took a short at like 469. Uh, because if you scroll back, you can see that this was the previous highs in May 2021 and it reached that level. And so that's obviously a huge huge huge resistance because it was the biggest you know the all-time highs. So we have that and then if we go down into the lower time frames it did start putting in Yeah. So it basically was in an uptrend. You can see it started off like side like this with how steep it was and then it got to be very very steep and then it broke underneath of that and then if we plot out what's known as a bearish breaker that's what this candle is right here. Then we can see that it retested it and it's been acting as resistance uh for a little while now. So I'm in a short for XMR right now and I'm looking for other coins that have these type of setups where you know this one is like really obvious. It's at this new I didn't even do this but it's also at the 2017 all-time high. Right? So this one's very obvious. It's in this huge huge huge zone that's triple tapped it over the course of many many years. And then there's ZEC which is in the uptrend and had this really nice market structure. But when it comes to like Bitcoin and a lot of other coins that have just been going sideways, I don't want to touch them because they don't fit into my strategy. They don't fit into my rules-based systems or anything like that. So, if you are going to trade anything, remember to just sit down with your thoughts and plan everything out and write everything down because I know there's a lot of people that are jumping into metals. Let's actually talk about silver for one second. If we go to the silver chart, look at this chart. Look at this chart. People are just buying it out of FOMO and they're they're not looking at the charts. They're not understanding this. But you just don't want to be buying. It's such a parabolic move. And I know a lot of people got totally wiped out up here, right? So even though silver and gold and metals, like everyone's loving them right now, just looking at the charts, I personally would never buy this because every single time it has a huge runup, look at what ends up happening, right? It ends up crashing all the way back down. That was one time and then crashed all the way back down after this huge run up. That's the second time. And now it's having another huge runup, even bigger than the previous ones. So what's eventually going to happen? So, even if you buy it here and it goes all the way up, you know, another 20, 30, 40, 50%. It's most it's almost guaranteed, nothing's guaranteed, but it's almost guaranteed like 90%. That it's going to end up crashing and falling all the way back down to below where you know you would buy from if you bought it here. However, you know, if something comes all the way back down, let's say it comes back down to 52 or $53 and it's like, all right, maybe that's actually a good buy then at that price. But just don't get FOMO about things and make sure you're following a rules-based system. Be systematic with things. don't just jump into stuff because of FOMO. There's still not a whole lot of liquidity in the markets. The ETF data is still pretty bad and Bitcoin itself has been rangebound for over a month now. And so there's really no need to be rushing into anything. And so all of this has been basically my overall thoughts on the market and how I've been trading it lately. And with that, I'll pass it back on to you guys. >> Great. So what I got from that is that I should be full porting into silver and short. [laughter] >> It's good. you know is that Lewis a man who's a man who's done a lot of trading who's seen a lot of setups he's just like chill because I mean that is that is a genuine trap that a lot of people fall into is just trying to trying to find trades where there are none. >> Exactly. Trying to force a trade out of boredom you're going to get wrecked. So >> credit to Louis. >> Great. So now we have we're going to close the vote on the coin. Have we got this is for the portfolio competition. Have we got a winner for this week? >> Uh Bitcoin again. Bitcoin again, folks, >> guys. I'm not touching those alts. >> Okay. >> Okay. And now, are we going to open up for the vote for the alloc percentage allocation for this week that is going into Bitcoin? So, we've got four options, 25, 50%, 75% and full port in that baby in the last for the last week of uh 2025 into Bitcoin. So, you guys can [clears throat] vote now on the percentage allocation. We'll come back in a bit and close that. >> All right. So whilst you do that, we will now take a look at some of the tweets of the week. Okay, let's start with uh with this one from Chimp uh that says if it will uh if it will come up on the screen. Bro, you're fine. You just need an impossible sequence of events to play out in perfect order against all the odds and you'll be fine. >> Chill out, guys. Just that's all that has to happen. Just calm down. Don't think about it. Yeah, just you know the odds of the lottery winning the lottery about the same as your some of your [laughter] >> and if uh if that doesn't tell you about good sentiment on crypto Twitter right now I don't know what does still very good tweet next one is from uh John Wang uh referencing the so what can you explain >> so basically he's replying quote tweet replying to someone who's going around his memecoin trading trench thesis about where he's finding the the best value in the meme coins trenches right now and John Wang has shared this note about this infamous or very well-known Japanese soldier who kept fighting in World War II 29 years after he it had ended because he was stuck on an island alone. So, it seems as if the uh memecoin afficionado below >> is akin to the guy who doesn't know, bro, take a look sneaking out of the jungle to go and uh to go and raid a village for for some memecoin even after everyone else has given up. >> Yeah, bro. >> Oh, goodness. Okay, this next one is from uh go effing long. >> Go. >> You [laughter] met me in a rather illquid period of my life. >> That's the That's the excuse I'm using when I go out these days. I'm sorry I can't afford that drink, my lady. You met me at a rather illquid period in my life. [laughter] >> I might have to uh I might have to start saying that to my wife. I'm sorry, honey. We're [laughter] I'm going through a rather illquid period at the moment. >> I have cash. I have uh you know, assets. They're just rather illquid at the moment [laughter] and the market doesn't realize their full potential and value. My altcoins should be worth way more based on their fundamental value, but right now the market's not reflecting that full fundamental value. >> And that's why I forgot your birthday. Okay. Um, and we also have this one from uh Hedgei. If you bought silver yesterday, you'd have outperformed someone holding ETH for four years. >> Oh my gosh. I I think that's a good tweet to end 2025 on because I mean I think ETH bashing has been one of the one of the sports of this year. >> Oh, it has, man. It's been tough to be a ETH holder. >> Um if only we'd all pivoted into silver at the beginning of the year. Gosh, what a what a party we'd be having. Okay, any uh dates for the diary to watch out for? >> Yeah, so December 30th is tomorrow is the FOMC minutes are coming out. Uh and um we also by the way speaking about those minutes we talked about this as well uh as as well as many of the other things to watch for this coming week not just on the dates diary but also coins to watch in our weekly te in our weekly telegram blast over in our telegram channel. So again if you guys are not following our telegram or subscribed to our telegram do so now with that QR code. Not only will you get that alpha you'll also get our weekly breakdown every Sunday without fail about what's happening in the markets and what dates to look out for. Okay. All right. Uh so can you tell us folks if we close the poll on uh what percentage uh of the portfolio we should be allocating to Bitcoin? I think I have an idea. Have they voted to full port into Bitcoin again? >> They have indeed. Okay, you guys said it's so uh we will make that final buy. Uh let me just share my screen here. Uh so let's bring up the Bitgate interface. So, uh, we are making a spot by market price. Uh, and we are turning that slider up. We are buying BTC. >> Boom. >> There we are. >> Where's the coin jingle? >> Oh, I think my computer was muted. I'm sorry, Nick. >> I'm sorry, Nick. You don't get you don't get the jingle. >> Oh, no. >> Okay. Um, and let's have a look at some uh some of the comments uh that people have been putting in there as well. [screaming] Um, lot >> was that the final go to? Yeah, just promise. >> I promise you that was the final thing. >> We're going to get we're going to get the stick from the comment in the comments, guys. >> Um uh kick full gore. I'm getting ahead of the move and going all in on orange juice futures. Could be could be wise. Other people saying rare earths are next. >> How can you even can you easily invest in rare earths? >> I I don't know. I don't know. I think I think they're mostly produced in China. I think >> are hyper liquid. You can go you know. Can you imagine if someone can bring that product then wow I'm bullish >> deex we no longer need to even scan coin market cap anymore just go and look at the periodic table of elements and choose your metal [laughter] just go >> molly bendium I like it I like it this >> the next tweet thread's going to be on why someone's going long iridium [laughter] >> why has no one been talking about iridium what am I missing here um uh someone else says uh tulips salt Long salt and long salt. >> Look, lots of utility there. People like salt the supply, man. Because there seems to be an entire ocean full of [laughter] start boiling the oceans in order to get more salt. Do you know um salt is where we get the word salary from because Roman soldiers were often received part of their payment in salt. >> Oh, and that's interesting. >> Uh Solaris, I think is the Latin for salt. >> Solaris. Solaris. But doesn't it sounds like >> it's it's something like that. >> Something that lines. There you go. >> Maths and Latin the two the two subjects I failed at school. But yes, that's where we get the word salary from. Hey, you come for the crypto, you stay for the uh >> got more utility than some governance token. So >> some chap calling themselves XRP Timson 1979 says Bitcoin is going to zero. I think we may have an ETH maxi in the chat. >> Oh my god. >> I I presume that >> I assume he's talking about ETH. No, Ada Maxi. Oh yes, it must be. Um, and uh, Melon V10, garlic horsecoin sucks. How dare you? You don't know anything about garlic horsecoin. You're not speaking from a position from a position of knowledge. >> Go and study. Go and study garlic coin. >> Study garlic horse coins. >> God, I better rarin. >> I better check that garlic horse coin is not actually real. And we've just shield an absolute [ __ ] on screen. Gosh, I do apologize if we have. Um, and a nice message from uh from Kunal. Fun to watch the live. Enjoy the Dubai fireworks. Cheers. Will you be watching the Dubai fireworks? >> I'm going to be trying to watch it for the first time. Yes. Um, to be honest, I need to see. It's quite a spectacle. Although trying to get around Dubai after New Year's Eve is going to be quite a mission. It's going to really be like the the jungle there trying to dodge all the traffic and uh >> yeah, trying to get a taxi at 1 minute past midnight. >> I'm taking my scooter with as well. [laughter] Walk with a scooter. I'm going to be on Shakes with a scooter all the way from [laughter] I don't care. >> Wow, what a way to start the year. >> Well, hey man, it's fitting. Fitting given how the markets have been, right? There's the crypto bro, the guy on the [ __ ] high on the highway with a scooter. >> Yeah, next year Lamborghini. Um, okay folks. Well, it has been, as we said, it has been an eventful year. It's been a pretty tough year uh if you're being in crypto. But look, hey, it's been great uh that you guys have been watching along with us and still paying attention, still interested, still here. We really appreciate it. We really appreciate you guys your support and your, you know, just staying interested. So, I hope you guys have a great 2026. Um, >> it's a it's a roller coaster of a year, no doubt, but it's good to be on that roller coaster with you guys, holding our hands along the way. Yeah. you know, and yeah, >> we don't know what 2026 is going to bring, but we do know um that uh Nick, myself, and the rest of the wonderful team at Coinbau will be here bringing you the crypto content you know and love throughout the year. And hey, let's hope in 365 days time uh when we do the last live stream of 2026, uh that we have a year to celebrate. >> Indeed. >> Amen. All right. See you next year, folks. >> Next year, guys. Cheers. >> [music] >> These guys are outstanding. Thanks for everything. Great episode [music] of the TI part two. Thanks. Maybe a clean, fresh look will spark the market. Proper style, sir. [music] Proper style. Nice. Love you guys. Happy New Year. Nice. [music] Proper style, sir. Proper style. Nice. Love you [music] guys. HAPPY NEW YEAR. NICE. DIDN'T TELL THEM WAS THAT I actually full ported all my Bitcoin, sold it all and actually bought gold. >> You got into gold. >> I got into gold. Can you believe it, man? It's actually good to have it hold something physically that I can actually store away. This internet money. Who gives a [ __ ] about that stuff anymore? >> Good. Well, good for you, man. But I think I can top that because I silver >> went into silver. >> Oh, man. There's many more use cases for that. Not going to lie. >> Check that out. I mean, it's it's it's it's good stuff."
    }
]