[
    {
        "video_id": "W17EzxF-FYg",
        "title": "Palantir Stock Volatility Could Change Everything in 2026!",
        "published_at": "2025-12-29T03:43:23.000Z",
        "sort_date": "2025-12-29",
        "url": "https://www.youtube.com/watch?v=W17EzxF-FYg",
        "views": 4003,
        "duration": "00:10:19",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope everybody is having a great day and had a great weekend. Taking some time over the holidays to kind of mentally relax, distress from the markets, but right now we have futures that are opening up that are kind of wishy-washy kind of they open up pretty much in the green, but we're seeing a little bit of a pullback to the red here. It'll be interesting to see what happens with another holiday shortened trading week with New Year's Day, of course, and we don't have a ton of macroeconomic data. I think that's going to bring more volatility in here. So, the big question is, you know, with a market that closed basically at all-time highs, are we going to continue to see kind of this melt up with a lower volume or are we going to see some retesting of uh previous highs? Uh we see silver, that's kind of the big thing right now that's been on an absolute run. A lot of people are starting to call the top for silver, saying that this kind of move is starting to become exhausted. Uh we'll also be talking of course Palanteer stocks that I'm personally looking at going into 2026 here and also what's happening with crypto. We're actually seeing a little bit of a bid. We'll see if it holds this time unlike all like the last 15 bids. So if you're new or returning viewer, hit the like button, subscribe for daily videos. Um pop it up on the screen here. What you see Palanteer is opening up just kind of slightly in the red here. Down about 7%. Uh down 132 currently at 187.40. Now, this isn't necessarily a bad spot for Paloter, especially because recently it's broken out of its last uh kind of base and its consolidation phase, which between, you know, which is between this 170 area and kind of the higher 180s. Uh we'll see if this will get retested right here, this previous resistance point, and it does need to hold this. If it can hold support here, that would be a nice flip. And that's where you can possibly see if the macroeconomic situation looks good. And if we continue to see a melt up in the, you know, kind of the bigger market cap stocks, that's where you could see Palanteer that could be retesting 200s. Uh, all depending here what happens. If we see kind of more bearishness and selling pressure, I think Palanteer is just going to reenter back into this consolidation zone, which is also entirely fine because year to date, Palanteer has done incredibly, incredibly, incredibly well. For people that are talking a lot about bearishness out there and people that are complaining, I mean, just look at all these stocks. year to date. 2025 has been a pretty good year, I think, for everybody that has been on the long side of things. Um, talking about the general market, like I said, we had the SPY here. Uh, the index closed at 6929, a very nice close for the index. Currently, the SPY is trading at 689 66.89.94. I can't speak. Uh, basically just opening up flat here down about 37. Um, one post that I did really like this is a X account that I like to follow that tracks a lot of flow of the Bronx Viking here talking about possible weekly outlooks for the spy and QQQ heading into 2025. Uh, you know, talking about here we do have the closing, like I said, all-time highs of the SPY. Uh but one interesting point here was that we're still seeing some lagging in many of the mega cap kind of mag seven stocks that are still well below their prior peaks and that's because we've seen a lot of rotation out of the tech sector into things like healthcare industrials and what we're seeing here is this RSP here printed an all-time high and this is showing equal weight strength rather than a pure 7me mark a pure 7 uh meg 7 market which I like. Um, I like that we're not heavily heavily heavily weighted into the MAG 7, especially entering into 2026 here. And we also have the VIX that is at some of its lowest levels. So, uh, you know, with this trend remaining up, are we going to see does it keep grinding higher or are we going to get a back test? Even if there is a back test for the SPY, I think personally in the short term, that's probably going to be just a dip opportunity um, this prior breakout zone right here at 687 before another push uh with pos volume. That's what I'm leaning on. I am leaning on to more of the bullish side of things. Of course, I could be incredibly wrong. Uh but however, the flip side here, if we lose at 687, um that's where you could see um a lot of more selling pressure um that is coming across. Um in terms of the MAG 7 that is lagging, I do like that cuz if we see any type of dip buying in the, you know, in the MAG 7 in some of these big tech stocks, that's going to help bring some more resiliency to the index which is already near all-time high. Okay, so that's why in the short term here, I'm kind of still remaining with a bullish outlook. In terms of futures, like I said, nothing's really changed like we just checked before. Uh, you know, what to expect this week. Um, you're going to have jobless claims, pending home sales, and some Fed minutes. Uh, but that's really about it. Uh, in terms of the trading days, Thursday, New Year's Eve is going to be a full trading day. The bond market does close at 2 p.m., but the normal trading schedule that we get uh for trading hours, but New Year's Day on Thursday, of course, is going to be the holiday. You're probably not going to see a ton of trading on Friday cuz nothing is scheduled there for macroeconomic data for so for tomorrow, we'll get the pending home um sales. Uh you're going to get the initial jobless claims uh on Wednesday and then you're going to get some Fed meeting minutes, the December Fed meeting minutes on Tuesday. So, well, do we do have something for each day to kind of look at, but like I said, uh you're going to see a lot of traders that are on holiday. I could see some lower probably, you know, expected to see lower volume, uh kind of like we saw for Christmas week. Um, looking over here before we kind of talk about the individual stocks that I'm excited about right now, you know, let's just take a look at silver. Uh, silver right here is currently at 71 just because this is a huge trend. And I mean, look over the last 3 months here. You know, silver's just gone from 45 and it's just absolutely skyrocketed up to 71. Now, you have, you know, all these different opinions right here on silver right now. You know, the big thing, you know, with silver, it's like, oh, um, is, you know, are we losing strength in the dollar, US equities, is that why we're buying metals? Is that what we're seeing here? Or are we going to see once we see profit taking and kind of a profit taking cascade for here for silver? Where are we going to see that rotation into? Are we going to see that rotation into equities? Are we going to see that rotation in crypto? I think the latter half right there. Um I think we're going to see that rotation rather than hey everybody is all of a sudden done buying stocks. Um I think silver here is pretty exhausted in terms of this chart. Uh the risk-to-reward personally would never take a long position right here. Uh so I could see a little bit of a pullback right here. Where's that rotation going to lead into? I think that'll be good for equities. Also kind of coupled here with some of the points that we talked about from Bronx Viking. Uh talking about that though, I don't personally have any exposure to silver. First, I'll just be seeing what happens to it. Um, but we'll see if this, of course, gains some more momentum. The markets can be a little unrealistic longer than people can say solvent. So, we'll see what happens. Uh, looking at Bitcoin, we do see a bid that's finally here. Oh my god, Ethereum is above 3,000. This thing's been hanging right underneath 3,000 for like the last week. Uh, basically, oh, it's back. Oh. Oh, it's out at 29.99 for a little bit. We'll see if this 30,000 holds. Basically, with crypto where I stand right now, it's like, okay, the whole sentiment is pretty negative. Uh, you see everybody that is basically hating on crypto on X, which usually it marks the bottom hopefully here in the near future. That does not mean that I think more pain can come ahead uh depending on what the macroeconomic situation looks like. However, you know, Bitcoin right here is catching a bid back up about 89,000. You know, I don't think these things are going to flip bullish or kind of find their true supports until we see some strong volume and support here, some good numbers for Bitcoin. You know, is Bitcoin going to eventually reclaim, you know, 90,000, 95, 100,000? Are we going to see Ethereum that for God's sakes holds above 3,000 for more than a day? You know, once that happens, I think that's where you can probably see some more bullishness. But right now we have a large bearish sentiment on the whole cryptocurrency industry. I think it will make its move. Um but who knows when. I mean just look at what Tom Lee's targets were. None of those were achieved basically by the end of the year. So who knows when. I think it's a matter of you know not when it's going to happen but you know if we're going to probably see a move in crypto. Uh nonetheless though with BMR we've been talking about this just kind of hanging around at support level. You know 30 is an important area. It's slightly below that right now at 29. I think this needs a recapture 30. Hopefully, we'll see some buying pressure here uh with Ethereum if it can hold this level. And with that being said, you're also seeing uh Bitmine that has finally decided to stake their Ethereum. Uh right here, they deposited $219 million worth of ETH into their uh proof ofstake consensus. Um so, right here, it's great to see here because why this is important. Uh this is their first time staking. They hold about over 4 million ETH. We know what they're trying to hit the 5% of course with an approximate APY of 3.12%. So staking right here, what they're going to be receiving is a lot of additional Ethereum depending if they're going to be increasing their dividends. Nonetheless, you know, this is going to be important for their balance sheet. So important to see here. Hopefully making up from some of their crazy unrealized losses right now that Bit Mine is currently sitting at. Uh with their average I don't I think they're actually around their average cost for Ethereum, but still at a decent unrealized loss, I believe. Uh but we'll see what happens. Uh looking at the uh you know other individual names of course talking about Cipher and IN these are down about 1%. A lot of the high beta names are all down about 1%. You know that's kind of the whole AI data center trade right here respectively. Kind of following maybe just these futures that are opening up flap. So we'll see what happens. You know of course over the year 2026 I am bullish on Cipher. I am bullish on Iran. Uh however, in the short term here for the last week, I think it's just going to be more kind of reliant on what's going to be happening with the broader market and I think that's going to be, you know, kind of representative of how these individual more higher beta volatile names trade. Uh, of course, you know, you do have Cipher that announced, you know, these big contracts at 200 megawatt deals. So, uh, I think, you know, in terms of long-term, I'm still incredibly bullish, uh, on Cipher. I ran the whole AI data center um, type of play. I think that's important for the bottleneck uh which of course is going to be the demand for compute and the power. How do we power and how do we get enough um power to basically supply this whole AI demand. So peace out. Take care. Let me know what you think down in the comments. I'll catch you guys later."
    }
]