[
    {
        "video_id": "Mq95fnkOygE",
        "title": "Bitcoin: Pain Over or Just Starting? Cycle Analysis",
        "published_at": "2025-12-29T11:17:35Z",
        "sort_date": "2025-12-29",
        "url": "https://www.youtube.com/watch?v=Mq95fnkOygE",
        "transcript": "Listen carefully. Is there more pain for Bitcoin in the short term or are we creating a bottom here? Because many people are asking, Ivan, is this bullish? The fact that we have so many weeks sideways, the bears cannot push us below 87 88 approximately. Does it mean that we're now a bit bullish? That's a big question. And of course, as soon as Bitcoin goes like 1 cent above 90K, people are screaming, Ivan, we're back. What's happening? Well, let's talk about Let's talk about it. Also another reason another reason why people are bullish is of course because of the metals. The metals the gold chart the silver chart the platinum chart they all look parabolic. And by the way both platinum paladium and silver now have quite heavy dumps. They're still in the bull trend but just like I warned you a few days ago you want to be in early bull trends. In this video from a few days ago that you should watch if you haven't yet. We did discuss that. Listen 6 months ago I told you that silver is going to go up here if you had the money scanner. Paladium six months ago, platinum seven months ago, gold 11 months ago. This is based on the money line. When money line is bullish, you want to be in that early bull trend. You don't want to be in late bull. You want to be in early bull trend. And even though all of these different precious metals are still bullish, meaning that they are likely to continue to the upside, this is the problem with timing. If you have bad timing, even if you buy bull trend, you may have a problem with managing your emotions and your portfolio. So ideally, you want to be in early bull trend. And you may be asking, Ivan, why are you showing us metals? Why are you showing us gold, silver? We want Bitcoin. We only care about Bitcoin. Well, there are two reasons why I want to show you metals. Number one, there is a bull market somewhere. There is no old season, but there is metal season. So, that's number one. But number two, maybe most importantly, is that you need to understand the importance of the trend. When I speak about the Bitcoin pair trend or commodity bull trend or Bitcoin bull trend at some point, Bitcoin will be in a bull trend. You need to understand that it's very important like we're not messing around when we're speaking about trends. It's not a maybe. It's not a maybe. It is basically how you can see that something big is happening and you can be part of a larger trend without guessing the price every day. The trend tells you the macro environment the price is in. And so if we take that into consideration and we look at where Bitcoin is right now, you see clearly it is in bare trend. Okay, very important. And then when you look at commodities, for example, gold 11 months in bull trend, silver 6 months in bull trend, paladium 6 months, platinum 7 months, and then you look at where crypto is and Bitcoin is, we're just one month into Bitcoin bare trend, one month into ETH bare trend. So as long as you don't have a choppy market, because in choppy markets, trends can be short. As long as you have a trending market, which you can argue Bitcoin is in right now, a bigger trend that is unfolding right now because we're below the 50we moving average. Bitcoin is having a forceful quite big forceful move down. Then you can see that the length of the trend of one month, it's still short. It's it's not that big. It's not that big. And when you compare to let's say stocks, let's see how stocks are doing on the weekly here. You have bull trends for months and months and months. I mean this thing is seven months. Nvidia, seven months. bullish uh Apple four months uh alphabet Google six months six months so these trends when they actually when they actually have a strong trend a macro trend you know this a few months here and there it's nothing I mean for them it's nothing they can go on for quite some time and that's why the current Bitcoin bear trend which has been going on for just a month is not that long normally it continues for way longer we can be here in another 3 4 months and it's still bearish and it would be still within a normal bare trend of course We hope that the price wouldn't go that far down that we just continue chopping here maybe for a few more months and then we have a chance of breaking out into a bull trend. But chances are guys that we will be attracted more and more towards this 200E moving average and that this move right here silos move right here is consolidation within a bigger bare trend. This is called the bare flag as you know we have it here in this picture and the target of this flag is actually around 200E moving average. So this is my base case scenario for Bitcoin. And by the way guys, a reminder because I feel there's always someone that forgets there is no certainty in the markets. There are only probability. So we can assign the highest probability to whatever event we think is the most likely and then we can adapt our portfolio thereafter. But we cannot say for sure what's going to happen. That's why we have different scenarios and we assign different probabilities. And if this small probability scenario happens, it is a real reality that we need to deal with. Okay. Many people want certainty. That's also why they get very very wrecked because in their mind they think that something is very certain. So they go all in. They don't leather in. They don't leather out. They don't even have an idea that hey maybe I'm wrong. And you could be wrong even if you did all the perfect conclusions, perfect analysis and everything because everything's probability. You have 99% chance of winning. There's still one% chance you get wrecked. And that 1% may be the reality. And so if you can just learn to see the market as a probability, everything changes for you. It changes how you act, how you allocate, how you set stop loss. Because listen, if you don't believe in probabilities, you won't certainly why to set stop loss. There's no reason to set stop loss. So people of course don't set it. They get so wrecked. And if you master probabilities, you start thinking in terms of probabilities, you are ahead of 99.99% of people in the space because most of them are sadly a bit of children. I mean sadly it is like that. They believe in things which are not real. Just like your son may believe in Santa Claus or he thinks he's freaking Spider-Man. The same thing is with your uncle. He thinks he's going to trade and he's so certain something's going to happen. He's so certain global M2 or ISM is going to pump his old coin and then it doesn't happen. He's wrecked 80%. You can be ahead of them. You can literally take their money. I mean that's how it works in trading. If you are acting in a disciplined way, in a professional manner, you will be consistently taking money from those that are not doing that. Why? Because they are purely emotion based. They're purely gut feeling based and it's free money. For everyone else, it is free money. But I digress. And so if we look at the different scenarios here, the consensation to the downside is the primary scenario. And then the secondary scenario is that we do go and we touch this 50 moving average and we continue down. For me, it doesn't really matter because I will not be taking any action in either of these scenarios because we already took action since October 8th. We've been derisking and now we are at our long-term hodddle portfolio of 30% Bitcoin and that's it. That's it. So whether we just uh go down to 200 a week now or we come back here and then we go down for me it doesn't matter. I don't do anything uh in either of these scenarios. The only thing that would make me become bullish is that we start closing weeks above the 50 week and we move up higher higher higher here and then the big flip here at 114 is going to be the biggest signal to be bullish again again and I look forward to that. See many people mistake the situation that you know for some reason I'm bare only. I'm bearing a bare trend. But if bull trend happens, well, I'm bull again. It's as simple as that. Bearish is not an identity. I mean, literally, it's just a position in the market and the market changes just like we were bullish January 2023 until October 2025. The same thing is vice versa. So, uh those are the scenarios where I will be taking action in case we s closing weeks here above 50 moving average and especially if we flip bullish here, which will happen at 114. And by the way, let me show you something that really proves the beauty of our system. Because as you remember, we were risk off already since October 8th. And then we become super riskoff when we went below the 50we and then super mega risk off when we went below the moneyline flip right here. And the good thing now is that the flip level for us to become bullish again is dropping quite quickly. Now it is at 114. In a few weeks is going to be at 110. And so when you look at our average price where we exited because we started here on October 8th it was 120 and then lower and lower it is around somewhere around 110 105 between 105 to 110 is the average uh price. So uh the thing is if we go above 50 moving average it's going to be the first signal to start buying and then if we go above the money line here that's going to be the mega signal to become bullish again and these levels are both dropping. So let's say that we start uh crossing here to the upside, you know, in the coming months in in March or something. Well, we're going to be here already starting at 97 or something and then this thing is also going to be dropping. So all in all, our buyback price is going to be super similar to our sell price and that's the beauty because literally if if that if that is the case, what has happened? We have basically been protected to the downside. So we would not participate in a mega bare market towards the 200E moving average which is by the way still the main scenario. I'm just uh talking to you about how a professional trader how how I'm thinking in terms of positioning and playing the scenarios because we don't know what's going to happen. So you want to maximize the expected value. Okay, in terms of statistics you want to maximize the expected value. How do you do that? You do that by not being part of the way down in big trend down and you want to be part of the big trend up. So, Bitcoin cannot cannot go to 1 million without us being bullish. And Bitcoin also cannot go to zero without us being bearish. So, you want to be good no matter what happens. You want to remove your identity from your position in the market because that's really what gets you wrecked. And as soon as you have a bit of distance to that and you see the market for what it is, which is all kinds of probabilities that you can adapt your portfolio to and you start acting as a professional trader, not not as a wrecked plebe just hoping and begging. And you can also see different bull markets like for example with um commodities. I think this year really showed us that you you have to look across uh markets for your portfolio. Uh you look at commodities here on the weekly uh all of the precious metals are bullish. I mean literally 100% gold, silver, paladium, platinum but then even the other ones you know like uh the other more consumable uh commodities uh most of them are also bullish. I mean you see here and so uh stocks uh the same thing. It's um a situation where on the weekly you have 50% bullish and then 50% bearish and then crypto is the odd one out here where only 20% are bullish and 80% bearish. So this is the power of seeing how different asset classes are trending and if you approach your portfolio with professionalism and you see the different opportunities you would be looking outside of crypto as well because as you can see there is a bull market somewhere. We didn't get all season. We did get the nice big fat precious metal season. And a smart student would be asking here, hey Ivan, isn't it good? Isn't it good to buy blood? Because only 20% are bullish. 80% of assets are bearish. So is it a good idea to buy right now because so many assets are down. So you can buy now and then it goes up. And listen, this is a concept which so many people because they think that just because something is down a lot that it has to go up. In reality, uh sadly it is vice versa in reality because an asset which is down a lot can still go down even further. And I will show you crypto example soon as well. But look at PayPal. This is PayPal after the COVID uh pump here which was insane. And you know some people bought here minus 50%, it's it seemed like a great discount but let's say you bought here minus 50%, uh what happened now? We went down another 60%. So something is down 50% doesn't mean that it it's the party is uh the bare party is over. I mean the bare party may just be starting. Then of course you know the famous famous example with Sana. I will soon show you that. Let me just show you micro strategy in the last uh bare market uh here uh when it went down here let's say uh 60%, some some people bought they thought hey you know 60%, quite a nice discount but what happened then it went down another 70%. Okay. So, listen, as you know, it's all about the trend, guys. You don't want to touch stuff in bare trend. You want to touch stuff in bull trend. And of course, Sana, let me just show you. It's my favorite example to show because the wreckage there, man. Holy crap, guys. The wreckage, the wreckage, the wreckage from the top. Even if you bought 70% down, what happened after 70% down right here? It went down another 90%. Guys, don't buy stuff in the B. You have to be uh sure that your thing is first trending bullish. So, what would make me bullish crypto again is if this uh number of coins is going up bullish and all of them are early bull trends. So, you can see here in the money scanner things that recently flipped. Uh here for example, this thing became bearish a week ago. If I remove the bearish part here, you see there are some coins that just became bullish. Okay, but you still have to be careful because Bitcoin is bearish. So, a lot of these alts, even though they're temporarily bullish, you know, if Bitcoin goes down, it's it's not going to it's not going to last. But when Bitcoin starts to be bullish and then a lot of these coins start to become bullish as well, and you can buy early, obviously, that's nice. Of course, that's nice. That's that's that's the signal. That's the true signal. The signal is not when to buy something when it's down a lot. The signal is when it's down a lot and it's been going down for a long time and it's justly bullish. That's the signal, guys. That's the signal. Please understand that. Please. I mean, I hope you I mean, listen, I I hope you understand that because I mean I can explain it uh one time, five times, 10 times. But yeah, I mean that's it basically. Okay, with that being said, let's check the news. First and foremost, the ETF. The ETFs have a big fat outflow basically every day. The only days this month were the 17th, the 12th, and the 10th, and then we don't have further data here, but it's just a few days that are in and everything else is just out. And by the way, one thing I want to clarify because some people are saying, \"But Ivan, looking at all of the inflow, like looking at the all of the inflow we had since the beginning of the ETFs, uh, this outflow is still quite small. I mean, it's you look here, it's like a few billion per month, like it's not that big.\" Yes. But the thing is it's not about the outflow in comparison to the AUM. It's outflow in comparison to the marginal buyer on each and every day that decides whether price goes up or down. It's not really about the total because total amum is like dead cap. I mean it's there. It's locked. That's it. That's it. Uh it's that bitcoin has been around anyway. I mean it's been in exchanges. The whales have been holding it like that bitcoin just changed hands. So nothing changes the fact that ETFs have a lot of aum. The uh question is is this outflow is it bigger than the new buyers that are coming into this market right now and currently we're seeing that yes this outflow is bigger because Bitcoin does not pump. All right, Bitcoin does not pump. It is being still held at 87 88 89 but um for us to pump I think the inflow has to come back. So that's number one. When we look at the uh different uh whales uh when you look at profit profitable whales which is most important uh those with highest P&L are bearish those with a bit lower P&L are slightly bearish and those with lower P&L are also slightly bearish and uh so basically everyone who is profitable is bearish and then everyone who is super unprofitable is very bullish classic and basically minus 1 million or more in P&L. uh then between 100k to 1 million loss P&L is bullish I mean you see yourself so all in all the situation is that the smart money currently is bearish okay that's what we see and I also want to remind you that this data is way better than any kind of you know onchain analysis of whales accumulating I mean onchain sadly it is in the existing day and age a bit of fugazi we use it before because there weren't better options but now that we have decentralized leverage exchanges like hyperlquid where you see the P&L and the position of the traders based on P&L. This is way better. This is way superior to any you know onchain some whale is accumulating because onchain you don't know I mean it's you don't know for sure you whatever is labeled the buy on chain they don't know it they think maybe it's a buy because it changed it changed hands I mean when they have different transactions on chain and they they try to see is it buy is it sell so it's basically all assumptions there are so many assumptions in onchain because you don't know with bitcoin whether something is a buy or just an internal transfer it's impossible to know so this is why we don't look at onchain we look that uh hyperlquid because here you see traders trading millions millions of dollars and you see what they're doing exactly. Uh so that's that. Also look here uh Bob Lucas is saying that he has a very very mixed feelings on Bitcoin currently. Sentiment is in the gather and we could argue and we could we could argue overdue for some type of uh relief rally. I mean it's true the the sentiment is very bad yet I really dislike the price action. The tape feel for me is one wanting to start another big leg uh lower. Uh so all in all uh there is a bit of sentiment like that. There's also a lot of sentiment that is bullish. So based on sentiment it's also not something I like trading really guys based on you know sentiment this sentiment that the trend is better. The price trend is better. But it it is funny here. Grant Cardone is asking seems like concerted effort to hold Bitcoin at lower levels. So Grant Gardon thinks that we it's some conspiracy that Bitcoin went down after a massive massive bull market for uh 3 years massive. I see you see here this green big green. So yeah uh he's new to crypto so I don't blame him but u yeah it's classic and then he says hey sailor what's happening I need inspiration for my conviction man and I wrote listen Bitcoin low will happen will people when people capitulate now all of these concerned people including Grant Cardone big shout out uh they're still hopeful you know sailor give me some inspiration I'm still in I'm still in tell me something positive when these people start to sell and they start to panic That's when you will have true bottom, which I think is going to be here around 200 week moving average. But as always, if uh price goes up, we adapt. We actually we're going to be in the perfect spot. Better than most people. Better than most people. Guys, that's it. Smash up the like, subscribe, let me know what you think about this format. And uh yeah, see you all very very soon. Check out bulmania.com if you want to get access to the uh to the money scanner right here to the Boommania suite of tools, the money line, the discord, the the private uh reports and so on. Use the link below. See you all very very soon and goodbye guys. Goodbye. Goodbye. Bye."
    }
]