[
    {
        "video_id": "w04dNeIg0C0",
        "title": "The Truth About The Gold-Bitcoin Rotation",
        "published_at": "2026-01-06T14:01:39Z",
        "sort_date": "2026-01-06",
        "url": "https://www.youtube.com/watch?v=w04dNeIg0C0",
        "transcript": "It's believed that Bitcoin lags gold by around 3 months. If this is indeed the case, then gold's massive rally at the end of 2025 should translate to a massive rally for Bitcoin at the beginning of 2026. However, this assumes that there's rotation between Bitcoin and gold since Bitcoin is seen as digital gold by investors. The truth though is that the relationship between Bitcoin and gold is much more complex. That's why today we're going to do a deep dive into the dynamics between Bitcoin and gold to figure out what it means for the price of both assets in the coming months. This is a video you can't afford to miss. Before we begin, you need to know that nothing in this video is financial or investment advice. It's educational content intended to inform you about the nuanced relationship between Bitcoin and gold. If you want to see more of this kind of content in your feed, smash that like button to give this video a boost in your algorithm. Subscribe to the channel and turn on notifications if you haven't already. Now, let's start with a surface level analysis of Bitcoin and gold, and then we'll go down the rabbit hole. In theory, investors see Bitcoin, specifically the BTC coin, as a safe haven like gold. Hence why there's a relationship between the two. That's because just like gold, BTC has a fixed supply, can be self-custodied, is not controlled by any individual or group of individuals or institutions, and so on. In practice, most investors still see BTC as a risk asset, specifically as a higher risk, higher reward bet on tech stocks, particularly tech indices like the NASDAQ. Notably, this is technically true for investors who see BTC as digital gold, too, because most of them also see BTC as a higher risk, higher reward bet on gold. This makes BTC more like digital silver than digital gold. And you'll see why that's significant later. Anyways, the fact that BTC is seen as a risk asset by most investors and even treated as a de facto risk asset by investors who see it as digital gold means that BTC lies on the opposite end of the risk spectrum from gold. Gold is a true safe haven. This is because of the characteristics I mentioned a few moments ago and because gold has historically been seen as a store of value by everyone everywhere for well millennia. With this in mind, the apparent lag between Bitcoin and gold starts to make sense, and it becomes apparent that the rotation has nothing to do with the gold digital gold relationship. It instead has everything to do with risk. When gold is rising, it's typically a sign that investors are concerned about what's going on in the markets and the economy. In this riskoff environment, risky assets like BTC tend to perform poorly. When gold is falling, it's typically a sign that investors are feeling confident about what's going on in the markets and the economy. This creates a riskon environment, which will cause risky assets like BTC to rise, especially if there are significant catalysts that bring attention and investment to the crypto market. The result is something that looks like a lagged rotation between BTC and gold, and it technically is. But again, this lagged rotation has less to do with the relationship between BTC and gold and more to do with the risk off or risk on environment in the background. Case in point, when the pandemic started in 2020, gold's price rallied while BTC crashed due to the riskoff environment. By the summer of 2020, however, unprecedented stimulus by central banks and governments gave rise to a riskon environment. The result was that gold's price fell in the autumn of 2020 and this corresponded to a massive rally in crypto with many altcoins hitting their cycle tops in the spring of 2021 just as gold was bottoming. Once again, this makes perfect sense. The initial rising gold signaled a riskoff environment wherein crypto crashed and the subsequent falling gold signaled a riskon environment wherein crypto rallied while gold fell. If you need more evidence, look no further than the autumn of 2024 when gold fell while aggregate measures of altcoins, like others, hit multi-year highs. The fact that gold's price continued rallying after that could be the reason why altcoins continued falling after that. It wasn't because gold was draining liquidity from altcoins. It was because gold was signaling a riskoff environment wherein crypto struggles. So, this begs the question of what will happen to crypto when gold's most recent rally ends and gold prices start to fall. At first glance, you might think it will be a crypto rally. Upon closer inspection, however, you realize that gold's price rallied when crypto topped in late 2021 and it rallied when crypto topped in early 2018. So, this suggests that there's more to this risk rotation than meets the eye. And that's because there is. But before we go down the rabbit hole, you have to check out the Coin Bureau deals page. That's where you'll find signup bonuses of up to $100,000, trading fee discounts of up to 50% and deposit cashbacks of up to 75% on the best crypto exchanges. To get these goodies, all you need to do is hit the link in the description or scan this QR code. And once you get on the deals page, find a deal that suits you and click one of the sign up now buttons. These deals won't be around forever though, so take advantage of them while you can using the link in the description below or the QR code on your screen. Right, to quickly recap, BTC is seen as a risk asset by most investors and even investors who see it as digital gold treat it as a higher risk, higher reward version of gold, i.e. also as a risk asset. Conversely, gold is seen as a safe haven by most investors. So it makes sense that crypto falls when gold rallies and that gold falls when crypto rallies. It's what happens when capital moves from risk off to risk on respectively. The caveat is what I mentioned earlier and that's that we've seen periods where gold and crypto would rally together, namely when the crypto market topped in early 2018 and late 2021. We've also seen periods where gold and crypto would crash together, namely when crypto bottomed in late 2018 and in late 2022. This change in correlation has to do with the change in gold's demand drivers over its cycle. As most of you will know, central banks have been increasing their allocations to gold since some reserves of Russia's central bank were frozen following the invasion of Ukraine in 2022. This freezing sent a signal that western assets used as reserves were no longer safe to hold as reserves in size, particularly government bonds. Since gold was previously used as reserves, it's the logical alternative to accumulate. At the same time, many investors around the world have been accumulating gold too. In China's case, the collapse of the housing market, which was previously the safe haven for most investors, has resulted in investors there looking for alternatives. Precious metals are once again the most logical alternative as they aren't as affected by Chinese Communist Party policies. For context, China's housing boom and bust was caused by Communist Party policy. In the case of Western countries like the US, many investors there have also been hesitant to allocate to bonds due to excessive government spending and political risks and they've been hesitant to allocate to stocks because of the concentration and bubble risks. This has likewise resulted in allocations into gold. The catch is that the buying pressure of central banks and these investors pushed gold prices up a lot. And the result was that gold started to attract speculative investors both from stocks and crypto. And this is where things get interesting. We can get a sense of how much of gold's price action has been driven by speculation by looking at search trends for terms like gold and gold price. As expected, trends for these search terms started going vertical in the summer of 2025 when gold started breaking out again. Put simply, it looks like gold's rally from around $2,200 at the start of 2024 to $3,400 in the summer of 2025 was driven primarily by fundamentals accumulation by central banks and riskoff investors. However, the rally from $3,400 to the recent high of $4,600 was driven primarily by speculation. Additional evidence of this can be seen in the fact that higher risk, higher reward bets on gold rallied during this period. And these include gold miners and silver, both of which have been ripping since the summer of 2025. When such high beta plays are also going parabolic, you know that speculation in precious metals is rising fast. In other words, risk on investors are piling capital into gold, silver, and other precious metals. When speculation becomes the dominant driver, the correlation between gold and crypto becomes positive. And that is basically why there were periods where crypto was inversely correlated to gold and periods where it was positively correlated to gold. When it was primarily risk off investors allocating to gold, its price would rise and crypto prices would fall. But when it was primarily risk on investors allocating to gold, its price would rise and crypto prices would also rise. I'll explain why they haven't a little later. First though, I need to underscore the fact that speculative flows currently dominate gold and precious metals more broadly. In our view, the biggest giveaway that speculative flows are in control is the fact that many YouTubers who often talk about gold are promoting services that offer yield on gold paid in gold. The fact that even respected YouTubers are promoting these services now suggests there's lots of revenue there. Anyone who's been in crypto for more than a few years will know that when yield starts getting offered like this, it means both speculation and leverage are rising fast. And when this speculation runs out and the leverage unwinds, gold's price could fall sharply. As I just explained, this fall would be due to force sales from risk on investors and it could correspond to another leg lower in the crypto market, not rotation. Now to quickly recap, crypto prices tend to rise when gold prices fall and gold prices tend to fall when crypto prices rise. However, this inverse correlation can become positive when riskon speculative capital starts to become the primary demand driver for gold. This is arguably what we've seen since the summer of 2025. And this suggests that a crash in gold could be bearish for crypto, not bullish for crypto. And this is where the rabbit hole goes really deep because everything I just mentioned is ultimately driven by the liquidity cycle. To bring you up to speed, liquidity is a fancy word for money in the economy and the markets. Michael Howell is the leading expert in global liquidity and he's been predicting that liquidity will peak in late 2025 or in early 2026. Now many interpreted this as bullish for riskon assets like crypto. The thing is that the most bullish phase of the liquidity cycle for risk on assets is when liquidity is rising, not when it's peaking. As you can see in this image here, if you look closely, you'll notice that the peak of the liquidity cycle corresponds to rallies and cycle tops for commodities, which includes precious metals. In case you missed it, other commodities like copper and coffee have been rallying in recent months, too. This is consistent with Howell's forecast that liquidity would peak around this time and consistent with his asset allocation framework which notes that commodities rally the most when liquidity peaks. In case you didn't notice, what follows the liquidity peak is a liquidity drawdown which is bearish for all assets. That's because there's a scramble for cash. Hence why cash is the asset to hold at that phase. What's fascinating is that how believes that the global liquidity cycle is driven by the debt refinancing cycle. In short, individuals and institutions around the world need to roll over their debts every four to 5 years. This rolling over of debt causes liquidity to fall in the same way that paying off your entire credit card balance means that you have less money left to spend on other things. Imagine that, but on a global scale. Now consider that the world's wealthiest individuals and institutions keep as much money in assets as they possibly can. Be they stocks, crypto, or precious metals. When it's time to refinance their debts, they must sell these assets for cash. Which is again why framework suggests holding cash during a liquidity contraction. And in case it wasn't clear enough, liquidity is expected to contract in 2026. This is just because there's a huge debt refinancing wall in 2026. This begs a bigger question then of how to tell when that wall is starting to drain liquidity from the markets. The short answer is to look at the DXY which measures the strength of the US dollar against a basket of other currencies. If the DXY is rising, the demand for cash is increasing and assets are likely to fall in price. If the DXY keeps falling, assets will keep rising. As some of you will know, there's a strong inverse correlation between gold and the DXY. When the DXY rises, gold tends to fall. And as we've just learned, there is a lot of speculation and leverage in the gold market. So, when the DXY eventually rises as debts are refinanced sometime in 2026, gold's price will likely fall, causing speculative capital to flee and triggering liquidations, pushing prices down even more. Meanwhile, crypto prices are also likely to fall, not because gold is falling, but because the liquidity drain caused by debt refinancing is creating a riskoff environment that's pushing down gold's price due to risk on investors getting out of gold. Once again, this highlights the fact that it's not gold which drives crypto prices. It's the risk off or risk on environment that gold's price is signaling based on its demand drivers. When most of the demand for gold is coming from risk off investors, gold's price will rise while crypto falls. But when most of the demand is coming from risk on investors, as is the case now, gold's price will fall while crypto's price falls as well. I'll quickly note that the debasement trade narrative is yet more evidence that speculative flows are in command of the price of gold and precious metals at this stage. The silver lining is that even though the price of everything will fall when liquidity contracts, gold's price should fall less than other assets in percentage terms as risk off investors increase their allocation to gold during the drawdown. The golden lining pun very much intended is that every liquidity drain due to debt refinancing results in a liquidity injection to help with this debt refinancing which then restarts the cycle. Now to quickly recap, the reason why speculative capital has been the primary demand driver for gold recently is because this is what happens at the end of every liquidity cycle. When liquidity peaks, commodities rally. What comes next is a liquidity contraction that causes asset prices to fall. The golden lining though is that the liquidity contraction will result in a liquidity injection which will cause asset prices to rise. So this just leaves two questions unanswered. The first is why crypto didn't rally alongside gold in late 2025 as it did in previous cycles. And the second is what comes next for the crypto market given everything we've just discussed. The answer to the first question is something that not enough people are talking about. And that's that there was a disconnect between crypto and liquidity sometime in the summer of 2025. For those unfamiliar, crypto is highly correlated to global liquidity, and prices lag liquidity by around 3 months. As you can see, global liquidity kept rising into the autumn of 2025, but BTC and the rest of the crypto market chopped sideways. Literally, every other major asset class hit new all-time highs except crypto. US stocks, foreign stocks, precious metals, other commodities, the list goes on. Now, many have claimed that this disconnect between crypto and global liquidity was caused by the refill of the Treasury General account over the summer, but this doesn't make sense because the disconnect between crypto and global liquidity began weeks before the TGA started being refilled. And not only that, but the 3month lag means that the cause of the disconnect likely happened in the spring of 2025. Now, our best guess is that something in the crypto market broke in the spring of 2025 when the markets crashed in response to Trump's liberation day tariffs. Again, many have claimed that the breakage happened with the 10th of October liquidations. But the reason why those liquidations were so brutal was precisely because liquidity in the crypto market was already abnormally low heading into the event. This pertains to the answer to the second question which you'll recall is what comes next for the crypto market given that the next draw down in gold may not result in a rotation into crypto. The answer is a bit complicated. You see as illuminating as the liquidity models from Michael Howell and others are they don't factor in injections of liquidity which were unexpected like for instance lastminute stimulus. As most of you will know, the Fed started buying US bonds at the start of December 2025, which it insists is not quantitative easing. Despite what the Fed insists though, this does amount to a liquidity injection and the draw down of the Treasury General account since November is another tailwind for liquidity. When you remember that crypto lags liquidity by 3 months, you understand there could be a small rally sometime in Q1 2026. And when you combine this increase in liquidity with the potential approval of the Clarity Act, it means that attention and capital could rotate into the crypto market. The approval of the Genius Act in 2025 was essentially the only bullish crypto catalyst that caused prices to rise. With a bit of luck, we'll see history repeat with the Clarity Act having a positive effect on crypto prices. After that small rally though, the crypto market is likely to fall as liquidity is drained due to the debt refinancing wall, which I'll remind you can be tracked by looking at what the DXY is doing. The more the DXY rises, the closer we're getting to that debt refinancing wall and the subsequent liquidity drain. And I'll repeat that this liquidity drain will eventually be followed by a liquidity injection to help with the refinancing. The only problem is that this liquidity injection probably won't happen until the markets or the economy deteriorate to the point that policymakers start to panic. That's exactly why things like QE have historically corresponded to market crashes and bottoms rather than rallies or tops. The Fed only steps in with extensive stimulus when things look very bad. So, be sure to keep that in mind in 2026. And yes, once that emergency stimulus is announced, expect to see crypto prices start to recover around 3 months later. And yes, gold will probably bottom around the same time the crypto will, just like it did in 2018 and 2022. Then the liquidity cycle will start over again with stocks and crypto leading the way as liquidity expands and a rally in commodities marking the peak in liquidity just like it seems to be now. The wheel keeps on turning. And if you want to know which cryptos could do well once the next liquidity cycle does begin, then be sure to check out our video about the top crypto trends for 2026 using the link here. If you made it this far, thank you so much for watching and I'll see you in the next one. This is Guy signing off."
    }
]