[
    {
        "video_id": "iBNgfTi8FKE",
        "title": "Palantir Set to Rally as These AI Stocks EXPLODE!",
        "published_at": "2026-01-06T04:31:36Z",
        "sort_date": "2026-01-06",
        "url": "https://www.youtube.com/watch?v=iBNgfTi8FKE",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope you guys are all having a good day as we see a lot of positive rotation and momentum that is coming into a lot of the AI stocks, especially ones that we've been covering on the channel recently. And we're going to be talking about how things are looking very bullish, especially with Nvidia's recent CES announcements. We see some very bullish product reveals there with the new AI chip Reuben. We'll be talking about that and how this downscale effect can really have a positive impact on some of the more smaller market cap names. Now also we'll be talking about Palunteer here. The broader market Palunteer is doing a good job to stabilize and we see the broader market that is still remaining relatively bullish here with oil stocks that are starting to catch a bed due to recent geopolitical tensions. If you're a new or returning viewer, hit that like button, subscribe for daily videos, and let's pop it up on the screen here. Palanteer currently trades at 174.88 up about a half a percent in the overnight session and currently trade closed just slightly below that. Now Palanteer is kind of recovering and having a reversal and some consolidation from its previous sell-off that we saw on Friday the 2nd when palenteer quickly lost the $170 level of support. This reversal is nice because Palanteer is now back in the consolidation zone and with the amount of bullishness that I've seen come in for the AI just sector and what the overall sentiment looks like in terms of risk type assets are kind of back on the table. We'll be talking about what does this mean? What does that look like with the previous statement that I just made but nonetheless from a technical pattern here Palunteer is just in this consolidation zone between 170 184 when it hangs out here there's really not much to say about it rather than it's just continuing to form its base. Palanteer, depending on the macroeconomic environment, could experience another bid here even after the critics still continue to to call it very highly valued. Now, on top of what we're also seeing, Palunteer has earnings here less than a month. So, we're going to start to see some earnings trading that will bring more volatility within this individual stock. Things could get quite exciting. On top of that, some of the big news here, one of the big cascade events talking about the downstream effect and how this could really, really be a boost for the AI industry is Nvidia talking about their things at the CES event. And one of the big ones is their new AI chip and released the video of its next generation Reuben here, which is about five times, yes, that's five times more powerful than the predecessor, Blackwell. The new Reuben chips are already in production here. This is a Reuben pod which contains,52 GPUs and 16 racks. Each rack holds 72 Reubins to connect this all together into one huge super computer. So this is quite astonishing with how quick Nvidia is develop developing this. And we also see Nvidia talking about looking to work on a robo taxi type of roll out here in the near future. That'll be an interesting competitor with Tesla. I haven't done a full deep dive analysis on that. So, if you guys know more about that, let me know down in the comments, but nonetheless, Nvidia is just kind of hanging out here, not making big moves in the overnight hours. We see here at 18870, still at a pretty good spot where Nvidia sits at, and it's kind of right above its 50, but below its 200. If we get a nice push above that, that's where and especially if Nvidia can push past 190, that could be a nice bullish move. Now talking about the downstream effect right here. What stocks caught an incredible bid today? Those were the stocks that we've been talking about for a while now, especially with the recent selling pressure. We've been talking about things like Nebius, Cipher, Irene. Now I ext basically ex experienced a large reversal and a breakout type move today up over 13% uh currently at 4762. I mean this stock was just sitting at 37 and even hit low here the bottom of 33 before we saw a big move. Now Iren is making this kind of breakout moon move along with cipher right here. Cipher pushes up pretty well today. This opened up here if we can get to about right here at like 1640 something. So this came up basically about also 10% on the day just cooling off a little bit in the um actual overnight session right now but that's not bad above its 50 above its 200. Cipher and Iran both getting a ton of love along with AI data center stocks. Why this is a positive cascade effect. I mean Cipher and IN we know are both working on G um GPU compute with their AI data centers working to provide more uh wattage that will be essential especially for a Reuben that's going to be very energy demanding and on top of that you're having Iran working on energy how do we get more energy cuz that's also going to be the bottleneck now with this you're also seeing things like the neoclouds here Nius They're going to be the first to offer Nvidia's Reubins starting in 2026 across both the US and Europe this year. So Nvidia and especially with the other AI cloud compute platforms, NBUS here having an edge by being to offer the strongest and the best compute power regarding machine learning and Nbius is going to probably be experiencing a more volatile price action here. I predict here in the short term I think NBUS could easily recapture its 100 all depending on kind of the macroeconomic environment and especially with jobs data that'll be coming out giving us an indicator of the labor market but nonetheless NEAS is looking quite well too and let's talk about a large retail trendy stock that is currently experiencing a breakout right now and that is Zeta now Zeta right here is up 8% and even another 14% in the overnight hours. Now, what Zeta does and we've talked about with another type of stock path before UIP path is working on Agentic AI and we even see Jensen in the CES uh meeting today. Talk about Agentic AI as kind of the next big move and Agentic AI is predicted to be a top theme for 2026. What you have right here is Zeta is now partnering with Open AI. This was kind of uh as a predictor was kind of brewing up in the background. Some people were forecasting it. Now it's true. There's official confirmation here to power Athena. It's an AI marketing agent built for enterprise workflows. Now this move brings agentic answer-driven intelligence directly into marketing decision making. So now with this zeta you can see the downstream cascade effect that these large product reveals and it shows you here that the demand for AI is continuing to accelerate at a rapid pace. One cool thing that I like here from Ronnie uh V who is another content creator posted about this is looking at Zeta compares to Palunteer's revenue growth. Now this is quite astonishing looking at the percentage gain. You know this is very comparable and highly correlated to Palenteer's revenue growth. One thing though is Zeta is right now just trading at a $5 billion market cap compared to Palenteer that's now at a $414 billion market cap. So the type of exposure of course there's a lot of volatility and risk that comes with some of these smaller market cap stocks. But if they can execute right that risk can be rewarding. So we'll be keeping this on the radar talking about that. Let's get off the AI stocks here. How do the broader markets look? Well, we see here with the SPY in the index closing above here at 6,900. This is also quite bullish. We have some cool things running into 2026 right here. Wow. You see the market comes up about 64% and right now futures are relatively flat. Still just in the green a little bit here up about 82 cents on the spy. Like I said, as we're seeing a lot of buying pressure into these oil stocks right here, Chevron here surged 5.1% and was seen as the biggest beneficiary of its current presence with Venezuela. We know we see Exxon Mobile right here. Um, we see these other ones moving here. I'm not big into oil stocks that much or energy ETFs or anything like that. Um, I have more of a diversified kind of dividend portfolio looking into some of those more uh conservative type plays. But nonetheless, you're seeing a lot of momentum that's coming into these stocks. Um, you know, in terms of the market, what we're seeing, and I agree with the statement right here, focusing on putting money back to work after we saw tax loss harvesting at the end of the 2025 year. We did not get that Santa rally, doing portfolio realignments, and then buying back into these stocks early in 2026. I think that's what we're seeing right now, a positive rotation into more of the risk on type names. And especially as that triples on over here, crypto still holding above 90,000. Oh my gosh. And Ethereum above 3,000. Never thought I'd see these two cryptocurrencies hold above this level for more than uh 24 hours with the recent price action that we've seen. Uh but Bitcoin right here at 94,000 basically Ethereum at 3,200. How that relates here to BMR as we know um a digital asset treasury for Ethereum at 3322 also back above its 50. So, you know, across the board and some of the Bitcoin digital asset treasuries are doing very well today like ASST is a big one. Strive. So, lots of buying pressure. Will this continue in tomorrow? It most definitely could. We see a lot of acceleration, good charts across the board on a technical perspective. I like the bullish move that we're seeing in the short term. The only thing that I think that we could get with volatility, especially with the VIX that is still kind of up, is all of a sudden we get some macroeconomic data that makes the market take a little bit of a breather. That could come out Friday. We're supposed to get a jobs report. So, we'll see what happens. And we'll see what happens on Tuesday. Let me know what you think down in the comments. Peace out. Take care."
    }
]