[
    {
        "video_id": "ZZyjqbcFRKQ",
        "title": "The Viral $300k Chart Just Proved Me Wrong? (Livermore)",
        "published_at": "2026-01-06T12:28:45Z",
        "sort_date": "2026-01-06",
        "url": "https://www.youtube.com/watch?v=ZZyjqbcFRKQ",
        "transcript": "Hey guys, I have many requests to cover this chart, the so-called Livermore chart, which Bitcoin seems to be mimicking right now. Basically, you have a series of higher highs and higher lows before a massive explosion into big big numbers to approximately 300K for Bitcoin. And this chart right now is quite popular. I see it on Twitter all the time, especially yesterday. I mean, this is another Twitter that is sharing it. And here is a third Twitter that is sharing it. So the whole crypto Twitter has discovered the Livermore charts. And of course people are asking me, hey Ivan, should we now be mega bullish? Is it time to go all in Bitcoin right now due to this magical magical chart? And the big question is of course should I fire Mr. Barra? Should I break up with Mr. Barra or is our relationship just starting? Well, ladies and gentlemen, let's talk about it. Smash up the like, subscribe, and grab a coffee and let's go. First and foremost, let's try drawing the pattern ourselves so we can ensure that it's valid. So you have 1 2 3 4 5 6 7 and next should be eight and then nine and then all the way to 300K. So we can clearly see that it does line up with the liver more chart and now the question is how can we use it? Can you trade based on this? And my answer to that is no. Currently we cannot trade based on this pattern but in the future it may be useful. Let me explain. So as you can see the pattern consists of two parts. First it is this megaphone pattern or broadening wedge and then it is this breakout and massive massive massive blowoff top. And currently we're still in the megaphone pattern. And before we break out to the upside from the megaphone pattern, this pattern is not useful as a whole. This whole liver more for me at least is not useful because the megaphone pattern can break down just as likely as it may break up. In fact, if you draw this line slightly differently at a bit different angle, if you draw it like this, suddenly it kind of looks like this megaphone is already breaking down. And suddenly the illusion breaks. The illusion of perfect pattern, perfect symmetry, perfect 1 2 3 4 5 6 7 and then breakout is no longer that perfect. As soon as you start digging a bit deeper in all of the patterns, you understand that they're way more difficult to trade and way more complex than they initially seem. That's why personally I rely on the trend and the trend is currently bearish for Bitcoin. And the general problem with patterns is it's very hard to trade based on them because you don't know exactly how to enter your position, how to exit, how to do position size and so on so forth. Meanwhile, when you have the trend bullish bearish here, you can take action when you have the moving average such as the 50, you can take action based on it. So you need more exactness so you can have discipline and you can have repeatable strategies that give you an edge. And if you want to learn more, go to bullmaya.com and watch this free video where I talk a lot about this because just like this screenshot says, look here. I would draw the trend lines and still get wrecked. I would draw the support and resistance and still get right because this is what everyone is told, but no one can really make money from it because they're not useful. You need to use the mechanical rules instead. So watch the free video here on bullmay.com, link in description. But to get back to the discussion, so patterns, we concluded that they're not really useful to trade, but they have a use. They do indeed have a use, and that's that it's a confirmation in case the trend is bullish and that you have the ambiguities removed. In this case, if the Bitcoin pumps like this bum bum bum and then starts breaking from this wedge megaphone pattern, then this starts to become a bit more useful just as a possibility how high Bitcoin will go. So this is not the first grade signal. First grade signal is the trend. It's not even the second grade signal. It's like the third grade signal that would make me super confident if the trend is bullish and we're breaking out from the megaphone. And then you can see, hey, actually there is Livermore pattern and it kind of lines up pretty exact and trend is bullish and we have everything else in in check. So could it be Livermore? Maybe, maybe, maybe, maybe not. We're still going to follow the trend. If this thing turns bearish at 8, we're not going to wait for 0.9 or 10. We're going to follow the trend. But, you know, maybe this, maybe that. It's a bit of, you know, infotainment how high something could go. And what's interesting is that in the last bare market, approximately a month or so after the peak, people also discussed the Livermore pattern. So somewhere here in December 2021 if you looked on Twitter and also Kevin Swenson here four years ago during that time let's see this is also from December uh he also discussed that hey potentially there is some liver Liverpool liver not Liverpool Livermore Livermore Livermore going out going on and yeah then he tried to apply to to Bitcoin and obviously did not play out by the way big shout out to Kevin Senson it was one of the one of the theories I'm not saying that he bet the form on it he's amazing you should go and you should subscribe but it is interesting that we're in a similar situ situation and people are pulling out Livermore, not Liverpool and are betting on it yet again. And I can really understand the reason because the current structure looks very much like the last bare market when it started. We had a double top here with a higher high. We had a double top here with a higher high. Many people uh right here were hoping that we would have a repetition of what happened right here, just like many people right here hope that we have a repetition of what happened right here. And by the way, another interesting thing is that you see here we bounced on this downward sloping bottom right here. And here we did not bounce because this one was upward sloping. And the same thing is here. Here it was downward sloping and now it is upward sloping. By the way, this bottom here also was a bit downward sloping like this. So this also interesting that the bottoms in all of these cases actually happened on a downward sloping. Uh and when it comes to this upward up upward one, it was a fake out and now we we'll see if it's a fake out or not. But uh people are pulling out Livermore, that's for sure. Uh because it starts to look a bit like it just like here we're kind of bouncing. Now we're kind of bouncing. So obviously a lot of hope is coming back into the market. In the short term, we have a very interesting Bitcoin setup right here where it is trying to break above this resistance at approximately 94.3 94.4. And if we can do that, then the next resistance is here at the 50week moving average. So you have an 8% gain. And 8% may not seem like a lot, but at the same time, if you use exchanges that I use, which you can find in the link below and then you sign up for buy bit and you get the bonus here, fantastic freebies or bit unix also big freebie or wigs big freebie. I mean all of them have big big freebie. But there of course you can use leverage and then suddenly 8% can become double or triple as much. Of course, you have to manage risk. You have to ensure that you know what you're doing. But all in all, in this choppy market, in this bearish overall market, there are opportunities to long because you have relief rallies, you have short-term pumps. And as long as you do it correctly, this is how currently money is made. When you have some kind of relief or rejection, I mean, another trade will be here. If we see that it starts to reject, then of course it's going to be another trade. But now you can take a short to the downside. So all in all, be nimble, be adaptable, and trade the market that you have in front of you, not the market that you want, which is, as you know, something that Ben Cowan said. I really love that saying. Now, speaking about Ben, he showed something very interesting in his recent video, and that's that the current yearly gain, basically the gain since the beginning of the year, since beginning of 2026, just a few days, it is uh basically on par with the average gain in midterm years, basically the years after the peak. Because currently there's a lot of excitement on Twitter and so forth that Bitcoin is pumping a lot like 3%. Uh but all in all if you compare it to let's say 2018 which is this pink chart right here 2018 actually pumped even more. I mean you see here it pumped even more. It pumped like 20%. Uh 2014 also pumped even more. And in both of these cases, of course, the it came back down, especially when you look later into the year. I mean, here both the 2014, which is the green one, and 2018, which is the pink one, went down. Um, and the only exception to this uh rule is that in 2022, we did start to dump quite instantly. And so if you take an average of this midterm years, it is now this yellow line. Then it's kind of like what we've seen actually a bit lower pump. Now we see a bit lower pump than normal uh in the post peak in the midterm year. So anyway, quite interesting data and uh that's something to keep in mind as we continue into this midterm year because that's how they normally look guys. I mean, I'm not making I mean, that's how they normally look. Okay. Whoop. That's how they normally look. So, of course, cars are stacked against you if you're not prepared for this. The point here is not to try to predict what's going to happen. It's to be prepared for any scenario. And cars are stacked against you if you're blindly believing in deliver. Big shout out to Delivermore. Now, let's see some more trade ideas for the short term. And the way to do it is that you go to Bulmania. If you're not part of Bullmania, then see the free video below to join. their instructions how to get the software. But all in all, we see the recent daily flips. So this is for the short term short-term trades. ETH recently flipped bullish on the daily. If we open it up, we see that yes indeed on the daily it is bullish. And you have a trade here with a potential upside to this peak which is likely going to be resistance. That's 6%. If we break that, then this peak right here 12%. So all in all if you use exchanges if you use uh with leverage it's going to be more but you need to manage risk. So just keep it in mind. Whenever I say percent just always think that you can use exchanges such as buy bit uniques and so on so forth to get more and if you link below you get the nice signup bonuses. Next you have both BNB and Sana bullish now as well on the daily time frame. So for BNB, what is good for for BNB is that we had quite a long bare trend ever since October and normally the bull trends are a bit longer if the bare trend was long as well. And for BNB you have a potential resistance all the way here 12% from here. So that could be a good setup. I would just wait for us to clear uh this high which is just a few percent before entering. I would just wait for us to be above it. Uh it will it would improve your odds a bit but you could enter now also. Um, next you have Sana. Let's see what we have here. Sana also now bullish after a long bare trend. This is good. This is good. This actually good. Um, the same here. We have some highs here which if you want to improve your odds, I would just wait for us to clear them. But you could enter now also. I mean, as long as you have the stop loss uh at the bare flip, you're good. But um you could improve your odds even more if you wait above. Uh but all in all you have a good setup here approximately 23%. 23% towards this this highs. I mean that's that's very very possible for Solana. And sometimes you have to see these trends very quickly. So that's why if you have the software you can see when they flip before I make a video. For example, Swiftcoin is already up 24% since one day ago when flip bullish. ZK swing 18% since a day ago when flip bullish. Then you have Bora. You have this AI companion deep book. Fantastic fantastic gains. And even the small ones, again, if it's just 7, 8%, it is actually way more if you use exchanges like I told you. So even the small percentages, don't look at them as small. All of the trade ideas we talk about, they can actually be amplified if you know what you're doing. Now guys, what's crazy is that some stocks are pumping like hell as well. As soon as they flip bullish, holy crap, this thing from Malaysia, I don't even know where it is, but it's up 92%. This thing from Singapore, what's happening in Singapore and Malaysia? I mean, they have some crazy pumps. I can tell you that. And we're monitoring all of them, guys. We just added all the stocks. Malaysia, Singapore, like all countries we've added to Bulbane. You see all the countries here. Freaking Nigeria. What's was in Nigeria? Nothing. Okay. Well, nothing bullish lately. Let's see what's actually there. There's one stock. Okay, it is bullish since a month ago up even Nigeria up 23%. Big shout out to Isaac who is watching from Nigeria. Big big shout out. But I it is quite insane when you when you think about it because we have not too many altcoin traders. Where are altcoin traders? In precious metals and in freaking Malaysia. Okay, so that's with the stocks. We al we also added this mag 7 mag 7 category for uh stock market because you can kind of see here what's happening with um with the overall stock market by just looking at these companies because as you can see they have 25 trillion market cap just seven companies here and all companies altogether have approximately 90 so it's a third of the whole stock market just these seven companies so keep an eye on them when they are starting to flip bearish on the weekly for the whole stock market is going to be No bueno. Uh if they're super bullish like now, I mean a lot of them are super super bullish. Uh you look here, Alphabet, Google 82% since the flip 6 months ago. You have Nvidia or actually 80% or 82 depending on which stock class. Nvidia 45, Tesla 42. Fantastic. So as long as it continues, stock market is likely to continue to the upside. Then commodities here very similar. We added the precious metals uh category. So you can only see the precious metals because the difference between precious metals and everything else is quite massive. I mean oil, gas, now you see big mega dump after the Venezuela Maduro capture because the US is going to be pushing the prices down. Okay, big big time. Um, and so if you look at all of the commodities, you don't get the same picture as if you only look at precious metals in terms of how many% are bullish, how many% are bearish. Precious metals are in the class of their own, kind of like mag seven, this is mag four of commodities. And then all commodities which are more consumable. You can argue that silver and palisium like it's also consumable but you know it's not like oil. It's not like oil where you literally burn it up and and you have to get more. So that's why we have different classes. And all in all I think the biggest lesson from last year is that we should have tracked this way closer all the commodities but we didn't have all the software in place. We got the software just in the second half of the year and then the focus was on mitigating the dump which we successfully did. So, I think we still did fantastic. But all in all, now that we have all of the overviews, I find it so fantastic that we can now talk about everything, adapt to everything. We are now investors, not only in crypto, we're investors in whatever pumps. I mean, that's the best. Crypto pumps were there, uh, robotics were there, artificial intelligence were there. I mean, whatever pumps were there. That's the essence of bull mania. It should be bullish. Your portfolio should be going up. You should not be holding down like Murad coins that are down 8 99%. You know, believe in something. You're believing. You're believing. You're losing. You're losing. You're losing. You have to do a,000% gain to get back to break even. It's not what we do here. No, no, no, no, no, no, no, no, no. We have stocks, we have crypto, we have commodities. We are modern investors, all around investors. And that's the best guys. I hope you enjoyed. Let me know if you love it. Let me know if you like it. Let me know if you hate the video. If you hate the video, let me know. Also, let me know everything in the comment section. Smash it up, subscribe, share with everyone who needs to see this. If your uncle loves deliver more, he needs to see this. Everyone who spreads deliver more, link them to this video, link it on Twitter, spread it so more people see it, the audience grows, which is our KPI. So, we need to grow the audience so people learn trading properly about Bitcoin properly. And with that being said, see you guys tomorrow. Have a good day and goodbye, guys. Goodbye. Goodbye. Goodbye."
    }
]