[
    {
        "video_id": "xaJ8k0WP_os",
        "title": "Benjamin Cowen Might Be Missing Something Big…",
        "published_at": "2025-12-07T15:00:42.000Z",
        "sort_date": "2025-12-07",
        "url": "https://www.youtube.com/watch?v=xaJ8k0WP_os",
        "views": 31803,
        "duration": "00:16:11",
        "transcript": "Oh yes guys, today we're discussing whether we are in a 2019 style bare market just like Benjamin Cowan is discussing on his YouTube because as you can see we are currently in a bearish trend on the money line and and this peak right here was a peak where not too much retail was in the market. when you look at YouTube subscribers, when you look at engagement in social media, when you look at subscribers to exchanges on Twitter, how many followers exchanges have um we haven't seen a repeat of 2021 or 2017 type cycle. And that's why Benjamin Cowan in his video is saying that we are likely repeating something like 2019 where we had this top right here and this top right here was based on apathy. No one really cared about crypto and despite the apathy, despite no one caring about crypto, somehow crypto still mastered this crazy run right here in 2019 and then we had a bit of a bear and then the real bull market started afterwards. So the question is how valid is this? Because this has some big implications on the projections for next year because if we see a bare market like this, it would be very short and Benjamin Cowan specifically says that he ignores this dip right here because this was an anomaly. This was the COVID dump. It was an anomaly. And before I talk about what I agree with and what I disagree with, let me just tell you that I really appreciate his videos and his channel is very, very good. So, go and subscribe if you haven't yet. And also, if you're coming from Benjamin's channel, big big welcome to you and I hope to provide a few more pieces of perspective that will fill important gaps in your understanding of the market and most importantly your execution of the market. Because in our trading community, I do have people every day that come and they watched Benjamin's videos. And while they're great and these people normally they know all about micro, they know all of the M2, global M2, ISM, they know all about the NASDAQ chart from 1997 and how it applies to today. So they know all of this theoretical knowledge. The problem they have and what they're lacking is execution. For example, when I ask them, so based on everything you've seen on YouTube across different channels, have you derisked from the October 8th top? And they say no. Oh, and if you've been watching our channel, you have the risk. Or let's say that uh uh people have been expecting ETH to go to 5.3K after watching Benjamin. Obviously, that did not happen. It was a good theory that could have happened, but it's all about execution. How do you adjust your portfolio? How much money do you put in given all of the different scenarios given the risk, given the fact that Bitcoin is going down? And many of them said, \"Yes, I did take the trade.\" And I when I asked them what what was your stop loss, what was your position size? They have no clue. So I hope to add a bit of practical practical knowledge about how to actually trade based on what's being said. So it's not only just theoretical a lot of charts a lot of this a lot of that but actually how do you manage the portfolio based on the analysis. So before we speak about the 2019 scenario let me just recap our execution up until today. So as you remember in 2023 right here when the trend turned bullish we went super super super heavily all in Bitcoin. Okay, this is very very important. Why is it important? Because we didn't predict it. We didn't have a crystal orb. We didn't say that you know somehow we see the future here. We just saw that the trend flipped and as you know the trend is your friend. Whenever you want to know where the market is going, you have to look at the current trend. So, as soon as the bare trend turn into the bull trend, that was the biggest signal for us to go heavy into Bitcoin because we know that we have a very good setup here where likely Bitcoin is going to go up a lot, a lot lot a lot because we just had a big bare trend and it ended and now we have a massive bull trend. And ever since we've been bullish, bullish, bullish, all of these different dips, we've been buying, buying, buying, buying, buying all the way until October 8th, which was right around here. Why? Because Bitcoin did a fake alltime high. and fake alltime high. We said it's very very much like the 2021 situation. And then on the daily we went into a bare trend very very quickly and this was the signal for us to start derisking. Then we derisk even more heavily after the bare flip on the weekly. And currently we are at approximately 30% allocation in Bitcoin and the rest is out of the market. And uh all in all we are waiting for the market to tell us where it wants to go. If we now look ahead and see where we're likely to end up in the coming weeks and quarters and months, uh we will be attracted like a magnet towards the 200E moving average right here and this thing goes up. So sooner or later we will have the magnetism towards it. Now before that of course we could have a relief rally let's say to the uh moving average here could happen but overall we will be attracted more and more towards this 200WE moving average. If we now look at what happened in 2019, you'll see that actually very similar things happen. Very similar things happen. We did go and we touched the 200E moving average. Now if you look at this whole move including the COVID dump, I would say that something like this could definitely repeat again and this would be a signal for us to start become bullish once we hit the 200E moving average and especially later once the bull trend really turns bullish because you can see this is the best signal in terms of riskreward because after this fle bullish it was you know big fat rocket up. Um so this is important to realize from the perspective of uh uh topping on apathy and then having some kind of 2019 repetition. Now as far as I understand Benjamin says that he doesn't really count this candle as part of the 2019 uh bare market because it was an anomaly and here is where I don't really agree from this perspective that we cannot count the covid dump because for one reason or another we did surgically touch 200 week moving average here. Let's say covid didn't happen. uh would we bleed just slowly to 200 week? I mean, who the hell knows? But all in all, the bears ran out of coins exactly at the 200E moving average just like they did right here or just like it did in the 2015 bare market right here. If you look at the recent bare market, what we saw was that we actually went below the 200E moving average. It was here in U 2022. We actually went below it. So just another argument that normally we go to 200 week moving average or even sometimes a bit below it. So it wouldn't be too crazy if we repeat something uh in this cycle as well. Now let's speak about apathy because Benjamin speaks about the fact that this top in 2025 and the top in 2019 were both so-called apathy tops meaning that you didn't have a lot of retail. Retail did not really subscribe to YouTubers. So YouTubers didn't get a lot of more subscribers. And the same thing is with Twitter. Twitter followers did not increase for the big Twitter accounts and exchanges. So that's how we define apathy. If we just look at Benjamin Kama's definition, at the same time, if you think back to 2019, what happened here? Do you remember what happened in March 2019? Do you remember what happened in May 2019 when this uh top right here was created? I mean, personally, I cannot think about many many things. I cannot think of many things that happened here. If you ask me, hey, Ivan, do you remember what happened in 2024 and 2025? Man, I can give you a lot. I can give you a lot. Trump did a memecoin rugpled. You had the president literally president of the United States doing memecoin rag pull. Melania first lady did a freaking meme coin also rock. You had the meme season. You had the craziness that took place with so much volume record-breaking volume on chain on Sana memes. So of course to say that what we just had is like 2019 you cannot really say that. It's obviously very very different. Yes. In terms of subscribers, in terms of followers, I would agree that this cycle hasn't been too crazy. But in terms of having a crazy greedfilled proy market, we did have that. Absolutely. Yes, Cardano did not pump. Yes, Avox did not pump. XRP did not do 100x. Iota did not do a millionx like in 2017. That did not happen. But did other things happen? Of course. And is it comparable to 2019? Absolutely not. Absolutely not. So, the cycle is unique. It's not comparable to 2021. It's also not comparable to 2019. It's totally different. And also imagine all of the different uh dots. Micro Strategy raising hundreds of billion. I mean, it's been crazy in terms of of frothiness in Wall Street as well. Black Rockck, Micro Strategy, all of the dots. Each altcoin had a dot a few weeks ago. You remember? So to say that we are just like 2019 and you compare this pump right here to 2019 and then you say we're going to have something similar. I don't think it's fully accurate. Obviously there are some similarities with for example YouTube followers not growing. Also another similarity is that QT is ending and maybe we're going to have Q soon but QT is ending just like in 2019. But as you can see it is not clearcut. The comparison is not clean. It's not a clearcut thing. And by the way, speaking about Micro Strategy and speaking about DATs, you know that many of them are kind of collapsing right now. Look at MetaPlanet. Unreal SPL is minus 500 million. Micro Strategy has been saying for the longest time ever that they will never sell Bitcoin. Sailor has been yelling, I will never ever ever sell Bitcoin. Now he's coming out saying that they may have to sell Bitcoin to service the debt to pay dividends and so on so forth. So this is very important to realize that when you have greed in the market, new weaknesses are being created. For example, in the last bull market, we had a lot of greed and we had Celsius, we had block five, we had the whole FCX thing. So when there is froth, when there is frothiness, greed, you have new weaknesses and they have to be flashed in the bear. Did we have any of that in 2019? Of course not. In 2019, we didn't have any super greed. We didn't have a lot of new weaknesses introduced, which we did have in my opinion this cycle. And that's why I also think that this move down, this bear like is not going to be the same as in 2019. Instead, we have to flush the weaknesses in one way or another. You look at the all of the dots again, each and every altcoin had its own dot a few weeks ago. How they going to survive the coming months? We have to see. But the market will chase the weak lamps, you know, in the the weak gazels. Just like in the Lion King, you have the lion, you have weak gazelle. The market sees that the market is going to come after them. 2019, we didn't have that. So guys, as you can see, we can be here all day, all night speaking about that this is a similarity. This is not a similarity. This is the same. This is not the same. If we copy the NASDAQ chart from 1997, we overlay it. It looks the same. But NASDAQ chart from 1989 is Listen, we can be here all day, all night. The question is what are the practical moves and how do we see the current market in all of this context and what do we do? As you know, especially you've been watching this channel, we never try to predict anything. You don't want to try to we never have predicted. I mean, imagine this. We never have predicted anything and yet despite not trying to predict look here we bought early 2023 held all the way started exit on October 8th when daily trend turned bearish and then accelerated profit taking when we were below 50 week and then when we went below the money line bearish on the weekly I mean it's perfect execution we've had perfect execution not trying to predict anything because at the end of the day no one knows what's going to happen of course we can see a repetition of this and that but likely it's not going to repeat likely is going to be something new. And as you know, cycles, they are similar, but they're never the same. History rhymes, but uh it's never exactly repeating. It doesn't repeat, but it rhymes. So, all in all, you cannot put your trading portfolio in the hands of all of these scenarios and all of the speculation. You don't know, no one knows. Have a trading strategy which actually keeps you in the long bull trends like this one from 2023 all the way to the peak and then removes you from big downtrend. So what am I doing practically? What am I doing practically? Practically we're waiting for the trend to turn bullish and likely likely if I'm if I have to guess let's say I have gun to my head I have to guess likely we will go down here to the 200E moving average which is by the way also what we did in 2019. If we don't ignore the COVID dump that is my only thing that I disagree with with Benjamin because I believe he said that he ignores the COVID dump which took us to 200E moving average. If we go to 200E moving average, it's going to be a very very good signal that the riskreward is way better to be more bullish. And then once we also feel bullish on the money line, it's going to be the final and most important signal to go heavy heavy heavy bull. And guys, here's the best part and I almost don't want to say it because I sound cocky, but it's true. I'm very humble really. But the best part is that even if I'm wrong about this move down and we just explode to the upside right now, I will still be more successful than you in trading. I will make more money than you. I will be more profitable than you. And I am saying that from a place of love because I've been exactly where you are. You're told support resistance. You try to follow support resistance, you get wrecked, nothing breaks out like you want. But let me explain to you why I will be more profitable and also teach you how you can become the same. So as you can see, you see very interesting thing. Let's say that I'm fully wrong. We're not we don't go down. We just explode to $1 million like 150k, 200k. We just go up from here. You see something interesting? Bitcoin will flip bullish on 120K right now which is below the price at which we started to derisk on October 8th. Okay. So even if we go all the way up here and we just moon and moon and moon this will be my signal to turn bullish again and I can buy it all back even below the price at which we started to derisk. So even if we're wrong we are in a very good spot. We're not going to miss the move to 1 million. And this is how trading should be done guys. Trading is not that you make a mistake and you suffer the consequences. Not at all. Trading is that you have a weaker chart, you adapt your portfolio, you become more and more and more conservative, you have a strong chart, you adapt the portfolio, you become more and more and more risk on. That's it. If it goes against you, well, you have the the other side, you have the other signal. Let's say you're bullish, but it turned out to be bearish. Okay, you adapt. You're still okay. You still ride the big trend to whatever side that the trend is in. Following the trend and not predicting is the most important lesson you can take from this whole video. If there's one single thing you can learn. Just follow the trend. I don't know what's going to happen. No one knows. But I know if a trend is bearish, it likely will continue be bearish. And if a trend is bullish, it likely will continue to be bullish. And once it flips, we flip. That's it. Being a bull or a bear is not an identity. Some people confuse their stance in the market with their identity. They're like, I'm a bull. I'm a bull. It's part of who I am. But then when people see me navigating the market kind of perfectly, I mean again I'm very humble but we did the risk on October 8th. It's perfect. It's as perfect as it gets. And we and we got super bullish on January 2023. So when they see me navigating, they get angry when they switch the direction. I remember in 2023 people were angry at me for being bullish. They said we're going to go down because if you remember 2023, it was right after the FTX collapse. Exactly right after the FTX collapse. FTX collapsed right here. Uh right here uh this was the collapse and then it sorry this was the collapse here. November this was the collapse and we turned bullish here in January. So November was the collapse. January was was the bull trend. And of course when I said that I'm bullish. Many people were so angry because some of them just capitulated here. They held the whole bear. Even though we said don't hold in a bear, they still held the whole bear. They just capitulated. And now Ivan turned bullish. Of course it's annoying as hell. People didn't want to hear it. And the same thing is here. People don't want to hear that I'm bearish either. So they're confused. Ivan, but you were just bullish. How you're bearish. Or you were just bearish. How you bullish? Listen, your stance in the market is not your identity. So guys, hope that makes sense. Basically, we follow the trend. We don't try to predict because nothing is the same. Nothing is different either. Like it's all it's all kind of the same, kind of not the same as always. So the it's not it's not important. Even what's important is what do you do with information. If you want to learn more about my system of trading, use the link below. Watch the free training here about the mechanical rules. What I described to you here is really part of the mechanical rules uh playbook that we have. It's fully free training. Watch the link below. Big shout out to Benjamin. Subscribe to Benjamin Khan and see you all very very soon. Have a good day. Subscribe and goodbye."
    }
]