[
    {
        "video_id": "hQQo3vuBuCU",
        "title": "BITCOIN AND ALTCOINS: SAYLOR GETTING NERVOUS!!!! 🚨🚨🚨 (truth)",
        "published_at": "2026-02-12T10:23:50Z",
        "sort_date": "2026-02-12",
        "url": "https://www.youtube.com/watch?v=hQQo3vuBuCU",
        "transcript": "Yes guys, welcome to another episode. And as you can see right now, Bitcoin is still showing a lot of weakness, a lot a lot of weakness on the chart. The chart basically tells us that it wants to go into the buy zone. And here is where we DCA slowly. And once we go to bull trend, we da fast. So all in all, nothing has changed. The same as yesterday, the same as two days ago, we've been spot on calling this pump as dangerous and not to be trusted. You remember here on Monday we said it on Tuesday I mean every day basically said do not trust this pump. But guys now we have a bit of news because Sailor just did an interview where he was super nervous for the first time ever. Sailor seemed to be a bit nervous not really appreciating the question and saying things that if you've been in finance a bit if you understand at least business and how financing works will make you raise your eyebrows. Listen to this. He get asked he get asked what's going to happen if Bitcoin keeps falling and how will Micro Strategy handle the big fat debt they have because they I mean they are one of the biggest debt holders in the world soon. So listen to this. >> If Bitcoin falls 90% for the next four years will refinance the debt. >> You refinance where Michael? >> We'll just roll it forward. I mean again, >> but you you you think banks would lend to you at that point. >> Yeah. Because because the volatility of Bitcoin is such that it's always going to be value. Look, you're at 68,000 right now. Literally has to fall to 8,000. Then we just refinance the debt. If you think it's going to zero, then we'll deal with that. But I don't think it's going to zero. And I don't think it's going to 8,000 either. But the credit risk is dimminimous at this point. we just refine this. Maybe he will refine us, maybe not. But this is kind of an environment where there are many sharks in the market. When you see him being a bit nervous that if it goes to 8K and it stays there for prolong prolonged period of time, they are basically facing bankruptcy at that point. Yes, they can try to refine us, but it's not a guarantee. It's never a guarantee. And that's kind of what this uh CNBC is calling him out for. Like you're saying you're going to roll over? You're just going to refine us? How you going to refine us, man? And also the interesting thing is that most likely the uh common stockholders are going to get wrecked way before the company goes bankrupt because what he's discussing here is a scenario in which you have bankruptcy. Basically you have debt you cannot service that debt you cannot pay it back. So you have to restructure you have to like really change what the company is either bankruptcy or restructuring. But the thing is way before that happens the common shareholders will lose all their money way faster. Why is that? Because in a bankruptcy you have different types of shares. You have preferential shares. He wants to issue more pref shares by the way uh within the coming um weeks and months. And then you have the common shares and it's not always the fact that they have the same value. I mean sometimes you have uh prep shares being the first ones to receive all of the assets from the company and then if there are any assets left for the remaining guys for the common stock then they get to share the rest. So obviously the value of a common share versus a pref share is very very different. So this guy has done a bit of analysis uh looking at how much Bitcoin has to fall before uh before um the the common shares go to zero and it's way way faster. I mean basically they're toasted below 33. I haven't double checked it in in detail whether it's 33 or 30. But the key conclusion here guys is that if you are in micro strategy I don't understand the risk you're taking. I mean really what what what's the reason? It is quite a complex company with a lot of different debt instruments. So yet again we've been saying it for months and months and months. I don't want to have micro strategy. I don't understand the risk. And really what is the benefit? Because if you want more upside you can go long. You can go long with leverage. We have it in our community all the time. People going long, people going short. If you want to outperform Bitcoin there there are easier ways where you understand the full risk. And also now that we do see the flashing the flashing in the old coins we have from our community very very nice shorting. So, uh, this guy shorted Hype. This guy shorted Trump. I think it is the Mooncat that did both of them. This guy went loco on my Then you have Johnny John going and shorting Sana. Sana. Nice. Nice gain. Uh, Poop the Pero. Someone said to me what it means in Spanish. Now I understand also. But listen, he may be called like this, but he's up 500% shorting the MX as well. And so on and so forth. So currently guys, the shorterters still are in control. I look at our community, whatever gains they're posting, it's still short short. So the the the playbook is currently that whatever happens is going to come down. The gravity is going to pull it down. And a good example here is Uni. So basically, Black Rockck came out and said that they will be integrating with unis swap. They're going to basically be working very very tightly with unis swap. This was yesterday. This was a massive thing, massive, massive thing that Black Rockck came out and said, \"We're working with unis swap, you know, we're going to build an institutional products on unis swap and so forth.\" And look at what happened to the chart. Black rock partnership happened. You had pump and then retraction. And then another event which was quite big here in late 2025 was that they um they enabled fees that that they that they will now collect fees for their token holders. Meaning that token holders will now get passive income. You see pump and then retraction of the pump and so here you had the news of the fees not that they got activated but the news the same thing the news hit and dump down. So what happens here is that this these people they are discovering mechanical rules and the meaning of the bare trend in real time. They are discovering the meaning of the bare trend in real time. Meaning that whatever happens whatever good news you have is still going to dump. The good news don't help you in a bare trend. That's why when people are yelling fundamentals, fundamentals, fundamentals, we just look at the chart and we tell them listen, it's a bare trend. Whatever fundamental you have, you literally see yourself. And I I see the frustration. You see, biggest asset manager in the world is partnered with unis swap. And this is the chart reaction. What? It's unfair. It is unfair. In 2021, we would insta rip. Yeah, exactly. Because it was a bull market. It's a bull trend. Uh it was a bull trend. Now it's a bare market. It's a bare trend. So no matter what news you have, it will not matter. The only exception is bad news. If you have bad news, you're going to flash. You're going to flash even harder. So based on what we're seeing in our community and also based on what we're seeing in the news, the current direction is short. And that's how you can make money in this market. You don't have to be in pain. You don't have to pray to God that it doesn't dump more. You can use this to your advantage. How do you do it? You go to bullmania.com/partners. There is a link in the description called bullmania.com/partners. It's I also write exchanges I use. Exchanges I use. Click it. You're going to come to this page. You can go long, you can go short on Bybit. You can get a big fat signup bonus doing that. Pioneex the same thing. Uh Bitunix is the same thing. And with Bybit especially, pay attention here. They're going to have a bank account soon. You can have your bank account inside Bybit and you can have crypto trading inside Bybit. So you can have your whole financial life in Bybit. Why is it good? because you don't have to explain to your bank why the hell you do a transfer to a crypto exchange. That's the best. If you can get everything in there, you can instantly swap your fiat to crypto and then withdraw to self-custody if you want or trade if you want. Whatever you you want, you can do it. So, personally, I'm very excited for this kind of stuff when you have banking and crypto merged. So, you don't have to explain yourself. You don't have to be like feeling like a criminal. Now, looking at the overall situation with Bitcoin, let's see the performance. How are we doing year to date versus other midterm years because the similarity was crazy just uh we checked a few days ago and it is currently still quite crazy as well looking at the average we are basically where the average midterm year is. I mean it is quite insane. So all in all if we follow something like this we would see another leg down quite soon within the coming two weeks or so. Then a bit of a bounce maybe until March Mar end of March some kind of bounce. I mean you see most of the midterm years they actually have a bounce here in March. You see boop boop boop. If you take the average a bounce should be in March. Will it be like this? I mean who the hell knows? But uh if it happens you know why. You know why? And not to open the champagne too early because then a few weeks later we do another low. Okay that's very important. And for us, whatever happens, if we are within the buy zone, it means slow DCA. So, I actually want to send a bit of, you know, encouraging message, encouraging message that um we're still going to beep in this choppy choppy bear for the coming months and probably quarters, but not forever. And until the end of 2026, we should be in a good position to start next uh next leg up. Now I guess in terms of micro strategy just one more thing they are planning to issue more preferred stock uh to fund Bitcoin buys. So just keep that in mind. The more preferred stock is issued the the you know the more worthless the common stock is in case there is uh a problem uh and in case there is a condition where they have to distribute company assets. So yeah uh strategy C of Fong Lee says the company is moving away from issuing and selling common stock because no one wants to buy it. No one wants to buy common stock. They understand that they are in a very bad position if you if they hel hold common stock. Uh I mean the financeers are not dumb and uh um yeah instead likely it's going to be preferred stock sales which basically means that it's a bit better stock that in case everything goes to uh to [ __ ] to speak bluntly that if you have the preferred stock you will be paid first in case there's a bankruptcy whatever bitcoin micro strategy has preferred stock is going to get that first and then common stock whatever is left uh that's that's going to be to them. Um so that's that. Next, you have uh a situation where AI is going to come alive on the blockchain with the recent ETH ETH updates that we will be discussing and also Coinbase. So, oh, by the way, before before AI, I just have to cover this. Tom Lee is saying we're going to have a V-shaped recovery yet again. He's saying the bottom is very close, very close. And um investors should be thinking about opportunities instead of selling. I love Tom Lee. This is the motivation I want to see. This is the motivation I want to see in my daily life. Tom Lee, head of research at Funstrat says he expects ETH to rebound quickly following recent declines. I remember a few months ago he said uh Bitcoin has sorry ETH has bottomed at 2.4K. 2.4K. He's at 2.4K. We've bottom. Now he's saying uh at 1.8K 8K with with bottom and before that he was saying that we're going to go to alltime high in January for ETH. Okay, so from alltime high to 2.4K bottom now 1.8 for sure for sure. For sure, guys. Bottom and thing is I mean at some point he's going to be right. But again, what's the point of ETH is down 80%. What's the point? I mean if it goes to 1K it is down 80%. So yeah, it's I mean it's so worthless. But in the bull market he's going to be correct. So we're going to be following him. He's saying a lot of people are frustrated, but keep in mind that ETH since 2018 has fallen more than 50% eight time. But bro, you were saying alltime high. You were saying alltime high. You were saying new high in January. Why didn't you sell tell this in um in December when you were saying that in Jan we're going to go to alltime high. Now he's saying guys remember that it fell 50% or more. Eight times. Eight times. But you you listen to the dude in in December in November what he was he he didn't mention that now that it falls guys oh you know it's part of the plan but remember it has fallen 50%. Well I mean what are you speaking about and then people ask him hey Tom you have such a crazy crazy loss in your company and then he says but listen I'm just like an index fund for ETH. You don't blame SNP when it when the S&P dumps. You don't blame So why do you blame me when ETH dumps? Because Bitmine was just like S&P for ETH. But bro, YOU WERE SHILLING THE CRAP OUT of it. Like the reason why people bought Bitmine and and your your idea is because they wanted fast gain. You said in November that in January, February, we're going to go to 10K 20K for ETH. That's why they bought man. If they wanted the passive holding of ETH, they can just buy ETH. They can put it in staking. Okay. Great. I mean, you see this is the problem with this fundamental guys. Their narrative always changes. Their narrative is all always elastic. They're always fully correct no matter what happens because they just, you know, they they switch the narrative slightly. And now fundamentals are fully correct again. Instead, chart chart chart bare trend, bare trend, bull trend, bull. I mean, just look at the freaking chart. Um, I mean, I hope you understand, but I see yourself. It's um it's quite insane. If you trade based on this uh based on the statements, uh you're you're s. So he's saying that last year ETH fell 64% from January to March but eight out of eight times ETH has had a V-shaped bottom. So it has recovered 100% of the time within almost the same speed that I mean let's see guys I mean some point it's going to be correct but I mean what does it matter if if you lost like almost 70% of your portfolio and uh you know it's last year it was 64 maybe this time it is 80. What's the point? It's not what people signed up for. It's not what people signed up for. And some people wanted I mean listen some people they sign up for fast gain but now they convince themselves that they're long-term holder and that's the worst thing you can do because you don't follow your plan. You gaslight yourself into a position you Yeah. So it's very bad but anyway we think ETH is really close to a bottom edge and I think it's just like the fall of 2018 fall of 2022. Well yeah I mean this was the end of the bear. Fall of 2022 was the was the end of the bear. So we fall of 2026 is if you look at the timing it's kind of like fall of 2022 uh April 2025 you don't really have to worry about the bottom if you already seen a decline you should be thinking about opportunity if you're already wrecked don't worry selling basically all prices on coin tank to 1.7K on February 6 just short of the 2025 low of just over uh 1.4k 4K. So guys, let's see. I mean, that's the problem with fundamental guys because it it is going to pump at some point and they're going to say, \"Look, I was right. I was right.\" Just like with the business cycle. I mean, it's a very big problem. And then their followers are wrecked. They have a miserable life because they are depressed. They wanted fast gain. Instead, they have this hell, five months, 6 months, one year of hell. Uh, and that's the beauty of the mechanical rules. You never lose big. You always have discipline. you you capture the upside without capturing the downside. The downside is always small because you get stopped out. So if you want to learn properly, go to bulln.com, sign up and learn. Next, you have uh Coinbase betting betting on autonomous AI as agent agentic wallets go live. So apparently now Coinbase has a wallet where AIs can go nuts. Um I mean not really sure what that what that means to be fair. H have some of you guys tested this because you don't need a specific wallet for AI to do a transfer man. I you can just AI can can assign a signature itself but anyway they have some agentic wallet maybe for the user that user can chat with the agent. I mean let's say uh I would say for most people it's a bit a bit too risky because AI is as you know probabilistic. I mean can you be 100% sure that it does correctly? Not really. So for financial stuff, I'm not really okay with using uh a aentic at this point. For many other things, I love AI, but for finance, man, let me enter the exact amount and click send myself. Um maybe in the near future, it's going to be great. Uh maybe it's great already, but I mean for me, I don't see the use case. Maybe you see use case. Maybe it's great use case. I just don't see it yet. I need to see it before I believe it. I don't really understand too much how it's going to, you know, why you need aentic wallet. Someone says trade bot. Yeah, maybe. But tradebot, it's all just solved. The tradeable can just sign its own transaction and that's it. Like you don't need a like specific wallet for that. You need a wallet for that. Uh but you have it's it's like a server. It's like a since Bitcoin was created, you had already agentic, you know, sending and receiving a server. a machine can send and receive crypto without a specific wallet that you that you need to build for it because at the core it's just a signature. So anyway, let's see what's what what they will do. I mean Coinbase, they're always in experimenting stuff. Sometimes it's weird stuff like how they botch the Coinbase wallet. It's so bad, man. They turn it into some social network where you can buy post buy NFTt very bad for trading. uh horrible UI in the Coinbase. It's so bad. It's so bad in comparison to Phantom or Zerion. I mean, if you're stuck in Coinbase wallet, try try the alternatives. Your mind is going to be blown like how bad it is. News. I open my up my wallet, they give me they give me like news. What do you mean news? I don't want news. Where is my asset, man? Where's my ass? Why I have to click to find my asset? Show me my asset. And then I don't know what they what framework they use, but it's like super ugly. Like all buttons are ugly. everything and but they always experiment, you know, they they they're not okay with just doing a wallet, which is a wallet. No, no, it has to be social network. It has to be 50% wallet, 50% social network and another uh 50% it will be like for artists. Okay, it's I don't understand their strategy is like spray and pray. No real conviction or they have conviction. It's just so weird. It's so weird conviction they have. People will buy and token and mint tweet like Jesse said from Bass. I hope he changed his mind, but they have they have conviction just a weird conviction like they're the bit tonedeaf. They tonedeaf. They made a nice product with coin.com obviously for on ramping noobs and so on and so forth having anch. since then like everything on chain man they are tonedeaf as hell as hell. Uh now with this aentic let's see maybe that's a solution maybe not I hope they don't shove it into coinbase wallet because that thing just needs to be a freaking normal wallet maybe just going to shove it even more into into coinbase wallet. Um by bit expanding into Nordics now they are sponsoring Stockholm Open which is a tennis uh tournament or what it is guys I'm not too much into tennis but apparently it's kind of big. So if you are in penis, let let us know. But yeah, Bybit is moving more and more into different EU countries. They're fully regulated in the EU. Uh and that's why they are they can be quite ballsy, quite bold. Uh sponsor like being everywhere in countries where I mean I haven't seen too many other exchanges in Sweden for example. So that's why they have been very reliable for us since 2019. We've been working with them since I mean basically every day since 2019 I use it. So that's why I tell you if you want an exchange go to bullmay.com/partners. Click the link in description. and it's called exchanges I use. Sign up. You will be supporting the channel and you're going to get a nice platform. But to be fair, most of you guys are probably already on by bit. Then go to bitunix weeks bionex like all the other ones and collect the freebie. Collect the freebie. And uh now is not the time to be picky. I mean especially when price are down you just want all the freebie and you can spread out the assets and so on forth. Guys, let's go to Q&A questions, answers, debates. Let's go. Uh, and the big shout out to Dub for timestamping us today. Let's go, guys. Tell the tax office. It wasn't me. It was AI. Exactly. AI made the money. It wasn't me. Ivan, are you in the bear school since 2028? I think 2025. Just I don't know, man. What should you mean like 2028? Ju just follow the trend. Don't Don't over complicate things. Uh go to bullmain.com. Look at look at what I actually have been saying. I mean people like have ideas bear this, bear that. Uh I don't really think in terms of bare bull too much except for the trend. Like I I see bare bull in terms of trend. But people have so many ideas bare market bull market. We had like a 10-minute discussion on it yesterday. Is it a bare market? Because people have so many different wrong sick psychotic ideas what the bare market is. For example, in the last bare market, everyone said it will never go below the previous alltime high. It went previous below previous. So remove all of your sick ideas you may have what the bare market is. A lot of your assumptions you everyone has so many assumption what it is. Just read the exact timeline here. Ivan starts buying slowly. See this was 6th of February. Read what it means. Okay? Read what it means. I have covered it at length on the YouTube but I know people don't like everyone doesn't watch every video but you can see here basically it means that we're buying slowly within the buy zone. We expect it to go down way more um go sideways also. Uh so you can easily see 30% down from the 200 week moving average. But long-term it's still okay still okay price and then once the the uh bare um bare trend ends which can be somewhere here like we don't know when it's going to be but at some point it's going to it's going to flip bullish maybe towards the end of the year then we just go faster. So that's that. Hope it makes sense. I don't I don't really understand your question either like bear school 2028 I I don't know man. I don't know. Uh if you look if you want to look at the uh timing of uh the cycle the don't over complicate it just look at what year we're in right now. Right now we're in the midterm year. So midterm year if you want to look at cycle it's it's continuing exact uh if we continue like this we still have a lot of pain. Okay we have a lot of pain this year and this far we're continuing based on the average of this uh uh of this midterm years. Exact. No, exact. We're now down 23% uh for the year. It can easily go down another like another 30. Okay. Easily. And and kind of be in line with everything here. So on average, we end the year minus 65. Sometimes it's a bit uh smaller because again, it's average. Sometimes the loss is a bit smaller, sometimes a bit bigger. Uh so yeah, hope that makes sense. Uh but we don't know if it's going to follow exact midterm. It's just it's a model that is quite accurate. As long as you buy here in the buy zone, you're going to be good and then once the bull flip happens, you just buy quicker. That's it. Longterm, I can tell this buy zone is going to be super good price. Like if you buy somewhere here, it's going to be good. So don't over complicate it. Don't uh yeah, any sick ideas you have about bull and bear. Why do I say they're sick? Because they are sick. Like people have such sick ideas, such sick con convictions. One sick conviction people have was plan B. You remember stock to flow last uh bear. You know many people got so confused and uh mega wrecked because it was a sick conviction that you know Bitcoin has the stock to flow and it's like impossible for it to go down. Now last cycle it was supposed to be 500k and it would be impossible for it to go down. Maybe really thought it would be impossible for it to go down. That's why I'm saying it's sick. It's sick in the head. Another one is your pule multiple, mayor multiple, all these Bitcoin top uh indicator. So, we discussed all of this yesterday already. By the way, I'm repeating a bit. I just want to highlight that it is sick ideas, sick ideas that get you wrecked because according to all of the sick ideas, they have not hit yet. Bitcoin is down 50% and altcoins are down like 80 to 90%. But none of the top uh peak indicators have hit. So that's why I'm saying it's sick in the head. Okay? If you still believe them, it's sick. So hope it makes sense. Um and yeah, I mean listen, we I would like to be a straight shooter here. I don't want to sugarcoat. If it is sick, I tell you it's sick. That's it. That's it. That's it. So people ask me, but what I what do you mean by bare market? Because according to mayor multiple, it's not a bare market. So Ian, what do you mean with bare market? is according to mayor multiple it's not a bur so what do you mean what do you mean according to to you know all of the golden ratio it's not so what do you mean it's burp yeah crazy man I used to follow plan B never understood what he was talking about nice guy though I mean what does it matter nice guy or not nice guy you're down you're wrecked you have a year of hell of suffering so nice guy what does it matter man nice guy I mean anyone can be nice anyone can be nice you Put on a smile. You're nice. What What's What's the neness worth? It's not It's worthless. Nice or not? Nice. Uh, who cares? Is it accurate or is it not accurate? I mean, you you follow people in crypto for what? For niceness. Well, what is what is that criterion? Nice. Oh, but he was nice. I I got wrecked, but he was so nice. I got wrecked, but at least I saw a smile on his face. So, it was okay experience. Five out of five star. What is it? Sick. I'm joking. I'm joking. Yeah. Yeah. A can be nice. It's we have an inflation of niceness. You go to the US, everyone is nice, man. Everyone is smiling. How are you? Apparently, you're supposed to say not even answer basically. Uh we are here every day, even in the bear. Exactly. Exactly. Robin Hood launched their own chain. Will Robin Hood I don't care about the chain. Even Even Vitalic said all of this L2 is their fugazi their fugazi. Will it be better than Coinbase? Uh but Coinbase isn't even good. Like that's the problem. Again, they're a bit tonede. They made a a stock market chain like you know chain done by a stock market company. Uh they don't support builders because builders in many cases they build a bit dig stuff. So it's bad for the image of the company. So what's the point? Like it's uh uh it's not helping ETH pump. It actually dumps ETH because they don't pay any revenue back to ETH. Um so Coinbase or Robin Hood, it's equally bad for ETH L2s. Will they will it be good for Robin Hood stock or Coinbase stock? That's another question. And I think there it's as a you know Coinbase or Robin Hood shareholder. I would like them to do a chain. You see have a bit different hats here. When it comes to ETH holder, I think it's very bad that they do L2. They should be building on L1. But as a shareholder, it is quite okay because then you have a potential to do an L1 or like L2 in this case, I guess. Uh yeah, Rome just launched like know orbitum based something. Okay, L2, which in the past at least could give you like a billion dollar asset or several billion dollar asset just because it's L2. But now people don't care about L2s that much. Let's see if it's it's going to turn into that. But as a shareholder, why not? Why not? It's another asset the company has. It's worth like 5 billion, three billion. Why not? And it was simple to create. You just click a button, you have a chain. This chain is simple to create. So, depends on which hat you have uh for the user. I mean, let's see what they deliver. I haven't tried it. Maybe it's good for the user. For if you have the hat of the user, is it good that they have a chain? I don't know. I mean for for Coinbase I don't know how much users actually are delighted that there is a chain there. Uh uh I think for Coinbase it's a bit I I don't know guys like for Coinbase it may even have been a a distraction to be fully fair because they missed Sana memes because they wanted they thought that their base could compete with Salana for memes. It was a bit of a distraction. So Coinbase was actually very slow to integrate Sana properly. They were so slow to add Salana memes to integrate the full the full ecosystem. Why? Because for a moment I think they thought that bass would be like an alternative but then they weren't really supporting the digence and all of this. No, I mean you know memes how they are. Uh so people still want that dig. People still want the freaking ponzies and pump and dumps. So they go to Sana. So uh for a moment they thought I I I I I really think that they thought that they're like competing with Salana but it's not even the same league like Basel 2 and Sana is not even in the same universe. Um, so for Coinbase maybe it was even a bit they should have just added all of the meme stuff from Sana from day one and supported the traders because they are there to support the trader. I mean I as a trader I don't care where the hell the uh the asset is and yeah anyway hope that hope that makes sense. Send Ethan Vitalik to Dagistan two three years. sending Vitalik to Dakistan maybe needed maybe needed so he can he can build a bit of a bit of weight like in terms of muscle he needs muscle mass he needs lean muscle muscle mass um so I I would be for that a camp in Dagistan eth Dagistan why it's always you know if you know Paris e all these conference you know eth Barcelona why not Dagistan when is that going to happen I should I think that the next ETH conference should be in Dagistan and Vitalik to do a bit of a boot camp with the wrestlers. I think it will be good for the project. Good that we have a healthy founder with big bicep. It would be very nice. He is 140 gram of protein. I mean, I think it would be good. I think it would be good. Based on my understanding of the health advice, it he he would need it. He would need it a lot. And he needs to start stop selling ETH. I mean, that's a big problem. He he dumps ETH so much. Why he dumps it so much? He He He should be holding. He should be buying, not selling it. He needs raw milk. Exactly. He needs milk. He needs raw milk. Yes. Yes. Yes. Yes. Come to papa. Deadlifts and uh wrestling for Vitalic 100%. Guys, let's see some more coins. Let's see how the coins are doing. Um, let's just check on Solana. Is it going still to 30? Kind of wants to go to 30, I would say, guys. Still, I mean, to me, it looks like it's heading on its way to 30. E heading on its way to 1K here somewhere. Still, um, Tom Lee saying it's going to be a bottom like this. It could be a bottom. Like, who knows? But if Bitcoin does not bottom, if it's not going to bottom either, and I don't think Bitcoin is going to bottom soon. is going to be in the fair value that buy zone for a bit. for a bit meaning until like at least the summer alltime low or where are we kind of at all time low uh on the edge sitting on the edge uh ENA alltime low price discovery great um radium has a bit to dump still this is the problem guys when people say but it's so cheap I my coin it's so cheap it's down it's down so much I should buy it. How much is radium down? See, it's down 92%, guys. The problem for radium. The It's down 93% already. The problem, guys, is that the next big support is another 75% down. Like that's you see yourself. Do you see yourself or you don't see? You need glasses or you see you see that the support is here somewhere and it's always down 92%. This like things that are cheap, they can they can easily become cheaper. That's why in a bare trend we don't touch these things. Yeah, it's down 93%. But okay, where's the next support? Where's the next support? Next support. Another 7 80. You can even say it's Yeah, 75. 75. So all coins in bare trend, you don't touch them even if they seem cheap. Something that's down 90% can go down another 90%. You see yourself? Um, so yeah, mechanical rules, trends, very very important. Let's see. Fourth coin was happening kind of on the edge here. Maybe going to go to the listing price which is yeah still a big fall but could happen. Zcash Zcash guys guys Zcash came and touched 50 week. Everyone said it would be impossible to touch the 50 week. They said Ivan does not understand the fundamentals. And then it touched the 50 week. But everyone said Ivan does not understand the fundamentals because it will never go to 50 week. They said, but here we are. It touched the 50 week. Holy crap. We should like autotune it. We should autotune the crap out of it. Do we have someone who is good at autotuning? And uh because the reason I'm showing you this I mean listen I love Zcash fundamentals great but it's still going to go to 50 week and gold also going to go at some point to 50 week uh and silver also at some point is also going to go to 50 week. Okay. Okay. down and then we're gonna go to 50 week but guys also you know we are becoming more and more bullish overall I I would say we we since February 6 when we said that we hit the buy zone it is time to change the mindset slightly on Bitcoin still we're going to probably go down to buy zone still maybe below here yeah you see but overall now is the time to start deploying in the in this rectangle here wrecked in the rectangle Well, oh yes. Questions, questions, questions, dab. Police wanted to confiscate my phone. Holy [ __ ] What did you do? Then they found it was a seeker, too. They didn't want No. Hopefully Jim Kramer says it's going to 35K. Yeah. So Jim Kramer is bearish. So that's that's a bit bullish. I mean you like Hyperlquid. I like it but u uh I I'm not I'm not a buyer now. I mean I love I love Hyperlid. I think they are they're doing great. They are running circles around Solana when it comes to pers. They are uh you know if a coinbase is tonedeaf whatever they do on chain is like kaka steaming hak kaka you know they do a wallet onchain wallet it's not even a wallet they have a social media for artists you can mint like your tweet like it's kaka it's kaka they are tone dev they don't understand on chain it's like you know they try to be cool kid they do a chain it's so like corpor chain don't support builders don't support so kaka hyperlquid on the other hand super super super clear about the use case about product market fit about exactly which features are needed and uh that's why this is such a success I mean they have the biggest uh onchain dex for going long going short and just looking the reason I'm telling you I love hyperl is just and don't take my word for it just look in our community how many people post screenshots from hyperlquid like this guy this guy uh this guy this guy hyperlquid so I see the adoption is massive like in our community people trade on hyperlid every day bam Bum bum like everyone's bum hyperlquid hyperlquid hyperlquid hyper it's massive hyperlquid hyperlquid so they build a product which makes sense not the stone death crap that Coinbase on chain is doing hyper liquid hyper hyper hyperid hyperid by the way if you want to be part of the winning team go to bulman.com watch the free video so you can join uh bulmania get the money line get the money scanner and all that stuff so do I love hyperlquid I think from a use case perspective they've nailed it like it's amazing It's amazing. Use case is amazing. App is amazing. Everything is amazing. Now they are expanding into uh into prediction markets kind of like poly market and uh they are a beast. They're a freaking beast. That being said, guys, the coin is another story. It's in a bare trend. It got rejected here. Uh it got slapped down and uh yeah. Uh so we're not touching it now. We're not touching it now. The best fundamentals can still get you wrecked. Hyperlid now has better fundamentals than up here. Okay. Um and uh yeah the the price still is down 50%. Can easily dump 80%. So fundamentals fundamentals is the same fundamentals but it's all about where you buy. You buy here it's great. You buy here even better fundamentals it's not great. So fundamentals fundamentals fundamentals but we don't buy in a bad trend. We need to be disciplined guys. You need to be disciplined. Exactly. You need to join bullmania and don't let small losses turn into big catastrophes. 100%. 100%. Man, T has gone down 50%, minus 50%, eight times in a row since I bought as a problem. And you probably bought at a discount. You thought it's a discount, then they discounted another 50%, another 50%, and another 50%. Always happens. It can happen easily, easily, easily. Some guy spamming change GPT. This is not the time for any old including change. This is not the time. I mean, you're you're in the wrong uh you're in the wrong uh season. Like it's any alt in a bare trend. It's it's not time for it. It's not time for it. Epstein was at Oh, guys, speaking about Epstein, I I I'm really curious what else is going to happen because yeah, uh there is some cover up going on. Where is Where is Pam Bondi? Where's Pam Bondi? I mean her behavior it's uh yeah I mean listen to yourself listen to this yourself former Prince Andrew Donald Trump attended various parties with Jeffrey Epstein. I want to know were there any underage girls at that party or at any party that Trump attended with Jeffrey Epstein? What? What is that? Is this slow motion or she actually made the slow move? Why? Why should she make it like that? >> Oh, yeah. Because she needs time to think. Exactly. Exactly. She needs to move in slow motion. She has a few seconds to think what else to say here. >> This is so ridiculous. And that they are trying to deflect from all the great things Donald Trump has done. There is no evidence that Donald Trump has committed a crime. Everyone knows that. This has been the most >> people saying he's Chinese spy. Guys, that that's xenophobic >> transparent presidency. He's the one that those claim my time. I got your answer. You said there's no evidence. Please stop the legislation. This this is like time belongs to the gentleman from California. >> Okay. I'm going to put up another doc, >> but he could be communist because it's California. With the California, I guess, you never know. >> Document from a witness who called the FBI's National Threat Operations Center because I believe you just lied under oath. There is ample evidence in the Epstein. >> Don't you ever accuse me of a crime. >> I believe you just lied under oath. And this is all on videotape. You said there's no evidence of a crime. I'm showing you here is >> a witness statement who called into the FBI's threat operations center. He drove Donald Trump around in a limo. He overheard what Donald Trump said to Jeffrey on his cell phone. He was so >> Yeah. So that's that. But where does she go? There's another video where she goes nuts. Like she says the stock market is pumping. Where's the other one? Let's see. NASDAQ. She was like, \"Stock market is pumping. Why are you asking me this?\" Oh, yeah. Yeah. Yeah. Here it is. Here it is. Maybe it's another I don't know if it's the same, but it was yesterday also. This was yesterday also. >> The Dow The Dow right now is over The Dow is over $50,000. I don't know why you're laughing. You're a great stock trader. As I hear Raskin, the Dow is over 50,000 right now. The S&P at almost 7,000 and the NASDAQ smashing records. Americans 401ks and retirement savings are booming. That's what we should be talking about. We should be talking about making Americans safe. We should be talking about what does a Dow have to do with anything? That's what they just asked. Are you kidding? >> Mr. Jordan, am I I guess I don't know what's going to happen here. I don't know what's going to happen. Like it's um I I think guys the left is going to have such a comeback after after all of this. Yeah, not too great. But uh let's see what's going to happen. But yeah, guys, don't don't ask too much. Look at the D. The D is up. Fantastic. Fantastic. That's a brilliant uh PR training. Fantastic. What do you think about Aster? I you probably know what I think about after but it even has bad fundamentals. It's a CZ shield coin and uh it had a bit of uh pump and dump. Let's see how it looks now. Yeah. I mean, let's see. Does it have a trend yet? It's too new to have a trend on the weekly. Uh I would stay away. I mean, at this in this market, I would stay away. I would stay away. Let's Where's the big chart? Like there's there should be a big chart. The time to speculate on it was in the beginning here when it when CZ was shilling it. CZ I I don't think he sh anymore even. So what what's the point? It technically it's not it's not hyperlquid. Um it's a copy. TZ tried to copy tried to shill it. Did not work. Everything went down. Yeah. It has a bit of a pump. I would not trust it. I mean again it's about riskreward. What's your You think it's going to go to alltime high? I mean, anything is possible, but it's riskreward. Risk reward probability. I wouldn't put my funds on it currently. If there's some kind of BNB season in the future, you could buy it, but at the same time, there's going to be new coins. CZ has a new darling every week. Like after that, he has some other copy of some something else also before. So whenever there's something successful, they copy it on the BNB and then there's a coin for it and CZ loves it for a while, but then there's something new. So yeah, that's the problem. She's not a politician. She's a lawyer out of depth. Poor lady. I mean lawyer. Yeah, but she should be good uh should be good with words. But also, she's in a very tough position. Like, what could can she do? Like, it's a she's in a very tough position. Even if you're good with words, um I mean, it's if if you have a bad uh ingredient, you can be the best chef, it's still going to be bad. Okay. Do you think holding Pudgy and little Pudgy NFT? Yeah, I'm going I'm going to hold I'm going to hold I think Pudge is going to return, but for me, it's not an investment. For me, it's like my identity online. So, I have the Pudgy. I have the penguin. So that's why I mean conceptually it's also a bullish thing that many people have it as their uh as their identity. So let me check for example like you know this dude for example founder of nonsense is the same. I mean he also just has it as his identity and buys more and more and more. Then there's like 20 other ones that I know and that um that that have different crypto companies that have uh penguins. So, but if you are seeing it as an investment, then I would follow the trend, but it's a bit hard to follow the trend there because it's more liquid. You could keep to just normal coins. Um with NFTTS, you need to be kind of a collector like it needs to be not an investment. It's not a trade. It's not a trade. is more of a no collector. You got to be NFT enjoyer. If you're not an NFT enjoyer, you're you're buying it and maybe it goes up. In the bull market, it will go up. Uh maybe you can correlate with ETH uh and look at ETH trend. If ETH is downtrend, then you can count as that NFTs are downtrend. Um maybe maybe but in general now that there are coins also for you don't have to buy the NFT. You can buy the pad coin. do that instead because for you if you're again if you're not an enjoyer, it's just going to be more illquid. It's uh just buy the the coin itself if you want to speculate. I mean, should I load up on BNB? Uh no, it's better trend. It is better. It had support here soon at um I I wouldn't think in terms like you know load up you can short the crap out of coins when they break down like here for example it broke down and you see how fast shook like this here maybe it has a bit of consolidation it's you know go sideways a bit but then if it breaks down likely it's going to be shook so think more like that should I load up not not when Bitcoin is in Bren guys um I I wouldn't load up any altcoin if Bitcoin is embarrass goes to 30 then I would load up because it's going to be cheap going to be cheap. Are you buying uni now? No. Why? Because I mean uni maybe is they going to have a better place in the world now that it's focusing on L1. But just know looking at use case of uni versus let's say Jupiter unis swap is on all these different chains man there's a copy here a copy there liquidity is not great because it's spread everywhere if you have a let's say you have an altcoin and alcoin is on orbitum it is there it is on base it and all of the unis swap copies they have low liquidity for it on this L2s and then you have the competitor radium it's from a use case perspective it's just better is better that being said it's all about the trend if price enters bull trend it's going to a different story. Now it is bare. We're not touching any old. If alt is down 90% in bare market, in bare trend, it can go down another 70%. Easily. So yeah, I mean, what would it take to get you back on the Monday DCA with C? I mean, it would be fun. Maybe it makes sense now. Time wise for me, it makes more sense now. Uh maybe maybe it makes sense. Need you on that. Uh uh yeah, may maybe it makes sense at this point. How is that seeker phone? Where is it? It's here now. It's out of battery. It just claimed the seeker airdrop and it died. I I guess the the timing of it was so so bad. They released it and then boop, we enter bare trend everywhere. So for now, it's more of a useless table support. You have you have wobbly table you can put it. And uh yeah, let's see what's going to happen in the next uh ne next cycle if it's going to be any value to it. I hope there's going to be more airrop in the next uh cycle, but is it no one knows it's the airdrop already happened with the seeker coin. Um so let's see if it pumps or not, but it's bare like everything is bare trend. So um what do you think about I think like any other alt, it's not really the time for it. It's not really the time for the air drops. It's we're in bare we're in bare winter. Dab says don't go back to GC everything they say oppose is booming. Did they call things correctly correctly or not on the podcast? Did they call the top in October? What happened? Black Rockck is buying uni. Yeah. So what? It still goes down. It goes down and you can buy when it goes up in in the bull trend. It's kind of what we said. Did you listen to the streamer or not? We covered it. They had the, you know, one of the biggest news in history still goes down. Uh, they had the feast wishes still went down. No, they did not call it. Okay. Okay. Okay guys, that's it. Thanks a lot for being here. Thanks a lot for contributing to this stream. Mort Oh, yeah. Marty is still bullish. But see, he's going to be right at some point. I mean, I'm also buying in the buy zone. Uh, when like 60k and lower is the buy zone. So, that that's a problem with permabull. Like, you can get wrecked so bad. so bad and then you can still say but look it came back but not what came back bitcoin came back most are wrecked beyond the repair and they don't come back additionally you have one two year of hell seeing your portfolio drop which spikes your cortisol destroys your health from the inside ruins your family relations because you are sad you are depressed when your portfolio is down you're not in control uh so what's the point man what's the point listen it's way better to following mechanical rules. Go to bullmia.com and see you all tomorrow guys. Big shout out to D for time stamping and enjoy your Thursday. Goodbye guys. Goodbye. Goodbye. Goodbye. Thanks for tuning",
        "summary_hu": "A videó elemzi a Bitcoin és más altcoinok gyengélkedését, különösen Michael Saylor MicroStrategy-i szerepvállalásával kapcsolatban. Saylor idegessége és a Bitcoin árfolyamának esetleges esése miatti aggodalma felveti a válság helyzetét, amelyben a cégek képtelenek a tartozásaik szolgálatására. A közönség számára egyértelmű, hogy az altcoinok ellenállnak és meg kell bízni a visszaesés után várható emelkedésben, miközben a kereskedési közösség a short pozíciókat favorizálja. Továbbá, a videó hangsúlyozza, hogy nem érdemes bízni a hagyományos pénzügyi megoldásokban, mint például a banki refinanszírozás, amikor a piaci környezet nagyon volatilis. Összességében bizonytalanság uralkodik a piacon, amely valószínűleg a közeljövőben szorosabb csökkenéseket eredményez.",
        "summary_en": "The analysis focuses on the weakness observed in Bitcoin and altcoins, particularly regarding Michael Saylor's involvement with MicroStrategy. Saylor's nervousness about the potential decline of Bitcoin raises concerns about companies being unable to service their debts. The audience is shown that altcoins are resisting while advocating for short positions, highlighting a cautious approach toward traditional financial solutions like bank refinancing in a volatile market environment. Overall, uncertainty dominates the market, likely leading to further declines in the near future.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 30,
        "key_points_hu": [
            "Michael Saylor idegessége a pénzügyi stabilitás kérdéseit veti fel.",
            "A közönsége a short pozíciókat részesíti előnyben a piaci volatilitás miatt.",
            "A hagyományos pénzügyi megoldások, mint például a refinanszírozás, nem nyújtanak garanciát a tartozások kezelésére."
        ],
        "key_points_en": [
            "Michael Saylor's nervousness raises questions about financial stability.",
            "The audience favors short positions due to market volatility.",
            "Traditional financial solutions like refinancing do not provide guarantees for debt management."
        ],
        "main_topics": [
            "Bitcoin's Market Performance",
            "Michael Saylor and MicroStrategy Debt Concerns"
        ]
    }
]