[
    {
        "video_id": "TeZ8k2OiHtk",
        "title": "Bitcoin Reaches CRITICAL Levels... Here&#39;s what this means",
        "published_at": "2026-01-16T19:15:49Z",
        "sort_date": "2026-01-16",
        "url": "https://www.youtube.com/watch?v=TeZ8k2OiHtk",
        "transcript": "But my point has always been in my videos, Charlie, that let's wait for a bounce, a rally back to the averages like now, and then let's see if it fails from that level of resistance or succeeds and moves through that level of resistance. >> Cuz when all the masses out there are negative towards something, it's probably going to do the opposite because the masses are usually wrong collectively. Anyone who has a slightly bullish view on Bitcoin, they they get suddenly attacked. There there are people out there who get angry at you at the analyst if they express a slightly even a slightly bullish view. >> The market is there to do a job on people trying to throw as many people off as possible. I'm just going to go personally overall um with those odds. >> Uh do you see 100k being tested on on the horizon? I mean it's not far away. And I think the key question is this. The moment of truth is all right guys. Hello and welcome. We're joined here by my good friend and trader Charlie Burton of charlie burberttontrading.com. This should be quite an interesting video because as I'm sure you've probably seen yourself, Bitcoin has had a nice bounce. A bounce, by the way, we've been expecting. We got very close, by the way, to a key level on the chart. Some of you know which key level I'm referring to. Uh so guys, let's dig into the charts. Charlie, how are you doing, by the way? You well? Did you have a good break over Christmas? And happy new year to you. >> Yeah, happy new year. Uh yeah, it was good. We went down to the southwest of the UK over that peri over the New Year period. So, it's down by the ocean. So, it was great. >> All right, guys. So, we're going to the chart of Bitcoin is a weekly chart of Bitcoin. As we can see here on the daily chart, we can see that uh bounce quite nicely there. Uh we've already tested a level which I mentioned a member video. It's the 100 daily moving average. That's the orange line there on my chart. And we look at the weekly chart. Guys, I've been saying this so many times. If you watch my previous videos, in previous member videos and in previous YouTube videos, I mentioned many times that we should wait for a bounce at the very least towards the weekly 21 EMA, which is right there, that blue line. Has that happened on the price of Bitcoin right now. Bitcoin has not yet rallied or bounced correctively towards the resistance level at the weekly 21 EMA. And by the way, I think that's going to happen in the next several weeks. I think likely as we enter 2026, perhaps in the beginning of 2026, we may very well see some kind of a strong bounce or rally towards the weekly 21 EMA and that's going to give us clues as to whether we're entering a bare market or not. There's potential here for Bitcoin again to test this 21 weekly moving average here, which is approximately moving into the region between 98 to 96K. Now, we haven't got there just yet. very close. But I think actually we're going to discuss in this video whether we can test that level and potentially even reach 100k or not. So that's why I have uh Charlie Burton here. Charlie very nice bounce so far. Charlie, before I get your view, one other thing I wanted to mention here is this, which is that if I put this if I put this um here on my chart, we're actually also tested two levels here. We tested this 61.8% golden ratio retracement. the decline that started in no this part of November, we tested the 61.6 gold ratio level. And if we go to week to the weekly chart, if we measure the retracement from the all-time highs of Bitcoin, so if I just get my uh pen here, so that's the highs. We measure from this high to this low, the 38.2% Fibonacci level is at 98,200, which I believe we came very close to. Yeah. merging with that 21w weekly moving average there. So it may come to that level. That's actually my expectation. I actually think we could come a bit higher and test the 21 weekly that approximate 98 to 99k region there. There are many people who are watching this video right now, Charlie, who've already made up their minds that Bitcoin is in a bare market. They're saying, \"No, Bitcoin is in a bare market.\" They're expecting Bitcoin because they're very bearish on Bitcoin. They're expecting Bitcoin to drop down eventually to 50K to 25K. In my previous video, I explained that I am not of that view until we get confirmation. Confirmation would come to wait for a bounce and then let's see if it fails or not. Now, we got the bounce. We haven't got yet to the 21 weekly yet. But my point has always been in my videos, Charlie, that let's wait for a bounce, a rally back to the averages like now. And then let's see if it fails from that level of resistance or succeeds and moves through that level of resistance. And until we see what happens in the next several weeks, whether it fails or not, I'm not as yet of the view that we're in a bare market. I need to see confirmation. There's an old phrase, I don't know if you want to bring it up or not, but on the monthly chart, it just zooms that out a little bit there, as you've covered before. There's an old saying in trading that you should fade the short-term trend in favor of the longerterm trend. So, when we're looking at the monthly chart here, what's the short-term trend? Well, to the downside. So, you fade that. you do the opposite of the short-term trend in favor of the longerterm trend. So >> to me, in my mind, much like to you, um I'm seeing this as just a pullback within the longer term trend at the moment. And in fact, and I know we'll probably talk about this, sentiment is so negative towards uh the likes of Bitcoin at the moment that uh I think that it's probably in a good position because when all the masses out there are negative towards something, it's probably going to do the opposite because the masses are usually wrong collectively. >> What Charlie just mentioned about sentiment is very important. Before we talk about that, uh first of all guys, if you haven't yet signed up to the joint course that Charlie and I are doing this Sunday, 18th of January, make sure you do so guys. It's still not too late. You can still get the discount rate. Go to this link you see right there. Charlie's going to cover important training on how to trade the markets. And I'll be covering technical analysis, some important research on technical analysis. Full details on the page. And Charlie and I will cover that again at the end of the video. >> Oh, and just note as well if even if people can't attend live, it's all fully recorded. >> Okay guys, uh let's go back to the chart of Bitcoin. Charlie, you mentioned sentiment and I think it's really important to mention this because I noticed the last time I posted a video about Bitcoin almost some weeks ago. anyone who has a slightly bullish view on Bitcoin, they they get suddenly attacked, you know, by the unfortunately I can only say by the mob on social media and they say, \"No, how can you be bullish on Bitcoin? We're in a bare market.\" So, a lot of folks out there have already made up their mind uh especially from reading the comments and they're saying no. Uh you cannot possibly in other words, they get angry at you. They literally there there are people out there who get angry at you at the analyst if they express a slightly even a slightly bullish view. Okay. Even for a bounce or a rally >> until proven otherwise as you quite rightly said if this becomes a dead cat bounce and we roll back over and break down below the most these lows then yes it will then increase the probability that there is a larger correction at play. But until until proven otherwise, this is still within an overall upwards trend and it's starting to rotate back to the upside over the last few weeks. So, um I'm I'm still bullish towards it at the moment unless it goes and confirms back to the downside, which it hasn't done this yet. If you look back at the amount of times that Bitcoin has dropped by 20%, you get so many false signals. Uh because many times Bitcoin drops by 20% or more and then it recovers. So yeah, to me that uh is a very unreliable measure and the reason I mention is because people said to me in my last video, they said, \"Alesio, Bitcoin has dropped by 20%. So definitely we're in a bare market.\" And I replied, look, if that if that's your measure of bare market, you're going to get a lot of false signals. But I agree with you, Charlie, that again I I'm still leaning towards the bullish side unless the bullish case gets rejected. Uh, in other words, if it fails. For people who are wondering, well, how would we know that bullish case is got has got rejected as Charlie said, if we break support like if we break below the January lows or December lows, that would very likely confirm uh the bearish case. But I think you're absolutely right that there are many positive and bullish factors like you mentioned the monthly chart which is the monthly chart shows that we've held we've held the 21 monthly average. Sorry Charlie go back to what you were saying. >> Well I think that's is the thing it's the classic setup really. It's just a pullback until at the moment. >> Um the market is there to do a job on people and and it's like a bucking bronco trying to throw as many people off as possible. And so when we see if everyone was bullish right now, I would probably be a little bit more cautious because the masses are normally wrong. I'm not talking about every single person, but on mass if if a large percentage of people are bearish towards a market, even though it's actually still technically within upwards trend, I'm going to look at that and say, \"Yeah, okay. It's probably going to go up.\" because you have to bear in mind that most people around the world who are investing or trading the majority of them are usually wrong. Um it's only a smaller minority of of traders and investors who are right. So when it comes to something like this, Bitcoin's just pulled back technically mass uh the larger majority are there. Of course, there's going to be plenty of people out there who will be bullish towards it right now, but there's a a decent majority out there who are very bearish towards it. I'll take the opposite of that. >> Absolutely. Yeah. And let me just say this guys, I know there are some people watching this video who disagree with us and I know there are some people watching this who are saying, \"No, Bitcoin isn't a bare market.\" My point is, listen, you guys could be right too. It's possible. It's possible that the bare market may have started on on Bitcoin. I'm not saying that we're right and you guys are wrong. Definitely 100%. That's not what I'm saying. My point has always been my point has always been in my videos, let's take a wait andsee approach, which is my view is, and I think Charlie was saying the same thing. Look, we've had a bounce back to the averages. And I know I'm saying this again, and people going to say you're repeating yourself. Okay, I'll I'll repeat this a thousand times, guys, because it's so important. I don't care if you guys criticize me and saying I'm repeating myself. I'll repeat this 1,000 times because people forget this. Wait. I said I said in my last video and I said it before, wait for price to bounce back to the averages just like in previous times. Okay, it's bouncing back to the 21 weekly or resistance. Let's see if price holds that resistance and gets rejected. In other words, fails on that level. In which case, then that would confirm a bare market. Okay? Like for example, in the year 2022, I showed this in my previous video. Bitcoin bounced back to the 21weekly moving average, got rejected, and then that's in other words, that confirmed a bare market. I think we're bouncing back to the 21w weekly. We're not far away. I mean, this could be it. And let's see. Let's see if Bitcoin succeeds to move through that resistance, in which case that would reconfirm a bull market or whether we get rejected and fail from this level. Okay, in which case that would confirm a bare market, especially if it breaks support. Okay. So my view has always been let's be patient, take a wait and see approach. Okay. And then with more information then we can make a better decision >> in any one situation. Anyone could be right. So on this yeah Bitcoin could roll over and technically like you said I'd be the same. If it rolls over and um yeah fine if it breaks back down some of those levels yes then we've probably got a larger correction on but it doesn't matter. I think this is the thing that I see on social media um with investors. They get so caught up on trying to be right. What does it matter if if you are wrong on any on a view? Whereas people get really caught up on trying to be right. Um, so to me, if if we had a hundred situations like this where you've got an overall upwards trend and it's just a pullback within that upwards trend, well, more more far greater greater than 50% of the time, the market will then just naturally transition higher. It won't do it 100% of the time. the odds favor that this is a you know still a bull trend and that the trend will resume. Um but um but of course on any one individual time you know we don't know 100%. I'm just going to go personally overall um with those [snorts] odds that the trend is your friend and um and stay totally agree. I mean just looking at this monthly chart that you mentioned Charlie again there's the 21 monthly average which we pulled back to we've held it so far Bitcoin held that level so far so that's why I'm remaining uh cautiously bullish still or at least again taking a wait and see approach as I as I mentioned before two questions I have for you Charlie before we finish this video number one uh let's just ask them very quickly uh do you see 100k being tested on on the horizon I mean it's not far away and do you think that at that level if if we test 100k K. Do you think some kind of pullback because it's a major resistance, psychological resistance, 100K, >> do you see that as a level where we might see a pullback uh from 100K? Maybe. I don't mean a pullback. I don't mean a crash. I'm talking about a pullback here. So, >> a reaction. I would always anticipate a reaction to a key level around that that 100 uh thousand zone. I would at least expect it whether it happens. It's not to say that Bitcoin couldn't just blast through it. >> But I would always uh anticipate a reaction to a to a key level like that and then you at least you're prepared for that then if we have a bit of a reaction to it. Like you said whether it completely rolls over is another matter. But I would at least anticipate as we come up into that resistance zone that the market may well find sellers because sellers people will naturally bank some profit at that level. You'll have fresh short sellers coming into that zone because they'll look at it as a resistance zone as well. So you would normally expect some sort of reaction. Exactly. >> Yeah. It's not a guarantee it's going to react but you have we are constantly dealing with odds probabilities. So the probability suggests that there should be some kind of reaction but uh and then we'll take it from there. And the key question is, and I think the key question is this, the moment of truth is whether Bitcoin is going to be able to successfully break through that 100k resistance and move back into a bull, in other words, >> continue the uptrend or or the opposite, whether it's going to fail from this level and then fall into a bare market, in other words, um, a downtrend. And that's the moment of truth here. By the way, guys, make sure you watch the full analysis that Charlie and I did both on the stock markets, Bitcoin and gold and silver. That's in the member video. And guys, as I mentioned before, this Sunday, 18th of January, Charlie and I are doing a joint course. I'm going to cover the technical analysis side in this educational class that we're doing on Sunday. And Charlie's going to cover the trading aspect. In other words, Charlie's going to share with you his experience. I think uh 28 or so years of trading experience that Charlie has. He's going to share that with you in this particular class. Definitely don't miss it. The link is right there. Prot trading workshop. Uh and guys, remember that uh Charlie has kept a discount for you until Sunday. So go ahead and check it out. And remember the the recording of the class will be sent to you even if you cannot attend. Thanks very much indeed guys. Thanks Charlie. Much appreciated. >> No thanks as always. Always lovely having to chat about the markets."
    }
]