[
    {
        "video_id": "_CqYuIDDC3s",
        "title": "BMNR Stock Unexpected News SHOCKS Investors!",
        "published_at": "2026-01-16T03:42:05Z",
        "sort_date": "2026-01-16",
        "url": "https://www.youtube.com/watch?v=_CqYuIDDC3s",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope you guys are all having a wonderful day. We continue to see resiliency within the market as the S&P 500 index basically melts up. Uh we continue to see strong earnings from TSM that brings a lot of ignition back into the AI trade. A lot of the names and more individual names that we've been covering on the channel continuing to hold strong or even catch a bid. And on top of that, we see some of the big banks here releasing earnings uh that were actually positive. So, a little bit of a relief there uh because there has been volatility within the banking names, especially with the whole credit card cap thing that's coming out from the administration. But before we get to all that, we're going to be talking about BMR cuz they recently had a big announcement uh big meeting and talking about some of the decisions that they made relatively recently that kind of is starting to leave some curiosity and questioning from shareholders. So, we're going to be talking about why Tom Lee from Bit Mine and even Bit Mine themselves, why they are deciding to make these decisions, some possible predictions or hypothesis, and we'll be talking about some other things occurring within the market. If you're a new or returning viewer, hit that like button, subscribe for daily videos, and let's pop it up on the channel here. Let's talk about first of all, BMR's price action right now is currently at $30.95. Not doing too bad. However, I was expecting BMR after we saw that little bit of a breakout with Bitcoin and Ethereum. I was expecting it to kind of hold when we t last talked about it a few days ago back up here in the 33. So, what we actually see is some selling pressure back here into the 30s where there is support. Now, currently where Ethereum sits at is still relatively around the same price that we had covered a few days ago, right here at 3,300. It's continuing to hold support right here at this level. So, we'll see what happens. But ever since the 13th here 2 days ago, Ethereum's been doing quite well holding this zone. Same thing with Bitcoin also holding here around the 95,000. So these had a little bit of a nice rally and are continuing to hold these levels. Uh we'll see what happens and come due time. Now what we should be talking about here is that Bit Mine decides to invest $200 million into Mr. Beast Beast Industries. Uh now they hold right now over 4.16 million Ethereum that's worth about 14 billion and they take this large equity investment into Beast Industries. Um now know we know this you know who Mr. Beast is like everybody does that especially on YouTube here. Uh but basically Bitmine sees this as tapping into beast unmatched reach with the younger generations to explore DeFi and upcoming financial services. Uh, also on top of that, you have Bitmine right here, a BMR app that is currently going to be developed. Uh, Tanner right here, he's a big content creator that covers BMR. Talking about, you know, is Tomly losing the plot? What is this? Why are you spending a lot of money on this? So, we're seeing some question here. Is this all the possible type of tap into the younger generation with this whole app idea? The big question is, you know, what's going to be the utility out of this Bit Mine type of app? We'll see what happens, especially when it does come out to fully kind of review it. But nonetheless, you know, what's the move here on the investment into Mr. Beast Industries? Is it that they want to get a lot of exposure to their individual name and Ethereum? And if this all of a sudden Mr. be see if he's going to start talking about Ethereum like crazy and talking about Bitmine. Is that going to go give a lot of exposure to the stock and to the individual crypto to the younger generation? Is this basically buying a lot of brand exposure? I think that's what's happening. However, I hope it is successful currently for the BMR shareholders to reap some reward. Currently, I do not have any exposure or any trades open with BMR. Um, as the price has really been beaten down recently. Uh, so we'll see what happens. I think I want to see some more confidence, especially from retail and a nice swing here in terms of just technical levels to see BMR hopefully start to experience a little bit of a relief, a little bit of a breakthrough and not kind of testing these support levels continuing to set these lower lows as it's been beaten down a lot recently. So, we'll see what happens. What do you think about all this happening down below? What's your opinion on this? And uh where do you think it goes from here? Do you think this is a good move or do you think this is a mistake? It would be interesting to hear what you guys say. Talking about the general market, let's talk about that today. You see the S&P 500 here closes at 6944 up about 26 basis points. And we see the spy that opens up a little bit in the green here. Uh up about a$148 right now in the overnight session currently at over 21%. uh what you have here with the futures chips, the TSM, really really good earnings reigniting the hopes of the AI trade. I like this because especially with all the AI top callers out there that are continuing to kind of hold down these prices or keep that uncertainty within the market, uh you see here over and over again these big AI companies, big chip companies, semiconductor companies, when they release earnings, they really really reignite and show you that the fundamentals are still strong within the AI trade. So you see here Taiwan uh semi they jumped more than 4% while Nvidia and AMD both gained about 2%. And you also have the US and Taiwan reaching a trade agreement in which um Taiwan ships and tech companies will invest at least $250 billion in production capacity in America. This is really good scaling down the bottleneck for AI. You also see here bank stocks got a boost. You got Goldman, Morgan Stanley uh both posted solid fourth fourth quarter results. Now, Goldman here shared shares gain about 4%. Morgan Stanley about 6%. So, fundamentals are still very strong. Any dips in terms of my long-term portfolio, I'll probably still be looking for additional exposure. I do like the current moves that we're sitting at right now. So, awesome to see there. Let's talk about an interesting headline that I see regarding PLTR. Palanteer. We know we be talking about this a lot. Palanteer currently at 178. Really not making any big moves. We talk about this all the time on the channel that Palanteer is really just hanging out in this consolidation zone kind of between the 170s and the uh 180s. It does like this area. So, we'll see what happens with Palanteer. Um but however, it likes to hang out in this zone. Um until we see any big type of macroeconomic or individual type of news within this name, I don't see it moving a ton. However, we see this here from unusual Wales talking about that Palunteer is currently working on a tool for immigration and ICE that populates a map with potential deportation targets. Brings up a dossier on each person and provides a confidence score on the person's current address. Oh my gosh. Uh you see Palunteer here working to assist with the administration and cracking down on the whole immigration type of tensions that we see. Um not really political on the channel, so take that with what you want. However, that's just what they're doing. Uh, but nonetheless, Palanteer's price is not really moving a ton. And I also don't see a ton of other reports reporting this. I don't know what 404 media is or how reputable that is. So, take all that with a grain of salt until we think we see more coverage on that. But that's just on the only articles that I could personally see. Uh, in terms of some of the individual names, of course, I'm still bullish on. Looking at Cipher and I, I really like them. Cipher right here, 1760 I still think is holding and doing a nice job, especially above this $165 level. Uh Cipher, a lot of people are anticipating a decent type of move here, especially breaking this trend line here outside the ascending triangle type of structure. Um and if Cipher were to fall beneath that, then maybe it's just going to get back into this consolidation zone. But nonetheless, I mean, currently Cipher right here at a $6.92 under a $10 billion market cap with this potential um type of I want to say exposure that it could get and a type of return that we could see possibly 2026. I'm still bullish on that and that kind of correlates with IEN nebius still catching a little bit of a bid here. Uh Corweave, Cororeweave I don't really cover, you know, not the I like the other three better to say that. Uh but other than that, you see things like Path and Zetta. Path kind of got beaten down today. Currently at 1489. I currently do have a little bit of exposure to this. So we'll see what happens if this gets a bounce right here. Uh Path also has a lot of anticipation to be a benefactor of Agentic AI and that current theme that we're continuing to hypothesize for 2026. One thing about Path is that over here in the last three, you know, in the last 3 months on this chart, you do have a decent amount of support right here at that 14. And so we'll see if that 14 if the nice bounce gets tested there. Uh and also here with this zetta that we saw this get down here to about 2187. Um also kind of in this area. We'll see if a bounce happens here or if we continue to see a breakdown. But nonetheless, I still like these names as speculative names going into the new year. Uh, one of the big things that we see today is as we've been talking about that working on broadband cellular gets a huge bid today is even popping up over here in the overnight hours up about 6% currently at 107. Wow. ESTs has been doing incredibly well and working on the broadband cellular cellular network is getting a huge bid and that is because recently they were selected by the missile defense agency for the third shield program. And they say right here as this award pulls it into the golden dome stack expanding its role in secure spacebased communications and sensing for national database. So big big moves for as we were covering this and talking about this at like $30. It's crazy to see. I don't have any current exposure. Uh probably not going to be chasing at these levels but wow for the long-term holders and for people that just have equity in it making some good returns. So, congratulations to those bulls out there that have been doing quite well. Other than that, really all I have for you for the market today. We'll see what happens. Peace out. Take care and I'll catch you guys later."
    }
]