[
    {
        "video_id": "dF8EIYgqEuw",
        "title": "BITCOIN REJECTED AGAIN!!!! (or Bear Trap Before Valhalla)",
        "published_at": "2026-01-16T10:03:34Z",
        "sort_date": "2026-01-16",
        "url": "https://www.youtube.com/watch?v=dF8EIYgqEuw",
        "transcript": "I'm here. Let's go live. We're going live. We're clicking the button. Oh yes. Oh yes. Yes. Yes. Guys, welcome to another episode. And as right now, Bitcoin is at 95. And some people are concerned. Why is it so that we have this week? Why don't we pump higher? And the bears the bears will tell you that we actually got rejected. If you look at Bitcoin moving averages and you look on the weekly, you see something interesting. We're now a bit below the 50week simple moving average. But when you switch to exponential moving average there, we basically touched it with a week. We basically touched it. So the question is, is this a big fat bear trap, okay, that we're a bit, you know, we get a bit hesitation between the big Valhalla or is it a real rejection? Let's talk about it. Also, we'll be talking about stocks, we'll be talking about other assets because as you know, in this day, you have to be a 360 investor. Everything that we look at whether it's stocks, whether it's crypto, whether it's precious metals, it's all about finding the next leg up because your portfolio has to be bullish. Okay? No matter the market narrative, no matter the cycle, the most important thing is that your portfolio is bullish. And in today's day and age, it it means that you have to be 360 all assets everywhere. Now, let's start by looking at the overall crypto market. We did see a bit of interesting news yesterday from Twitter because they basically banned a a portion of the crypto market that has to do with Infoi. So Nikita Beer, who is heading product on Twitter, he said, \"Listen, no more Infoi. We're banning all access to crypto data for Infoi uh uh platforms, for infoy products. We have revoked API access from these apps. So your ex experience should start improving soon because as know infoy is all about encouraging people to spam in order to get points and then maybe a token. So if you look at kao this thing is fully fully wrecked today minus 20% in 24 hours. Meanwhile you have other things such as dash such pump fun doing very well. Pump fun by the way pump fun as we've been discussing during the last uh the last days it is basically to alltime high when it comes to usage. Okay, we've been joking a bit. Maybe we deserve another big fat nuke in price because memecoins, believe it or not, guys, they're back. They're back in ways that it's a bit hard to comprehend for the average, you know, crypto investor who has a bit of ada, a bit of link, a bit of blue chips. But the kids are going nuts. You have new memes from Tik Tok. You have new memes everywhere. It's like a whole different type of investor or I mean degenerate gambler. Maybe that isn't me. whole subculture within crypto and it is bigger than ever when it comes to the overall fees they collect. If you look during the last few weeks, it is quite significant. I mean, you see yourself, there are not many times where pamp collected this many soul and especially if you measure the revenue in soul, it's clearly basically pushing alltime high soon. And when you measure the moving average, you see how many weeks of high high fee that they add. When you switch to dollar, it's a bit different. It's not as high because as you know, their revenue in dollars depends on the salt price. So when salt pumps just by definition they have more revenue. So that's why I personally look at salt because that's clearer signal. But that's interesting to see that they are pumping quite nicely. And then of course their token pump is also pumping. So that's why you see it here. Then when it comes to uh Dash it's one of these things where man I mean it's it's very nice to follow the trends because you see here on the daily let's see what flipped within the last week. You see Dash Dash flipped within the last three days on Bulmania money scanner up 114%. Then you have gas. It's a new coin with the you know storing gas ETH gas as a coin. You can then use it for gas. So that's that's a fully new coin. Then you have pirate chain. You have a collect 80% horizon. Horizon 3 days ago flip 39% pump. So again for short-term trading a lot a lot a lot of opportunities. But when it comes to the uh stock market, when it comes to uh ETFs and so on so forth, that is where we've seen the highest growth in the last uh in the last uh weeks and months. I mean, ever since Bitcoin basically lost the momentum in October. If you look here, it's insane. I mean, literally insane. So, if you're not in sts and you're only in crypto, you're basically missing like half of the opportunity because obviously crypto pumps a lot in bull. It pumps a lot. So in crypto you can have life-changing returns. The problem is that for many people then when it's bur they they're basically out of the game for like uh two years two years it's down 80% then have to recoup 80%. Meanwhile the world moves on. I mean the world moves on. You have gold silver you have stocks and so on so forth. So my message to is to become more of this 360 investor. And the thing is you don't even have to move platforms a lot because nowadays you have platforms like Pionex uh supporting stocks. If you use the link below for Pionex for the trading boss you do have a nice incentive to try the Nvidia trading for example just by clicking the link below exchanges I use you will come to this website partners and here you see Pionex number one sign up to Pionex. So go here it's booming.com/partners it's it's in description exchanges I use you're going to see it. So sign up for Pinus. Just by doing that you get Nvidia position. Next uh you can copy my boss which I mean lately I've been doing fantastically well. You look here silver uh a lot a lot a lot a lot. Apple a lot. I mean these returns they are harder to get in crypto nowadays. Although it is possible like with ETH we timed it quite nicely. And all of this opened six days ago. This is just six days ago. Then you have uh Tesla still warming up. Nvidia still warming up. So uh click here to copy the bots. you can do it easily. And then finally we spoke to them and basically we told them we need more stuff with Tradfi and they now have this trading competition for semiconductors. So on Pinex you can do everything. You can join the trading competition again just click this button right here on booming.com/partners because the sooner you learn how to use it because most people they don't even have a brokerage. Most people in crypto they have no bro they just have buy bit and bionex and that's it. But on bionex you can trade stocks you can be part of the competition. You can get Nvidia position also on buy bit you can trade stocks. So basically crypto exchanges now they actually allow you to be 360. And at the end of the day it's all tickers anyway. Whether the ticker has this name or that name or this logo or that logo if the chart goes up that's the only thing we care about. So let's be practical. Let's be super super super pragmatic and uh look at 360. So uh do that. Go to booming.com/partner. Sign up. copy the bots if you want and then join the competition with this stock semiconductor. So this one is focused on what? On micron semiconductor, AMD and ASML if you want to get going and also in the overall world of uh trading and investing ETFs are massive. We added ETFs recently. Let's see what happened in the last week when it comes to the flips. Holy crap. You have the silver Swiss Kanto silver ETF up 78%. So a lot of them have a bit of leverage. So if you have a big move in silver, a lot of them fly like like there's no tomorrow. Then you have black rock asset management eyeshares gold the 12% since four days ago then you have u a lot of other ones with ETFs. It's more for the long term. I mean for you it's not I I wouldn't trade them in and out but if you want to build long-term positions maybe trade on the daily. If you want to trade do it on the daily. It's a bit of a catching the the bigger trends basically. Okay catching the bigger uh trends. uh you have uh the move in precious metals, you could have bought ETFs or you can you can buy CFDs for uh for gold. But um I would say that ETFs here it's more if you have a few months horizon at least or or longer or or longer and also it's a nice way to see approximately what's happening in the world because when you have let's say high yield ETFs pumping it means junk bonds are pumping it means more risk on when you have let's say gold you see precious metals are pumping so it's also a nice thing way to to see what's happening in the world overall. Now guys, let's back let's get back to Bitcoin. Are we now in a bear trap or uh is this really a rejection? As you know, it's not a good idea to try to bet on this because at the end of the day, the time to derisk was here from October 8th down here. Some people say that it's it's still a bull trend. I saw one guy, it was actually quite interesting. One guy yesterday said, \"Hey, Ivan, you should zoom out. You should see that we're still higher than uh a year ago, five years ago.\" And so forth. And listen, it is true everything goes up against fiat long term. The problem is still that in the meanwhile um you can still lose 80%. Okay, from the top if we go to the 200E moving average here it is the 55 because we didn't really pump a lot. So the 200 moving average takes care of this argument that we didn't pump a lot. So we will not dump a lot. Absolutely. Because 200 moving average is not that far away from the peak. Uh but personally I see it more as a sign of weakness currently because we are below the 50 week. We're not above it. It would be different if we pumped above it and then we had this this um this week because at least then we're above it. At least there there is some constructive constructiveness going on. For now nothing has changed. We're still below the 50 week even if strength comes back. My target would be the 50. I'm actually expecting it to go to 50 week um not occasionally what's the English word eventually eventually um but currently when you see so much excitement for no 95 96 it's really is just not even at 50 week touching the 50 week and we expected to touch we expected all the all the way since uh since November basically that at some point we're going to have relief rally to the 50 week and uh yeah it's kind of happening kind of not the the time for us to act will above here uh to turn bullish again or at the 200 week moving average. So we keep it super super simple. Now in terms of the inflow outflow let's see the ETF daily ETF. Daily ETF actually had another day of inflow. So that's a positive sign that more and more money is coming back to the ETF. You have now in total 1.6 billion uh for January in ETF uh inflow net in ETF inflow. So that's something I mean at least that's a sign of of positivity from Wall Street. um in many cases they just follow the price but you need to have sustained Wall Street interest for them to out outnumber the sellers. Okay. And uh that's good. I mean that's good if if this continues like this even when Bitcoin dumps but they still have inflow that's a very good sign. Okay. So let's say on the next day when Bitcoin is down a few percent if if there's there still inflows and there's still good interest despite the downturn that's very very good for the bulls. Then in terms of the wallet positions, let's see. You have giga chads uh with highest P&L slightly bearish. You have big brains bearish. It's interesting that they are bearish. Normally this the strongest opinion is giga chads. They have the strongest opinion either bullish or bearish. In this case they're slightly bearish while the strongest opinion today is from the big brace and they are bearish. Then Dian pros are indecisive. Uh and then everyone else is bullish or slightly bullish. Uh historically if we look here then um yeah it's a bit um now now now everything is kind of the same you know a few days ago for a few hours here both of them were slightly bullish but then it it changed again to uh to bearish because a lot of them trade for the short term if they see a bullish reversal they act on it kind of like we saw during the last um last days here uh but now bullish reversal seems I mean according to them at least according to hyperl seems to be over at least for now. We can always retry next week and um you know go to the 50week moving average especially now that we're above this this resistance. So let's see what the big wallets do. But all in all guys still for us it's a no trade zone. It's a no trade zone. When it comes to trading uh what's good to trade are the uh breakouts into bullish trend, new breakouts, new flipping into bullish trend whether it is on stocks, whether it is on uh on crypto. But when it comes to the big allocation, big picture, uh it's unchanged until we really go above the uh 50 book moving average and start closing above. But at the same time, you don't have to worry too much about that. Dash 3 days ago, fantastic. Horizon 3 days ago, fantastic. So there's so much focus on on Bitcoin only. And I understand because many people want to have their long-term allocation, when to get back long-term and so on so forth. Um but you you have to be too too focused on on one thing. At the end of the day, money is made every day. There's something pumping every day in crypto or in stocks. So being more flexible makes sense. Makes a lot of sense. And you know, bull markets come and go. Bare markets come and go, but there's opportunity everywhere. I remember in the last bear, that's when the meme started. It was in the last bear. So as long as you're not too focused on the existing dying bags, there are many coins that pump in crypto. Even when Bitcoin is going down, but you you cannot confuse it with, you know, like long-term bull. you're going to buy, you're going to accumulate, you're going to buy, you know, the blue chip alts. It's not like that. Instead, it's um one, two weeks shortterm like with Dash or with what we've seen with Monero and other ones. Uh it makes perfect sense. So, it doesn't mean that you have to be bearish on crypto overall. It just means that you have to be selective and you cannot give any benefit of the doubt to coins that are just dumping. There's no such thing in this environment. If your coin is in a bare trend, it's down and down and down. Man, while while Bitcoin is in a bare trend, especially, I wouldn't give any benefit of the doubt. Even if Bitcoin is in a bull, I also wouldn't really give benefit of the doubt to bare asset. But um for short term, this is what we're looking at. This is the focus as long um so as well as the stocks as as well as the precious metals. So that's the situation for now. Now, let's move to some news. We have more and more users coming back to ETH. you have new wallets onboarding testing NFTTS testing stable coin transfer D5 finance so in the times when a lot of people lose interest I mean I find actually the most exciting it's when kind of like now you know many people have have left crypto it it's now when you can really catch the next uh the next wave whenever it is whenever it is the price trend will will tell us but the most exciting thing is when you have this apathy and then people come back it's very very nice and you can be one of the early ones to see that. Let's see if this is the actual signal of of new retail. Probably not, but um at some point it's going to be the actual signal of new retail at some point. Currently, this is not. We can monitor what's happening with the social risk right here. Uh social risk currently is very low. This is based on Google searches. So, no one is really searching uh crypto. The last time people searched crypto was right here in 2020, end of 2024 when it was Solana alltime high and Trump coin and all of that. Now not a lot of searches and also uh let's look at fear and greed because it's interesting how fast the fear returns um into the market. Also how fast how fast the greed returns into the market. Here is fear and greed. It is now greed as you can see. Yesterday it was also greed. Let's see if it changes uh today on the uh on the refresh here. But you see very quickly people go from fear to greed, from greed to fear. Uh let me see if it loads here. Uh and for us the key thing is to keep the head cool and look at the uh price chart because this you know it emotions emotions you see yesterday people actually went to greed. Now we're neutral again. Now we're neutral with the newest refresh. We're neutral. But this is how quickly people go from fear to greed mega mega fast and um I also seen many people in on Twitter and so forth they change opinion so fast instead let the price guide you and uh that's it that's the biggest signal instead of gut feeling uh the fear and greed really reflects the gut feeling of people when you have 2% pump suddenly greed when a bit of dump suddenly fear instead you need systematic systematic approach approach to the to the market and have your own thesis on what's happening like we have on this channel. Now uh the glass node uh company is where this data is coming from that you have more and more users uh on chain actually now there is glass node I become a bit more yeah because you cannot is it new new wallets or is it just uh someone that created a bunch of wallets but it's the same guy with onchain is always tough man especially now with ETFs and so on so forth it's it's a bit tough I mean the fact that you have alltime high new wallets is it really that I'm very skeptical when it comes to the onchain companies, guys, because normally their signals are very bad normally because they need to make so many assumptions. It's it's quite insane. They need to assume that this is not a normal transfer that is a buy. They need to assume that this is not a just a guy that created a new wallet for himself. It's actually a new user. Assumptions are massive. It's massive, massive, massive. So here in terms of interest, I would mainly be looking at uh social risk. Social risk. Okay. If we see people actually searching crypto, you know, we're not going to miss it. We're not going to miss it. It's going to be it's going to be in the social risk. So, keeping it simple, there is not any new entrance now. So, likely this pe this peak this spike is some kind of exchange, some kind of uh player just redistributing their uh their wallets uh reconfiguring them and uh yeah, there there's no new retail. Uh this is interesting. You have Bitmine expecting 400 million income on Ether holdings and they also bet on Mr. Beast company. As you know Tom Lee he's not only buying ETH now he's also buying Mr. Beast. Okay I mean that's so before he was only buying ETH now he also spent 200 million on Mr. Beast. So they are diversifying from ETH only and this makes sense in one way because he also says that ETH will produce them $400 million in uh income from staking. So based on that you can uh diversify in other different things. So Tom Le's Bitmine now becomes more of a you know investment fund for new exciting uh stuffs you know whether it's ETH whether it is Mr. is it's not not a crypto only cryptofocused. It's a bit different. It's a bit of influencer. It's a bit of crypto. It's a bit of this. It's a bit of that. Um but it is true that overall bit mine has a way better position long-term than Micro Strategy because Micro Strategy actually has no income. You know, they they invent all of these different metrics like um Bitcoin yield. Like Bitcoin has no yield. That's the thing. Bitcoin has no yield, but they invent different things. No, Bitcoin yield isn't for most part it is for guys. They then they explain, oh yeah, but we grow Bitcoin per share. Listen, Bitcoin has no yield. The only way to make Bitcoin yield is to lend it. You can lend it to someone, you can get yield. Uh or you can try to make financial gymnastics like seller is doing. But there's no such thing as Bitcoin yield. Okay? There's no such thing. Uh you have to take risk to get yield with Bitcoin. With ETH, it is different because the way that the inflationary model works is that if you just have ETH and you stake it, you get more ETH. So from that perspective, the yield from ETH is risk-free quote unquote because if something happens to the yield, then ETH itself goes to zero. If some you know there's some bug with the staking or something, then um if let's let's compare that if you did not stake your ETH would still go to zero. So staking or not staking is the same risk. That's why it's like risk-f free if you compare to just holding ETH. So from that perspective, these ETHbased ETH-based treasury companies, they are more sustainable theoretically at least because you have the income, you have the income, so you can actually pay dividends to shareholders, you can invest in new things and so on so forth. So I am more bullish overall on the uh income producing ones whether it is ETH whether it is soul whether it is other ones because at least then Wall Street understands it and um you know I have this issue with for guysing yourself into yield I mean Michael S is creating a new product every quarter with new credit note that credit I mean there's financial gymnastics all the time there with when you actually have income totally different totally I mean then you actually have yield you can have yield It's a big big thing. Next, next next. When it comes to the SEC, Democrats don't like the current SEC at all. Uh they they don't like the current SEC. They're saying that the SEC is helping crypto too much. They're also saying that uh they don't really come after uh Justin Sun. They should go after Justin Sun way more. So, SEC basically isn't pursuing Justin Sun. Um, and you you have this political struggle now with Democrats trying to stop the uh the new bill that is coming out, the the declarity bill. Um, at the same time, Coinbase is also pulling their support for the new market structure bill. Why? Because Coinbase is saying that there's a lot of new stuff there that is bad. For example, the ban on stable coin yield which was recently added by the banking lobby. So, let's see what's going to happen with the bill. Maybe Charles Hoskinson is correct that it's not going to happen at all until 2029 because that's the whole thesis Charles Hoskinson has in the recent interest. He's been saying that listen this bill will not pass until 2029 because now it's midterm and if Republicans lose control it's not going to be great because uh Trump has a lot of crypto and Democrats don't want to help Trump obviously to become even richer and Trump is really at the center of all of this. That's why Charles Hoskins saying that he doesn't like what Trump has done with the meme coins with being so much involved because we cannot get legislation through now. Let's see what's going to happen. But another part of it is that Democrats also don't like that SEC is not coming after uh after crypto companies for better or worse. If there's a reason or not, that's secondary. But uh yeah, SEC is very good for crypto. I mean that's something is very good. But for this to become permanent so that even when Trump is gone, the SEC is still good for crypto. We need the market structure bill. That's the whole thing. That's the whole point of all of this. So yeah, let's see if uh 2029 is the next chance or if they can get it through now. But if they get it through, it's not good. It's not good either because then you have a bunch of restrictions on ZFA. You have a bunch of uh uh problems for stable coin companies. Let's actually see what Brian Arrong sent because he did comment on it. Um here here here after reviewing the Senate banking draft text over the last 48 hours coinbase unfortunately can't support the bill as it's written. There are too many issues including a def facto ban on tokenized equities. That's very bad because now as you know on Pionex on Bybit you can trade uh I mean all of them you can trade basically all of the stocks um AMD you can trade semic semiconductor ETF ASML micron anything you can trade anything you can trade so with this new bill that would not be possible defy prohibitions giving the government unlimited access to your financial records and removing your right to privacy erosion of the CFTC's authority staffing innovation and making it uh subservient to the SEC. Draft amendments that would kill rewards on stable coins, allowing banks to basically ban their composition. We appreciate all the hard work by members of Senate to reach a bipartisan outcome, but this version would be materially worse than the status quo. Would rather have no bill than a bad bill. Very true. So maybe we don't even want the bill now with the changes because it's not what it was just a few weeks ago. Okay, they changed it a lot. So this market structure bill everyone was raving about is not good even. I mean you see yourself no more tokenized equities, no more yield on stable coin. You have to go to the bankers in order to get yield if this happens if you want to get yield on on dollars. So yeah, I think that narrative is either turning into a bearish one or that we just have to postpone the bullishness until 2029 when they can actually do it without all of this. Um, and it's interesting to see what kind of influence Brian has. Okay, he has withdrawn support, but what does it mean? What does it mean? He's withdrawn. Okay, so what? So he will so he his politicians will not get money from him if he if they vote for it or what what does it mean guys? All of you who know more about US politics, let me know. Does anyone care there that he has withdrawn support or is this significant? Like it's good that for general information that he's stinging I don't support. I mean just like you and I can say we support we don't support but does it actually mean something? Can he stop it? Can he? Yeah. Let's see. I'm actually optimistic that we will get the right outcome with continued effort. We'll keep showing up and working with everyone to get there. Let's see what Sam Lumi says. Nothing. Brian is lying. Hence the facto talking. But I mean, Brian probably knows better. I mean, it's it is in his interest to have all of the tokenized equities on Coinbase. Uh, so they can become more like Robin Hood and we can merge Tradfy and crypto and have more 360 opportunities for crypto investors. Guys, on this note, let's go to Q&A questions, answers, debates. Uh, big shout out to DAB who is time stamping us today. Uh, welcome, welcome, welcome everyone. Let's go to your questions as soon as possible. To summarize guys, for us nothing really changes. I mean, just like we weren't too excited when Bitcoin pumped above this resistance, we're also now not really putting a lot of weight into this uh um pullback. I mean, it's the same. It's the same. We didn't touch the 50 moving average event. And if you are a mega bear, like big bear, then if you look on this new chart we added, then if you look at the EMA, we actually touched it. This chart doesn't show it because here we look only at the close closing prices. But if there is a wick that went above the 50we EMA. So all in all the good thing is for us we don't really have to worry too much about it. All of this here is a no trade zone for us. Uh just sit on your hands. 30% is in Bitcoin. Fantastic. In case it goes to Valhalla we're going to get the notification. Uh other than that 200 week moving average is the next target for big fat fiat track backing up. That's Bitcoin. All coins you've seen it is tradable mega tradable. Um especially if you know what's breaking out. So go to booming.com watch the training get the tools and yeah let's go guys. Let's go to Q&A questions answers debates discussions. Let's go. Are you still leaning bare Ivan? I mean long-term we're bullish crypto. Long-term we're bullish crypto. Uh the better question is what's your position? What's your position? Because I don't like know bear bull. It's people put themselves in a box and give themselves identities which don't serve them. If you say I'm bull, I'm bare, you're not approaching the market correctly because it's not really about that. It's all about how do you position and what's the triggers to change position. So currently we're positioned 30% Bitcoin. We start to derisk on October 8th as you remember. Uh that was the first signal when we had the fake alltime high and then the bare trend on the daily. The second signal to derisk even more was below 50 moving average. And then the third signal was below the uh flip. So currently we're 30% Bitcoin. The where when it will change is in case we start going above here 50 moving average then our buy price is going to be the same as the average sell price. So basically we avoid all of the risks and uh we get back at the same price and we have all of the upside. That's number one. And then the second uh trigger to be buying is if we're close to 200E moving average. So I don't know what you call it. Is it bear or bull? It's up to you. I don't want any labels. Labels are very bad. It's also a sign of a bit of this newbie, a bit of the newbie mindset, which is totally fine, but we've all been the newbie sometimes, but you know, this buller bear because it means that you're either all in or all out. And that's like the the newbie mindset that, you know, either I'm in or I'm out. And it's very bad because at the end of the day, all markets are probabilities. If you're all in or all out, what normally happens, let's say that you go all in near the bottom, it can still dump another 30%. When you look here at the, you know, 200 moving average is one of the best ways to best uh best times to buy Bitcoin. The problem is that even though it is great, it can still dump. So, here we have the simulation where we look at all the times Bitcoin was around 200 week moving average. It was great time to buy, but if you went all in, you would struggle through a 24% loss in 2022. On average, it's still great. It's the best the best time to buy Bitcoin. On average, it's still great. But if you're all in all out, the problem is that you put yourself in a very very tough mental position. You're all in. Okay? Even if it was a great buy at 200 million, okay, now you're down 25%. Depends your on your net worth. It can be years and years if not decades of work, okay, of of the of your career, of your struggles you've gone through. So, it can be very very challenging mentally. Instead, it's better to have an entry strategy, how you lad in with what signals and an exit strategy. So, for us, you remember since October 8th, we're lathering out. It's not like no, sell everything on October 8th. No, no, it was fake out, bare trend on the daily. That was the first signal. when you have a alltime high fake out and bare trend on daily as well as where we are in the forest cycle like there are many things that pointed in the bare direction so we started to derisk not sell everything because tomorrow there is a chance we pump to Valhalla again but when you have the these strong stronger signals coming in it's time it's time to start positioning then our next signal to become riskoff was the 50 moving average that's when we uh had even more confidence and then the the bare flip so the same thing is on the way up Anyway, it's a very very long and very important topic for you to get right uh to stop thinking in terms of are you bare, are you bull instead think in positioning and the best way as you know to learn all of this is to learn the mechanical rules because what I'm telling you here is the mechanical rules. Go to bullmania.com use the link below watch the free training. I mean if there's anything you should do is to watch this because 99% of people they don't know it they go all in all out they're bear or bull. I see it also in the comments. I see it a lot. I don't know you bear or bull but you were bearish yesterday. You were bear like was that it's all positioning. Don't ask if someone is bear or bull. You you're not going to get a good answer. Ask instead what's your position and what are the triggers for that position to change. Okay, that's the correct way to say it. Uh because basically you're asking them for their for their so-called mechanical rules. What uh what will change? So anyway, hope that makes sense. At the same time, I'm very bullish on anything that flips bullish on the money scanner, which you also get in bull. I mean, you see yourself, are you bare or are you bull depend depends on what context? I mean, I'm very bullish on anything that flips bullish on the mainline. I mean, you see yourself dash bam bam bam bam bam bam. This this is short term. Are you leaning bear or bull? Would you mean long-term or short-term? If you can be super super bull shortterm while longterm be uh risk up. Okay. So for trading shortterm, this is great. You can trade on bybit. If you use the link below to exchanges I use, you're going to come to his website booming.com/partners. Bybit, fantastic bonus. Bit fantastic bonus. So for short term, anything that is a new bullish trend, bullish for long-term everything that's in a new uh bullish weekly trend, bullish. So that's that. Memecoin is running like bite. Will we see a memecoin run? We we're we're currently seeing it. We're currently seeing it. Uh but it's not for the uh average, you know, average guy. It's more it's more of a gambling thing. Uh you see here on pal fun like we saw 10 minutes ago, 15 minutes ago in the stream. Pump fun activity is nearing basically alltime high. This is their fees. So definitely there is a lot of interest in memes now. A lot a lot a lot a lot. Um it's a totally different mindset. It's a totally different uh uh type of persona that that that that is trading meme coins versus even trading all coins. Like it's totally different. You have to basically be terminally terminally online. For most people, it's not a good idea to touch it because if let's say you you have a job, you have family, this and that, you're going to get wrecked. Okay? Because it changes so quickly. It's a lot of insider cabal. You need to know who is in, who is out. A few minutes, a few hours in, out. I mean that's the that's why I say terminally online. So for most people the better thing is to focus on the outcome of it. So the outcome here could be that you can buy and speculate on the pumpcoin. Uh if you want to bet on the on the memecoin activity memecoins themselves the cars are just stacked against you a lot. It may change in the in the next bull as Bitcoin is bullish and like we just have, you know, more money coming into crypto, more users coming into crypto where it's basically going to be, you know, throwing darts at the board and then most of them are okay. Uh, currently with memes, you still need skill, man. You need skill. You need skill. You need dedication. It's I mean, it is a fun industry. It's a fun industry. It's uh not even trading like it's I would put it more towards gambling and it's more towards you know do you know the wallets do you know who is in who is out and that you can also adapt quickly because the time horizon there it's not uh even weeks guys it's uh maybe a day maybe a maybe two day is so basically the memes from the last bear you know you remember the peppa Peppa also started in a bear uh it's not like what we're seeing here with the pamp it's not you know, new Peppa. It's not like a new dog with hat. No, no. Like, it's totally different. It's, you know, something comes, it go tomorrow is gone already. Can you make money there? Absolutely. Is our card stacked in your favor? Not really. Not really. Not really. Yo. Yo, cryptofactor, what's happening? You got to have longevity 100%. Oh, traveler working for a crypto project says that what does he work for? That's awesome, man. Travel 11, right? What what happened to him? He was uh stamping a lot, but now he's working on a crypto project. I mean, that's great. That's great. Silver running hard, but due to a pullback eventually. Yeah, let's check silver. silver. Yeah, man. Another week, another big fat pump. So, when it comes to silver, I know many people are saying, \"Oh, it's the top this and that.\" It could be the top any time. It is parabolic. At the same time, uh it can still if you go to 150 before like we don't know where the top is, okay? We don't know where the top is. So, is it smart to sell here? All depends on when you enter. If you enter the new bull trend here, then lading out a bit like taking at least initials or something, especially if you trade with leverage makes sense. Um, but I would leave still some position in the in the market. I mean, you never know with trends. The thing is you don't want to exit them too early. Yes, it is a parabola, but you see if it just has a cool down. Let's say it cools down to 75. Okay, now it's no longer that that much of a parabola. It can continue like here. Like here, you see this was a parabola. Okay, it has cooled off for a few weeks then continues. So the fact that it's a parabola is not necessarily, you know, a signal to sell everything. Of course, if you bought here, follow the mechanical rules, u take a bit of of chips off the table, fantastic, makes perfect sense. But a parabola can enter a bit of consolidation and then continue in a new parabola. So from that perspective, being super bearish because it's up a lot, is kind of uh vertical does not make sense. Now if the trend is bearish is different then we pack up the bag and we we go somewhere else. There's always another bull trend somewhere else. So that's uh that's very important from uh not selling not selling your winners. Selling the winners is not good. Let the winners ride. You can ladder out to take chips off the table to be mentally in a better position. That that makes sense. But uh to be bearish because something is bullish, not good until I mean as long as it's not in a bare run. I mean, is there a video how to trade gold or silver and pionex? Yeah. So on PyionX, if you go to exchanges I use booming.com/partners, you're going to see this copy my Pionex boss. Click here and you can just click here on copy. Copy the silverbot. It is this one. SLVX. Copy the silver bot. That's the easiest way to get started. And then you you you're going to find gold there also. They have gold, they have silver, they have everything. And for all you guys who joined recently, if you go to booming.com/partners or just click in description exchange I use, you sign up for Pioneex using this link. You can copy the bot using this link. And here you get low fees, you get nice reward and all of that if you use the links. And then step number three is stock trading competition because again all of the crypto exchanges now they're moving more and more towards trad because that's what's pumping now. So if they don't have it it's very bad. You cannot participate in in the upside. And here you have this uh uh competition for trading uh semiconductors. Okay. Uh you can read more about uh how it works here on the page. Uh but I I think that's the main thing. 360 investor. You have to be a 360 investor. Yo yo travel, we're just speaking about you. We're just speaking about you. What's happening? You work in the in uh in crypto now. I think Matt said that you've transitioned to a crypto position. Travel says, \"Pionex, love them. Very easy and their bots are amazing.\" Yeah, 100% 100%. Do you see the Monero pump continuing? The same thing as with silver as long as they are in a bull trend. Um, don't sell everything. Have at least a bit because it something that is in a bullish trend is likely to continue. Not guaranteed. Big distinction, but likely. So, let's say that you have nice profit here from this entry. You would be at 100%. Now still at the peak here you will be at 130%. Uh so I would take a bit of the table. Um again there everything when I say take a bit of the table this and that if you want the exact exact strategies it is the mechanical rules on bulman.com but in general if you're in a profit take a bit of chips off the table so you have secured something. You're now psychologically more relaxed. You're more coldblooded. You're more rational. you're not as emotional because you you already made profit. You you entered, you took risk, you made profit. Great. But I would still leave a bit here. Again, it just pumped. It could have a consolidation then continue. Um but is it due for a consolidation? Likely. I mean likely. Yes. Uh so I would leave a bit here for sure. And that applies to all bull trends, especially the strong bull trends. Anyone know what's happening to Cookie? Yeah, Twitter nuked them. Twitter nuked Cookie. Twitter nuked Kaio. They nuked everything that has to do with Infoi. Their whole product is wrecked. It does not work. It's uh banned as a thing. So you see here Nikita Beer, head of product at X, he said that their they removed all their access. They banned them from using the API without the use of API. Infoi does not work. It doesn't work. Let's see if Kaio or Cookie has commented on it because they either need to say, \"Listen guys, GGVP, we're done.\" Um, let's see. This is what Kaio is saying. Let's see what happened here. For full context, here's the timeline. On January 13th, we received an email heads up for potential re-evaluation from our account manager. We immediately asked for clarification. Jan 14, we received legal notice from X and issued our legal response on the same day. On January 15th, we saw Nikita's tweet same time as everyone else. I would say from Nikita, it's very irresponsible to nuke many coins like this with an announcement at the same time. I mean, it's tough, man. You either give the information to everyone all at once so everyone knows and we everyone nukes at the same time. That's that would be one way to do it. Maybe it is the best way to do it. This is what what was done by Nikita and Twitter. The other way to do it is to say to the projects, listen, we don't like what you do. Here is a timeline when we're going to ban you. The problem is then insiders can exit. The team can exit. Insiders can all the insiders know. That's why checking the chart is so important. Let's actually see if there was a bare trend on Kai. Probably yes. But here's an example where, you know, Twitter could have uh uh they could have done it in different ways. I mean, I I suppose it's good that they just told everyone quite quickly. So here the dumping started on the 14th and then boom, big nuke on the 15th. Yeah. So maybe someone started to take uh profits like here, you know, this week. This is when they got the first notification. then here and then so yeah I suppose the way they did it it makes sense but everyone is nuked why was there no prior announcement it's not the first time we received legal notice from X according so this is from the Kaio founder the previous occasion was resolved amicably amicably how say amicably with new enterprise agreement so it's reasonable to wait further for further clarifications and discussions before we unilaterally announce anything. How long have we been planning Kaito Studio? For several months now. Kite Studio was working in progress that signals our expansion crossplatforms as well as beyond crypto complimenting YAPS. So what happens with YAPS? With YAPs sunsizing, we move crossplatform. Okay, they're going to go crossplatform. Hi, happy new year. I appreciate you reaching out. Ah, okay. Okay. So this is I thought this was Twitter trying to sugarcoat the bad news. Happy but I guess it is them replying to Twitter. This came a surprise but we do appreciate a sub. Okay. Hello team. Please attach letter from our side. Where is happening year? See when it's bad news. No happy year. See attach letter from X which requests your prompt response. Okay. Okay. So they're like yeah look at our letters. to happy new year guys. Merry Christmas la. Boom. Removed. Nuked. Oh, by the way guys, another thing I forgot to tell you. Go to bullming.com/job. I'm looking for uh clippers. Clippers. You know clipping. bulming.com/job. Check this. If you love clipping, you love the clipping. basically making short form content from our long form streams, then this is for you. Click apply. Click apply right now. Cedar is too spicy for I Yeah, I mean actually I'm I got kind of burned out also on all of these policies, guys. I don't find it interesting anymore. Uh that that's another reason. There is something I don't know. There's something that uh I I found it funny and interesting last year but this year I mean now with AI everything that's happening like I have so many new interests like vibe coding I have no time to like worry about siders or anything I mean we all know west is uh suiciding but uh who cares I mean uh by the way this whole website bull.com/chars you know it's vibe code it was crazy so I don't actually care too much about that either now I We said what we wanted to say. That's it. That's it. And then um yeah, everyone does what the hell they want. And we focus forward. We focus forward. So yeah, I get kind of I don't know, maybe you had it also, but something I found interesting, you know, to it also became kind of mainstream. That's another thing you know in like five years ago having right-wing content on Twitter would be like you know like a miracle now man it's everywhere it's everywhere and so I feel that it's kind of mainstream now so by definition it seems that there's nothing I mean we can still comment on it of course but I mean everyone understands everything UK wrecked everything is everyone knows so the problem is I mean as you see messages out there. When will the change be? It can still take years and years and years. So, let me know what you think, guys, about that. I'm just not um I don't know. I kind of lost the interest in that. Now, I'm I'm just uh you know uh there's there's so much stuff to learn with the with the AI stuff. I mean, whether it is VIP coding, whether it is vi vibe running company with cloud work, um cloud co-work. So yeah, no time for that. Basically, X is preparing to make Dogecoin their currency. They're definitely doing something with finance that they will have a finance app. Hopefully, it's going to be with um crypto, stable coins. I mean, I guess it is. Anything else would be too bad user experience uh that you you have your assets inside the Twitter. I'm pretty sure it's going to be crypto because everyone else has crypto. Revolute, Robin, they all have crypto. So why would X have not not have crypto? So it's likely going to be something around crypto. By the way, guys, let me know what kind of charts I should vibe code more. This morning I voded this one, but I love vibe coding. So it's it's so it's so crazy, man. Like can you imagine that? I mean this whole website like all of the charts everything I did it in like a week and the first chart I had within 30 minutes it has back end front end it's mind-blowing so now with I have all the data in the back end here so I can just tell it to do any chart I thought this one was interesting with Bitcoin moving averages because I put the most important so the two most important ones for Bitcoin I know it is weekly 50 and weekly 200 if we're above the 50WE moving average then we're in a bull market and 50 moving average is support. If we're below it, we're in a bare market and then it is resistance. It's quite simple. Uh and normally we come back and touch the 50WE. Then let's check the EMA. Actually, this is the 50WE EMA. So here the bears would say that we already kind of touched it. We did have a week towards uh above it. Uh on this chart, it's not seen because it's only the daily close. Uh but let's see. Yeah, I mean this one is also quite accurate in the bull market. the EMA 50WE EMA is support and then in the bare market it's resistance like you're uh so yeah if you don't if if you're not too smart like some people they try to be like outsmart the in crypto no you you never want to be smart too smart whether it is when when it comes to buying dog with hat or dogecoin or other retardio stuff uh fartscoin two when it comes to being too smart uh like finding reasons as to why uh something like the 50 week and the 200 week is different this time and they may be different like who the hell knows we're going to as you know uh we will change our mind if we go above them it's all about positioning anyway no one knows the future uh now the problem here I I think so the 50w week EMA is basically as good if not even better than the SMA I mean you see yourself the EMA the blue one it it's like exact support and kind of exact resistance SMA it's a bit more gap but then when it comes to the 200 100 here. We went so much below it in the last bear. So here I would just stick to the simple moving average for when to buy around the 200 week. We also went below it here. Went 20% below it, but we went even more below the EMA. Well, anyway, I did that this morning. Then also the news, the news. People ask me, Aan, where do you get the news? Nor normally I would have a a list of tabs I go through. Now I vibe coded it here. Uh so yeah all the news are here. All of the different uh crypto websites and also I made them so that um uh AI analyzes is it bullish? Is it bearish? AI picks what's most important. Now this most important uh uh yeah I need to tweak it a bit more. Like sometimes it shows stuff that that are not super important but still it gives you kind of what's happening you know today, this week, this month. And then here you have a feed of all of the news. You can sort by high trust, medium trust. So yeah, this is all for free guys by the way. Booming.com/charts. Then as you know ETF inflow I check it every day. Very nice. Here maybe for the u ux maybe I should move the total to the left because I only care about the total but all is okay. Let's check the total. Let's let's let's scroll. Let's scroll. Maybe I move total here to the left. That would be nice. Uh global assets asset ranking. Very nice. see here gold, silver, silver above, invidia. So yeah, fantastic man. I mean it I'm just trying to estimate how much time like something this would take before vibe coding, you know, with uh I mean especially if you want to build the special UI customize and now you just tell it you know do do green button do oh no I don't like this do do this bama. It can do anything. This is the best UI developer I have ever had. He's the best. Now, is it retardous sometimes? Not really, man. Not really. I mean, it's I'm I'm trying to think when it did something very bad, the AI. I mean, some sometimes it's just um I I mean, it's not like two years ago. It's not like one year ago. But also, my use case is pretty straightforward, you know. It's basically get the data, show chart. It's it's quite simple. It's not too complex. I guess if you have more complex, it would be different. But yeah. Being a good trader is all about having strong opinions but not holding them too firmly when faced with evidence. Yeah, 100%. Very true. Very true. And and that and that's when the noob mind noob mind cannot comprehend it because the noob is either bullish or bearish. He's like but you were bullish yesterday on October 7th. 7th we were bullish. On October 8th we were we start to become bearish. I mean I remember you don't get but Ian you were bullish. What happened? Well, I thought we would be bullish until death tear us apart. How you say? Death takes us takes us apart. They think it's like, okay, Ivan is either bull or bear. And if they if Ivan is bull, it's like, you know. Yeah. Until death tears us apart, he's bull. I'm no why you you were bull yesterday. The same thing is now we risk off. I don't I mean I don't want to say bear. People people don't like when I say bear that we're that we're mainly towards the bearish side. At some point we're going to turn bull and I know many people will not like it either because when we turn bull people expect me to be bare until death turns turns us apart tears us apart and then uh yeah they they may miss the the upswing and they miss the upswing and then they're angry Ivan why you bull it's just a fake out Ivan bear I missed the upswing it's gonna happen I'm ready for it I'm ready for Um, Ivan, you know what would be sick if you could have a automatically draw out alert you of new ranges. Yeah, that that one is interesting. I mean, we it's kind of like what we have with the trend, but I want Yeah. So, the next step is to see if it can it can like see basic support and resistance. Can we do that? That would be amazing. I'm I'm going to think a bit in in the weekend like given a chart at least you man draw support resistance because then it draws horizontal support resistance great kind of a ch then could be a channel um absolutely now when it comes to this an I haven't done too much well I've done a bit of analysis with AI like for example this news analysis with AI I'm not too happy about this one because it's not um I mean listen this month is the most important thing this month is that Google Play will require soon all crypto platforms. I I don't think it's the most important thing this but it thinks this. So AI is great for deving for like analyzing news. I mean this far I need to have a better prompt but yeah I need to tinker with it more. So the reason I'm saying that is because analyzing chart is going to be kind of like this like the same kind of task. It's not the same as just do website. So I need to improve on that on that front. But it's fascinating, man. It's fascinating. Like this AI stuff is fascinating. I have no time for cedars now. I I'm only I'm only AI. Do you know what would be I just read it? You can vibe that in 15 minutes. Well, I mean when you're backseat driver or or you are on the sidelines, everything is 15 minutes. But when you're driving, when you are in the arena, suddenly you understand uh maybe not 15 minutes. I mean, man, if I'm backseat driver, I can tell you anything. Tell you going to be 30 seconds. Just vibe code. Just vibe code. Well, and to be fair, it I mean, everything is fast, but um there is um there is complexity to it as well. But listen, I I've just been vibe closing for one week. I've just been webc for for one week. If I just continue this in in, you know, in a few in a few weeks, I am gonna oneshot anything in 30 seconds. Maybe like you you do already. Hey, by the way guys, I I did try also with VIP coding. I I actually did try uh cloud code. I don't like it, man. I mean, it's good, but I like Lavable more. So, I started with Lavable. I got very used to it. It's fantastic. Then I thought, okay, let me try cloud code. Man, it is that one is dumb. Not in the sense that it's not smart. I'm sure lovable uses them on the back end, but it's just like so much work it wants me to do. You know, with Lavable, it runs all of the backend migration. Like you want a new thing in your database, Laval just does that. Bum bum bum bum bum bum bum. Man, cloud code. It tells me run this migr. What? What do you mean run it? Run yourself. Then it tries to install the CLI. Oh my like oh I cannot install the CLI for for the superb basease would like why why you come to me for this like Lavable would already oneshot the crap oh no I am uh I'm installing CLI cannot install then then cloud code ask me can you check the console check the the dev console copy what is like are are you like what do you mean check on loavable if there is a problem if if there is a crash in the console or some network it just says a button Try fixing on level just click try fixing it already knows all the console all the network log like what the hell it knows everything cloud code no please check console copy like what and then also I need I need cloud code window cloud code by the way I don't know maybe it's on Mac but UI is like laggy I don't know what is like so laggy on UI cloud you know I click it I click I need to click main but anyway so that's a problem then I need another window it needs to install it cannot install CL I so I need to help it to install CLI then uh of course it has very little connection to the different u systems like you say you want to deploy okay but it's kind of your job to it can help you to deploy but it's not you know in love it's like it's already deployed man it's already deployed so anyway uh I didn't like it guys cloud code I didn't like it I just thought that oh yeah another thing another thing in lovable it knows what you look at so I just look at what I'm working on and say hey bum bum bum bum change color bum bum bum do this do this do this this it knows what I'm looking at with cloud code it has no I need to tell it hey on this or I need to screenshot and like tell it exactly it's I don't know man it's uh I have no shame in say that I use the some people are ashamed like oh no I use cloud code and Ralph wiggle like what else I have no shame like yeah I just want output and that it's great I did try cloud code I'm a developer myself cloud code for me was too much like normal development you know check console check yourself console I don't want to check any console. Help me installing CLI. What do you mean, man? You're AI. You're AI. Do it yourself. So, I want only web based ID, web based. I'm not going to sync any freaking terminal more. Uh, you don't need it. It's just for code monkeys. It's like um there's no productive output based on that. Uh there's no you get zero. You lose productivity. You lose productivity. So uh anyway so that that's a bit of my journey with um I'm still trying to think when I would actually need cloud code like for my use case you know I I also have quite simple use case I I just need a bit of stuff in the database and then call some function to aggregate data in chart I mean maybe for more complex things you need it I don't know man let me know guys how what and also you should you should try like all the tools as well I mean I'm not saying don't try to try different things like I'm I've tried I did not like it. Like my review, it wasn't for me or at least for my use case. Now, if I have another use case, I'll try it again. Anyway, that's that. That's that. Yeah, charts are simple. Cloud code is is amazing. I I guess the issue is I guess the issue is that I want to vibe code. I don't want to have like a serious setup, you know. That's what I don't like with the cloud. It's like it requires you to still, you know, run on your machine CLI. It's like it's not vibe. I mean, it is vibe causing, but what if I am traveling? I need to like it's still local environment. It still needs to work like it's you know, it runs stuff on your machine. It works on your machine here. On vacation, on laptop, it doesn't work. You need to set up it from scratch. So to me, I want real vibe coding. Real vibe coding means anywhere you just talk to a chat and it does stuff. That's vibe code. That's my definition of vibe coding. Okay. With cloud code, yes, it's like a it's somewhere in between. It's somewhere in between. Anyway, for me, for me, for me, for my use case, more more correct. Guys, listen. That's it. Thanks a lot for being here. Smash it up. Let me know what you think about cloud code. I I think you're going to have many opinion. Maybe I'm gonna love it with with some other project I do. Uh Google Gemini 3. Yeah, maybe. But yeah, do they have like a Oh, anti-gravity. I guess I still need to try that. I uh there are too many tools, man. There are too many tools. So, enjoy your uh Friday. Enjoy your weekend. Smash up the like. Subscribe. Have a good day and goodbye, guys. Goodbye. And big shout out to Dub for timeing us today. Have a good day and goodbye."
    }
]