[
    {
        "video_id": "zOyx8f2G25U",
        "title": "LAST CHANCE.. Freaking Take It!",
        "published_at": "2026-02-10T21:22:13Z",
        "sort_date": "2026-02-10",
        "url": "https://www.youtube.com/watch?v=zOyx8f2G25U",
        "transcript": "Lotion line has been blue on Bitcoin for four months already. Bear cap was out at 120K plus. Lotion line confirmed it. Flipped blue here at 108 110K in October. Blue on Ethereum, blue on Solana. And doesn't feel so lagging anymore, does it? But back to Bitcoin now. We have a shortterm bottom for sure with a strong bounce of key support which was established already in February 2024. two years ago. Support and resistance are not magic lines. People remember prices. That's why it works. Could this be enough to turn it around? Well, I will share my exact game plan in this video. A new year is starting and a large part of the world celebrates new year starting now in February, not in January. And this year, it's the year of the firehorse. But this bounce is not enough to turn the trend around. So, I'm still wearing the blue cap. Yet, I'm bullish on everything. Bitcoin, altcoins, stocks, commodities, even some forex. How does that add up? How can I sit in a blue cap and still be bullish? I will explain. Don't worry. Just as the previous times, the lower it goes before the turnaround, the better. The worse the narrative is, the more it's over, guys, we get, the better for us. I want more quantum FUD. Please, China, ban Bitcoin one more time. I want more M2 money supply guys and ISM guys and plan B, yes to F models who get everyone thinking that it's going to go to the moon instantly. And then when it turns out they were completely wrong, people get so disappointed that they rage quit and sell everything. Great. I want more Financial Times articles because the lower before the next turn, the better. And there's no need to be stressed. We're not going to miss the turnaround. Bitcoin is not going to go to a million dollars with a trend down. Can't happen mathematically. So, let's saddle up, folks. Let's get ready for the year of the Fire Horse. Bring it on. It's not over. We're just getting started. I'm extremely bullish over time on many things. Hoard digital money on the internet in the AI era at a time where there is reckless government spending, crazy debt, and gold is going parabolic. As a response, digital money with a cost, speed, and efficiency advantage, a factor thousand better than the old systems. I'm bullish on Bitcoin because of the generational shift. Just take the new US Fed chair as an example. >> If you're under 40, Bitcoin is your new gold. >> And I'm bullish on blockchain as a technology, which is alt coins. Profit per employee and focus on the magnitude. Number of employees, Robin Hood, 4,000. Hyperlid 11. Revenue I saw different figures for Robin Hood 3 to five billion let's say four billion hyperlquid 1 billion profits Robin Hood 2 billion hyperlquid almost the same as revenue 0.9 billion revenue per employee Robin Hood 1 million hyperlquid 90 million profit per employee Robin Hood 0.5 million hyperlquid 80 million this number is 160 times more and Robin Hood is a modern pretty efficient company this is the efficiency advantage I'm talking about and in the future tokenization of all the world's assets with a cost advantage of even more democratizing access to assets making it global it's not going away guys it's not the value is enormous I'm bullish on volatility on trading the parabola in silver looks the same as any meme coin you can pull up and Bitcoin institutions didn't change anything. Someone wrote here, \"How is it possible that a large asset like Bitcoin drops from 90,000 to 60,000 in 72 hours?\" Then I commented, \"Wait until you discover silver.\" Volatility is not going away just because the institutions are here. It could get more volatile. And I'm bullish on Asia and Asia-like countries. The world is polarizing. One half of the countries want the last person still left to pay for everyone. The other half is trying to attract the profitable people and their companies. UAE, Italy, Cyprus, Singapore, Switzerland, El Salvador and so on. That opens massive opportunities for us to run our own lives, not the lives handed to us. I'm bullish on AI taking more and more roles. And that means for you, you need to wake up each and every day to build assets and learn to build assets. Everything else, all other white collar work will diminish in value. This year in 2026, I'm bullish on friends, contacts, community. Don't underestimate the power of a network of people. I'm bullish on our three asset categories. For the longest time, I bet on these three coins, stocks, commodities. It was the right choice. I'm bullish on Lion Line. I'm bullish on LLP3, the new process in Launch Line Pro 3. I'm bullish on our community sharing our findings using it. In summary, I'm more bullish than ever on everything we are doing here. It actually worked. We're standing here perfectly positioned for the change that is happening right now. I'm really excited for 2026. Actually getting goosebumps as I'm saying this year of the fire horse, ladies and gentlemen. It's going to be great. And if you're looking at some chart right now and feeling, oh no, I missed it. You didn't miss anything. This is just getting started. 2025 was a difficult year in crypto. Yet, we avoided disaster. We didn't hit the iceberg like so many others. We even largely sidstepped this dump, putting us in a better position now than ever to take advantage of the next bull run. LLP3 turned out key in this choppy year. Like to add it just before maybe we ultra smashed it in commodities, gold, silver, uranium, commodity companies, the influencers added support when the pump had already happened. We gave it to you before the pump and then raised the warning literally on the day of the parabola break. We ultra smashed it in tech stocks. Nvidia 10x from last launch line process entry. Tesla, Google, you name it. An amazing year. Thank you everyone for your trust. But now that is in the past. We can't get lazy now and start living on past achievements. Whether we believe in the year of the firehorse or not, I do very much believe in these characteristics of 2026 which will be I have to read here fast changeheavy. I believe that very much. AI disruption is accelerating now. Your safe job isn't safe. Markets will change. Everything is changing very fast. High initiative independent with this amount of change. You can't let yourself become passive and just let this avalanche roll over you. You have to take action on your own initiative. Do it your own way. Shield yourself from the manipulative narratives which are there to mislead you. And I will help anyone who still hasn't joined. We celebrate by inviting you with a discount. Instead of 5,000, you get 2,380 per year, which is about six bucks a day. is all the tools I use myself and my knowledge and insights. You can pay with cord or crypto. No excuses, just do it. CT city.com. Press the button. Next, emotions run hot. Quicker excitement and quicker irritation. This is the number one beginner mistake in any kind of investment. They buy the euphoria and sell the depression instead of the other way around. And most people will repeat those exact mistakes. So you need tools and a process to stay on track. Short sprints with clear priorities. I very much believe in this too. Just like last year where we had incredible opportunities in the altcoins during a brief period during the summer of 2025. Then the rest was long stretches of me where you just input your watch list in launch line pro and then do nothing except check the alerts when it comes. schedule recovery like it's work to keep you cool. This field of investing or trading is not a dayto-day job in that sense. You have heard me talk a lot about working in seasons, seasons of intense work and seasons of deep recovery with your loved ones. So this is the year ahead and we are extremely well positioned for it. We are captains of our own ships. We stick to the process and typically do the opposite of everyone else when they lose their controls and emotions run hot. This is perfect for us. It's funny, I would have said the exact same thing because of the AI changes happening now, even if I hadn't read these points about the fire. But there is one more key point, one more reason as to why I'm extremely bullish on all assets over the next years, and it's Kevin Walsh. I've thought a lot about this. First, everyone, myself included, was confused. Why would Trump bring in a hawk Fed chair after spending two years fighting to make power lower the rates? Now, I have a clear opinion of what I think that they will do. First, they will cut rates. And as the Fed and the Treasury Market keep rates low, the government's interest bill gets cheaper. even with a huge debt. Then if inflation runs higher than those rates, the debt kind of shrinks in real terms, that also means that the purchasing power of your dollars drop. Each dollar buys less in real terms. And when that happens, real assets get priced higher in USD terms, all else equal. So that means everything seems to go up because you're looking at it in USD. Even if there is no real growth, for clarity, there will also be real growth in many assets. I'm just explaining that there's two factors at play here. You can see this very clearly in the Dow Jones index over 100 years for example. So I think a hard asset like Bitcoin, digital money on the internet in era digitalis will emerge super victorious in this environment. Let's take a few comments. I've been following CTO for 5 years. Every time I ignored Lion Line, I lost money. I watched this video on October 10 around 400 p.m. and thought, huh, let's take some profit. BTC was at 116K. Had dinner and instead of selling, I watched some TV. Around 21, the whole crash happened. Don't watch too much TV guys. Best investment ever made. Me too. Same. Thank you. I cannot express my gratitude enough for Line Pro. This is my third cycle. The last two I did really well and then roundt tripped pretty much all of it. I signed up to Loine nearly a year ago. I exited when it flipped blue 186K. My first cycle. I have not roundted. The relief in my soul over the last two weeks is indescribable. Lo Pro has been my best investment in crypto over the 10 years. Just buy it and do the course. Be like Harry. Was really hard to sell BTC at 108K and Sana, but now I'm really relaxed. I sold around 70%. Imagine if I had sold 100%. It's actually easier to take a partial decision. So well done CTO and nailed the calls this time. Absolutely. Shout out to Ian as well. 99% cash since your bare mic video. I really like this one. CTO, you saved me from losing all my capital. And that's really what this is about. Making money in the markets is easy. Not losing it again is hard. Now, I will address this one because it's a good question. Hey man, honest question. If you are so good in investing and trading, why charge your followers with a trading course of 2,300? So why? Three negative reasons, three positive. Negative. First, it costs me time to manage this and to be available to people. This weekend, I had to write three long emails to the same guy who didn't follow the rules in our Discord. One on Friday, one on Saturday, one on Sunday to try to explain what he did wrong. I had to do that instead of analyzing other charts or being with my kids. Number two, it costs me something in liquidity. Suddenly, there are more people like me who try to buy the same gold flip. These are my actual tools, guys. you get the same tools as I am using. And number three, it costs me something in risk to myself, maybe even to my family to be public on YouTube in an area of financial education. So, it costs me something, then you sure as heck are not going to get it for free. The three positive reasons I like being of use. I build an incredibly valuable contact network. And number three, to truly understand something, you almost have to teach. So in the end it fuels my own growth and expertise. But this guy has a point as my own capital continues to grow. The arguments of this guy why don't I stop this are getting better and better. I will probably not do this forever or at least radically reduce the intake maybe by increasing the price 10 times or something for new members. So take advantage of this now. This opportunity will probably not be there forever. I think it's incredible value right now. Actually, I also promised my exact game plan. I did buy some at this support bounce. I shared it in our Discord. I think it was at 62,000 something, but I need more to enter with real size. I will simply stick to my same process as always. I need either a clear bottom pattern in the chart or the trend to turn back up. You can see here that this dump stopped in this volume profile where a lot of Bitcoin changed hands previously. To remind so far the drop has been 52%. If this support breaks the next major volume profile below is here at about 40 to 44K. That is still only a 66% drop. While if we go back and look at the previous cycle that was almost 80% drop and took almost exactly a year. Now the gain the previous cycle has been less than the cycle before that. So the retracement can also be less. Will this support break or will it hold? You don't know. I don't know. No one here in this world knows for sure what the markets will do in the future. Unless you are the person who has the funds to move the market yourself and then you're not going to tell anyone. There are however an enormous amount of people with the incentive to talk the market in the opposite direction of the action they're actually taking. They try to talk it down when they are buying and vice versa. So at the end of the day, I will not fool myself into thinking that I can predict what the future will bring in the markets, but I can react to what actually happens. And that's what I will do as always. That's my plan. And I'll of course continue to share my thoughts in the Friday tier reports and often here on YouTube as well. Join us. You get all this stuff course loan indicator lo 3 alerts discord community pro portfolios by CTO in coins stocks commodities my Friday TA pro report that I write each and every week. And my commitment is that new stuff will be included. There will be no pro plus or pro ultra or something like that. You keep your discount at renewal. You can pay with card, crypto, PayPal or any way you like. We have a page of testimonials now and you can read for yourself. city ctoarsson.com. Press the button. Happy New Year. Happy chat. Thank you. Tuck. CTO Lson out.",
        "summary_hu": "A Bitcoin és más kriptovaluták, mint az Ethereum és a Solana, váratlan emelkedése várható, miután a piacon megjelentek a támogatási zónák. A befektető bizakodó, a jelenlegi csökkenési tendencia ellenére, különösen a volatilis időszakokra alapozva. A technológiai újítások és a digitális valuták előtt álló jövő kedvező lehetőségeket kínálnak, amelyek óriási előnyöket nyújtanak a hagyományos eszközökhöz képest. Minden piaci elváltozás kedvező esetlegesen hosszú távon, így a befektetőknek meg kell találniuk a saját eszközeik növelésének lehetőségeit, és figyelembe kell venniük, hogy a közelgő évek új kihívásokat hoznak a kriptovaluta piac számára. Az AI szerepének növekedése is hangsúlyos, így a befektetőknek fel kell készülniük a jövőbeli trendekre, amelyek megváltoztatják a kereskedelem helyzetét a következő években.",
        "summary_en": "Bitcoin and other cryptocurrencies like Ethereum and Solana are expected to see an unexpected rise due to the emergence of support zones in the market. The investor maintains a bullish outlook despite the current downtrend, especially drawing on the opportunities that volatile periods may present. Technological innovations and the future of digital currencies offer immense advantages over traditional assets, suggesting that any market fluctuations could benefit long-term investors. It is essential for investors to seek opportunities to grow their assets while acknowledging that the coming years will introduce new challenges to the cryptocurrency market. The increasing role of AI stands out, requiring investors to prepare for future trends that will reshape trading dynamics in the next few years.",
        "crypto_sentiment": "Bullish",
        "sentiment_score": 85,
        "key_points_hu": [
            "A Bitcoin jelenlegi támogatási szintek erős bizakodást mutatnak.",
            "A technológiai fejlődés és a digitális pénzek jövője kedvező lehetőségeket kínál.",
            "A befektetőknek figyelmeztetniük kell magukat a volatilis időszakokban való részvételre."
        ],
        "key_points_en": [
            "Current support levels in Bitcoin reflect strong bullish sentiment.",
            "Technological advancements and the future of digital currencies offer favorable opportunities.",
            "Investors must remind themselves to engage during volatile periods."
        ],
        "main_topics": [
            "Market Sentiment",
            "Technological Advancements in Finance"
        ]
    }
]