[
    {
        "video_id": "HWOTBRDu_OE",
        "title": "The REAL Reason Bitcoin &amp; Crypto Look Broken Right Now",
        "published_at": "2026-02-10T21:50:11Z",
        "sort_date": "2026-02-10",
        "url": "https://www.youtube.com/watch?v=HWOTBRDu_OE",
        "transcript": "After so many weeks, we finally know the real reason that Bitcoin crashed from 126,000 all the way down to $60,000 in just a few months time. And today, we're going to be investigating all of the conflicting pieces of data that are leading to complete widespread investor confusion and dare we say pandemonium across global markets, of which Bitcoin and lots of emerging tech are bearing the excruciating weight of this investor uncertainty. Now before we get into any subjective analysis, the actual narrative-based explanations for what might have happened, I want to share this. Okay, this is Black Rockck's EyesShares expanded tech software sector ETF. And this is effectively an ETF showing all the different exogenous exotic software products bundled into one product. So you can just bet on software, right? And if you can see here, this is the last 5 years of this ETF. And more or less on a percentage basis, it has tracked Bitcoin up, down, up, down, and all the way up throughout the last four or five years, including a perfect retest of this level from 2025. This blue line is Bitcoin, and the standard chart is the software ETF. And these are pretty much the exact same image, a mirror image of Bitcoin trading effectively in lock step with all of software, which demystifies effectively what the markets see Bitcoin as. Of course, we all like to hypothesize, is Bitcoin a safe haven asset? Is it digital gold? What is Bitcoin? And this, in my opinion, is one of the most clarifying examples I've ever seen as to understand exactly what Bitcoin is and how it performs, or more importantly, how it is traded by the big money bags. Because let's be real, there was big money trading Bitcoin before we got an ETF. That's how you get to a trillion dollar market cap. You don't get there with only grandma putting in her $5 or, you know, construction workers investing their lunch money. You know, we already had institutions trading Bitcoin. Elon Musk and Tesla bought last cycle, remember? But this, my friends, is one of the most clarifying charts I've ever seen in my life. Bitcoin is simply software. And it's traded as software. And software trades as a risk asset that essentially explodes when the economy is feeling speculative upside fervor. And when there's uncertainty, software is one of the first things that gets sold. Now, it's also notable that people have sniffed out that there is a significant amount of evidence that there is a Hong Kong-based non-crypto hedge fund that effectively had a single asset position in IBID. And that effectively what happened was after 1010, maybe they got liquidated, had a 90-day period to pay back their loans or pay back their debts. They tried to make it back on gold and silver being highly levered. and then when silver essentially collapsed down 20% on the day uh just a few weeks ago, we covered this in depth that they might have gotten liquidated again and been forced to unwind their entire fund. Now, this is speculative and we all know that when these big collapses happen in Bitcoin, it tends to lead to insolvencies. Leverage in many forms, which is all over the place in crypto, tends to start being washed out whenever there's a crash. And we have largely suspected that a big player has been wiped off the board, creating indiscriminate selling since October 10th. That being said, this to me is a side product, a sideeshow, because if it wasn't this player who had gotten wiped off the board, it would have been another player. That's just how these bull bear cycles work with crypto is on the way up, everyone gets levered up to their eyeballs trying to make the most money out of the crypto bull run. And on the way down, you have people getting wiped off the board because guess what? They were being too risky, trying to make money too fast. It is simply a story of human nature. It is not a flaw with crypto. It is not a flaw with really any part of the system. But the reality is that humans will be humans and greed is greed. That is the story of Bitcoin's bare markets. So that brings us more to the question which is why is Bitcoin or software in general selling off as if this stuff is going out of style? And that my friends brings us to the significant pockets of uncertainty that are facing all software today. or really all risk assets today. First and foremost, we have the biggest piece of the global economy that has allowed for the last 26 plus years of essential unlimited investment into the US markets and specifically into breakout internet tech stocks and this is the Japan yen carry trade. We all have heard about this. I'm not going to go too much into it in depth, but we have here a new prime minister, Prime Minister Sane Taiichi, who won in a landslide. The most decisive electoral victory that Japan has seen since World War II, which as you can see here represented is way more than 50%. It looks more like almost 70% of the vote that she won. And because it's not super straightforward here, I had Super Grock break down what this means for our beloved bags. Okay, so key policies and sunnomics. I love how they always figure out how to combine the word economics with whoever is in charge. It's really a brilliant exercise and word play. But overall, okay, overall these are the punchlines because we got a lot to cover today. Okay. Potential impact on global risk assets boost to Japan and Asian equities. We saw this because the Nikk pumped almost 5% the pico second she got elected. Okay. Yen weakness and carry trade dynamics. We'll cover that because here Arthur Hayes is saying, \"Okay, dollar JPY to $200. Let's break something.\" Okay. So essentially the yen is going to continue to be weak under this policy. Bond market spillover and debt concerns as well as geopolitical trade effects. Okay. Overall, Tekkai's agenda leans bullish for risk assets in the near term through stimulus and growth focus, but introduces tail risks from debt and yen volatility, meaning if something breaks here with things getting a little bit too wet and wild, potentially more pronounced if she overextends fiscally without market buyin. So this is why we're seeing a little bit of bullishness here with the yen. But it's very unclear, right? There's still a lot of lack of clarity as to if she's going to be able to pull this off. Is this just a sugar high off the election, there is, as much as there's some excitement here, there is a question mark as to how these policies will play out. And there is a referendum on Japan right now creating a massive political change. So whenever there's major changes, you have question marks introduced. Mind you, the sane Japan thing happened 2 days ago. So that's not the reason why Bitcoin collapsed, but it's a huge change happening now. Now, that brings us to the biggest piece of uncertainty that led to this second leg of the collapse of Bitcoin, which is this man, Kevin Worsh, who was appointed as President Trump's new Fed chair. Now, what's very interesting about Kevin Worsh is he is a noteworthy hawk, which seems to go contrary to what we think Trump will want for this term. It seems very clear that Trump will want some sort of stimulus. He will want to give the people bread here so he remains popular and doesn't lose control of the House in the midterms. We've covered Wars extensively over the last year and he is very against increasing the government balance sheet which has been the driving force of risk assets growing up or at least heavily correlated with risk assets going up. We know for sure he loves low interest rates but we don't know much beyond that as to how he'll behave. In fact, we highly suspect that he is super focused on inflation. Now, if you've been following the story, you know that true inflation has inflation well below 1% which is infinitely lower than the Fed's stated 2% goal. And that would mean that Kevin Worsh has a lot of wiggle room to actually bring American excitement back to the economy without actually creating inflation that has been so toxic to the working class. What you need to understand though is that Kevin Walsh has introduced a huge amount of uncertainty. And that, my friends, is toxic in a time that is already topsyturvy for the American economy, that is already uncertain for software in general. As you see the rise of AI, vibe coding, where anyone can quickly create a piece of software with just a few lines of text, stuff that used to take weeks or months of development with a whole team of engineers. Boom, bang, pow, make it for me, and it's done. Of course, I'm oversimplifying, but really vibe coding poses a threat to software as a business in general. If software becomes funible, can be infinitely created at the drop of a dime, what's the point in these big multi-billion dollar software companies? Do they really hold value? So software in general is massively uncertain right now. Massively uncertain. And now we get this guy Kevin Walsh where now his economic policies become massively uncertain. The ones that have stimulated software to grow to the point where they are today. And I want to be very clear. I'm not saying that Bitcoin is actually in danger of not surviving here. That's not at all the case I'm making. I'm trying to explain to you why Bitcoin crashed the way it did. And after I do that and I explain that, I'll explain what Bitcoin will likely do in the future. But right now is about explaining and understanding the significant crash that happened. And here's a great example because this happened yesterday. Kevin Worsh introduced something called the Fed Treasury Accord which stirred tons of debate is effectively he introduced a bill that would rewrite the rules of how the Treasury essentially the White House and the Federal Reserve which you know the Federal Reserve we know that are actually going to collaborate. This is the first piece of legislation put forth since 1951. That's 75 years ago. Okay. A lot of this has to do with how they would refinance the debt and it even calls for controlling the long end of the yield curve or yield curve control. This is really confusing because Kevin Worsh is someone who never wanted to have the government have a big balance sheet. He didn't want the government to intervene into markets creating a wealth gap. But yield curve control is precisely that. Yield curve control is the government effectively controlling the long end of the yields. And what it really means is that they will make sure that interest rates stay low no matter what. And that means that they will be the buyer of any extremely highpriced debt. Pure and simple. So how can it possibly be the case that you could stay out of markets and also ensure for sure that the yield curve stays controlled? As many analysts pointed out here, these two things are actually at odds with each other. As TXMC says, the article mentions Worsh's interest in Fed balance sheet shifting more towards bills, T bills, instead of long-term debt. What that would mean is that private markets would have to absorb duration, long-term debt from the Fed, which is inarguably bearish liquidity, meaning more people are going to have to buy that debt instead of buy risk assets. Money goes somewhere, and if it's going more to one thing, then it means it's going less to another, right? So, we saying this is bearish for overall liquidity, meaning bearish for our bags. And it would be anathema to yield curve control. Right? Yield curve control is the thing we're talking about. The two ideas cannot coexist. Cannot coexist. Okay? The Fed cannot implement control across the yield curve without either absorbing duration in a price insensitive way themselves or forcing savers to absorb duration in a price insensitive way. Now, the second part is effectively saying, hey, look, forcing savers to absorb the price means inflation, right? Means you're just going to get what you're going to get. And that means your your savings are going to dwindle. So this has to go somewhere. This absorption has to go somewhere. If Worsche wants the Fed to shift its balance sheet to bills, the only way to enforce yield curve control is by effing the savers. Not sure the implications of this are being fully processed by the chatter on this topic. Okay, so once again, we have this proposal by Kevin Walsh that simultaneously seems to give the have your cake and eat it to proposal. He wants a small balance sheet. He wants to protect savers. He wants to protect mom and pop who have been working, who have been saving the working-class Americans. But then he's also trying to control the long end of the debt, which inherently would be bullish for risk assets, which would create historically a massive stimulatory effect for assets. So you have this contradiction, right? Kevin Walsh is a man of contradictions, which again makes him completely fitting for the time that we're in, which is a time of pure unadulterated confusion in markets. So to recap here, we have Bitcoin trading in lock step with software as much as we all see it as gold 2.0. That's not the way the markets see it. The markets see Bitcoin as software. Okay? And now you have software also with huge question marks due to the rise of AI and vibe coding. Now you introduce economic uncertainty with Trump's tariff Palooa. You also have uncertainty with what's going to happen. Are they going to print money? Are they going to do austerity with Doge? Are they going to actually be stimulatory? Are they going to be hawks? very unclear. Now you have Worsh who his policies are unclear. It's uncertain. Now you introduce the Japanese prime minister who we think might be bullish for risk assets but it could very well break things and make things extremely bearish. This is why you're seeing so much rampant uncertainty and add to that you have these rampant indiscriminate sellers on the back of October 10th that have been carried out as they say in the business and they have to force sell all their assets in crypto and you have a perfect storm of uncertainty of confusion and of bearish price action which creates all sorts of emotions and that's how you get a crash in Bitcoin that is twice as fast as the 2022 bare market. Mind you, the 2022 bare market played host to the Luna collapse, to FTX collapse, to Celsius collapse, some of the most bearish, fraudulent, and overall emotionally destructive price action we've ever seen in our lives. And yet, we've managed to eclipse that almost twofold. So that, my friends, is why Bitcoin has crashed. That, my friends, is why Bitcoin is so bearish right now. And that, my friends, is why we are seeing so much doom and gloom on the timeline. Add to that that altcoins have gone zero bid and are really starting year two of their bare market which really started in December of 2024. So now let's get to the optimistic side because I want to be very very clear here. Bitcoin did not fail as a hedge or a gold comp. Okay, Bitcoin succeeded faster than most people could process. It's an asset that moves at the speed of information. It frontuns every macro move. Did Bitcoin fail as an inflation hedge when it became official in 2022? No. Smart people bought Bitcoin in 2020 anticipating the inflation from the co money printing. They didn't wait till it was entrenched in 2022 to start buying Bitcoin. So in many ways when Bitcoin went from few thousand bucks up to 69,000 bucks that my friends was it performing as an inflation hedge that was it performing as also software because software also performed really well. So Bitcoin performed as all of these things. It performed as innovation. It performed as an inflation hedge. Now, to be clear, it also didn't fail against gold because gold actually started its bull run the moment that America seized Russia's gold. And at that moment, Bitcoin was trading at 16K and gold was trading at 2K. So, Bitcoin went up 7x while gold went up 2 1/2x. The opposition is French posting dangerously close to the bottom. Now, I would have to agree. I think we are probably much closer to a bottom price-wise, maybe not time-wise, than people believe, cuz these bottoms can take a while to actually work their way out. But it's important to realize why Bitcoin crashed this way, and also that it didn't really fail at what it set out to do. The people who bought it as an inflation hedge bought it in 2020 when the money printing started. The people who bought it as a gold substitute bought it in 2022 when the United States froze Russia's assets and global central banks began hoarding gold. it just happened way faster. And so that trade, both those trades had already played out. And then we got the sell software trade. Then we got the sell America trade. And those things hit Bitcoin double speed because Bitcoin had become politicized. And Bitcoin, as we now know, trades in lock step with software. Now, I'm going to start painting a more optimistic picture here. Even though I am still structurally bearish on Bitcoin until the price action proves me otherwise, I'm going to paint for you a more optimistic picture because I do believe that as we get down here to these lower prices, it's very easy to throw your hands up, cut, and run. But it's important to realize crypto will viciously test your conviction. Santiago here was one of the most vocal bears near the top, essentially claiming that everything in crypto was wildly overpriced. Okay. He says, \"We go through market cycles, severe draw downs, and extreme euphoria every few years. what investors feel in a lifetime we experience every few years. It's brutally hard to manage positions. You want to be a long-term holder, but the markets remind you how right and wrong you are daily. Venture doesn't have a ticker constantly grinding against your thesis in real time. We do every single day. Right now, the most vocal believers are quitting, throwing in the towel, dismissing the space. Remember this moment. Years from now, someone will scoff and say, \"Oh, you were just lucky for being early.\" Being early is goddamn hard. Years ago, you could have been early, too. And being too early is indistinguishable from being wrong. I'm going to say that again. Being too early is indistinguishable from being wrong. We're not too early anymore. Read the room. Read the headlines. The infrastructure is battle tested. The adoption is happening. The cruel irony is that crypton natives are quitting just as fast as non-cryptonatives. And new adopters are about to capture way more value than they ever will. A lot of groundwork was built by the very people throwing in the towel today. And that's a shame. But markets don't care about fairness. They reward conviction. For anyone who told you that you were just lucky, none of this is effing easy. the draw downs, the noise, the conviction required to hold when the world is telling you you're wrong. Learn to love the pain. Learn to love the work or you'll always be a prisoner of the market at other people's opinions. Find love of the game or go play another one. If you're still here, still building, still creating, still grinding, I salute you. This is a generational shift and we're lucky enough to shape it. Long crypto. Now, obviously, if you've been following the channel, you know that we've been building rain or shine. Good times, bad times, even the worst times. I've been here with my team every day for the better part of 10 years. And that's actually not stopping because as I said a few episodes ago, my team is actually going to ship a product next week and they're going to be giving out the tokens to everyone who's been holding the projects, who's been believing. If you held super, you got Black Hole for free. And if you held those Black Hole Vlack tokens, you're getting VOVA for free. You don't have to do anything. And I want to be very clear. I'm not here telling you to go buy the token, to go speculate. I don't want you to do any of that. I just am sharing with you what I'm up to because I pour my heart and soul into this. It's been a very rough year and hopefully hopefully this product performs exceptionally and is able to give back some value to the community that has believed in this mission for so long. I do not want anyone to speculate or guess or hope that this token goes up. If you understand how V33 dexes work, I welcome you to check out the technical documents, understand how supernova works, and also understand that Ethereum Foundation members like Abas Khan here are actually posting about supernova. As you can see here, we're being mentioned as the black hole to supernova release happening here. So, the project is getting noticed by the Ethereum Foundation. It's also worth noting that the Ethereum L1 is scaling aggressively with Vitalik's commitment to essentially abandoning L2s and making L1 like Salana a central hub for finance. That means that Supernova being the first next generation DEX to actually go live on Ethereum mainet. Not only drop the insane product that did so well in Avalanche, but to try to build out way more design space. The opportunities are truly endless. And so again, the team's very excited. I'm not promising you anything here about price, about performance. We all know bare markets are brutal, especially on altcoins. But I just wanted to share with you this is my reality is that hard times do not affect the mission. You just keep building. You keep believing and you keep trying to ship something that matters. Again, I'm just saying this to show you that this is how we operate. This is how we deal with the hard times is we put our heads down and we work. Now, that said, let's get back to the video because there's so much more to cover because under our noses, there's actually something crazy happening with the economy in general. Now, I'm sure you guys have seen the comparisons between crypto and the ISM. Now, we've been tracking the ISM for quite a long time on this channel because it actually holds the keys to understanding when the economy is hot, right? And if you can see here, this blue line is the ISM. And you can see that when it's a reading of over 50 is typically, and I'll put a little horizontal mark here so you can see here, a reading of 50 on the ISM on this blue line is considered an expansionary economy. And as you can see, there's only been a few times in the past 20 years that the ISM has actually been under 50. And it usually is a very short amount of time. In the case of July 2019, it was under for maybe a year or so, right? It was done by 2020. It was here in 2015 for, you know, about a year or so. Again, in 2012 for about a year or so. And what you'll notice is that these correspond almost perfectly with Bitcoin tops. You can see here that when the ISM was hot, Bitcoin topped. When the ISM was hot, Bitcoin topped. When the ISM has been down below 50 for almost 4 years now, starting in 2022 and now for the first time in 2026, making its way above 50, you can see that maybe, just maybe, what we saw during this runup was actually just institutions buying Bitcoin because of the ETF, because of regulatory arbitrage. Maybe we didn't see this real natural bull run. Which is why I've been pontificating here on the channel, as you may remember, for almost a year now that we didn't really get a bull run. We didn't really see a real bull run because the public doesn't feel like they have money to spend on a bull run because there's not this excess spending in the economy, this real bullish feeling. There was just this what felt like hot air balloon being pushed up by little catalysts. the bank bailout, the ETF filing, each giving us a little push up that then felt like it wanted to roll over and die. Bitcoin has felt so heavy this entire bull run and the altcoins don't even get us started. But the reason why this is actually happening and the ISM is finally popping up is because manufacturing is actually recovering and this is actually happening aggressively in the freight economy, which is something that is very rare to see. And this is a very long video, but I encourage you to check it out by Kug Fuller. And then we also have a very long article here explaining how there is a huge reaceleration happening in the core economy. Despite what all the doomers would have you say and believe, we are seeing the American economy reheat and accelerate. This is at a time where many people are calling for a recession. Now, I'm going to wrap all this up for you. To be clear, there's a lot of forces that have created massive uncertainty here in cryptoland. Okay? software being sold, the de-risking of American trade, the rise of AI and vibe coding threatening software, you name it. There's a lot of confusion happening and a lot of it points to Bitcoin as potentially being vulnerable. We also have quantum as a threat. I didn't even mention that today. But you also have the reaceleration of the economy. Now, the timing of this is a bit tricky because we don't know exactly when all of that liquidity will start to hit the actual economy. whether it will hit assets immediately or whether there will be this air pocket in which there is still bullish narrative but essentially that liquidity isn't making its way into assets. So to end this I will say that I'm going to keep it very simple. We will be tracking all of these narratives as a way for you to understand that Bitcoin is not only not dead but there is a huge opportunity on the horizon. But we will also be taking a trader mentality only buying and selling when the charts give us actionable signals. And right now there's nothing too actionable. We had our housekeeping zone up at 98,000. We sold around there. If you were part of that trade, I salute you. Of course, it was a brutal 2025, but now we have a chance to time our re-entry and we want to wait until we durably see that crypto has bottomed. And as I've been covering on recent episodes, I believe Bitcoin needs to make it over 82K to be durably durably bullish again. And for now, we're just seeing a lot of chop after the flush. As always, I'll be doing a more in-depth price analysis on the next update. But that is the reason why Bitcoin crashed. It's a piece of software. It's traded as software and software has a lot of question marks around it. However, it did not fail as an inflation hedge. It front ran the inflation from 2020 to 2021. It front ran the gold trade from 2022 to 2025. And it outperformed in both scenarios. So, in a time of great uncertainty and people getting delevered, it actually makes sense that Bitcoin has crashed so hard. But make sure that you don't get carried away with the bare case that you forget to see when the tides shift. As we all know, having conviction in crypto can be painful. But I'll be here with you each and every step of the way. If you enjoyed this video, make sure to subscribe and like the video. And I will see you very soon the next",
        "summary_hu": "A Bitcoin árfolyamának drámai csökkenése mögött a szoftverpiaccal való párhuzamos kereskedelem áll, amelyet a kockázatos eszközökkel kapcsolatos általános piaci bizonytalanság táplál. A legújabb politikai és gazdasági események, például a japán új miniszterelnök és Kevin Worsh Fed-elnök jelölésének nevét a piaci hangulat romlásához vezetett, melyek a befektetők kétségeit fokozzák. A kriptovalutákra általában jellemző a spekulatív kereskedelem és a sűrű piaci volatilitás. Ahelyett, hogy a Bitcoin a védelmező asset lenne, a piaci értékelések szoftvertermékekként kezelik. A jövőbeli kilátások bizonytalanok, de figyelembe kell venni, hogy a Bitcoin nem csődölt meg a infláció ellenállóként, valójában sikerült felfutnia a 2020-ban kezdődött inflációs utakon.",
        "summary_en": "The dramatic decline in Bitcoin's price is driven by its parallel trading with the software market, which is fueled by general market uncertainties concerning risk assets. Recent political and economic events, such as the election of a new Japanese Prime Minister and the appointment of Kevin Worsh as Fed Chair, have contributed to a deterioration in market sentiment, amplifying investor doubts. Cryptocurrencies are typically characterized by speculative trading and high volatility. Instead of Bitcoin being seen as a safe-haven asset, it is treated within the market as a software product. Future prospects remain uncertain, but it is important to note that Bitcoin has not failed as an inflation hedge; it has indeed managed to rise along the inflationary trends initiated in 2020.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 25,
        "key_points_hu": [
            "A Bitcoin ár fala a szoftverpiac mozgásait tükrözi, és jelenleg piaci bizonytalanság jellemzi.",
            "Az új japán politikai vezetés és a Fed új vezetője hozzájárult a feszültségek növekedéséhez a piacokon.",
            "Bár a Bitcoin nem csődölt meg inflációs védőként, a jövőbeni kilátások továbbra is kérdésesek."
        ],
        "key_points_en": [
            "Bitcoin's price movement mirrors that of the software market, currently marked by market uncertainty.",
            "The new Japanese political leadership and the new Fed chair have contributed to rising tensions in the markets.",
            "While Bitcoin has not failed as an inflation hedge, future prospects remain uncertain."
        ],
        "main_topics": [
            "Bitcoin Price Decline",
            "Market Uncertainty"
        ]
    }
]