[
    {
        "video_id": "GwIoM5zh43Q",
        "title": "BITCOIN AND ALTCOINS: TRUMP FIRES NEW FED CHAIR?!!!! (truth)",
        "published_at": "2026-02-10T10:29:57Z",
        "sort_date": "2026-02-10",
        "url": "https://www.youtube.com/watch?v=GwIoM5zh43Q",
        "transcript": "We're going live. We're going live. Let's go. Let's go. Oh yes. Oh yes. Oh yes. So yes, guys. Welcome to another episode. And as you can see right now, Bitcoin is currently in a very interesting position because it is at 69. But just like we said last show on Monday, it's weak, man. It's weak. It needs to pump very high here to 85. Basically raise the entire down from last week to show that there's some kind of strength. Now it's showing weakness. It's showing heaviness. The bears are in full control here. So just a question of time before we go back here into the buy zone and uh basically touch the 200 week moving average for real this time. Not just a week like this within a few thousand but actually touch it and probably also go a bit below it. The flash button is still in the works and then I expect us to go sideways for quite some time basically finding a bottom but all of the prices here around 60 61 62 63 basically within this box they are a good buy zone to buy slowly slowly slowly. Don't for in. There's going to be a lot of time because just like we said last week, there is no hurry. There is no hurry here. There's no hurry. I mean, you see yourself can barely, this thing can barely even get back and test this uh uh this uh resistance here at the 86. At some point maybe it will, but then it has another resistance here at uh 74 now, which is the previous low from uh from last year. So, all in all, you have to be too, you know, too too scared here that you're going to miss something. But what's interesting, guys, is that this clip is going online now where Trump is basically firing his new Fed chair, Kevin Walsh. It's a very interesting clip because it's not really what it seems. But listen to this. Listen to this first and then I will explain to you exactly exactly what's happening at the Fed, exactly what Trump is doing, and how this will affect our bags within the coming months. Listen carefully. >> When did you know you wanted Kevin Wars? >> So, >> officially it was two Fridays ago, but when did you >> Well, I made a mistake. He was u runner up if you want to say that. >> He's a finalist. >> Yeah, he was. And I made a mistake because I had somebody that was my uh secretary of the treasury wanted him so badly, so badly. And you know, I I didn't feel good about him, but sometimes you listen to people and it was a mistake. It was really a big mistake. But um I think we're going to do something that's really spectacular. When did you know you? >> So when you listen to this, it does kind of it does kind of sound like Trump is not happy with his newest big Kevin Walsh. But the thing is here they are discussing the J Powell uh J Powell hiring back in 2017 because even at that time Kevin Walsh was one of the key key candidates that Trump had in mind. But at that time in 2017, he did listen to the uh then Treasury Secretary. Who was that? It was the mush. Scaramoo much. How who was that? Or which? No, no, it was not the mush. It was the other guy. It was the other guy. I see him in front of me. He was with the with the gloves printing the dollars. What's his name? The previous one. Anyway, he that was the previous secretary, Treasury Secretary basically told Trump to go with uh with Powell. And that's what they're discussing here. And in reality, they're still very very very excited to work with Kevin Walsh. Kevin Walsh is the is the new Fed chair still. And you could see that easily if you looked at the Poly Market. So the first thing I did when I saw the news that, you know, apparently he's going to fire Kevin Walsh. I looked at Poly Market and there was basically no change. I mean, yes, it did go down a bit because this clip make it seem it make it seem like um he's getting uh he's getting fired. By the way, it's Worsh. Yeah, it's Walsh. Worsh. I I I keep confusing. It's worsh with an R. Uh [laughter] so poly market is the truth here. So whenever you have some kind of news you're not really sure about just check poly market. So poly market basically confirm that uh this is this is not a firing that is going on. Instead, Trump is pointing to the fact that we will have a new Fed chair in the coming months and markets are going to pump and he thinks that Kevin Worsh is going to be the person to ensure the economic growth to basically continue easing but way faster way faster than Powell. And as you know it's one of our key thesises how you say key not key thesis but one of the key thesises one of the key aspects of our bullishness towards the end of the year and as you know or now we're buying if price goes towards the 60k towards the 200 moving average but overall our bullishness comes from the fact that you're going to have such a nice situation with liquidity with the Fed with the economic backdrop for the crypto pump and we've been really tracking it since uh since previous cycles here in the heat map. As you can see, this uh whole bull market. We had Bitcoin price moon a lot but the overall economic backdrop was very bad. You see this this red basically means that the interest rates are high. The Fed is not increasing the balance sheet. The the Fed is decreasing balance sheet here. No, when it's red, but you look here when Bitcoin went from like 3K to 60K, you see how green it was. And uh later this year we will be basically coming into the green area. Currently we're still in yellow. We're still in yellow but later this year we will be coming into the green area. So we're now somewhere I would say we're somewhere here now. You know we're kind of you know chopping chop chop chop. Uh coming months likely is going to be a lot of chop just chopping trying to find the bottom. And then in 2027 uh we will see this very very nice uh run up in the price and also this will correspond to a very nice green backdrop. You know that earlier this bull market we also discussed that you know when uh you have green backdrop in the macro the prices are going to skyrocket and at that time we were speculating that maybe it's going to happen this cycle but as soon as the prices went bearish we changed our opinion very very quickly because it seems that there will be enough time for us to basically have an entire bare market probably be here until the end of the year chopping around a bit here maybe at 60 maybe at 50 uh before we hit green. So since October that is our view more that you don't have to really hurry here because these things they take such a long time man you can have one year and it goes from orange to yellow. I mean that's basically what happened now we are in yellow but uh where were we in last February it was kind of orange it was kind of orange one year to go from this orange to this yellow based on the heat map how much uh how much we have backing from the Fed and uh then it took a year to go from red to orange. So a year from red to orange, a year from orange to yellow, and probably going to take a year to go from yellow uh towards green. So that's why position building is quite important already this year. We're not in a hurry, but we're preparing. I mean, we're preparing. We we have an open mind here that very quickly things are going to change. Uh maybe it's even going to be faster than the end of the year. Maybe it's going to be already during the summer. We don't want to time anything. We just buy at good price levels around 200 week is good. And especially when we enter a new bull trend, it's going to be crazy. It's going to be insane. Insane for Bitcoin. So, Trump is still excited about his new peak. Kevin Worsh, not Walsh, Worsh. Uh, number one. Number two, rates are going to be cut. Money is going to be printed and going to be put straight into the markets because the number one KPI for Trump is probably the stock market. I mean, I mean, when you hear him speak, it's it's a lot. It's a lot a lot a lot about the stock market. Also guys, I want to highlight this very important clip from Alcohind Daily. Big shout out to the guys from Alcohind Daily. They recently interviewed Mark Yusko and here I agree with him 100%. In the coming cycle that is going to start towards the end of the year uh and then early next year we will be pushing towards half a million maybe maybe even a million. I fully fully subscribe to this because there are also many many opinions now that we're going to go down. You know, Jim Kramer, Bitcoin has lost its luster. You had financial times yesterday say that we're going to just go down and down and down and down and down and so many other people coming out. I had another one here basically some economist saying that we're going to enter a death spiral where all of the miners are going to go bankrupt. So you see a lot of it now and this is where it's time to start changing the the mind. Actually it was it wasn't some economist. It was Michael Bur. Michael Bur from Big Short said that if Bitcoin goes to 50K it could drag markets into a buyerless black hole. [laughter] Bur also thinks that a further decline in in Bitcoin could cause miners to go bankrupt. Listen, this is the kind of stuff that you normally read around the bottom. Now the bottom can still take half a year to form which I which I also believe but I don't think we're going to go you know another 80% down. Maybe we go another 20 30 down and you know within the coming months have some nice bottom very fantastic bottom but uh this is this is too much gloom. This and it actually makes me even more bullish in buying of bullish on buying around 200 week because this kind of stuff I mean literally it does come out at uh close to bottom. No one was bearish when we told to d-risk in October. No one was bearish. No one was bearish. So we knew when the prices start to uh fall when you have fake alltime high bearish daily trend you have a 4ear cycle for us it was a clear signal. Then went bearish on the money line weekly went below 50 week like we had so many signs. No one was bearish at that time. No one. Now man so many people are bearish and we are again front running. We're front running the herd. We're frontr running the pleba. Look here, this is the perfect example I keep showing, but literally at the bottom of 2022 lows, this is like exact bottom, European Central Bank published this article, Bitcoin's last stand. The fact that Bitcoin is going to zero, it's going to go to zero, this boomer said. So around the bottom, you have this articles, you have the sentiment, and it's important for us to look at where crypto is hazing and it's hazing way, way up. You have to be patient still. It's not going to happen tomorrow. So no V-shaped recovery, but towards the end of the year, next year, we're going to be way way up. Listen to this. >> Equivalence, right? Which is I do believe someday equivalence, right? Which is I do believe someday the the the monetary value of gold, which is about half of the total value because the other half is jewelry and chalicees and art and stuff, but but the monetary value, the bricks that are in central banks, etc. is about half of of the value of gold. So, you know, way back when when we were 20 trillion of gold, I said 10 trillion of Bitcoin value. So, you know, that was my that was where I got the directionality for the 100,000 to, you know, 12140. The other piece of it is every having we add a zero. So we increase the total market cap 10x. Now does that mean it has to happen every time? No. But it has from 10 to 100, from 100 to a,000, from a,000 to 10,000, 10,000 to 100,000. But that's the fair value. But inevitably we go above fair value. So when it was a 10,000, we got to 20. And at 100,000 we got I thought I thought you know we'd get not all the way to 200 but you know 150 maybe I think that was the number in my my presentation last last uh January and yeah we got to 126. Okay. So call me call me a liar. Now at least I wasn't the guy calling for 2 million. Um, there are plenty of those, but that's a long-winded way of saying next cycle if we added a zero, fair value would go TO A MILLION. OH MY GOD, MARK, THAT'S so ridiculous. Like, well, okay, let's back into it. So, uh, gold market cap increased, you know, at one point it hit 37. I think it's now back at, you know, 32, 33. Let's just round it to 30 and say it settles in at 30. That's 15 trillion. So 15 trillion um gold equivalents if we got Bitcoin at uh 1.7, right? Um 1.6. So let's just again use round numbers. Let's say it's 10 times from here. So 10 time 75 be 750. It's a little light. I'm okay with that. So >> yeah, I fully agree here and I see people in the comment section saying that Mark Yusco has terrible track record and he's ridiculous guy. Listen, these guys are perma bulls. You listen to them in the bull. You listen to me in bull and bear. I mean I tell you how it is in both directions. In bull they are I mean even Tom Lee man. Tom Lee is horrible. I mean he he's very bad in in the bear. In the bull he is correct. He is correct. So when you have me saying that okay now it's okay to be a more bullish you have permission to listen otherwise don't listen when I tell you now it's time to be riskoff like we said in October you just listen to me when I tell okay now you can listen a bit to this perma permabull guys you can listen to them okay deal deal [laughter] okay it's a big problem I mean this permabull guys I mean I agree they have a very bad track record if you follow them without understanding what they're doing many of them have investment vehicle they fund. Kathy Wood has fund like Tom Lee has his company. They just want more inflow. Uh but will they be correct in the bull 100%. And these estimations when they align with what I think I I think it makes perfect sense to to share. So personally I also think that we're going to go towards 500k in the next uh in the next bull in the next cycle. When is that going to start? Likely towards the end of the year. Uh we're going to start bottoming out and going up. doesn't mean that we're going to be there [laughter] at the end of the year, but we're going to start bottoming out. We're going to start, you know, may maybe increasing increasing in price, some kind of bull trend may be starting. So, because it is quite soon, we need to start reprogramming. We need to start reprogramming the brain uh towards the bullishness because it also takes time for people. Uh so, yeah, after a few months, uh we're going to be in the perfect perfect spot mentally. Now, let's see. This guy from the Fed is saying that Trump's crypto hype has died. Let me just quickly see what it is. I didn't actually watch it before. Let me check. >> These kind of >> Let's Let's do reaction reaction together. >> Ups and downs in the crypto world have become so common. They actually have a name for them. Winters, right? So when you start saying something a season, you know, it's going to be a regular phenomenon. That's part of the game. You get in, you make some money, you might lose some money. >> True, true, true. >> That's the that's the nature of the beast in a lot of these things. I think some of the euphoria that came in to the crypto world with the with the current administration, some of that's kind of fading. The l the lack of passing of the Clarity Act, I think, has kind of again [snorts] put people off on this, >> but it's good. I don't think we should pass the Clarity Act anymore, guys. I mean, the more I look into it, the more it seems that it's clear capture by the bankers. Okay? It's clear cap. Crypto doesn't get too much from the Clarity Act. Uh, not at all. So, what's the point of passing something where you have restrictions of stable coin? You have so many restrictions. Like, what's the point? And u I don't really see it as a big make or break. I know many people try to hype uh hype it up. They say that we're going to pump once it passes. I don't think anything's going to pump once it passes. It's a kind of a nothing burger. I mean, if it happens, it's it's kind of a neutral thing because crypto gets a bit but also loses a bit. So, it's I don't think it's that big of a deal anymore. Um, the actual volatility is, you know, that just happens. I mean, it's just, it's happened before. People like, \"Oh my god, Bitcoin's down to 63,000.\" I mean, you have to scratch your head a little bit and say 63,000 8 years ago. If you'd have said it was 10,000 said, >> true, true, true. I mean, the boomer here knows exactly. >> Oh my god, this is crazy. Now, you say, \"Oh, it's only 63.\" So uh but there's a lot of it has been brought into the mainstream finance and then you know things have to happen there. So I think there was a lot of selloff just because firms that got into it from the mainstream finance had to adjust their risk positions sell lots of other things but in general look prices go up prices go down. I mean it's just the nature of the business. If you don't like it don't get in don't get in it. That's >> yeah I mean that probably the best thing I heard from the Fed in recent time but he's fully correct is he's fully correct they go up they go down that's that uh and you have to see it for what it is but be prepared for the bull that that's important bull's going to come bigly bigly now let's let me see this I mean guys today we're kind of reacting to Boomer clips it's a bit of a slow market it's a bit you know a bit of sideways [laughter] let's react let's see what what he's saying here Jim Kramer Jim Kramer >> Robin [clears throat] Hood reports people are starting to get unnerved by how closely aligned this stock is with the price of Bitcoin. Even if today's dramatic rebound, Bitcoin still feels like it's lost its luster. The precipitous decline of the cryptocurrency occurring at the same time as a weakening dollar calls into question whether it's a real storehold of value or even a hedge against inflation. We know nothing. We we we this vol thing we used to think could be a currency. That's not obviously not going to happen. It's a great speculative asset, I guess, until starting what he's saying. And then people complain that I have bad English. I I didn't understand anything. What you What is your point? But what's your [laughter] bad? I mean, man, this guy is on CNBC. He's well known. You see how he speaks? You You see this? What the hell is he saying? Anyway, I think he's a bit bearish, which is bullish because it's inverse Kramer. So, that's very good. But guys, welcome everyone who is watching [laughter] live. We have more to discuss. We have more to next. We we're going to be reacting to Ray Dalio. We have a few more clips. Then, of course, we're going to be going into alts. You can ask any alt you want. We will analyze. Big shout out to Guzman who is timestamping us right now. Looking at our community, I want to give a big shout out to Supreme Governor who is back from a long weekend. He's back to Bullmania. He's saying that it's time to short Kaka coins into the abuse. Also, some of you don't know, but we do weekly reports to our communities like between 20 and 30 pages of uh all of the different cryptos, gold, stock market, and so on so forth. We have very very good feedback yesterday from the recent report report because I publish them on Mondays and when the week closes I start writing them and then 20 30 pages I I send it out every week to our members. Uh and also some profit a bit smaller profits um these days because it's a bit sideways it's a bit sideways but listen profit is profit just like animal is saying profit is profit 100%. Then uh you have also here 14 25. So is listen profit is profit profit is profit. I know we're used to like 150 200 when things were really uh flushing. We we did have those days but even in the sideways if you apply the mechanical rules you have the money scanner. It's fantastic. It's fantastic. But hopefully soon we get to these days. Okay. I we want to get to this day. We another flash another big big flash for this to happen or pump. I mean literally we don't care if it goes up or down. as long as it goes somewhere. That's that's the most important thing. We need volatility. We need volatility. And looking at the at the money scanner, let me refresh here. What happened during the last uh uh few days since Bitcoin flipped on the weekly uh sorry, on the daily, we're down uh 26%. Uh on the weekly, let's see, 28%. Uh ETH 40 Oh my god. Yeah. I mean, you you you don't joke around with uh weekly flip. XRP 40%. Solana 54% 54% and of course if you have access to Bulman you can see what flips like today what flipped to yesterday and so on so forth on the shorter time frame now I'm just showing you what has happened Cardano guys Cardano what's happening since 3 weeks ago is down 56% so you understand when I say that currently the only people who are eating are the shorters because it's very tough man it's very tough to make money in if you're longing you're either a bag holder praying for life you know huddle huddle huddle or you're liquidated because you you long without mechanical rules uh or you're shorting properly with the mechanical rules. Anyway guys, to get access to our tools like the minus scanner that I show you now, the reports, the community, go to bullming.com, watch the free training, you have the link below. Hyperlidus 22, Monero minus 36, chain link, chain linking, you know, people say fundamentals, Ian, you don't understand chaining fundamentals. Why are you bearish chainling? There are so many fundamentals, man. I mean, you see yourself fundamentals are great and we'll say you buy it now on the next bull flip. It's the same fundamentals, but you're going to make money on the next bull flip. Uh whether instead if you bought on the uh in the bare trend, let's say you bought uh 3 months ago or something, you're down 50%. So fundamentals are not fundamentals. It's a big difference, man. It's a big big difference. Avalanche, holy crap, minus 60%. Since three months, three months, how quickly it passes. I remember in December people were telling me, Ivan, you're too bearish. You're too bearish. This was December. Three months ago. Okay, now look here. Suie, big shout out to R Paul. [laughter] Suie, Sui, Suie, business cycle. Where is business cycle? Uh, maybe here, maybe not here, but Sui is down 62%. And if if the business cycle arrives tomorrow, what's the point? Because you just lost 62% anyway if you trade it on the on the weekly. And so, yeah, business cycle comes, maybe you get your money back, maybe not. And listen, I'm not doubting that business cycle will come. It's just that what does it matter if you just lost 90%. What? It doesn't matter, man. [laughter] Ton ton ton since a year ago this thing is just going down 72% loss unis swap since four months 55 pola dot oh my god I mean especially these coins that have been down for a year it's crazy man 82% in a bare trend since a year so guys it's very very possible to play the next cycle correctly if you stop listening to BS business like I mean there's so much BS there's so much you get led astray you know You try to, you're on your journey, but then you got pointed into direction. It's just a cliff. You fall down. You fall down. You fall down and you diamond hold all the way down. Okay, then it's time to buy. Now you're too bearish. I see many people too bearish. Now I tell them, listen, 200 week is a good price. Uh if you buy at 200 week or below, don't be greedy. Don't be greedy. Don't wait for exact bottom. People tell me, Ivan, you're going to get wrecked because it's going to drop lower and you're not going to buy the Listen, do you understand what I'm saying? I told you we're buying a 200 week a bit nibble nibble nibble it goes down we we can nibble there also and then when we go to bull flip on my line that's when we deploy the big capital but no no you're going to miss the now now people are telling me telling me I'm going to miss the bottom [laughter] you know that that we're buying too early man you need to wait for the bottom I mean crazy anyways go to booming.com watch the free video you you see there and also another thing. By the way, I love this. This is ours, guys. This should be in Louver. You see the games from our community. This should be like in the Louver. Uh but the other thing is that um uh looking at our partners, we updated the page. Uh if you go to bullmay.com/partners, uh let me see where it is. Right here. Uh it's also linked in description. Exchanges I use. Now you have all of these different categories. For example, you want an exchange that has a debit card. Bam. You have bybit. Very nice. You want trading bots, bam. Uh you have Pionex and uh Bluffet. Very nice. You want stocks? Bam. You have this ones. You want bank account soon bybit will have a bank account. And if you go to boommy.com/partners, you sign up anywhere here, you get big fat signup bonus, which is very nice. I mean basically freebie. Who says no to freebie? It's very very nice. So on this note guys, moving on. Okay, Ray Dal, what is he saying? He's saying that CBDC's are coming. You're going to be super controlled. And by the way, it's another thing that is so key to keep in mind that, you know, the use case of crypto is so important, especially now that we we're starting to become a bit bullish. We see the light we see the the light at the end of the tunnel. We have to be more bullish. We have to look back at fundamentals and see the role uh crypto uh crypto plays in the in the world, which is so important. Listen to this. >> Right? >> What happens if the government issues digital currency? Like what does that mean? >> Well, digital currency is right. You're talking about um central bank digital currencies. Yeah. Okay. And that um >> um there's a great deal of appeal because of uh the fact that it's easy and so on, but it's um and I think uh it'll it'll be um it'll be done. A lot happens. >> You think it will be done? >> Um yeah, I think it's and but what happens in the digital currency? Um, of course it's easy to transact and so on. Um, almost the and it'll be like money market funds I think. Um, the question will be first uh will they be able to offer interest. So there's a debate now as to whether they will be interest if they're not able to offer interest and they there will be a debate probably they won't be but then they're not an effective vehicle to hold it in because you'll have the depreciation course. You'd rather hold it in a money market fund or a bond but that's debate. There will be no privacy and it's a very effective controlling mechanism by the government. What I mean is all the transactions will be known. All transactions done with digital currencies will be known. Um, which is good for illegal activities getting control of legal activities. But it also means that the government has a great deal of control. For example, they can they can tax that way. They can take your money. They can establish foreign exchange controls and the like. And that'll um so that's something that uh will be an increasing issue particularly for international holders of that currency because they might feel let's say if you're a Frenchman and they wanted to have sanctions they could take your money course you know and >> so guys it's coming CBDC's they're coming they're coming bigly bigly bigly for us and uh the only way to save yourself is of course crypto and uh yeah Just as a reminder, probably all of you already know it, but it's a reminder that these are the things we want to focus on now that we enter the next bull phase. Okay, now it's time to think about fundamentals. You don't think about fundamentals when we're about to go down 90%. They will not save you. But now that you know the sun is coming up, sun is shining, it's a bit fun to watch fundamentals also. Now it's a bit fun to watch a bit of fundamental, discuss a bit of this, a bit of that. Solana can still go to $30. Okay, this is easy. Make them think Sorana Sorana. How How do How do you speak Chinese? Make them think Sorana bottomed at $67. Dollars. Give them a B. Give them a reef bounce. Now send Sorana to $50. [laughter] Man, I I wish I could do Chinese better. Make the team S bottom that $67. Give them a a brief. Anyway, [laughter] now can Solano still go down at to 30? I think guys, I mean, you see yourself is the flash. So, for Solana fundamentals, we'll have to watch watch this a bit. I will give you more fundamentals later on when it's closer to 30. Okay, I think Bitcoin now is a good buy zone to watch fundamentals. Uh, but yeah, it's it's going to be here uh somewhere. By the way, big shout out to all Chinese. I mean my my uh partner in Bulmani is Chinese who does the coaching. So it's you know I I'm allowed I'm allowed. It's all good and you can you can joke about some Bellarus if you want. I mean that's the thing we Russians and Bellar Russians we don't have any protection. We're not a protected species. So anyone can say anything they want about us. You know there are many other like protected ones that you cannot joke like it's super sensitive. I mean we we we don't have any protection. We everything is allowed. So so you you see where I come from. [laughter] Big big shout out if you're Chinese sitting there with a chopstick. Fantastic. Now uh what's happening? Look here. Discord guys maybe adding KYC governments pushing AML KYC on the app layer is crazy. They think it's a good idea to have citizens submit biometrics and IDs to every third party who requests it. Can [clears throat] they at least mandate ZK solution? So all of the data is harvested guys. is harvested very very rapidly and uh yeah soon you may need to use KYC for discord now uh hopefully it's not going to affect the normal features I mean when I actually read a bit deeper it seems that it's only needed if you want to watch some u you know 18 plus kind of content um let's see guys I mean in our discord we don't have it yet we don't have it yet uh but uh hopefully we will not have to do KYC to use discord otherwise I mean we just move somewhere else. I guess that's the best. Uh I don't really care about Discord in particular. If they add KYC, that's too much. Uh we're going to move somewhere else. That's it. That's it. That's it. Look here. A founder Stani Cautious the Bank of England proposed 20K stable coin cap. So this guy just bought a 30 million dollar mansion in London. I think it's a I mean listen, he's very smart, but I think that's a very bad choice. Now he's like stuck in their tax net because they don't have non-dom status anymore. It's high crime, bad weather, uh socialistic mindset and uh increasing taxes. So I think he got himself in a bit of a pickle, so to speak, if I am to say a bit of Britisher. He got himself in a bit of a pickle. Is that how you say in London? Pickle. Okay. Uh let's say let's see. He can unpickle himself if he wants. But now he is warning that it seems the bank of England is unwilling to budge on the 20k uh pounds stable coin holding uh limit uh for in I don't understand how how will this work like they cannot regulate the wallet obviously so what's going to happen was I don't understand this will is it if you have like a crypto exchange you cannot have more than 20k or what is it apparently bank of staff understands this but it may be that the the restriction is coming from the very top. Uh whether it is true or not, it's a true limit to innovation. Yeah. Okay. But they cannot control wallets. So I guess it is if you are a regulated entity, you cannot allow more than 20K for the for the users. And I guess it's good. I mean I mean if we are to think positively about it, if we're to see the bright side here, it means that they have to then hold it in crypto and uh no sell pressure. Is that how it is? I mean, I would imagine being something like that. [laughter] I would imagine being something like that. I mean that would be good. Why why sell into stables when you can hold in crypto? Let's see. Um guys, let's go to Q&A questions, answers, debates, discussions. If you are in the UK, let us know. Uh yeah, you're not in a good place. You need to unpickle yourself uh as soon as possible. As soon as possible. And on this note, let's go to Q&A. Questions, answers, debates, discussions. Let me play you some background beat. There you go. And big shout out to Guzman for time stamping yesterday. Today is Guzman. Today's Guzman. Yesterday was dab. Today Guzman. Fantastic. Fantastic. Sadly, I'm in the UK. Well, I mean you you can take your stuff. You can move. Oh, Guzman needs to move from Netherlands because soon they're going to have tax on unrealized gains. Unrealized gains in Netherlands. Isn't that crazy? Guzman, what's your plan? What's your plan? What What you going to do? You cannot allow them to tax your unrealized gains. It's unfair, man. It's so unfair. I would I'm not allowing I'm not I would never allow that. I would never because what do you get back? You get bad weather. You get uh chaos in the street. You get uh like Yeah. You don't get peace. That's for sure. That's for sure. I love London. That's great. I mean, listen, I like it also as a visitor. You come, you you bounce, you you don't uh wear expensive things because that's dangerous. Uh but yeah, I mean, just see a bit, you know, London Eye. What you see there? Mayer, what you see there more? That's it. Okay, good. You know what, guys? Why is the river brown? Thamps. Thamps. You pronounce Thamps. Why is brown? I don't like that. You know, you thinking, okay, waterfront. It's going to be nice, beautiful is brown. I don't like brown. I don't like brown river, guys. I don't like brown river. I don't like brown river. It It should be blue. Water is blue. Why is brown river temps? Temps. How you say? Tams should be blue. Shouldn't be brown. Temps. Temps. Temps. Yeah. Can Can you guys figure it out? If you can make it blue, I will come a bit more. It's so much pollution there. What happened? What happened, guys? Mud. Well, I mean, there is mud in all water. It's still blue, but there it's brown. Looks like kaka. Come to South Africa. Okay. Uh, but yeah, if they can fix the blue water, at least then it's going to be a bit better. Yeah. I prefer to see it with my chopstick instead of unrealized profit. Exactly. Exactly. Exactly. Big shout out to all Chinese. We I mean listen in China you have like lower tax than in in the EU and then and then they say that the west is capitalist and China is communist. I I don't know. Look at taxes like China is lower than many many so-called capitalist countries in the west. River temps isn't what is it city or you mean city? It's runoff from the city sealed. Oh no, wait. Sorry. Silty. Silty. You mean salty or silty? I don't know this word. Silty. You know English. Or you need to improve because I don't know this word. I never heard silty. Maybe you need to improve your English. Has a pretty brown color. Not a fal brown. Yeah, guys. I I understand. I understand. I understand. But uh it looks the way it looks. Like I understand. I understand. Seal. Silt. Okay. It was correct. tilt is correct. Okay. Yeah, I I understand. I understand. But still, it should be blue. Can they can the colors or something? Silty. Silty. Okay, guys. Got it. Got it. Got it. Exactly. Amsterdam has the same problem. Amsterdam canals. Great canal. But it's brown. It's ugly brown. I don't like brown. It needs to be blue. Water needs to be blue, not brown. I have never seen Cape Town or Durban blue water. Yeah, I've not been to South Africa, but I don't know if you're joking or not. Like, is it is uh polluted or polluted or not? If it would be Trump, I'm sure Trump would already color it long time ago. Just like he's doing the beautiful ballroom in the White House. [laughter] I'm dead serious. Okay. Okay. Okay, let's go to Q&A. If Discord makes KYC, we will VIP VIP code platform. I mean nowadays it is possible. Yeah, Discord doesn't do anything special, but of course running it at scale, many users in everything instant media, loading media, but you know, everything is figured out like there are solutions, best practices how to do this cloud for loading fast image with many users. It shouldn't be a problem. Uh so the problem is that if it becomes big, you get regulated. So maybe the solution to this overregulation by governments is that everyone kind of has their own vibecoded like self-hosted solutions and then we interconnect kind of like masttodon you know that you run your own server like your own social media server and then you connect to others that run their own social media server. Now the normie will never do it but the thing is at some point the they were going to ruin the experience so much so that you need to do KYC and like everything to use discord that that's gonna put the normie a bit back to hey install this thing and run your own social media like you know and then you boop communicate with other others that do it a good example of it is VPN I mean VPN for norm it's quite uh you know complex you download an app you change to VPN but if you have a ban in your country on certain apps then normally learns VPN very quickly. So Normi can learn anything if it's needed enough. Okay. And so when it comes to the uh yeah the your own decentralized social media, maybe we're going to get there. I mean it wouldn't surprise me. It wouldn't surprise me that in a few years with more KYC online, we're going to get to where you run. No, like master Ivan only drinks special waters from Russia. I can't remember what is it called. Bjour. Exactly. Exactly. We will have all graphino west when they force us to KYC. Exactly. So the privacy tech is going to is going to have a renaissance bigly 100%. Um cryptog saying we're the biggest parasites of planet earth. I mean there's something to that. Yes, there's something to that. But at the same time I I don't know. I see it 50/50 because yes I mean we are using the resource but at the same time what's the other way? What's the other way? I mean, we need to use it carefully and respect them. I fully agree. I fully agree. But the other way is that the the radical left is telling you to not have kids because of global warming. I mean, that's uh that's sick up here also. Okay. So, 100% we should respect the environment and all of that. But u I'm just thinking back to 2015, 2018. I I had this discussion with CTO on Twitter. He posted this um video of of a woman who said that she never will have kids and now she's crying because she holds a kid that her parent birthed. Sorry, not her parent, her friend. Her friend birthed and she gets to hold. And C said, I'm not laughing. I think it's beautiful. I'm getting tears in my eyes. Okay, have children, folks. It's great. So, he's fully correct here. And I said, but Larsson, I was told it's bad because of global warming. So, I don't like this kind of mindset. It's so easy, you know, to get pushed too much into the cuckoo universe where you're you're seeing yourself as some kind of uh, you know, parasite because uh, yeah, I mean, what was the solution? Parasites, you need to remove parasite. So, what do you do? You don't uh, reproduce. That's a bad mindset also. So, listen, we're here for a reason. Uh, planet Earth has resource. We need to be respectful, but man, we need to use them. We need to use them. I'm not going to go back into the stone age, okay? U and uh let's figure instead out new techch. Okay? It's kind of like Flintstone. You remember back in the day, you maybe have seen the the the movie, the popular Oscar movie Flintstone, like the cartoon. Anyway, so [cough] Flintstone, it was a nonrenewable uh non-renewable resource back in the day, you know, when we at the Unadunga stage were trying to make fire with a flintstone. It was not renewable. Uh but imagine if we as humans, we started to be like super conservative. Instead of pushing ahead, inventing new methods, electricity and so on, we started to be super conservative and we would not develop our civilization. We would still be, you know, preserving Flintstone. I don't know. There is a bit there is a bit of uh uh balance to be found so to speak. Yeah. By the way, let me know what what you think when we speak about non-crypto. Sometimes you guys just you guys are are channeling the discussion into non-crypto. Sometimes we have a crypto show, but the Q&A is about other things. But listen, we can speak about anything. That's why we have this gathering each and every morning. A bit of gathering. Most times it's crypto. Sometimes it's not crypto. [laughter] But guys, as long as you guys are listening, I'm happy to tell you my opinion on anything. Sometimes, you know, people like, I should stick to I don't know. I mean, as as long as I see the viewership is here, uh, I mean, we can speak about anything. I reserve the right to change my opinion in the future, though, because sometimes people are like, I in 2017, you said this and this and this and this and this and this, and now you're saying this, but bro, you know, 2017, what who was I 2017? I was like, uh, I was a baby 2017. What do you mean? [laughter] like no I haven't in 2017 you said this and this and this and this and now you say this why it's different why it's different if I start digging in your underwear what happened in 2017 and start comparing okay we're going to see we're going we're going to find we're going to find something okay so that's that we need a weekly close above 70.8k 8K for a relief rally. Well, I would say we need uh we need I mean I would say we need something that really erases the I think we need more man. I think we need more. If we go to what is 70.8 no it won't do it. It won't cut it. Why? Because then it's just meh. It's meh. Like there is no force. There is no capturing of initiative from the from the from the bears. uh like a relief rally can happen if we have a candle like this you know like 8K 10k candle something we really need something like that uh you know it's like in I don't know if you watch sports I don't watch sports but many people do so if I have watched some I mean once upon a time I watched sport uh so you know you watch sport your your guys are losing they're being like pressured and pressured you know goal after goal your guys are being you know demolished it's not enough that you know they take the ball and maybe they run to the halfway of the field. It's not enough. You know, they take the ball and they, you know, they derp around a bit. They need to have like a a proper push, you know, take over the initiative. Not just be reactive, be proactive, which is very good in life in general. You're proactive. You're not reactive, you're proactive. But especially now in the market we're in currently, the bulls really have to be proactive. Okay? To really show us the capture of control and capture of initiative. If guys even if we go here is we can just get rejected here at this you know 74 which was the previous low from the year. So just that's why I'm saying the the path of least resistance is down. I think we're going to revisit this buy area quite quickly. Why? Because uh I mean you see yourself h how do you get up? How do you get get it up? Uh that's what she said. But look here first this resistance it's a going to be hard resistance man because it's uh quite solid the resistance from last year next you're going to have this resistance it's also quite solid resistance next you're going to have this resistance quite solid resistance then 50 moving average then you're going to have the the flip here bullish flip another resistance and then so you see how it's like a going to mortar mortar [snorts] at at some point Bitcoin is going to do all of that at some point but it needs to rest just like Frodo needed to rest in the village with a Gandalf for a good while. Drink some tea with a Gandalf before going to mortar. This is what it did here. Okay, we we need this. We need a bit of this here for the resting and then boop can go to mortar. Okay, so we we're far away, guys. We're far away that we're still far away. A bit far away. Yeah, let's see what's going to happen. And if we're wrong, okay, we're going to bullish if we go to bull trend. It's still I mean it's way far away. So yeah, in a land far away the the resistance uh the path of least resistance is down. I mean what cold wallet do you use? I mean to this I I just want to say nice try FBI. I mean I don't like to discuss no exactness of anything. I can I I can tell that I'm not a fan of this like new small ones. I'm not a fan of that. But I don't like discussing the details of uh anything. I can just tell you that I'm not a fan of the small ones and you you want to be ideally geographically geographically distributed so that you have a multi-ig uh for the big funds to move. It shouldn't be in one place. It should be geographically distributed. So that's very important. We got mountain ahead of us. Momentum must fully reset. Yeah, we need to rest guys. We need to rest with Gandalf. How's your dog doing? Very good. Very good. I have two dogs. I have two dogs. Uh this one is uh is the big one. He he he he needs to lose some weight though. So we need to give him a bit less uh food, but he loves food, man. It's crazy. It's golden retriever. They eat so much, man. He never says no to a snack. He's the So yeah, we need to really control his snacks and Yeah. Yeah. He got a bit overweight. He needs to lose some weight. But yeah, that's uh I mean, you know, people struggle lose weight yourself. With a dog, it's a bit easier because you you control exact, you know, the input and and then the output is controlled. Now, [clears throat] when it comes to the second one, he he's smaller. He's smaller and uh he's also golden retriever. He he has I guess he has different metabolism. I mean, he can eat way more, but he's still thin. Okay. So, I don't know. He can he he can eat way more. Well, yeah. I don't know what the hell happened there. [clears throat] the one it's well I mean also the first one that you see here that that gets a bit of a he is castrated uh then the second one we did not castrate uh we thought u yeah so maybe that's also why I heard that their metabolism kind of decreases so could be could could be the reason so I mean my lesson from it is that it's better not to castrate you know but we were a bit of noob when we started when we started with a dog we were a bit of noob we were a bit of clever I mean just like uh most of you guys and me including we were noob move in the crypto markets, especially if you're not in Bulmania, you're still there, uh, go to bulmania.com. And the same thing is with the dog. So, uh, now I would say it's better not to chop off the balls. Okay. Why? Because, yeah, I mean, I see clearly he he eats and he gets fat. And the other one, he eats more, but he is lean as hell. He's he's shredded. [laughter] So that's uh that that that that's my lesson guys. Just like I teach you the crypto lesson lessons, I also teach you a bit of other lessons here as well. Low T makes is Exactly. Exactly. Exactly. It's uh uh it's a problem. I Swedish crime has reached Thailand. Some I was actually Yeah. Yeah. I I was seeing that. Yeah. And you see how Swedish media is so dumb. They say Swedes were captured. You know, in Denmark, Swedes are captured for for this and that. Or in or in Thailand, Swedes are captured. Then you look at them, you're like, man, what is this? It's barmal. You know, barmal, you've been, you know, the child uh story, barmal, if you don't know, you're not from the from the C, what's called CIS, C, you know, the post Soviet, you see like two big bar, you're like, man, this is not Swedish. But okay. But okay. So you see the Sweet this the Swedish media there. Yeah. It's crazy. [laughter] It's the same in everywhere. CIS. Yeah. Exactly. CIS. [clears throat] [laughter] Google Barmal guys. Google. You see you see what is this? Yeah. Crazy man. Uh but it's a big problem. I mean I think soon countries they need to like remove a visa entry from Sweden. I mean uh I I would do it instantly if I would be like migration migration uh officer, a migration minister. I would not allow anyone from Sweden to enter. I mean sadly sadly you don't know who who the hell they have. They don't know anything who who they let in who they are. It's a super violent. I mean they you have um like 12 year olds doing uh uh military grade missions with uh Yeah, it's it's crazy. It's crazy. It's crazy. I would be if I would be Denmark, Norway, I would just like close everything. You need like super KYC to to enter. I think they kind of already done that to some extent, but it's needs to be more. It needs to be way more. Needs to be way more. Uh, it's very interesting how it has like spiraled out of the control. B Poland. Exactly. Zero. Zero. B Poland. Let's end on that. Fully correct, guys. See you all tomorrow. Smash. Smash up the likes. What was this guy name? B Poland. Zero. We have zero. Zero terrorist. Zero zero zero. That's exactly exact. Exactly. Exactly. So, uh, Guzman, thanks a lot for time slapping us, guys. Check out bullion.com for training. Bullion.com/partners for the exchanges. Uh, thanks a lot for being here. Fun discussions. Always fantastic. Always fun every morning. Tashinsky. Tashinsky. Exactly. Zero0000. [laughter] Okay. Thanks a lot, guys. Let's see how the market goes. So far so good. And goodbye. Goodbye.",
        "summary_hu": "A Bitcoin jelenlegi helyzete gyenge, és szüksége van egy jelentős emelkedésre, hogy erőt mutasson, különösen a 200 hetes mozgóátlag elérése előtt. Trump új Fed elnökének, Kevin Worsh-nak a kinevezésével kapcsolatos hírek vegyes érzelmeket váltanak ki, ám a piaci reakciók nem mutatnak komoly változást. A jelenlegi gazdasági háttér kedvező a kriptovaluták számára, és a közeljövőben fokozatos növekedésre lehet számítani. Az elemző szerint a következő ciklus végén a Bitcoin ára 500 ezer dollárra emelkedhet, ami a jövőbeli likviditási helyzet függvénye. Mindezek ellenére sok befektető aggódik a piaci volatilitás miatt, és ezt figyelembe kell venni a pozícióépítés során.",
        "summary_en": "Bitcoin is currently in a weak position and requires a significant pump to demonstrate strength, especially ahead of reaching the 200-week moving average. The news regarding Trump firing his new Fed chair, Kevin Worsh, creates mixed emotions, but market reactions do not show significant changes. The current economic backdrop appears favorable for cryptocurrencies, suggesting gradual growth in the near future. Analysts predict that by the end of the next cycle, the price of Bitcoin could reach $500,000, contingent on future liquidity conditions. Despite optimistic projections, many investors remain worried about market volatility, which should be considered in position-building strategies.",
        "crypto_sentiment": "Bullish",
        "sentiment_score": 75,
        "key_points_hu": [
            "Bitcoin gyenge és emelkedésre van szüksége",
            "Trump új Fed elnöke pozitívan befolyásolhatja a piacot",
            "A következő ciklus során a Bitcoin ára 500 ezer dollárig nőhet"
        ],
        "key_points_en": [
            "Bitcoin is weak and needs a pump",
            "Trump's new Fed chair could positively influence the market",
            "Bitcoin's price could reach $500,000 in the next cycle"
        ],
        "main_topics": [
            "Bitcoin Market Analysis",
            "Federal Reserve Developments"
        ]
    }
]