[
    {
        "video_id": "vKDPFWm6VDE",
        "title": "The Crypto Bull Market is Over...Now What?",
        "published_at": "2026-02-05T10:45:14Z",
        "sort_date": "2026-02-05",
        "url": "https://www.youtube.com/watch?v=vKDPFWm6VDE",
        "transcript": "So, what actually happened in crypto in 2025? >> 100% tariff on imports from China, >> a new record around $125,700. Strategic Bitcoin reserve private experienced [music] a hack. The SEC has abandoned their appeal. >> We recently published our annual report, which makes this a good moment to step back and assess what kind of year it really was. And we know it hasn't been fun. 2025 was the first red year [music] we've had since 2022, but recapping what has developed [music] is important to help inform what might come ahead. So, let's break it down. Crypto started 2025 at 3.4 trillion total market cap and ended at 3.0 trillion, down about 10%. Now, for crypto standards, that's not a whole lot, but context matters. For most of the year, the market was building and as you're probably aware, we went to new all-time highs in early October and total market cap hit 4.4 trillion. And [music] then October 10th happened. Trump announced a surprise 100% tariff on China, which seems to be the trigger for the largest liquidation event in crypto history. About 19 billion wiped out in a single day. And unlike previous corrections, prices [music] did not bounce back. They just bled through November and stayed flat into year end. Even with the little recovery that we saw in January, momentum seems lacking, at least at the time that I'm filming this video. So even if we aren't down a whole lot in absolute terms, it's no wonder that investors are tired when prices are about the same from a year back, just packed with a lot of turmoil in between. And how did all of that fit into the broader market? Well, Bitcoin hit that 124k all-time high in early October, then dropped [music] 23% in Q4 alone, finishing the year down just a modest 6% though. Meanwhile, gold was up 63%. [music] The S&P 500 was up 17%. And even bonds held steady. [music] Silver is up over 2x lately. And its chart looks like a meme coins. So, Bitcoin didn't just underperform. It was one of the worst major [music] assets of 2025. Rather depressing to think about. So with the king down, altcoins, even majors like ETH and Soul [music] fared far worse, but BNB was the outlier here. Despite [music] falling 14% in Q4, it actually closed the year up 23%. [music] The only major asset in the green for 2025. So congrats B&B holders. And beyond the majors, [music] it gets uglier even faster. DeFi, memecoins, AI, everything higher risk got crushed. Bitcoin dominance rose to 57.4% by year end as people rotated out [music] of altcoins. Stable coins were already winning on their own, hitting over 300 billion in market cap altogether. But the market downturn just helped give them a boost in market share. USDT and USDC hit their highest combined market share since late 2023 at [music] 8.6%. 6%. But if you only look at price, you miss half the story. So, let's talk about [music] attention. Meme coins and AI still dominated user attention for [music] the second year running, 12% and 9.4% respectively. That said, meme related interest dropped from 31% in 2024 to [music] 19% in 2025. Meanwhile, AI interest grew from 15% to 18%. [music] And some new narratives broke through as well. Made in USA tokens and world liberty [music] finance both made the top 20 riding political momentum into the election cycle. And despite [music] everything, Solana's ecosystem stayed the most watched layer 1. Between Solana itself and Solana meme coins, it captured more attention than Ethereum [music] base or BSC individually. The other big shift is that interest got more [music] distributed. The top 20 categories made up 67% of attention, down from nearly 79% in [music] 2024, meaning people were spreading out and chasing more narratives at once. Now, one of the hottest areas wasn't even a token narrative though. It was prediction markets. In 2024, platforms like Poly Market and Kelshi got a huge boost from election related markets and that momentum carried into 2025. Total volume on prediction markets jumped from about 15 billion in 2024 to 63 billion in 2025. [music] Poly market was still massive doing around 27 billion on the year but Kalshi climbed fast too hitting roughly 24 billion and by Q4 it had actually edged ahead on market share. The most popular categories on the platform shifted as well. Early on politics and macrostyle markets dominated and by the end of 2025 sports had become the biggest category. So moving on to DeFi. The DeFi market traced the same trajectory as the broader market just with sharper edges. Defy market cap fell hard after the October events, ending the year just over 100 billion, dropping from about 160.7 billion at the start of October. Its share of the overall crypto market ended at about 3.3% which put it below where it started the year. Multi-chain DeFi TVL briefly peaked around 171 billion in early October and then fell to roughly 116 billion by the end of the year. During this period, Ethereum's TVL fell by 23% while Solana's TVL fell by 30%. Base and BMBB chain declined significantly less than both Solana and Ethereum. So in comparison, their dominance improved. NFTs were basically in winter mode. NFT volume showed some life earlier in the year and by September monthly trading volume was around 194 million and then Q4 hit and by December that dropped to about 111 million, a decline of roughly 46%. [music] There was a temporary spike in October on Ethereum, but it was mainly because people were rushing to offload their blue chip pieces while liquidity was still there. But there was one bright spot. Tokenized physical collectibles, actual trading cards and memorabilia represented as NFTts. Platforms like Collector Crypt and Courtyard moved into the top volume rankings. So, while digital art is dead, physical collectibles wrapped in blockchain are finding a niche. On the exchange side, centralized exchange volume fell 15% in Q4. December was especially quiet at around 900 trillion in volume, the slowest month since late 2024. Yet, for the full year, it still grew about 8% to 18.7 trillion. Binance kept its lead with 40% market share, but the bigger trend here was that decentralized exchanges kept closing the gap. The top dexes doubled their annual volume from about 1.8 trillion in 2024 to roughly 3.6 trillion in 2025. And derivatives kept migrating on chain, too. The top 10 per venues did about 92.9 trillion in volume in 2025, up roughly 65% year-over-year, even though the market finished weaker. And while most of that still ran through centralized exchanges, per dexes are growing fast enough now that new players like Hyperliquid and Lighter are showing up among the largest per exchanges. Last but not least, ETFs. US Bitcoin ETFs ended the year holding 121 billion in assets, up 13% despite Bitcoin's price being down. That means flows carry the growth. Institutions kept buying even when prices fell. That said, Q4 did see the first quarterly net outflows for these products at roughly 1.1 billion, but in the full year, net inflows were still around 21 billion. Ethereum ETFs grew even faster, up 48% to 18 billion in assets. They saw Q4 outflows, too, but still ended with 9.7 billion in yearly inflows. And Solana ETFs launched in October, pulling in 866 million by year end. Plus, we got the first XRP ETF in late 2025, and there's also talks of others on the horizon. So that is 2025, a down year for prices, but not a year where everything stalled. ETFs kept growing, stable coins gained share, dexes and onchain derivatives kept pulling volume. Prediction markets exploded, and we'll get to it in another video, but tokenized stocks have also been gaining a lot of traction lately. So whether 2026 turns that underlying activity into something that the market can actually price in is the question. So let us know what you think the next phase looks like in the comments below."
    }
]