[
    {
        "video_id": "ffyObCxsVOQ",
        "title": "Palantir Stock TANKS Today and SHOCKS The Market!",
        "published_at": "2026-02-05T04:20:39Z",
        "sort_date": "2026-02-05",
        "url": "https://www.youtube.com/watch?v=ffyObCxsVOQ",
        "transcript": "Ladies and gentlemen, holy Toledo. The sell-off is still continuing and the knife is continuing to fall as we see red that is just splurged all across the SAS industry. We're going to be talking about the strong correction that we're seeing with a lot of these high beta names and a lot of these software names and why we're seeing a lot of fear, uncertainty, and doubt that is surrounding these individual assets. On top of that, we see Palanteer that unfortunately had, you know, super good earnings. That whole positive move that we talked about yesterday has been completely faded from this technical perspective. This head and shoulders has been setting up that people have been talking about for a while now and has came down about 12% today. We see Palanteer that has lost some major levels of support. We'll be talking about that. What the RSI is looking on some of these names. Are we entering into this oversold territory and when will we see that kind of full capitulation? That's what people are anticipating, especially with a market that's near all-time highs, just a few percentage points off. Um, and we see a lot of rotation that is going into more of these conservative bets like energy and utilities and these different types of productive names. Um, on top of that, we have some of the big CEOs from the make 7 that are telling you that maybe this might be overdue in terms of the selling pressure that we're seeing here. and maybe AI won't completely destroy all the software stocks. If you're a new or returning viewer, hit the like button, subscribe for daily videos. Let's pop it up on the screen right here. First things first, let's address the elephant in the room. Palanteer right here at 138.95. Pretty crazy to see here that Palanteer drops about 12% in the day and is continuing to fall in the overnight session slightly down about another 63. Currently, Palanteer literally lost. You know, you see the head and shoulders right here. Obvious to see on this longer timeline. And you see Palanteer, we talked about this yesterday that hanging out that 150, it was going to be really important to hold that support area and hopefully see a reversal. Unfortunately, we did not get the volume that came through and we lost its support right away. Palanteer has broken down. It has lost its 200 simple moving average. Now, of course, this could, you know, bounce back up whenever, you know, but just looking in terms of its actual uh technical perspective, Palanteer is trying to find a little bit of a grounding. So, we'll see what happens. Maybe a little bit here in the 130s. Palanteer hasn't traded here in quite some time. The last time we were kind of beneath this area or in the 130s was kind of back here in last June. Uh, so it's been quite some time like I mentioned before. We'll see what happens uh in terms of those long-term, you know, people with a super long-term perspective on Palance here. Look at fundamentally what's been happening at the company. Very strong earnings, the earnings continue to be very very well. Is the valuation is becoming more of a reality now. And is that why you're seeing a little bit of a break here. Um I think whenever this does kind of fully capitulate and find a nice bid, uh I think this reversal could be quite strong. It's just a matter of when is that going to happen? And of course, no, nobody knows. you know, another content creator here, V Ronnie, talking about this palance here, of course, highlighting the head and shoulders, but talking about no 146, if that's broken, then it's going down to 120. If that breaks and it's going down to 80. So, we'll see what happens. Um, in terms of a lot of the names here, we'll be talking about those in just a few moments. What I want to talk about here first is Google. Google comes out with some really good earnings today. A had posted um some different tweets on Google. They crush Q4. They crush it like crazy. Their annual revenue revenue here exceeds 400 billion and their cap x guide is at 175 billion versus expectations of 120 billion which is great. You see here Sundar is basically saying that the amount of investment into AI type industries and everything related to the AI industry is going to continue to increase which could be very beneficial. This is his kind of opinion though on the recent SAS meltdown talking about how AI is going to be an enabling tool for software companies. We are seeing massive tokage usage and that many many companies are actually going to be incorporating Gemini into their workflows to increase productivity. And this is important because you also have Jensen here. I encourage you guys to look this up and listen to the clip because Jensen is also saying that the market is wrong currently for software stocks. The big fear is that AI is going to heavily disrupt these software companies and SAS companies. However, Jensen even says here that the notion that how this these software companies are going to be replaced is the most illogical thing in the world in time will prove itself. That's what he's saying. So, we'll see what happens. His reasoning here is, and he talks about either humans or robots, you know, if they need to use a screwdriver, this is his example, that they're not going to reinvent a screwdriver to accomplish a task. They're just going to use what's already there. Um, and that's how he says AI is going to be incorporated into the a lot of these softwares here. They're not going to rewrite or reinvent a lot of these softwares. Why would you take the time and energy to do that if you can already use the available software? So, I think that makes a pretty strong point. the AI is just going to utilize those softwares to become more, you know, productive and more efficient. So, the fact that we got these two Mag7 CEOs saying that, I still have a lot of conviction in the names that are currently experiencing a decent drop and that's what we can talk about here first. Now, Zeda, Zeda is actually doing quite well, holding its 200 currently just slightly below. We'll see if this kind of gets back up here. It's right beneath here waking it off at $1,730. Now, Zetta right here, people were just up here at the 24s. Now, now $7 cheaper. You see, Path also didn't do bad today and actually closed in the green. And that's because Path has been having a lot of selling pressure recently. So, could this be entering an environment where, hey, maybe it's oversold? And we see it right here at 1226. I really like Zetta and Path for a Gentic AI type of opportunities and I think if we do see a rebound, you know, in terms of the long-term perspective, depending on where these bottoms are, these could be some pretty attractive names. On top of that, you're also looking at things like Cipher. Cipher actually was pretty resilient today um at 1414 here. Um you can see cipher um in terms of its actual and what I mean by resiliency we did see a ton of selling pressure of course we saw this huge red candle of course here on the daily what we saw with cipher was get absolutely destroyed originally from where it was at market open this thing was at like 15 right here at 1576 literally plummets down to about 1286 but where the resiliency is we see a nice pop back up here kind of this intraday popback up into the 14s more right around this 50 and 200 trying to recapture those areas. So you can see Cipher does have a lot of resiliency back to these moving averages and I like that especially for IEN kind of experiencing a little bit of the same trading pattern but not quite you know the same. Uh some of the other names more speculative and right here is both you know below underneath $10. You're seeing a lot of these names that are continuing to fall. However, with some of the mag seven names, you know, and with Google, this is where things also can get quite interesting. This is their afterearnings volatility. You see this thing dropped to 311, up to 349, now down about 2% in the overnight session. So, Google right here, even though they had wonderful, wonderful earnings, their name is also getting faded right here, which means there still could be a potential for a downside of course, and that is because, you know, the SPY is still at 685 right here. And the S&P 500 index closes basically it recaptures 6900 for a little bit but right underneath that 6900. So it's below its 50 or it's above its 50 below its 200. We'll see what happens in terms of the moves that do get made. But I like to see the market here that seems to be a little uncertain. This means that the possible opportunity for long-term exposure uh can continue to sit there, especially as we're seeing here, the futures really aren't moving too long. We're seeing a lot of turbulence right here, and a lot of these, you know, bigger people are saying that a lot of this has been sold out. So, we'll see what happens. One thing that is still continuing to sell and you're seeing a beatd down of is crypto. Wo! Bitcoin right here at 71,300. You see Ethereum here that drops back down to 2100. Ethereum and Bitcoin have been seeing an immense amount of selling pressure. And you see BMR right here now underneath $20 at $1972. I think whenever these things reach full capitulation, that is where you could have a strong reversal. It's just a matter of when because these poor BMR shareholders have been beaten down uh after being basically we've seen a lot of promise from everybody involved. So, you know, hopefully that comes with some time with these diamond hand holders that are holding out or stacking and uh we'll see what happens in terms of some of these moves. Uh looking at some other names like the financial tech platforms you see here Robin Hood below $80 now continuing to break down. This could have a lot of correlation with Bitcoin's price and of course with the volume that's associated with probably taking off some of these riskier uh assets and you see SoFi even dropping down here to 20. So we'll see what happens with some of these names. Do you guys think the reversal here is soon or do you think we continue to see a breakdown before these stocks find their bottom? Peace out. Take care and I'll catch you guys later. Let's see what tomorrow brings.",
        "summary_hu": "A Palantir árfolyama 12%-ot esett, és elvesztette a 200 napos mozgóátlagát, ami jelentős támogatási szinteket bontott meg. A piaci félelem és bizonytalanság dominál a szoftveriparban, miközben más szektorok, mint például az energiáé és a közműveké, stabilabb teljesítményt mutatnak. Az AI-technológiákkal kapcsolatos optimizmus ellenére a Piacok felett továbbra is magas a szorongás, ami a részvények kapitulációjához vezethet.",
        "summary_en": "Palantir's stock has dropped 12%, breaking key support levels and losing its 200-day moving average, indicating significant bearish sentiment. The market is fueled by fear and uncertainty, especially within the software industry, while sectors like energy and utilities are showing more stability. Despite optimism surrounding AI technologies, anxiety remains high, potentially leading to further capitulation in stock prices.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 25,
        "key_points_hu": [
            "A Palantir árfolyama 12%-ot esett és elvesztette a támogatási szinteit.",
            "A szoftveriparban a piaci félelem és a bizonytalanság uralkodik.",
            "A kriptovaluták, mint a Bitcoin és Ethereum, jelentős eladási nyomás alatt állnak."
        ],
        "key_points_en": [
            "Palantir's stock has fallen 12% and lost key support levels.",
            "Fear and uncertainty dominate the software industry.",
            "Cryptocurrencies, such as Bitcoin and Ethereum, are under significant selling pressure."
        ],
        "main_topics": [
            "Palantir Stock Performance",
            "Market Sentiment in Software Industry"
        ]
    }
]