[
    {
        "video_id": "tqA5uiGFIgs",
        "title": "CRASH WARNING: Get Your Crypto Off Of Exchanges NOW",
        "published_at": "2026-02-05T18:47:56Z",
        "sort_date": "2026-02-05",
        "url": "https://www.youtube.com/watch?v=tqA5uiGFIgs",
        "transcript": "I'm going to say something very, very serious. If you're holding any crypto on a crypto exchange, I would remove that crypto and take self-custody of that crypto. If you want to keep it throughout the bare market, I would take that crypto off an exchange. And that's because what we're seeing in crypto is an aggressive sell-off, the speed of which is significantly faster and significantly more devastating than any of the previous bare markets. And I'm going to show it to you and prove it to you with data here. And in these conditions, I'm not saying that there's anything guaranteed to happen, but in these conditions, it is absolutely critical that you understand that centralized players like exchanges, if there's any holes in their balance sheet, if there's any lending that they've done, these are the conditions which they blow up because most centralized players do not predict this type of behavior. Especially given everything we know about Bitcoin and crypto being institutionalized as an asset class backed by Wall Street, yada yada yada. You've heard all of the narratives. We've all heard them. We live them. But most centralized players would not expect what's happening now, just as we did not expect it. This is the time for you to be extra vigilant. And I hope that maybe this is overly cautionary, that there is actually not a reason to have to do this and that we do not see another iteration of Mount Gaus, of Bitconnect, of Celsius, of FTX. But sadly, there are just too many examples of centralized players getting wiped off the board in times like this. So, please be vigilant and make sure that you do not become a victim of a potential exchange or centralized exchange failure that tend to happen when prices plummet like this. Now, let's talk about this because what we're seeing here is that Bitcoin has already reached the 2021 all-time high. You can see here the 2021 all-time high of 69K roughly. Uh that is exactly where we are almost right now. We hit that in the span of 17 weeks. It took us 30 weeks in the last bare market to reach the prior cycle all-time high. And in the market cycle before that, we never reached the prior all-time high. You can't see it down here, but the prior cycle all-time high was all the way down here at 1,100 bucks. Right? You cannot even see it. So, Bitcoin and the pace of which Bitcoin is growing is not only slowing down, but it is changing dramatically. And the institutionalization, the Wall Streetification of Bitcoin did not really send our bags to the moon. in this time. In fact, I would argue that right now it has the risk of being a bigger risk on the way down than it was an aid to us on the way up. Let's talk about that. This industry is going through a spiritual cleanse right now. And it has everything to do with the memecoin super cycle with effectively going in for cheap sugar highs as a way for us to see our bags get sent to the moon. And we know why we did it. We found political support where we had political opposition. We found companies willing to buy our bags. We even begged the government to buy our bags. Even though it's quite literally the opposite of the point of a cipher punk movement, which is supposed to empower we the people, to own our own money directly and to really just be free of government intervention. The irony is overwhelming. And even though we didn't really care on the way up, we were hoping to really get rich off this. The truth is that on the way down, it presents an extra level of concern because you have hundreds of companies and some with tens of billions of dollars of Bitcoin and cryptocurrency that are at some point in some way may be forced to sell that asset to make sure that their stock price does not continue to go down because in the end, the only reason why they bought the Bitcoin was to increase their own stock price. So, it's true the ponification of Bitcoin is real and that doesn't take away from the fact that it is an incredible mechanism. It is an incredible technology and it will live on forever. And we must embrace that Bitcoin will grow at the pace it grows. Maybe it's the four-year cycle. Maybe we just bought them in October. Maybe this is the bottom. Maybe this is Elio Trades freaking out near the bottom. But despite all of the humming and hawing, whatever happened on October 10th completely removed crypto from the global industrial asset complex. Okay, Bitcoin is no longer catching any of the momentum that any of these assets have caught. You can see here that on October 10th, Bitcoin was more or less trading in lock step with the S&P 500, with gold, and with the rest of the civilized world. And since that day, it has careened off a cliff. And that maybe is just due to the 4-year cycle. But maybe, just maybe, something big happened that day, and we still don't have answers. I believe the most logical explanation is that effectively whatever happened has led to an exchange or a massive player in crypto with such a big balance sheet that they needed to either sue or offload or mechanically destroy every other participant in order to get back to being solvent. And I think that's what we're seeing here in the charts. That's my guess because what's so crazy is and I've been telling you guys I've been trading. What's so crazy is when you look at even the uh 1 hour time frame, you'll see that there are scarcely any higher highs, right? There's almost no even attempt, no attempt here to make a new high. This was the housekeeping zone which we visited for about 10 seconds, right? And I made that video even while I was on vacation cuz I knew, hey, this might not last. Let's make sure we take advantage. And not only did it not last, but since this nuke back out of the housekeeping zone, you have not even had this attempt. not even a little scammy pump up to make people feel like we might be reversing the direction of the industry. Usually all these downtrends are very treacherous because there's all these super scammy pumps that really liquidate the shorts and make it hard to short. But look, there's just this beautiful symmetry. Every single time Bitcoin just completely carines off a cliff and it's almost without any push back. And the scariest part of all is that we went down to 74K, which is the all-in buy level. This is the weekly level. That was the ultimate low from Trump's tariff palooa in April of 2025. Not only did this level not hold, but we couldn't even get above the prior 15inute high. Right? We bounced maybe a couple thousand bucks, but not even as high as we were earlier that morning. We couldn't in one of the most important levels in crypto bring a real bounce, right? It just rolled right over and went right through. It didn't even bounce on the second time visiting 74K. Right? This is anemic. This is one of the most systematic sell-offs. There are clearly big players, massive players running for the exits in cryptoland. And it is causing a systematic downturn that I just simply haven't seen in all my days in crypto. Not on this level. We've seen collapses. We've seen momentary implosions like Luna. We've seen liquidation cascades, but we've never seen a systematic sell-off where every single minute of the day, someone is hammering the sell order more than anyone could possibly buy. And so, that's the moment we're in right now. And we just tapped 69K, which is the prior cycle all-time high. It should offer some kind of bounce here, but as you can see, it's barely doing anything. It's barely doing anything down here, right? There is no bounce. So clearly the buyers uh for our beloved Bitcoin and the rest of the altcoins obviously are even worse. They've just evaporated and it's almost as if it's too easy to short this asset class right now. Uh you can just put on a short and kind of not worry about it. But at the same time it's quite scary because in the end that means that crypto now needs to go through a bit of a reathering period. Make no mistake this technology is completely transformative. permissionless, disintermediated, powerful finances being built and we will see an entire new financial system born in front of our eyes. And one of my messages today is we don't need to force it to happen. We need to encourage people to innovate, to continue to push the boundaries, to continue to build, and to let the prices happen when they happen because the forcing of number go up here has led to a significant overhang. And really, it's led to us losing our way with the memecoin super cycle and people effectively just looking to make as much quick cash as they can instead of looking to build the most value that they can. Now, make no mistake, my team and I are not going anywhere. We're going to keep working, heads down. Everything keeps going. But it's important in this moment that we realize how grave the situation truly is. That we couldn't see a bounce here off 74. The charts are telling us the news right now. And the news right now is that someone big, someone central to crypto is offloading from crypto. And it's in the form of Bitcoin, of ETH, of a lot of coins and it's systematic and it's every second of the day. And until this ends, which may not happen until we are lower and maybe, just maybe, much lower because under this 69K level, there's not a lot of really good levels until you get down to that bottom around 49K where the whole bullet and Trump thing happened. That's really the next big level. We just need to be very real that this is what we're looking at. We have a potential another major leg down. Major leg down. And we can take it level by level. Obviously, we're right here where, you know, the market kind of broke out when Trump was first elected. This is this uh this breakout zone, right as the election was actually underway. But it's important you realize that unless we see some real push back here and it would be very nice, at least fake it, baby. At least fake it. At least groan and moan for me, baby. Even if you're not liking it, you know what I mean? Like, fake it for me. Okay? Go over 74K. Show me that you have some life here. That would be at least at least something that I could get excited about. And to be honest, I think that it would be really nice because it would offer another short trigger. To be honest, I guess if you're not thinking about shorting or selling right now, I think you're not thinking about it right. Obviously, you'd want to accumulate, but given the price action, I think accumulation down around this level is a more accurate target. But remember what I told you at the beginning of this year. We're not going to speculate. We're going to take it level by level and we're going to seek truth at every moment. Right now, the truth is the truth is that things are pretty bad. Unfortunately, things are pretty bad for crypto. And if you didn't take advantage of the housekeeping zone around 98,000 where we made that video when I was on vacation telling you, hey, if you want to sell stuff, now's the time. In my opinion, losing 74K is a major major negative sign. It's not a good sign, and we need to regain it in quick order. But the charts are just simply not bouncing here. So, it's important you realize what we're being told, the objective information here, and I believe it has a lot to do with Kevin Worsh. That's why we saw the the sudden collapse was that Kevin Worsh effectively takes away the possibility that we might get cheap fast money from the government, which is of course Bitcoin's purpose for existing. In the end, the sun will shine again in crypto, but it's not today. And I want you all to be very careful and I want you all to remove your coins from the exchanges. And I know there's going to be a lot of comments in this section about my projects. Obviously, Superverse, Black Hole, Supernova, they're all going forward. In fact, you are going to get some free stuff here regardless of the fact that there's a bare market. The team voted yesterday that they want to continue on uh with the launch regardless of market conditions. So, you will have Supernova to look forward to if you're holding Black Hole. That will be for free. It'll be a gift and we hope it's very successful for you. Uh we're not hoping that anyone speculates on the token. It is an economic mechanism in the end and we hope it's successful for all the holders who deserve some good news and Superverse will continue to exist throughout the bare market and continue to iterate. Imposters is launching. Everything is going forward. But what we cannot control are the charts. And what we must listen to at this point is just the objective truth that crypto is going through a very significant reformation right now. It needs to lick its wounds. It needs to find its way and it needs to build back stronger. And that's what bare markets are about. But on the other hand, I want to leave you with a very exciting message. We are seeing a slowdown in the S&P 500. We are seeing a slowdown in metals. We are seeing a slowdown in crypto. And it's in these periods that are truly the opportunity to build life-changing positions that will make you wealthy. We'll be talking a lot about that over the coming months. But the point of bare markets is to actually build positions which become astronomically big in bull markets. The point of bare markets is to get ahead and to go the other way while everyone else is freaking out. And I'm going to be very clear that doesn't mean that you buy today, but it means over the next year I believe that we will have amazing opportunities. Maybe over the next year and a half. I have no idea how long this period will last, but we're going to be navigating it together and we're hopefully going to emerge out the other side. Just like we bought Bitcoin below 20K, just like we front ran the altcoin seasons before they happened in 2023 and four, we're going to frontr run everything again this time. And this time, we're going to come at it with the mind of a trader and we're going to make sure that we're always riskmanaged and that we're taking advantage of all those amazing gains that we create along the way. As always, if you enjoyed this video, make sure to smash that like button and subscribe and we'll be back with more. But for now, I hope this message is a cautionary tale that doesn't actually play out. I hope that no exchanges actually go under. I hope that everything's okay. But it's in these times that we prepare for the worst and we continue to hope for the best. I'll see you very soon.",
        "summary_hu": "A kriptovaluta piac jelenlegi helyzete rendkívül aggasztó, mivel az eladási hullám sokkal gyorsabb és drámaibb, mint a korábbi piaci mélypontok idején. A központi tőzsdék működése komoly kockázatot jelent, különösen, ha pénzügyi hiányosságokkal küzdenek. A Bitcoinnal kapcsolatos elemzés azt mutatja, hogy a 69K-as szint elérése nem hozott tartós fellendülést, a vásárlói aktivitás gyakorlatilag eltűnt. A piacok mutatói, beleértve az S&P 500-at, szintén csökkenést jeleznek, ami tovább fokozza a bizonytalanságot. Az elemző arra figyelmeztet, hogy a befektetőknek el kell távolítaniuk kriptovalutáikat a tőzsdékről, mivel a jelenlegi körülmények között súlyos károk érhetik őket. Azonban még a pesszimista piaci helyzet ellenére is lehetőség nyílik az értékes pozíciók kialakítására, amelyek a következő bikapiac során jelentős nyereséget hozhatnak.",
        "summary_en": "The current state of the cryptocurrency market is extremely concerning, as the sell-off is significantly faster and more devastating than in previous bear markets. Centralized exchanges present serious risks, especially if they are facing financial shortfalls. Analyzing Bitcoin shows that reaching the 69K level has not resulted in a sustained rebound, and buying activity has virtually evaporated. Market indicators, including the S&P 500, are also signaling a downturn, further exacerbating uncertainty. The analyst warns investors to remove their cryptocurrencies from exchanges, as severe losses could occur under current conditions. However, despite the pessimistic market scenario, there are opportunities to build valuable positions that could yield significant profits in the next bull market.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 20,
        "key_points_hu": [
            "A kriptovaluta piacon rendkívül gyors és szisztematikus eladási hullámok figyelhetők meg.",
            "A központi tőzsdék és azok pénzügyi helyzete komoly aggodalomra ad okot.",
            "A befektetőknek el kell távolítaniuk kriptovalutáikat a tőzsdékről a potenciális veszteségek elkerülése érdekében."
        ],
        "key_points_en": [
            "The cryptocurrency market is experiencing rapid and systematic sell-offs.",
            "The financial stability of centralized exchanges poses serious concerns.",
            "Investors need to remove their cryptocurrencies from exchanges to avoid potential losses."
        ],
        "main_topics": [
            "Current market trends",
            "Risks of centralized exchanges"
        ]
    }
]