[
    {
        "video_id": "GQD0WyDZOTc",
        "title": "Tech Stocks Crashing: NASDAQ &amp; S&amp;P Weakness Incoming? #shorts",
        "published_at": "2026-02-05T18:29:19Z",
        "sort_date": "2026-02-05",
        "url": "https://www.youtube.com/watch?v=GQD0WyDZOTc",
        "transcript": "Imagine what will happen once NASDAQ and S&P start showing weakness, once tech companies start to dump. And that's exactly what we're seeing right now. Tech companies start to dump. NASDAQ is still holding up, okay? S&P is still holding up, okay? But many, many tech companies are getting absolutely demolished. Absolutely demolished. So, when you look at the Tesla, it's still not looking too bad. I mean, it's just down 20%. Can easily go to the 50we moving average right here. Let's look at something like Netflix. How hard this thing is doing. Netflix shouldn't be too affected by AI."
    },
    {
        "video_id": "65cgxj5o5ZA",
        "title": "Vitalik Dumps ETH: Bearish Signal or Strategic Move? #shorts",
        "published_at": "2026-02-05T16:02:13Z",
        "sort_date": "2026-02-05",
        "url": "https://www.youtube.com/watch?v=65cgxj5o5ZA",
        "transcript": "Vitalic is dumping. He's dumping. He's dumping like there's no tomorrow. He basically nuked all of the L2s a few days ago when he said that he doesn't believe in L2s anymore. So, all of them dumped a lot. And now he's also dumping the crap out of ETH [laughter] over the last three days. Vitalic sold approximately $6.6 million at an average price of $2.2,000 for ETH. I mean, normally when he dumps, especially in big amounts, we do have a bit of a a bit of a leg down. I mean normally he dumps and it sends a signal to the market that he's not too bullish. Now if you look at his whole holdings it's not too big part of it. So that's important context that is not like he dumps everything but he is aggressive. He's aggressive in this bearish times where each and every piece of sentiment matter."
    },
    {
        "video_id": "H12_4L4sUDM",
        "title": "BITCOIN AND ETH: VITALIK DUMPING EVERYTHING!!!! 🚨🚨🚨 (bloodbath will end here)",
        "published_at": "2026-02-05T09:57:29Z",
        "sort_date": "2026-02-05",
        "url": "https://www.youtube.com/watch?v=H12_4L4sUDM",
        "transcript": "Oh yes. Oh yes. Oh yes. Oh yes. Guys, welcome to another episode. And as can you see right now, both ETH and Bitcoin are going down. We're getting flushed flashed as a toilet back towards the 200E moving average, which is going to be a great buy zone. ETH is also not looking too great here. And the target for ETH, as you know, is around 1,000. Sana is also not doing too great. We still have a bit of support here, but if we get flush down, it's going to be towards the $30 level. What is interesting, guys, is that Vitalic is dumping. He's dumping. He's dumping like there's no tomorrow. I mean, literally, there's no tomorrow. He's dumping. He basically nuked all of the L2s a few days ago when he said that he doesn't believe in L2s anymore. So, all of them dumped a lot. And now he's also dumping the crap out of ETH over the last three days. Vitalic sold approximately $6.6 million at an average price of $2.2,000 for ETH. I mean, normally when he dumps, especially in big amounts, we do have a bit of a a bit of a leg down. I mean, normally he dumps and it sends a signal to the market that he's not too bullish. Now, if you look at his whole holdings, it's not too big part of it. So, that's important context that not like he dumps everything, but he is aggressive. He's aggressive in this bearish times where each and every piece of sentiment matters. I mean, in this environment, everything matters. If you have bad news, we dump a lot. If we have good news, we don't pump. So when we are in a bare trend, we have this curse. As we say on this channel, it's a bit of a curse where good news don't pump us, but any bad news dump us like like there is no tomorrow. So Vitalic dumping does in fact have an effect on the on the price on the sentiment, the fact that the founder is exiting at the lows at the lows. I mean normally if you believe in your project, you buy at the lows. You deploy capital at the lows. you look at the stock market normally that's what happens when when the stocks dump they do buyback or they they invest more so all in all this is not too great but guys I have to tell you that overall in the stock market it's not too great you look at many companies I mean look at uh what's happening in fintech look at PayPal for example so it's a bit of a message maybe of encouragement because we're not alone [laughter] we're not alone in look at PayPal PayPal basically going to zero as well from the highs here it went down how much? Uh 86% it didn't even recover. Okay, this is the problem with uh looking only at fundamentals and not at the trend because you see the trend here super bare. It is below the 50 week, below 100, below the 200 week and just going down so fast. If you only look at fundamentals, you may not have seen that the the price is changing, the trend is changing. So we always always look at the price. Let's look at Tesla. People have been asking about Tesla, what's happening? Because that's another thing we have to keep in mind. We have an overall market that is shaky in the stocks and we've been worrying about it. I mean before stocks started to dump, we've been warning that Bitcoin is showing weakness at all-time high in S&P, at all-time high in the NASDAQ. So imagine what will happen once NASDAQ and S&P start showing weakness, once tech companies start to dump. And that's exactly what we're seeing right now. Tech companies start to dump. NASDAQ is still holding up, okay? S&P is still holding up, okay? that many many tech companies are getting absolutely demolished. Absolutely demolished. So when you look at the Tesla, it's still not looking too bad. I mean it's just down uh yeah 20%. Can easily go to the 50WE moving average right here. Let's look at something like Netflix. How hard this thing is doing? Netflix shouldn't be too affected by AI but you see here boom boom down. Well I mean it depends on how you see it. Content creation with AI is going to be huge. But Netflix here has how many weeks now? since December down only when people are saying Ivan we had so so many weeks of Bitcoin down only well look at Netflix it's also down only a lot so all of this points to oh 40% down holy macaroni that's interesting even Microsoft Microsoft shouldn't be too affected by AI either because they have all of the enterprise contracts you look at all of the uh big companies in the world that use Microsoft it's not like it's not like they're going to use cloud code and vibe code their own Microsoft replacer it's not going to happen it's not going to happen. So there is also I would say there's there is a fair uh share of of fear in the tech markets due to AI which is unfounded and likely it's going to recover but the problem is that unfounded or not unfounded the chart is the chart unfounded or not unfounded it's still dumping Bitcoin unfound unfound unfounded or not unfounded it can still take a year six months for it to correct and in the meantime meanwhile in the meantime you're also Bitcoin like everything. So that's why we don't really analyze too much whether something is unfounded or founded or makes sense or doesn't make sense. We just look at the prices. You know it is our mantra price is king. So when you look at uh Microsoft it's not looking too good can easily come back here towards the 200 week and then get a bounce kind of like it did here. Kind of like it did here wouldn't be too crazy and again if Microsoft does it Bitcoin will not like it guys. I mean Bitcoin will not like it. Let's look at Google. Magdogal is Fantastic. See, [laughter] the market is betting that Google is going to basically come in and replace everyone else with AI. That's interesting because I mean, personally, I use probably Google the least. I looking at all of the different softwares that I use daytoday. Uh, when it comes to the business, obviously, we haven't changed too much in terms of like CRM, you don't just go and change CRM and and move all everything to freaking cloud code. You don't do that. I mean, everything works there. you know we have a business process like everything is doing great there we're not going to move it uh looking at every I mean basically it is it is Google that we don't I don't use I chat to AI nowadays but Google is of course providing a lot of the AI they are integrating AI into browser into Google doc so the market is pricing Google quite highly but uh here is where it could actually be another leg down for uh for NASDAQ Google is holding holding up NASDAQ a lot because NASDAQ is still doing quite okay and it hasn't fell too much from the highs. Uh so if this thing starts falling, NASDAQ will follow. NASDAQ will follow very very quickly. So NASDAQ can still easily go to the 50week moving average which is approximately 10% down. And if we do that, Bitcoin is not going to like it either. So Google uh I mean the way I see it is that this is more of a danger zone because uh yeah the market still hasn't uh kicked the fear still hasn't kicked in in the chart while everything else is super fearful. Let's see at Nvidia what's happening Nvidia a bit sideways can easily go to 50 week and guys if they go to 50 week they themselves are still in a bull trend they themselves are still fantastic but for Bitcoin obviously it's a big question mark it's a big big question mark. Uh let's see. Apple Apple I mean Apple blows my mind. Like when it comes to AI they are they they have the worst AI. They don't have any AI [laughter] but they their performance is quite good because AI cannot make iPhone. AI cannot make Mac. AI cannot make uh Apple Watch. AI cannot make that. Okay. So their performance is quite good. Uh they're not replaceable by AI. It's quite interesting that they're not even part of the AI race. They're so far behind with the series. Siri is so bad. It's so horrible. The only thing I can ask Siri with good probability of correct answer is what time is it? Isn't it crazy that in the age of AI like the most reliable thing that Siri can do for me and the only thing I use it for is that I wake up and I ask it what time is it. [laughter] I literally don't use it for anything else. in the age of cha GPT Gemini all of them are doing you know this B you know this meme with the like Olympics with with that Turkish guy that did some professional shooting or something you know his competitors have all of the AI all of the tools he doesn't have any tool he just boop the same thing is with Apple AI worst AI in the world [laughter] so bad Siri doesn't know anything doesn't know who it is what what the hell it's doing Still probably the best stock performance. I I love it. I mean, it's fantastic. Fantastic. Fantastic. Now, Shopify. Let's see. Shopify. Holy crap. Yeah. Coming to 100 week. Hopefully, we're going to get a a bounce. Shopify maybe is a bit different because I mean, basically, their business model needs to be reconfigured a lot. I mean, with AI that can do a million different stores in real time, test different audiences. I mean, Shopify needs to do that basically. But you know the fact that you you come to Shopify, you create like some store uh and they charge a lot for it. It cannot man it's too easy. It's too easy. If they can use AI to let's say do a 100 stores for you and test and you have one store maybe per person per audience. Uh that could be interesting. I mean let's see let's see what's going to happen. But yeah market is not really liking that. What else guys? What else? Oh I mean we can look at all of these treasury companies. They go to zero. Another one goes to zero. Um, let's see. Micro Strategy goes to zero. Let's see. Um, let's see. Bit mine. What's happening? Tom Lee, Tom Lee, Tom Lee, Tom Lee, what's happening? Goes to zero. Basically, it would be crazy if it uh lost all of these gains and went back to where it came from. [laughter] It's still still a long way to fall. So, I wouldn't get too bullish on it yet. It can still fall 50% and get back to basically before Tom Lee. Okay. Wouldn't it be crazy if it went back before Tom Lee? I think it has to happen. [laughter] I think there's going to be an irony here. There's going to be a big irony here. Tom Lee shield if e if shield shield shield shield shield shield in a fully wrong way at the top basically and the stock still went basically where when it started. Now to be fair he has a lot of support here with the 100 week with the with the 200 week like there's a lot of support here. There's a lot of support. So maybe it will bounce a bit, but overall I I I think it would be quite funny if it went back all the way to before Tom Lee. Uh what else? Let's see. Circle. What's happening? Going to zero. Um what other stocks you have, guys? So give me a stock. Let's check some stock. What else is going on? Well, let's let's check SAP. SAP SAP. Are are people selling SAP? Yeah, kind of. Kind of. Exactly. Uh they are selling. They're too expensive, man. They don't do too much. They don't do too much. uh see as long as they move away from the seedbased model to something that makes sense CRM will survive CRM but I mean it's too expensive like they charge too much for storing some data in database yes it's a processes this and that but uh you need to adapt you need to adapt so all in all S&P is sorry no SAP is now at a a good support how much down they are 40% it's a lot it's a lot then people say Bitcoin is volatile I mean look at look at stocks guys. Um, oh yeah, let's check Mara. Mara, what's happening? Mara, people holding Mara, you are currently uh at very very long time support. And if this breaks, guys, we're going to go and we're going to test alltime low. Uh or is this alltime low by the way? But uh you see, so here is going to be very very important. Okay, it's not alltime low. It can go even a bit further. Uh so yeah, before alltime low. But here guys, if it breaks here, you can try shorting with mechanical rules. It's easily possible to short here. Oh, okay. It has to fall quite far. 66% 60% fall you have in front of you if this breaks down towards this low right here. So, yeah, be prepared. And again, guys, the way to make money now is mainly shorting. So, in Bulmania, in our community, we have mainly people making money now from shorting. Uh some do from longing as well. For example, Supreme Governor yesterday was up 60%. Also, I asked him to share a few losses because people some why you only share wins, share losses, share losses. But I told you guys the losses are not exciting because mechanical rules don't allow big losses. We cut losses quite quickly. We don't allow small mistakes to turn into big disasters. So as supreme governor, please share a bit of loss. So you share this loss 3% 1% 7% uh 2%. So losses do happen. Losses do happen. But it's not about whether you have losses or not. Losses happen to everyone. loss happen to everyone. It's more about how big is the loss when it happens and how big are the wins when they happen. So that's very important. So anyway, that's from the Supreme Governor. Big big shout out. La La Land. Haven't seen La La Land post before. Uh but of course we did see a fantastic dump in Sana yesterday. And uh uh 200% captured. Fantastic. Gio shorted Zcash 38%. Very very very nice. So yeah, big shout out to everyone in bulmania.com for sharing their wins. You want to inspire people to show what's possible. Otherwise, you know, you get too depressed if you only see losses. You only see complaining, complain, complain. Everyone complains, manipulation, bias, manipulate. It doesn't help you to complain, complain, manipulation. You are this wasn't supposed to happen like no. This wasn't supposed to happen. All of this, it doesn't help you. Say you need to see the wins. You need to see the winners. You need to see what's possible because people are winning in this market also. And if you want to join Bulmania, go to bulmania.com. Watch the free video. Otherwise, you don't even know what mechanical rules are. Otherwise, your losses are not like this. Like I showed you, boring losses. You have fantastic uh fun losses. [laughter] I wish all of you guys in the new year health and boring losses. You want boring loss, not fun loss when it's down, you know, 70%. You need boring loss. Okay. [laughter] Anyway, anyway, that's that. And also, as always, check out the exchanges that I use in the description below. You see them right here uh in the description below. Booming.com/partners and there you have for example Pionex. You can go long, you can go short, you can do bots. You have buy bits big fat signup bonuses on all of them. And big shout out to Guzman who is timestamping us today. On [snorts] this note guys, let's uh move ahead. So Vitalik dump dump dump dump dump dump dump like there's no tomorrow. Dumping so hard. Bhutan man. Even Bhutan I mean we Bhutan man. We were counting on Bhutan, but Bhutan is now selling, selling, selling, selling. They were the first country to mine Bitcoin in stealth. And uh we were so excited for Bhutan, but now at this lows, they're selling, selling, selling, selling. Uh also, you have to understand that uh uh we are close, guys. I mean, we're getting close to a big fat buying opportunity. We're getting close to generational buying opportunity for Bitcoin. It's not far now. I mean, we're literally at 70. Okay, we're at 70,000 these prices. I mean, just imagine that um we're 12 we're just 12% away from from this buy zone here at around 200 week. It's quite crazy. I want to to remind everyone that uh just a few weeks ago we were here at 93. Do you remember that? Do you remember 93? Good old times. People were saying Ivan, you're wrong. You know what? What do you mean? We've been riskoff since October [clears throat] October 8th exact day. People still ask me and uh yeah this is what happens when you flash this this is the the speed when you break a range this is the speed okay this is the speed and u I think it's a quite good chance that we go here quick as well why because uh we broke this support and if we close the week like this then that break of support is confirmed when you break support you normally go fast okay so uh I want to g get everyone now into a bit of bullish thinking you remember when we in October when we said be careful with this fake time high that happened where we just wicked and fell. I I start to prepare you mentally to be riskoff and bearish. Now I kind of want to do the vice versa because it is time to get the bullish uh as the closer we get to the 200 week guys. I mean it is it is um we don't count on a V-shaped recovery. In fact I I expect to hold kind of sideways for maybe a year because normally you know we get towards 200 week it still takes like a year for it to bottom out maybe go below. So it's not like no get rich quick scheme where we buy in it in this explosive. It could do that like it's not impossible. It could do that. I would rather start start building the position now already when we go towards this buy zone. Uh but um just be prepared also. You know it may still take you know bam bam you know maybe it goes even lower and then something like this happens. Okay maybe something like this happens. Um but we're fine to start here. It's part of the plan. It's part of the strategy. We follow the strategy. Many people now calling for lower numbers 35 30 uh that's not part of the stretch. [laughter] They're not part of my strategy. I just follow my strategy. I don't care what anyone says. Everyone said I was wrong in October. Now people some people are saying that I'm I'm too bullish now. I mean isn't it crazy that that's the that's the curse of uh playing the market in the correct way where you bet on the uh on the chart and not on the narrative because everyone else bets on the narrative. So in October most people were bullish as hell because so much narrative business cycle ISM ISM people were telling me I you're wrong because of business cycle because of ISM. Now people are telling me I'm wrong because recession is coming and so I have to be even more bearish. This is what this is why people told that I am a retardio in October. Listen to this. >> Why is Bitcoin sort of not wildly off to the races yet? And it's this chart. >> Ah it's ISM guys. This is from like October. [laughter] Of course, it's ISM. Bitcoin is basically, this is a dtrended Bitcoin, and it's basically the ISM, which is the business cycle. Remember, we've always said it's the business cycle, stupid. It is always the business cycle, stupid. >> Yeah. Yeah. Ivan, in October, people are telling me you're stupid, Ivan. You're [ __ ] Why? Because you don't follow the business cycle. THE BUSINESS CYCLE. THE ISM IVAN, YOU'RE A BEAR. What a man. What is this? Big shout out to R, but I mean I love R. I love R. In the bull market, we're going to be on the same side. We're going to follow him. He's going to be bullish to the bottom. Bullish. It's I love R. This is not really against R. It's more that, you know, people don't see truth for what it is. And the truth is on the chart. It's not in the business cycle. It's not in the ISM. And I'm looking forward to bull market when I can share Ro's views and we agree and he's bullish as hell and I'm bullish as hell. But I just tell you that this this is this is uh where the the hate towards me has been coming from in terms of everyone saying Ivan you're wrong, you're wrong. I mean we have to we have to analyze >> and all these people who claim it's the four cycle based around this and that. They don't understand. >> Ivan doesn't understand. People tell me you don't understand Ivan. don't understand >> the fundamental of what the business cycle is, why there's a four-year cycle in everything. And we've explained it, we'll go through it. Great. >> I guys, I believe I have to take a victory lap. I give me that. Allow me a bit of victory lap. Allow me allow me a bit of victory lap. So, uh that was in October. That was in October. Uh what happens now is that people are saying I'm too bullish to buy at the at 200 week because you know what? uh recession coming. Bam. So many things that are gonna come and uh that's why we're gonna go lower. I I'm telling you, I don't care because we have a plan. Buying historically at 200 week is a very good deal. Even if it goes a bit lower, it's okay. Don't worry. Be happy. So yeah, Bhutan um sold. Uh let's see what happens here in the White House. I just opened it before. Let's see. Claris Act. A White House tweet exposed the real risk in the Claris Act. What happened? Sincere thanks to representative from crypto. So what happened? What happened? Over the course of the past few months, we achieved breakthroughs. So what happened? What happened? What happened? The meeting reignited tensions, critics, questions. Why policy makers invited Wall Street to help shape uh crypto? Well, I mean, listen, at the end of the day, you you have different interests. Yeah, there is Wall Street, there is the banker, there is this, there is that. Obviously, it's finance. They need to be invited. They need to be enlightened. U otherwise uh you see politicians they have donors. They have I mean they they need to make it work. They need to make it work. It's no one is pro crypto 100%. They have a bit of this donor, a bit of that. They know someone here, someone there. So they need to figure out some somewhere here in between and uh yeah, let's see what's going to happen. However, the meeting also allowed the far subtler subtle set subtler settler is that how you say in English yet equally significant issue to sleep largely unnoticed. Privacy what was happening the fact that you you y'all the fact that y'all are letting the banks contribute to the regulation of their competition just makes look incompetent. In what world should the compensor have a say? Um yeah, so XRP by the way is uh the ones that love the bankers is the Brad Garlinghouse. He is for bankers having a lot of influence. So yeah, this guy he's XRP. So he's boss basically is for bankers. This I'm sorry the bill or sorry croniums is the bankers and two or three crypto firms using the force. Yeah. So so that's exactly what's happening by this is true. This is true. Basically no it's a big club and you're not in it. I'm also not in it, so that's okay. [laughter] Trump, his friends, he has friends with the bank and it's it's it's Trump. He has friends in the banks. He has then Coinbase. All the crypto bros that contribute to Trump, they are the ones that are going to make the rules. It's going to be Coinbase. It's going to be a few other crypto dudes there. They're going to make it. So, it's good for them. And that's it. And that's it. Classic. Classic. Classic. Classic. So how clarity pulls crypto under the bank secret? The clarity act presents itself as a market structure framework that promises regulatory certainty for the US crypto industry. Yet the bill does more than just draw boundaries, judicial boundaries by formally defining regulated crypto roles. Uh it embeds these actors within the existing financial systems system. Yeah. I mean listen that's what I have been wondering for the longest time. How come the bankers don't push harder on them being super regulated and then you have stable coins who basically do similar things where you get yield you know the the function is very similar but the regulation is zero so you can have a wallet you can earn fee on trading it is it is non-custodial but listen all in all the feature is kind of the same now they seem to be now pushing they seem to be now pushing a lot saying basically guys listen why are we so overregulated these guys They have a wallet. They do trading. They do more trading than we do trading. And they have zero KYC, zero nothing. So, let's see what's going to happen, guys. I mean, this Clarity Act um I kind of left it from my uh from my um radar. Why? Because it's I think net positive still at the end of the day because it will allow people to do crypto in the US in ways which are maybe not perfect, but now what happens now? You cannot even do in the US. You have to like leave. You have to do Bahamas. you have to do foundation here. Switzerland like it's going to be net positive is going to be fully bank free. There's not going to be fully bank free. It's more that banks and crypto are going to merge. Crypto Coinbase is going to be more like a bank. Banks are going to be kind of more like crypto as long as they don't touch self-custodial and uh that you can develop your own stuff as a dev. The the the the biggest issue here is going to be for intermediaries like Coinbase and other exchanges. It seems that they're going to be leaving the devs alone and that's the most important thing. So yeah, let's see what's going to happen. But I kind of follow it less and less now because it just seems to be one of these bills that happen all the time. There's nothing special about it. It's not going to improve crypto a lot a lot a lot. Also not going to destroy it either. So it's like you know me something like me. Let's see what's going to happen guys. All in all uh that's it. That's it. We we we covered a lot yesterday also. So, let's go to Q&A. Questions, answers, debates, discussions. Big shout out to Guzman for time stamping us. And let's go to Q&A. We can analyze stocks. We can analyze crypto. So, yeah, let me know what you want to analyze questions. And uh let's go. Let's go. Let's go. Let's go. Guys, everyone talks about Micrology and BNMR. Bit mine, but soul treasuries are overlooked. Yeah, I mean, they're all wrecked. They're all treasury companies are wrecked because also there's like no purpose in them. Uh let me give you some. We actually checked some sold companies earlier in the stream. I did open some of them. Like this one it goes to zero. This one it goes to zero. Uh let's see. This some random ass uh Vanad coffee. Was that a soul company? I need to remove some of them from my watch list. Can someone check Vanadi coffee? It's some coffee brand that became a soul hodel company here in June. And uh now they're back to alltime low. [laughter] I think this idea with uh with uh treasury companies guys, it was a bit over overhyped. I mean you don't need them. What is the point man? Just buy soul. You want more leverage? Okay, buy soul with leverage. You can do it on bybit. If you go to bulmia.com/partners, use the link in description. It's way better actually to just trade with leverage than to buy all of these companies. Uh I mean just go here exchange I use boom.com/partners go to buy bit you get a big fat signup bonus for bitun or weeks or hyperlid. So any of them I mean all of them here have big fat signup bones go long or short. Here's why doing leverage is better than buying some kind of you know treasury company. Number one 24/7 access. You don't want the position anymore during a weekend when prices dump you're out. If you're stuck in a treasury company and prices dump during weekend, you're stuck until the stock market opens. Number two, liquidity. All of this crap uh crap treasury companies, they have zero liquid. Is there illquid penny stock? So, if you want to do any kind of meaningful position or you want to ensure you have good spread, you will not be able to do that with this. Okay? Uh instead, go to buy bit like you can do you can long or short or do what the hell you want with any asset. So, that's that. Uh, what else? Um, management risk. You have management risk. Who the hell like you have a CEO, maybe CEO there's a incompetence, maybe they lose the key, maybe something else, like there's a guy running the company or a girl. Well, it's another risk. Why you need that? Why you need that? Uh, so I I I think that all of these treasure companies, no matter whether it's Saul or any of them, it is for guys. I mean, at this stage, it's why you need them. There's a bit of you need to have a stock to buy if you cannot buy real crypto. You want a stock to buy, but now you have ETF. So what's what's the freaking point of treasury company? They just add more risk. But if you want more risk, you can go and uh long with leverage. It's also going to be more risk. But in my view, in my view and also in my experience, way better for the reasons I just said more control 24/7. You decide the leverage. No external risks like the CEO management risk, fraud risk. I mean sometimes you are fraud in companies. You are fraud. You can you can easily have fraud. Someone siphoning off money like anything can happen. They can do a contract a dumb contract that they have kind of legal issue. Like there are a million things that can happen a million things. [clears throat] So why stack and and and they do leverage with the assets. They normally have asset and then they uh leverage it by have by issuing more stock or taking on more debt or issuing or issuing debt. So they also do leverage. So you have yeah I don't know how equation this equation makes sense. So that's that. Do you think Sailor will start selling uh any Bitcoin anytime soon after being down like 10 billion? I don't think he's going to do if he's not forced to. And as far as I understand he's not forced to for a few more years. So and um yeah as long as he can pay the dividend on all of the different debts he has. So he has he needs to pay that's why it's too complex now. I can't even know. Some of it he has to pay dividends. some of it he just has to pay the interest rate. Uh so look at all of the different uh things he has issued. He has the stock obviously then he has the debt instrument number one strikes drive bum boom boom you have to pay interest like that's why I don't really understand how much money like when he has to pay it changes he does a new instrument so it's too much money so I cannot even tell you when that will happen probably maybe if you ask a he can tell you something and also it can change at any moment it can change if the issue knew that they sell more stock so it's again just if you want more craziness buy um on buy bitcoin buy bit now if you're asking in terms of the risk I think the risk of them selling is still quite low uh if bare market continues for 2 three years that's going to be higher but now I think that they're fine they're fine they should be fine and uh they can pay all of this interests and dividends without issues and if they can do that then there's no reason to sell so yeah but it is it is interesting guys I mean I got to say it is interesting the the underperformance of his buys it's Insane. It's insane. Like, you know, we say hodddle, huddle, buy, huddle, huddle. But I mean, he's been doing it for a long time and he's down a lot. He could have just bought treasuries. He would be up like 20%. If he just buy treasury, like short-term treasuries, he would be up. Uh, now he's down. and treasuries is like zero risk thing in terms of um it's like having a dollar or having treasury is the same risk. So [snorts] yeah, he's down like what is it 10 billion and he's been dcaing for five, seven years or how long? It's not good, man. It's not good. Um yeah, he needs to all I mean here's the thing. I I would if I would be sailor I would be seller I would be I would speak to the CFO a bit. I would speak a bit with the CFO because how come they buy at such weird times and I would also investigate a bit are we getting a bad price from the exchange or why do we all is I I've never remember that seller bought at a lower price than the market price like at the current now of course he doesn't buy the same day as he tweets but you know sometimes just so he buys so expensive how we can buy so expensive uh I I would really really evaluate like what's happening here. What's happening here? And ideally, he should buy in a bull trend. Not in a bare trend, but in a bull trend. But okay, his strategy is to buy no matter what DCA. But you also see the result. I mean, the result is not too great. No, he bought on February 3 days ago. He announced that he bought at 87. Like h how how? Yeah, average price at 87. It's 70 now. Nothing was happening. Now, the good thing is that he didn't buy too much, but uh before he bought like two billion and then he bought like two billion or something at 90. So, something's going on. I mean, I I I would at least check like how are we buying? Who who gives us this price? Can they give us a better price? Can they be Can we be a slightly smarter in how we buy? I mean, maybe a bit smarter because this this is not smart. The way it looks is not smart. Now, will he win at the in the end if he survives? Probably. I mean, business is going to go to a million eventually. I have no doubt about that. Um, and u he has a strategy. As long as uh he doesn't blow up before that, as long as he can pay the dividend, um, great. But it's not for me. It's not for me. And indeed, he needs Bulmania. Bulmania.com. It would save him tens of billions of dollars. And Tom Lee and everyone like, they really need Bulmania. They really need to understand the mechanical rules. Um but you see their their incentive is not really to uh grow portfolio necessarily. They just need to have a it's more like a fund. You know when you do a fund uh it depends on which fund but let's say that you do a bitcoin fund you cannot guarantee bitcoin performance. You cannot guarantee. So if if you just have a passive fund if people believe in bitcoin they can buy. Bitcoin don't people don't believe in bitcoin they don't have to buy. Then um I guess it's okay. I mean it's uh for them it doesn't really matter as long as they get more assets under management as long as they're bigger as a company uh it should be counted as success still for them. So it's also important to caveat. It's kind of what Tom Lee said which I agree with him on when people say that Tom Lee has a big loss. Well it's because ETH has fallen and uh Tom Lee before he was positioning himself as this opinionated person. And here's where I think he is not fully honest. Before he was saying that I believe in ETH, you should buy ETH because of this and this and this and I believe in ETH. Then ETH started to dump and he said why do you guys blame me? You believed in ETH and I just did a vehicle that mirrors ETH. You understand? So it's like a bit of double speak because for the longest time to was saying, you remember what he was saying? BYE BYE BYE BYE BYE. IT'S GOING TO GO UP. IT'S GOING TO GO UP. I BELIEVE IT'S GOING TO GO UP. IT'S GONNA OKAY. Then everyone bought and he's saying, \"But guys, you bought ETH and I just did an ETH vehicle that follows ETH.\" He compared himself basically to S&P 500. He said, \"Guys, you don't complain when uh he here's what he said. These tweets missed the point of an ETH Ethereum treasury. Bitman is designed to track price of ETH. Uh shall he say, shall all shall we call out all index funds for their losses?\" But bro, you were bullish like a mfer, like a like a mother. You know who. Okay, that was why people bought. People did not buy just to passively follow ETH. You said the business cycle. YOU SAID ALL OF THAT. THAT'S WHY people bought. Okay. And now he's like, \"Oh, no, no, no, no. We're just we're like S&P but for ETH.\" So ETH was down and we're down. So So he he he made that jump. Okay. He made that jump. So now he just has an unopinionated vehicle for ETH believers. And if ETH goes down, it's not his problem. It's your problem. You bought the ETH crap. He just did a vehicle for you. Okay. [laughter] I don't even know how we got here. Oh yeah, we spoke that they need mechanical. Yeah. See? Yeah. He needed mechanical rules and now he he effed up and he's saying it's on you guys. I just did the freaking vehicle. It's think of it. Think of I'm like S&P for for uh for ETH. ETH went down and boop. That's it. That's it. Ivan, you told us to buy ETH. Not since October. Not since October. Since October, risk off. No altcoins. Conservative. You always again I keep I I always have one or or two guys saying that. But Ivan, what about when you said this and that? Listen, when it's sun, we have sunglasses. I keep repeating it. When it's rain, we have umbrellas. Since October, it's rain. It's rain. If you take umbrella, should I tell you but you had sunglasses tomorrow? I don't want to repeat too much because we did a lot of it. Go to Ivan. Go to bullmay.com/ivan and read my track record here because we have we have all the receipts. Okay, we have all the receipts. And when I can tell you when we're going to be buying at 200 week for Bitcoin. People are gonna say, \"But Ivan, you you were bearish Bitcoin.\" But I mean you were bearish like Salada or you know in a bull market we're bullish that's the definition in a bare market we're bearish how else you want you want us to be vice versa how else you want like that also highlights that the the average investor like I don't know they have this this idea of the market that is so weird. I don't I don't even understand it. Like people are saying Ivan in the before in the bull market you were bullish now you're Yes. Exactly. In the bull market we were bullish now we're bearish. Exactly. Exactly. So October since October rain started and we're bearish. That's it. That's it. That's it. That's it. Sailor convinced Retail to fund his Bitcoin stack while they carry the risk. Genius. Yeah. So as long as Sailor survives, he has very little risk in in micro strategy. As long as he survives, fantastic. Ivan when you buy a 200 week moving bearish and money line still bearish will you keep shorting the market? No. No. So when we are at 200 week even though money line is bearish I so basically what I will do I will I will front my line a bit just based on the historic performance of Bitcoin and that 200 week is a very very fair price. So I would not be shorting instead I will slowly buy slowly uh either we either I'm going to do 10 trenches or 15 and then um either bi-weekly or monthly. We'll have to see see how the market evolves. But uh and I will tell you more exact how we'll do it once we get closer. But all in all between 10 to 15 trenches and then in terms of the speed either bi-weekly or monthly I will I still will have to decide how I do it and uh I will not be shorting. I will just be accumulating. I'm also expecting it to go a bit below 200 week which it did uh last uh uh bare market as well. Uh so no shorting and then when we flip bullish that's basically a signal to accelerate this accelerate. So instead of bi-weekly maybe it is weekly now in terms of you know how fast to uh to enter. So we we'll see exact the the plan once we get closer. But that's um that's kind of what I'm thinking. Um what do you think of world highest IQ? No clue. No clue. No clue. who keep calling for a super cycle. I mean, don't put label on stuff. I don't even know what a super cycle means. If we go to 200 week and then we go to Valhalla, is it a super cycle? These labels people have, it also makes you a bit uh loco because okay, as you know, we're bullish around here. So, we go here and then we go like this. Is this super cycle? The super cycle guys are going to say it's super cycle. They're going to say I was right. Uh, roll is gonna say ISM AND THE BUSINESS CYCLE. IVAN, YOU WERE WRONG. LOOK AT THE ISM. [laughter] Now we're pumping. So why do you put labels? Ignore the label. I don't know what the super cycle means. I I literally don't know it. What What does it mean? It's some retardial concept. Uh, I look at the trend. I look at the price and uh I look at the buy zone. That's it. Super cycle, not super cycle. What is it? I mean people invent all these labels to fugazi themselves into something that doesn't exist or yeah you can have a super cycle if it goes 200 week and then up. I guess it's a super Yeah. I mean you could also argue that Bitcoin isn't a super cycle since 2010 because it goes up three years then down one year normally. So is that kind of is a super cycle also? What is a super cycle guys? Let me know. Do you have an exact definition or you just have you know this handwavy BS you you heard somewhere? likely. I mean, I know already it's the second. You don't have you don't have to reply actually, but [laughter] hope it makes sense. There is no super cycle in my head as a concept. Left translated, right translated, I don't care. I don't care. We follow the the chart. The chart is bare. That's it. It's going to be bull at some point. It's going to be bull at some point. Hey Ivan, if this time is not different, we should print a green yearly candle this year. Uh I don't know, man. It's it should be now is the barrier. Midterm year is the barrier. That's it is the barrier. And uh should we print this? I don't know to tell you. It's bare trend. When the bare trend ends, we're bullish. Or when we're at the 200 week moving average, guys, don't try to like think, you know, one, two, three, one, two, three. No, nothing is for certain. Nothing is for certain. Uh and uh I don't know how that's useful. You know this you know red red bum bum bum. There there is one useful thing which I use to um to see if we are kind of on track for midterm year and that's comparing to previous midterm years. I think this one is useful because it is following exact and uh yeah and you see it's exact. It's exact this one how this year the green one is following the other midterm years and this is the average the white it's exact but then like what do you mean this this cycle if according to fourear cycle this one should be red okay but I don't like on the yearly candle guys uh I don't like looking at the yearly candle why uh because you can have different results versus the weekly let me actually find I did a video on it I don't want to repeat it let let me just give you the video you can watch it I have like a 15-inute video I did in uh oh yeah yeah here here stock market in sorry sorry here go and watch this one bitcoin yearly candle is ins is insane [clears throat] where I discussed that you know technically it was a red candle but I don't care about it where is it where is it where is technically this one was a red but uh I don't care about it because you measure weekly weekly from top to bottom is the same so I I'm more on a weekly time frame I don't use the yearly like I I don't know really what to what to do with it because yeah it's uh it's red but uh weekly is the same I mean everything else this doesn't affect anything from what I do like this year anyway go and watch it I will post in the in the comments uh here the video is better the video explains it better than I do now because there I had like 15 minutes to record it but all in all I don't I don't care about the yearly color this and that instead uh we look at uh where the trend is where is the 200 week moving average and on uh if you compare to other midterm years it's it's quite exact so yeah and the 4 cycle is correct we did uh we did pick out basically it's called four cycle I would rather call it 250 week cycle is that better because you see yourself like for cycle this and that I I live on the weekly like for Bitcoin my time frame is the weekly so I would like to call it the 200 how many is it like 200 210 year not 210 week cycle. Let me actually measure it here. Let's see from this stop to this top. How many years is that? How many weeks? So 204 week cycle. Okay. I like I like this one more because the problem with looking at the yearly is that you see we have like we really have like a 204 week cycle. So it is kind of four years but it's not exact. So, it's just going to be overlapping sometimes. So, instead of ending the year green, if it's just like one week shifted, it can be. Anyway, the let's not get uh too much into this. Go watch the video and on the weekly you're going to see that everything is way simpler uh and uh the numbers are exact. And that's it basically. And we watch for the 200 week and watch for bull trend. That's the most important on the weekly. I mean if we still have some major alls to sell to drisk more do we wait for retest of upper levels this is the most difficult question there's no good answer um the retest may not happen there is no relief rallies uh this far and alts have dropped another like 50% since people wanted relief rally what I would do is I would break them up in trenches and then exit one trench at a time into something that is bullish but there are not too many things that are bullish so it's just the dollar now just the coin and uh uh and and take it from there. Uh just to release some pressure, you need to release pressure. You hold the back down a lot. It's going so you you don't want to sell. But if you start selling a bit, you're going to release pressure. You can then see see it with fresh eyes. Would I buy it today? Like that's a good question. Would I buy it today? Because each each day you keep holding, it's like you're buying it again. Would I buy it? You can ask it yourself and then you can you can have a clearer mind. But it's a deep topic. We have a full course on this how to handle losing positions. Uh so go to bullmania.com watch the free video. If you join Bulmania you're going to you're going to see it. Uh you you're going to see it. But there is no good answer. I mean that that's that's that's the first thing you have to understand. So don't look for the perfect answer. All answers are going to suck because you mismanage the position. And that's fine by the way. I'm not saying it's no use your I mean it is your fault but um let's be constructive and just look at how to fix it. There there's not going to be a perfect answer. So you just need to be okay with that. And the first step is to break the mental prison. You're in the mental prison. You hold it. You hold it. You feel you feel dumb for selling, which means that you keep holding it. It goes down. You keep holding it. You need to release that pressure first. Um once that is done, you can see it from with fresh eyes. And by the way, then the answer will come to you yourself. Okay? [laughter] If you ask yourself, okay, would I buy it today? Let's say you had 10K, now it is 2K. It's down 80%. It's still 2K in the market that you could take out now. So in but instead you keep it in the market which means that you kind of buy it every day. You understand? You keep buying it every day. 2K you you decide to still hold it. So just see it from with fresh eyes. If you had 2K would you buy it or not? I I would just ask like that. Fantastic analysis. Great that you like it. If SLA only drops to 50 then up would you buy it in? Yeah. So then we would buy when when bull trend happens. Sana 30 we're gonna buy even in bon. Okay. [laughter] If it goes to like 50 and finds a bottom then we're going to buy it when [ __ ] happens. But 30 guys we this here. We're going to be buying it without [ __ ] We're going to be foring in 30 and loading the bag. Now FOMO, not FOMO, it's going to be in trenches. But FOMO in terms that we do it before the the the bullsh uh let's say it goes to 50, it finds a bottom here, then it flips bullish. We're going to jump in. We're going to jump in. Um I wouldn't be worried of, you know, it goes to 50 and then bam, back to a million. That will listen likely it's going to it's going to find a bottom. It's going to derp around probably for like six months. this flip level is going to come down and then boop, it feels bullish and yeah, that's it. That that's going to be a great setup. I mean, you know, here it took like how long time it took really to find a bottom here. It took a year in the last uh in the last bear. So, bottoms they take time to form. You need to form a bottom. Vshape recovery is an exception. I think people remember V-shaped recovery from 2019. you guys who have been here because that was like one time we had V-shaped recovery with the COVID crash and then boop straight back and and people somehow see it as this standard but it's very rare like normally bottoms take time to form they take a lot of time so I'm not worried that you know it's just going to be boop 50 and then bam to a million is likely going to form a bottom flip level is going to come down we can buy it when it flips if it goes to 30 we're going to be buying it in the bare run [laughter] it's too good value man it's too good Guys, let's wrap it up. We're at 50 minutes. Another stream, another fantastic morning together. Thanks a lot for being here. Thanks a lot for contributing to the chat with great questions, great discussions, great debates. We will be back. I mean, let's see what's going to happen. If Bitcoin goes to like 60 today, I mean, it could be today, guys. It could be today. We're going to do a stream in the evening if something happens. If nothing happens, then we're going to be back tomorrow. So guys, thanks a lot for being here. Thanks a lot for contributions to the chat. Big shout out to Guzman four times something else today. Check out booming.com for training. Booming.com/partners exchanges I use for buy bit bonus and all of that. And um goodbye guys. Goodbye. Goodbye. Bye."
    }
]