{
    "channel_name": "CoinBureau",
    "channel_id": "UCqK_GSMbpiV8spgD3ZGloSw",
    "channel_handle": "coinbureau",
    "video_id": "qJNj1eVmgNc",
    "title": "Wall Street Just Proved Bitcoin Is Not Digital Gold (The Data Is Terrifying)",
    "published_at": "2026-02-25T14:01:19Z",
    "url": "https://www.youtube.com/watch?v={'kind': 'youtube#video', 'videoId': 'qJNj1eVmgNc'}",
    "transcript": "We were promised that Bitcoin was a digital  gold. We were told that it was the ultimate hedge   against geopolitical chaos and government money  printing. But when the US president announced a   massive 15% global tariff, the market didn't  behave as the maximalists promised. Gold shot   up more than 2.6%. Bitcoin plummeted below  $65,000, dragging the entire altcoin market   down with it. In a matter of hours, over $500  million in leveraged positions were wiped off   the map. The safe haven narrative just failed its  biggest test on the global stage. Since the crypto   market's peak in October 2025, a staggering  $2.22 trillion has been completely erased.   Institutions are pulling billions out of Bitcoin  ETFs. Miners are dumping their entire treasuries.   and the fear and greed index has collapsed to  levels we haven't seen since the March 2020 co   crash. So is the digital gold thesis officially  dead? Are we looking at a cascading liquidation   event that sends crypto back to the stone age?  Or is this actually the ultimate contrarian setup   for a massive wealth transfer? And that is exactly  what we are going to cover today. My name is Nick   and you're watching the Coin Bureau. First things  first, let's look at the catalyst that just sent a   shock wave through the entire global economy. To  understand why Bitcoin is crashing, you have to   understand the legal drama that unfolded over  the weekend. On Friday, the 20th of February,   the US Supreme Court handed down a momentous 6 to3  decision in a case called Learning Resources, Inc.   versus Trump. The court ruled that the president's  previous sweep in tariffs imposed under the   International Emergency Economic Powers Act or  EA were unconstitutional. For a few brief hours,   the markets actually cheered. Bitcoin actually  bounced from $66,500 toward $68,000. But these   celebrations, they didn't last long. Within a few  hours of the ruling, the president fired back on   Truth Social, invoking a completely different,  never-befored law. He announced a new 15% global   tariff under section 122 of the trade act of  1974. Now, in case you didn't know, section 122   allows the president to impose temporary import s  charges of up to 15% to address quote fundamental   international payments problems. It is a 150day  emergency measure that applies to virtually   all nations simultaneously. It is historically  unprecedented and the market reaction was absolute   carnage. Bitcoin shed more than 5% of its value in  under two hours, falling from $67,600 to a low of   $64,090. This sudden drop triggered a cascade  of forced selling. According to Coin Glass,   total liquidations hit $55 million in just 24  hours. Over 136,000 traders were liquidated,   completely evaporating open interest. across  crypto derivatives from a peak of $ 38.3 billion   down to just $19.5 billion. But the headline that  grabbed everyone's attention wasn't the dollar   amount of the liquidations. It was the devastating  divergence between Bitcoin and traditional safe   havens. For years, the core thesis of the industry  has been that Bitcoin acts as a non-s sovereign   store of value. When traditional markets panic,  Bitcoin is supposed to be the life raft. But on   tariff day, that life raft sank. While Bitcoin  was dropping 5%, physical gold surged 2.64%,   crossing over $5,200, bringing it back near its  all-time highs. That is a 6.27 point divergence   on the exact same macroeconomic shock. At its peak  in December 2024, one Bitcoin could buy you about   38 o of gold. Today, that figure has fallen to  roughly 13 oz. Bitcoin has lost more than 62% of   its value relative to gold in little over a year.  And it's not just gold. When the tariff news hit,   Bitcoin moved in near lock step with the NASDAQ  index. Its correlation with the tech stocks has   swung from a negative 0.68 to a highly positive  0.72 in just a matter of weeks. I know this is   hard to hear for the diehard hodlers, but the data  does not lie. Right now, Bitcoin is not trading   like a digital gold. It's trading like a high beta  leveraged tech stock. When Wall Street panics over   tariffs and supply chains, they don't buy Bitcoin  to protect themselves. They dump it. And the smart   money is already heading to the exits. Since  late January, US spot Bitcoin ETFs have logged   five consecutive weeks of net outflows. Over $3.8  8 billion has been pulled from the ETF complex in   just over a month. Black Rockck's IBIT alone shed  roughly $2.1 billion, while Fidelity's FBTC saw   about $954 million walk out the door. Institutions  do not like uncertainty, and a global trade war is   the ultimate uncertainty. But it isn't just Wall  Street suits who are heading for the exits. The   miners are capitulating too. Bit Dear, currently  the largest publicly traded self-operating mining   company by hash rate, just did the unthinkable.  In their latest weekly update, they revealed that   they sold 189.8 newly mined Bitcoin and liquidated  their entire reserve of 943.1 Bitcoin. They now   hold exactly zero Bitcoin on their balance  sheet. When the biggest miners in the world   are dumping their entire treasuries, you know, the  pressure is real. And uh to make matters worse,   the liquidity that usually buys these dips  is evaporating. According to CryptoCquant,   the 60-day market cap change for Tether or USDT  has dropped below $33 billion. Stable coins are   the dry powder of the crypto market. When USDT  contracts by billions of dollars, it means   capital is leaving the ecosystem entirely. And  speaking of staying ahead of these macroeconomic   shocks before they wipe out your portfolio, you  need to be where the news breaks first. The Coin   Bureau Telegram channel is where we share the  latest breaking news, provide deep dive alpa,   and give you the most important market updates,  all pinged directly to your device so you don't   miss a thing. Whether it's a surprise Supreme  Court ruling or a massive minor capitulating,   our members knew about it first. So, sign up  today using the link down below or by scanning   this QR code over here. Okay, back to the macro  picture because to truly understand why Bitcoin   is bleeding, we have to look at the impossible  trap the Federal Reserve is currently caught in.   Conventional economic wisdom will tell you that  tariffs lead to inflation. When you slap a 15%   tax on imported goods, companies don't absorb that  cost. They pass it on to you, the consumer. And   we're already seeing this in the data. The core  personal consumption expenditures index or PCE,   which is the Fed's preferred inflation measure,  just came in at a hot 3% year-over-year. This   completely shatters the narrative that inflation  was cooling down to the Fed's 2% target. So,   the Federal Reserve is trapped. They want to  cut interest rates to support a slowing economy,   but they cannot cut rates if tariffs are causing  inflation to spike again. If they cut rates   into rise in inflation, we get stagflation. And  stagflation is the absolute worstc case scenario   for risk assets like tech stocks and Bitcoin. And  this is why the 10-year Treasury yield is falling   and the US dollar index or the Dixie is holding  strong near 97.8. Investors are fleeing to cash,   government bonds, and to gold. They are derisking.  And because Bitcoin ETFs have integrated crypto   into the traditional financial plumbing, Bitcoin  gets sold right alongside everything else. When   a hedge funds algorithm tells it to reduce  risk, it sells Apple, it sells Tesla, and it   sells Black Rockck's IBIT. It is institutional  correlation by architecture, not by coincidence.   So, is it time to pack it all up? Are we heading  into a multi-year Bitcoin winter? Well, to be   perfectly blunt, no. And here's why. Everything  I've just shown you, the tariff chaos, the fear,   the institutional selling, it's all setting up  for what could be one of the most historically   significant buying windows in Bitcoin's history.  Let's take a look at that fear and greed index.   Right now, it's sitting at five out of 100.  That is extreme fear. Do you know the last   time sentiment was this bad? March 2020, the COVID  19 crash. And if you know your Bitcoin history,   you know exactly what happened in the months after  that reading. Historically, market bottoms tend to   line up with the index dropping into extreme  fear, forcing the final wave of capitulation.   But it's not just sentiment, it's the maths.  Since 2014, Bitcoin has experienced nine major   corrections where the price dropped between 40  to 50% from its cycle peak. We are currently down   roughly 48% from October 2025's all-time highs of  $126,000. Now, do you know how many times Bitcoin   has failed to reach an all-time high after a 40  to 50% correction? Zero. Nine out of nine times   Bitcoin has recovered. And the average recovery  time for a correction of this specific depth   is between 9 and 14 months. This is not the  2022 bare market where we drew down 77% over   systemic bankruptcies. This is a standard  midcycle macroeconomic shakeout. Something   else that you may also want to consider is how  liquidity is likely to shift in the coming months.   Over the past year, most people have focused  exclusively on broad measures of money supply as   a sign that Bitcoin could be about to shift. They  praised the almighty M2 indicator and yearned for   quantitive easing. However, according to a recent  report from Krock, it's not the Fed, it's not QE,   it's all the Treasury. Since 2021, the liquidity  source with the strongest leading relationship to   Bitcoin has been Treasury bill issuance. Treasury  QE or T- billill issuance shows an 80% positive   correlation leading Bitcoin. When T-ball bill  issuance starts to pick up, we tend to see Bitcoin   follow months later. It has been fading into early  2026 and Bitcoin weakness lines up with this. But   consider this. A3 to4 trillion annual refinancing  wave is building through 2029. And the path of   least resistance is more short-term issuance. So  that's liquidity. But finally, let's not forget   about the inflation rate of Bitcoin versus gold.  Bitcoin's block reward is now just 3.125 BTC per   block. The daily issuance is a mere 450 Bitcoin,  and that makes the inflation rate about 1%. Making   it mathematically more scarce than gold, which  inflates at about 1.5 to 2% a year. Right now,   the market is completely ignoring this potential  supply shock. And that's just because demand has   temporarily dried up due to the macro concerns I  mentioned earlier. But when the panic subsides,   as it always does, that supply deficit is going to  have an impact. And even with the recent outflows,   Bitcoin ETFs still hold roughly $85 billion  in assets. That is sticky long-term capital   sitting in retirement accounts and pension  funds. They aren't panic selling because of   a 150day tariff. The outflows we are seeing right  now are largely hedge funds unwinding their cash   and carry basis trades, not long-term believers  abandoning the asset. What's the verdict? Well,   uh, the Trump premium that pumped the markets in  late 2024 has completely evaporated. Bitcoin is   currently failing its test as a short-term safe  haven. When the VIX spikes and the NASDAQ bleeds,   Bitcoin is going to bleed with it. And this  is the price of institutional adoption. But if   these global tariffs spark a new wave of sticky  inflation, the fundamental thesis for holding a   decentralized cap supply asset has never been  stronger. The weak hands are being shaken out   by Wall Street algorithms and forced liquidations,  leaving the true believers to scoop up the pieces   at a massive discount. The question isn't whether  Bitcoin recovers. History says it does every   single time, even from a 40 to 50% draw down. The  question is, are you the one still holding when it   does? But what do you folks think? Is Bitcoin  safe haven narrative officially dead, or is   this just the start of a temporary macroeconomic  shakeout? Let me know in the comments down below.   And if you want to understand how the Fed might  actually react to these tariffs and what it means   for interest rates, check out our macro deep  dive right over here. Okay, that's all from   me for now. Thank you guys very much for watching  and I'll see you again soon. Nick, over and out.",
    "sort_data": "2026-02-25",
    "summary_hu": "A Bitcoin mint digitális arany koncepciója jelentősen megkérdőjeleződött az utóbbi időszak piaci eseményei miatt. A Bitcoin ára drámaian csökkent, míg a hagyományos menedékeszközök, mint az arany, erős növekedést mutattak. Az amerikai elnök által bejelentett 15%-os globális vám árfolyamessze áringadozásokat váltott ki, amely a kriptovaluták eladásához vezetett. Az intézményi befektetők és bányászok is jelentős likvidálásokat hajtottak végre, ami tovább növelte a FOMO-t, míg a Bitcoin ETF-ek tömeges kivonásokkal küzdenek. A piaci hangulat a félelem szintjén van, és a Bitcoin korrelációja a hagyományos piacokkal nőtt. Történelmileg a Bitcoin mindig helyreállt a mélypontokról, de most a fundamentális tényezők aggasztó kockázatokat vetnek fel az elkövetkező időszakra.",
    "summary_en": "The concept of Bitcoin as digital gold is significantly challenged by recent market events. Bitcoin's price has drastically plummeted while traditional safe havens like gold have shown strong gains. The announcement of a 15% global tariff by the U.S. president triggered volatility, leading to massive sell-offs in cryptocurrencies. Institutional investors and miners executed significant liquidations, further amplifying FOMO, while Bitcoin ETFs face large outflows. Market sentiment rests at fear levels, with Bitcoin's correlation to traditional markets rising. Historically, Bitcoin has always recovered from lows, but current fundamental factors present worrying risks for the near future.",
    "crypto_sentiment": "Bearish",
    "sentiment_score": 30,
    "key_points_hu": [
        "A Bitcoin 62%-kal csökkent az aranyhoz viszonyítva az utóbbi egy év alatt.",
        "A hagyományos piacokkal való korrelációja megerősödött.",
        "A likvidálások szintje drámaian emelkedett."
    ],
    "key_points_en": [
        "Bitcoin has decreased by 62% relative to gold over the past year.",
        "Its correlation with traditional markets has strengthened.",
        "The level of liquidations has dramatically increased."
    ],
    "main_topics": [
        "Bitcoin's diminishing status as a safe haven",
        "Impact of geopolitical events on cryptocurrency markets"
    ]
}