[
    {
        "video_id": "gVQLX9ZnTPQ",
        "title": "Stablecoins Are Exploding… Which Players to Watch",
        "published_at": "2026-01-15T10:47:44Z",
        "sort_date": "2026-01-15",
        "url": "https://www.youtube.com/watch?v=gVQLX9ZnTPQ",
        "transcript": "Stable coins have set new supply records this year after more than doubling since the start of 2024. Last year, they also processed more money than Visa and Mastercard combined. While their largest issuer, Tether, bought more US treasuries than entire countries like Canada and Germany. And all of a sudden, it feels like everyone wants to launch one. So, why are these tokens, whose prices don't go up, suddenly such a big deal? First, we need to catch up on the stable coin scene because a lot has happened in the past few years. Back in 2022, things looked grim. After the Terra collapse and the wider crypto crash, stable coins weren't growing anymore. Their total supply fell from around 190 billion to 120 billion by the end of 2023. But the next two years flipped the story. By late 2024, supply had climbed nearly 60% to past 200 billion. Six months later, in mid 2025, it pushed past 250 billion. Now, for context, that means stable coins now make up about 1% of the US money supply. In 2024, stable coins process more than 27 trillion in transfers, more than Visa and Mastercard combined. By the end of the year, their quarterly volumes were already running more than double Visas and triple Mastercards. Now, of course, not all of that is real usage in the everyday sense. Analysts estimate about 70% of transfers are still bots and arbitrage trades across exchanges, but that isn't necessarily a bad thing as it shows how deeply stable coins are woven into the plumbing of crypto. They've become the default settlement layer for trading and DeFi. Now growing beyond DeFi, stable coins are now used for remittances, merchant payments, and even by people in high inflation economies as a way to hold on to the dollar. And that surge in activity meant regulators couldn't just shrug stable coins off anymore. So in 2024 and 2025, we finally saw the first real frameworks take shape, especially in the US and Europe. In July, Congress passed the Genius Act, the first federal law to explicitly recognize dollarbacked stable coins. >> The bill is passed. >> It gave insured banks the green light to issue them and framed the whole effort as a way to strengthen the dollar abroad. And Europe moved as well with Micah coming into force in 2024. It basically says that if you issue a stable coin in the EU, it has to be fully backed. Reserves have to be disclosed and regulators get to keep a close eye on it. Across Asia, Japan approved bankisssued stable coins and Hong Kong set up licenses to pitch itself as a hub. Even China, which banned crypto outright back in 2021, couldn't ignore the shift. Officials there have started debating dollar stable coins openly, warning they boost demand for US treasuries and establish American dominance. And at the same time, China is reportedly exploring its own when back stable coin. And while regulators were moving, companies were not sitting still given the sheer number of projects now coming online. And it's not just crypto startups launching tokens anymore. It's payment giants, retailers, even banks, all racing to issue their own digital dollars. In the past 2 years, we've seen PayPal launch its own stable coin, PYUSD, and Stripe spend 1.1 billion to acquire a stable coin firm. Western Union began experimenting with stable coins for remittances. And even retailers like Walmart and Amazon started exploring their own tokens. And then there is Visa and Mastercard. Instead of pushing back against a technology that could disrupt their business, they joined the race. Visa signed onto a consortium with Paxos and Robin Hood to back a regulated stable coin. And Mastercard rolled out end-to-end support with partners like Paxos, PayPal, and Circle. For them, it was about staying relevant. If stable coins are going to carry more of the world's transactions, it makes more sense to build the infrastructure themselves than risk being displaced by it. We've also seen an entire wave of new blockchains designed specifically for stable coins. From Circle with ARC, Tether with stable to stripes Tempo. For now, Ethereum and Tron still carry about 80% of all stable coin value and we'll see how much these new chains eat away at their share. It begs the question though, why so many? Why do we need a dozen different dollar tokens or entire blockchains just for stable coins? Well, each new entrant is chasing some mix of control, regulatory fit, or distribution advantage. But at its core, what drives this wave is profit. Stable coins earn money on reserves and fees in a way few other crypto products can. And that incentive is probably why everyone wants their version of a digital dollar. Now, for governments like the US, it's a little bit trickier. Stable coins are a tool because they project the dollar further into the global system, but they're also a threat because they put enormous financial power in the hands of private companies. So, whose hands are we actually talking about? Well, Tether is first and has become almost absurdly profitable. In 2024, it booked around 13 billion in net income, mainly from the yield on its massive reserves of US treasuries. Tether still operates out of lightly regulated jurisdictions, still only provides quarterly addistations rather than full audits, and has faced its share of fines and skepticism. But none of that has stopped it from capturing more than 60% of the entire market. Then the closest competitor is Circle, the company behind USDC, which has taken almost the opposite route. Where Tether leans into offshore freedom, Circle built its reputation around compliance. Tether's growth is nothing to scoff at, but USDC's strategy may be helping it play catch up. Considering that USDC managed to double its market cap in the past year or so, circle also branched out beyond the dollar with your C, its euro stable coin, which has also been flying this year. And in mid 2025, it became the first stable coin issuer to go public, raising over a billion dollars in its NYSE debut and landing a market cap north of 15 billion. Now, beyond these two giants, which together still control more than 80% of the market, there are others vying for market share. Ethena's USDE, a yieldbearing stable coin, has climbed into third place, showing there is appetite for a token that does more than simply hold its peg. Other players like Maker Dow have also been seeing some growth in market share since the rebranding of their stable coin from D to USDS and even examples like Ripple which entered the race with RLUSD at the end of 2024 and even went so far as to explore a multibillion dollar bid to acquire Circle. And that brings us to the bigger picture. Why any of this matters and what risks come with it. Stable coins may face concerns on centralization from within the crypto community, but we can't deny that they're currently being used for the very thing cryptos struggle to do due to volatility being money you can actually spend. And their popularity has impacts. Whoever controls stable coins holds influence over the movement of dollars worldwide. Issuers sit on reserves that rival midsize nations and their tokens are becoming the entry point into dollar liquidity for entire regions. And that is real financial power no longer just in the hands of banks or governments. But at the same time, the concerns are valid. Stable coins may run on blockchains, but they're not decentralized. Issuers hold the keys. They can freeze or blacklist funds, as Tether and Circle have already done at the request of regulators, and that makes them less like independent digital money, and more like banks plugged into blockchains. As governments step in, the ability to pressure issuers could become a built-in feature of the system. >> It's called Mikar. It's currently under review and consultation for possible improvements. >> Regardless, their convenience and efficiency continues to drive their use, and people are finding different ways to cash in on the trend, such as seeing ETH or Tron as proxy bets since these chains host a lot of stable coin activity. So, stable coins began as a simple convenience for traders, but they've grown into one of crypto's biggest money-making machines, pulling in regulators, banks, and tech, and e-commerce giants. They make payments faster and savings easier, but they also concentrate power in the hands of a few private issuers. So, as this boom accelerates with no signs of slowing, let us know what you think. Is this good or bad for the industry? Three."
    }
]