[
    {
        "video_id": "2A960fKivjM",
        "title": "Palantir Stock Set for a Massive Move as Global Tensions Esclate!",
        "published_at": "2026-01-15T04:13:21Z",
        "sort_date": "2026-01-15",
        "url": "https://www.youtube.com/watch?v=2A960fKivjM",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope you guys are all having at least a decent day as hey, this is kind of our first day in red as we see a decent amount of selling pressure. The S&P 500 index falls underneath 6,900 for a little bit, but recovers and reclaims that kind of you could call it support level, I would say, or psychological level uh towards the end of the market as we kind of see some selling pressure with the MAG 7 bringing down the index. And we also see bank earnings that just aren't coming in as strong as the analysts are expecting. So, we're seeing some selling pressure there on top of pressure already on a lot of the banks and credit card companies from the whole uh 10% interest rate cap. We're going to be talking about that. We also have uncertainty with geopolitical tensions. Uh, of course, right now with what's happening with Iran, there's a lot of uncertainty there. So, you know, fundamentals still remain decently strong. Uh and uh we have PPI data that didn't come out as kind of what was estimated today too. So uh we're going to be talking about how does Palanteer kind of incorporate in this especially with some of these geopolitical tensions. Palunteer typically um can experience a little bit of resiliency or a little bit of a bid and all the other names that we're talking about and we'll end it with crypto. So if you're new or returning viewer, hit that like button, subscribe for daily videos. Let's pop it up on the screen here. First things first, let's talk about Palunteer since we didn't really cover it a ton yesterday. basically just consolidating here, hanging out in this zone like we've talked about. You know, when Palanteer hangs out in this kind of volume zone between 170 and 183, it just continues to build out its base. And that's exactly what's happening. Uh I think we're going to need to see a move here relatively soon. Either that's to the upside or to the downside. I don't know, but it looks like it's wanting to get ready to make a move. Uh we do have earnings that's coming out here in like the beginning of February. So that's going to bring some more volatility especially a little bit before as people try to play on earnings. Uh but Palanteer showing to be pretty resilient here only down about in total even with the overnight session down about a percent today. So not too bad. One of the big things that could bring a little bit of resiliency cuz Palanteer typically does well in terms of times of geopolitical uncertainty and tension is right now with Iran we have a lot of speculation. you know, some things could happen or nothing can happen. But right now, basically, we're seeing that Iran has actually closed its airspace and raise its defense readiness, cautioning the US military against entering without explicit permission. You're also seeing here, I see reports about aircraft from China towards Iran while the airspace is closed. So with that you're seeing uncertainty that is arising about any type of possible move from uh our administration and that's where you know defense stocks and especially like Palanteer typically do catch a bid uh in times of tensions. I don't know if that's morally the correct thing but just not getting political or anything like that. That's just what happens with a stock. We're kind of seeing here how do the stocks typically react. Palanteer could possibly be making a move here or if nothing happens then it's just going to consolidate probably in this zone some more. Um Amma did a really good summary about what's happening in the market. I really like this. Uh you know I agree this is the first kind of real red day that we saw and this could just be the market cooling off. We're seeing kind of some breath uh in the market where you're seeing a little bit of a rotation out of the M7s and entering into some of the other names. Have we se as we've seen resiliency in some of the other sectors which isn't necessarily a bad thing. It's kind of good for the MAG7 to cool off sometimes. But what you have here for the S&P 500 index, this is where we saw that drop, losing that 6900 area for uh a little bit here and then it was reclaimed uh basically towards the end of the day. Right below its 15, it's 200. And currently, as we look at the SPY, futures are basically opening up here relatively flat. Uh down about 12% which is really nothing. So basically 75 not seeing a ton of moves. But in summary here, kind of what seems like we could be a general breather after two hot weeks. That definitely could be a good argument. Uh because we've had the markets that have been very strong year to date. So a breather here, a little bit of a profit taking um not necessarily a bad thing. You have the the dang supreme court tariff decision. They have no opinion today. I didn't even make and I exited all type of short-term trades on Friday, last Friday, awaiting this and I didn't do it this time and thank God I didn't because they still didn't make a decision. So, this is still sitting in limbo. Hopefully, maybe they make a decision relatively soon. But like I said, you also have here Trump kind of getting more serious about Iran. PPI worse than expected. You got the credit card uncertainty that's becoming more real. Um, so no crazy big headlines, just kind of all these things that are brewing in the background and that's what we're seeing right now. And it's kind of why stock futures are opening up kind of relatively flat. And like I said, from Mag 7, you're seeing a little bit of rotation out of there. You got Microsoft, Meta, Amazon, all down about 2%, Broadcom, Oracle down about four, Nvidia down, there's some, of course, is everybody talking about China and the H200 chips. There's always stuff going around there. Uncertainty. Uh, some of the big lagards though here, Wells Fargo lost 4.6% 6% on Wednesday, weighing on the broader market after the company posted weaker than expected revenue for the fourth quarter. You also have here City Group and Bank of America both falling more than 3%. Uh this could all be due to a little bit of some selling pressure. Of course, you have the cap now on the credit cards and things like that. Uh so just uncertainty there, the big banks not doing us quite as well even though the economy still remains relatively stable. So in the short term to me this is more personally noise. Uh any more type of uncertainty or dips that we get especially with any geopolitical tensions I think I'll be just buying on the dips to be honest uh for the long-term portfolio. Maybe not making as many crazy moves with the short-term kind of swing trading. However, you know where we sit right now. Like I said fundamentally I'm still very bullish uh in terms of what we're seeing with some of the individual names that we've covered. I mean, let's talk about Cipher right here, cuz Cipher is being relatively resilient right here at 1784. Is Cipher is doing pretty well. Only came down a little bit on the day. Nothing crazy. Uh, has had some testing now at about this 19, you know, area. I think once Cipher gets a close above this, it's 1860 area and is able to push through that, that's where you can see that potential breakout for Cipher. It's just going to depend, does that move actually get validated? Do we see that or will it get taken back? and kind of in more of the higher beta moving names today. We kind of had that same thing. I ren here was pretty resilient, you know, at 5175. Uh you see um also on top of that talk about the agentic names. Zetta here is now at 2212. And I see on X right now a ton of people are loading up right here at 2212. People are predicting, you know, is this going to come back to the 20s? Um or is this going to get a nice bounce here at 22? basically as we see this push a lot of resistance at the 24. This has been tested a few times now and it just was hanging out there at the 24 and was not able to advance higher than that. Now Zeta has been on a good run. However, I'm still pretty bullish for the whole year going forward. So, I really like Zetta at these zones. Uh once I think you see Zetta that's able to push past, you know, you see a little bit of this cup and handle right here. As long as you see Zetta that's able to break out eventually here out of this 24 and not get invalidated, that's where you could see a possible higher move. And you know, a lot of these high beta names do depend on the macroeconomic situation. You also have Path right here that's down here at 1535. And PATH has a decent amount of support that we've seen in the short term here kind of over the last 3 months right at that 15. So, we'll see what happens right here at that 15. How that support will be tested if we do get a bounce there and if things can kind of turn around, but nonetheless, uh kind of seeing that same selling pressure across the board. Nothing too crazy. Let's toggle on over here and talking about Zeta right here. I really like this chart here. uh Ronnie, he's a big guy, a content creator that's really bullish on Zeta and I like watching some of his content on uh Zetta specifically, but talking about this basically saying prepare for the next move and I kind of agree with that. Uh currently with crypto, you have Bitcoin that's finally making a move. Wow. Wow. Wow. Uh you see Bitcoin right here. It's cooling off a little bit, but at 96,000 basically this pushed up to about 97,000. We'll see if it kind of regains some of this regain some of the support here at 95 if we continue to see some selling pressure. But finally, a little bit of a breakout with Bitcoin. On top of that, you also see Ethereum that's also catching a little bit of a bid. And we talked about this in yesterday's video that BMR could have a nice bid. And that's kind of exactly what we had with BMR. BM BMR on the daily here was able to push before we saw that sell off. BMR was able to open up here, get to about 33 at least, and then we saw it kind of get faded again back here to the 30s, down about 2.5% even though Ethereum is up. Let's see over here last 24 hours down about 1%. Uh, but over the last week here, up at 4.45%. So, BMR gets faded a little bit after we do get a nice bid in momentum and strong move at the open. So, we'll see what happens in terms of this individual stock. There is support here at the 30. We'll see if we get a reversal there, how that'll be tested and if there will be a bounce. Uh, nonetheless, also looking at that digital asset treasury. So, we talked about ASST. A lot of more uncertainty with this one is that because they announced their merger, which is awesome to accumulate more Bitcoin, trying to get more of a leverage play on the actual crypto itself, but they also announced a reverse stock split, which typically retail does not like. We had mentioned about this yesterday. So, personally, I'm starting to lose a little bit of interest in here. I'm just going to be more keeping it on the watch list and seeing what will happen uh depending on Bitcoin's price cuz Bitcoin is now at uh you know 96,000 but we still have Strive that's hanging out here just at about a dollar uh actually down on the day. So, we'll see what happens. Peace out. Take care. Let me know what you think down in the comments and have a great night."
    }
]