[
    {
        "video_id": "3GN6b-pWTW0",
        "title": "Palantir Stocks Falls Before Critical Market Announcement!",
        "published_at": "2026-01-09T04:12:00Z",
        "sort_date": "2026-01-09",
        "url": "https://www.youtube.com/watch?v=3GN6b-pWTW0",
        "transcript": "Uh ladies and gentlemen, welcome back to Data Dispatch. I hope everybody is having a decent day as we could experience a ton of volatility tomorrow. We're going to be talking about how this made an impact on some of the individual stocks like Palanteer and some of the other speculative more AI names that we've been talking about on the channel because we have some big big pieces of information that will be released tomorrow. One of those is going to be the Supreme Court's ruling on Trump's tariffs that could bring a lot of volatility into the market. We're going to be talking about that on top of a really important jobs report that co could give us kind of a further indicator on how interest rates are going to turn and what possibilities that the Fed might bring in terms of their decision. So, we're going to be talking about everything you need to know. If you're a new or returning viewer, hit that like button, subscribe for daily videos, and follow me down on X below if you want to get more frequent updates before I have time to post a video. Now, if you pop it up on the screen here, Palanteer is currently at 176.97. uh it was at this top kind of resistance area of its consolidation zone around this 186. You see it here kind of open up basically around the 181 and close right underneath its 50-day at 176. Currently, it's really not making any big moves in the overnight session. Basically just consolidating up about 11 cents. Uh Palanteer right here. Now, this could have taken a little bit of a beating today. We did see some rotation out of some some of the big tech names and there's a little bit of uncertainty that I think align around with Palanteer. We kind of have a mix of bullish and bearish type of headlines. However, we also could just have some rotation and some de-risking due to the whole more macroeconomic environment with the possibility of the Supreme Court ruling. So, all those things could be variables within Palanteer's trading price. Nonetheless, I don't not really too concerned about its current price right now at 176 because it's between this consolidation zone that we talk about all the time on the channel between 170 and 182. So, as long as it holds there during a time of volatility, you know, Palanteer is just continuing to build its base, and I do like that, especially for any type of possibility uh possible moves up to 200 in 2026. One of the big things that we did have in terms of a bullish thing for Palanteer was we talked about this yesterday because you have the new buy target uh the new price target from Churist at like 223 or whatever and you also have here the announcement from the administration yesterday of increasing the defense budget to 1.5 trillion from 1 trillion. And we know that uh Palanteer obviously has very strong governmental connections and does a really good job in terms of credibility and working to uh basically help benefit the government in any type of their missions. Now, one of the things that was against the defense sector and defense stocks that took a little bit of a beating was the whole kind of uh they need to build have more production plans within America and that the executives won't be able to kind of like do this whole dividend issue or buybacks and stuff like that. So, that brought a little bit of uncertainty and that could also be possibility on why we saw Palunteer seeing a little bit of a drop. But personally, I think it's more related to this right here. These are polygons or poly markets current estimates of a 78% probability that the Supreme Court will rule President Trump's tariffs are illegal on Friday. The Supreme Court could force Trump to return over 133 billion in tariff revenue. And this main dispute here really revolves around, you know, does the president actually have the right to impose these universal tariffs or if this is something that needs to be decided by Congress. Um, this could, you know, bring a lot of volatility into the market. I am not making a single trade until to see how the market reacts to this and basically how this kind of gets priced in because I don't think the market's really pricing it in. The market doesn't really know where to go right now. I mean looking at the S&P 500 it is currently sitting at 6921 was at.1% on the day. So basically consolidated on the day uh what you saw on the daily right here I mean we saw a little bit of an intraday low at about that 69 uh 12 and finished right here with a little bit of a recovery at 6920. So, uh, nonetheless, I do like the S&P as long as in terms of a bullish perspective, more long-term before we see further breakdowns. You know, it is at this 6800 in terms of support. Uh, I do like that that area for that 6,800 where we had a ton of consolidation right here kind of all through December, late November. A lot of consolidation at that 6,800. We of course had some dips that were quickly bought up. Uh, so it needs a direction. it needs a moved somewhere because I think traders are getting sick of this trading sideways. Uh, one of the big things that I do see right here, a lot of people are talking about this is kind of this head and shoulders build out on the S&P. You can see it right here as bright as day. Uh, you know, of course, this could be invalidated. You know, these setups are as good as our follow-throughs. Uh, but in terms of if that plays out, that is a possibility, especially here if we do get volatility from here and we will have the jobs report that's coming out. So, nonetheless, the short-term perspective, I'm predicting volatility and it could be to the downside. That's why long-term portfolio, don't care at all, obviously, but short-term, not making any big trades. Uh, what you do here, you know, do see here, I'd like this long-term data to show you is the S&P 500 is actually up during the first 5 days of the year. When it has been up for the first 5 days of the year, historical and seasonality, what we've seen has seen the S&P 500 gain 14.2% 2% during that full year with 84% of those years finishing positive. So the data is with the bulls. It is supporting the bulls with the recent price action that we've had. So even though it's been kind of choppy, we had that big jump in the first few trading days, but nonetheless, it's up over the last 5 days. Historically, we're leading towards the bullish direction. You have the whole AI trade on top of that. Unless we see any huge changes, people talking about possible liberation 2.0, liberation day 2.0, you know, a huge dip or anything like that. I will personally probably just be taking advantage of that opportunity uh in terms of long-term bullish perspective because I still think we're in the middle of a bull market. Let's talk about also the jobs data that could give us some indication for how the labor market's doing, which we've seen signs of weakening. However, we're going to have that on top here. It's expected to show modest improvement. non-farm payrolls, they're expected by to grow about 73 or 73,000 while the unemployment rate inching down to 4.5%. Those are the expectations. Separately in the headlines today, we have Trump here that actually issued a directive to buy 200 billion in mortgage bonds, which claim will drive rates and monthly payments down. Uh that could be good because housing is very unaffordable, especially for kind of those firsttime uh home buying seekers. So, uh, in terms of that, that's where we're sitting with the political news and where the current market's sitting at. Futures in the SPY right now in the overnight session really isn't moving. I think they're going to wait for the ruling from the Supreme Court. I think it's happening at some time in the morning. I don't remember the exact time off the top of my head and also that jobs report of course. Um, so how did the high beta names trade today? You see, I read here that actually caught a decent bit of a bid. Uh it dropped down here to about 43, shot up to 47 where we saw a little bit of resistance there that we got just a few days ago after its move from 38 to 48. Uh but currently kind of settled right down here at 45 and basically stabilizing there in the overnight session. Same thing with Cipher. You see Cipher that kind of experiences that same push up here to about 16, settling it down here about 1645. You know, if we do see any type of selling pressure, I'm still bullish on these names longterm. So, I'll be looking at some of these buy areas around the 14 right here. Um, I red could come down here. This is a very volatile name. It can swing quickly. So, traders might love this. Uh, it could, you know, come back back down here to test the 40s where we have a lot of support and touch points at the 40s. So, I'll be looking at those areas. Um other names that are kind of big themes for 2026 with Agentic AI, you got Path obviously is a really really big name right now and you have uh Zeta which is a really big name right now at 2352. Zeta's been doing a good job after its recent run uh holding these levels. So that's pretty impressive and shows you there's a lot of resiliency within this individual name. So, uh, after we get the ruling tomorrow, depending on which way the market goes, um, I'm going to be looking at these names and possibly taking more short-term trades on them, uh, once we have more of confidence on kind of where the direction of the market is pacing to. Uh, looking at crypto, not really seeing any big moves there. You see Bitcoin that's basically still hanging at 81. Now, we saw this drop down here to 89, slightly underneath 90,000 today and kind of recovering, holding that 90 91,000 support. And Ethereum is also doing the exact same thing. Hanging right here at 31. I think Bitcoin and Ethereum also need to find a way to go and they need to go somewhere. Is that up or down? B&men R. I mean that hangs right here at $31 too. So with these kind of digital asset treasuries that are highly highly, you know, correlated to the price of the cryptocurrencies right here at 3119, not necessarily horrible. BMR is still continuing to accumulate out of Ethereum. Uh stake Ethereum. we know that they're trying to get to their whole uh 5% of the circulating supply. And then uh some of the digital asset treasuries that I've liked for Bitcoin recently, ASST, Strive, they're kind of hanging out around that $1 mark. Um also in a very interesting area. So this market, I think, needs to find a way and a direction to move. And I think the volatility that's going to be coming tomorrow could be an indicator for that. But personally, uh, in the short term, I'm not going to take a bet there because that's like taking a bet right before an earnings call is that you don't know. And that's more of a casino like play rather than, uh, there's a lot of things that are out of my control and how the market's going to price that in. So, we'll see what happens. What do you think down in the comments? Nonetheless though, like I said, I still like Paneler here. So, we'll see how some of these individual trades move and we'll make a video on it tomorrow. Peace out. Be careful out there, everybody, especially with the big reports tomorrow. And we'll see what the Supreme Court does. uh because we could have some interesting changes coming for the market. Take care."
    }
]