[
    {
        "video_id": "MvKQDMV8azs",
        "title": "EMERGENCY: TRUMP PREPARES FOR BIG WAR (Bitcoin, Commodities, Stocks)",
        "published_at": "2026-01-09T17:48:19Z",
        "sort_date": "2026-01-09",
        "url": "https://www.youtube.com/watch?v=MvKQDMV8azs",
        "transcript": "But um oh yes oh yes guys welcome to is not and we actually have a bit of an emergency because the US is increasing their defense budget by 50% from 1 trillion to 1.5 trillion. Obviously it's a big big change. A lot of money is going to flow into hard assets because they will print a lot in order to accommodate it. But also, we have to discuss the defense industry and unfortunately a potential for a broader conflict. Listen to this. All the signs suggest that we're going to have a big war soon. The president announced that he is hiking the Pentagon budget from 1 trillion to 1.5 trillion. Just announced that. That's the kind of budget that a country that anticipates a global or regional war has for its military. Obviously, we're moving in that direction toward a world war. Sorry. So, how do you position yourself for that? Well, you look at a map and you ask, \"What areas do I want to control? Where are the trade routes? Who's got the resources?\" And if you were to do that, you would arrive at the most obvious conclusion of all, which is the United States has to have a relationship with Russia in order to survive anything like that. Now guys, listen, whether Russia is the the key here is in my point is in my view secondary. The key thing here is that we have a big big big problem when it comes to inflation and when it comes to government debt and this will not help it. Of course, this will not help it. At the same time, at the same time, you do have the expansion of the US towards Venezuela kind of colonizing Venezuela. I mean, let's see how this will end. But Trump said that Venezuela will only be purchasing American products. They're going to give all the oil to the US oil deal. only American products, all the oil to the US. Also, also Trump said that listen, we're not leaving Venezuela, okay? It's going to take years and years and years and years before they're out of Venezuela. And the question is, uh, will they ever be out? I mean, is it five years? Is it is it 15 years? 20 years, is how many years? So you you have an interesting balance here where yes it is more resources at the same time bigger budget but I think it inevitably will lead to big big big printing and big big big expansion of the debt and that's why we have to look at bitcoin we have to look at precious metals as soon guys guys as bitcoin enters bull trend whether it is now whether it is when we are at the 200 moving average is going to be a monumental insane insane signal okay keep this in mind as soon as bitcoin enters bull trend it's a monumental big signal now I mean we're struggling a lot. Bitcoin is struggling a lot. It it it it is risking still to go down here towards this uh 200 week moving average. These things with the debt with budget with defense spending and all of that. This will still take months to propagate throughout the financial system. And if you look at the performance of Bitcoin in midterm years, it's not too good. And right now we are in a midterm year. And so until you have inflation really hitting until you have the new Fed chair which is going to be in May, Bitcoin could very well go to a 200 week moving average and then bounce from there. So the thing we look at is the trend. Then how we arrive at the bull trend that's yet to be seen. We just relax. We sit on our hands. We'll look at what's happening. But something very interesting is that commodities, they're not waiting for any kind of any kind of propagation of capital. They're pumping as is. I mean their trend is bullish like there is no tomorrow. On the weekly you have silver as you know 7 months ago it flipped bullish on the weekly. Then you have platinum 7 months ago also. Then you have lithium four months ago and as you can see it's in hundreds of percent that we have the gains. If you look at the daily it is interesting here for the short-term trend. Lithium is up 60% since 3 weeks ago. Uh, silver is up 51% since a month ago. And orange juice, I mean, surprisingly orange juice, we added orange juice to our money scanner. Okay, orange juice because I mean clearly there is trading happening there. Even freaking orange juice is up 38%. While all is bleeding, while crypto is bleeding, all of that orange juice is pumping and of course all other commodities that are used in the industry and also precious metals are having a very very fantastic time. And as you know to get access to Bulmania to money scanner use the link below bullming.com and watch the free video right here which will explain you the mechanical rules and then tell you how to join Bulmania to get the tools. We also have free charts if you look here on booming.com. We launched free charts for for everyone who just wants something free for all the players will also get something. We we give something for you who want to join us for real. But if you don't okay we have some we have some free charts as well. uh things to look at here is for example the performance of midterm years which we are and as you know now we're in a midterm year. Bitcoin uh is going down in midterm years. I mean it it is where it is. It's always been like that. Uh will it be different? Maybe maybe not. You don't want to bet your money against this. Okay. Uh you don't want to bet your money against this. If we pump, we're going to see it in the trend. So don't go against the the trend both when it comes to the midterm year and also when it comes to the the price. Okay? So, we wait for the price to be bullish. Before we're bullish, we're not predicting that this is going to break like many people try to predict. And as you can see, the current pump we've had in 2026, which was a few% at the beginning of the year, it's not that abnormal for midterm years. So, the green chart here is the is the uh 2026 uh price performance of Bitcoin. And then you have the yellow and the orange chart. Those are the 2018 and 2014 midterm years. So, they actually pumped even more at the beginning of the year. Uh and then they all I mean they all end up in the same place and that's uh between 50 and 70% down. Now will Bitcoin have the same fall? Who the hell knows? But it is midterm year so we're treating it uh we're not taking any chances. I mean Bitcoin loses. Imagine what all are going to do. If Bitcoin does this, imagine what all are going to do. So wait for bull trend. That's number one. Also another chart we added is Bitcoin social risk. Uh this is basically Ben Cowan. He also has this social risk kind of thing. But um I think ours uh free version it is a compliment which is very good and maybe even better in some in some ways because we're not basing it on social media which easily can be tricked uh where you know he's is looking at um you know views subscribers followers to exchanges sell one sell two and so forth and his chart is great so I see it more more as a compliment because we don't look at that uh because social media is very easy to fake instead we look at Google trends uh which is already normalized and here you see that when people are searching for Bitcoin a lot is normally the top here. People were searching and um uh and looking to Bitcoin a lot. It was the top and this time around we haven't really had that except for the Sana top. Okay, Sana top happened here in 2024. Trumpcoin launched here. So we did see a bit of uh social risk increasing but overall uh not really in the same extent as before but we also had institutions but other things but so that's another chart you can check out. Then the ISM chart people love the ISM. This is the manufacturing PMI. How much the manufacturing companies are saying they will spend on new supplies in the coming months and quarters. So, it's a way to see how the economy will grow because if you survey all of the manufacturers and they say, \"Hey, we're going to be buying a lot of supply, you can imagine the economy is likely going to grow.\" And so, the idea here is that when uh the this ISM goes up, Bitcoin goes up and all the tops are when ISM is above 50. And now we didn't have ISM above 50. So some people love trading that uh personally as you know I mean I'm not looking too much at this. I I'm looking at the price trend but I'm just telling you that there are charts okay there are charts charts are here. We're doing all kinds of charts fully fully for free because we want to give back. It's time for you guys to get because a lot of people charge for the stuff you know for like is you have to charge for it. I mean number one following ASM would be very bad because you missed the October 8th top which we did not miss and then you also pay just go check look at for free if you want. So guys, uh, number one, welcome everyone. We have a live stream here. Fantastic. We have and it is a bit of breaking news. The fact that the US is increasing the spending so much, it is a bit of breaking news. When it comes to Bitcoin, I think towards the end of the year is going to be great. When it comes to commodities, right now already bum bum bum, they're pumping like there's no tomorrow. When it is uh bull trend, when when things are bullish, you don't want to fight against it. You just see that it's bullish and that's it. So the lesson overall for 2025 is and beginning of 2026 is that we need to be modern investors that have access to everything. Whether it's commodities, whether it's freaking orang juice, whether it's lithium, whether it's gold, whether it is shitcoin. Forkcoin pumped a lot in 2024 and early 2025. Forcoin pumped a lot. That was the way to make money. Now it is lithium and orange juice during the last three weeks. And if you look at the daily trend, it is lithium, silver, and also orange juice. Okay? So all of the assets they're just they're just tickers in Trading View and we have different kind of emotional attachment. But if you want bull mania in your portfolio that your portfolio goes up, we have to be a 360 kind of investor with everything with that's why we're building bullmania in this way. We don't just have crypto because only cry, you know, just having crypto look here on especially when you look at the trend, man. On the uh on the weekly, you're going to see that most coins are down in a bare on a long in a long-term bare trend. 87% in a long-term bare trend. On the daily, we have most of them having a bit of a relief rally. But on the week, I mean, it's if you're only in crypto, I mean, it's it's not good. It's not good. You have to be in stocks, you have to be in commodities, you have to be in things that are bullish, that are bullish. Now, uh, to give you some, um, uh, things relevant to what we're seeing now with this Trump stuff, it is, of course, defense stocks. And I know many people they they're saying that they don't want to touch defense stocks for moral or ethical reasons. And I fully get that. I fully get that. For everyone else who is going to hell, you can you can check out the following. Uh, RTX defense stock already. I mean, it's up a lot. Someone bought it seven months ago. Did they did they know about Trump plans or not? Uh anyway, it was bullish 7 months ago on um bullmania and uh you know that's why we look at the price on bull and bare flip because I mean someone was buying it a lot. Did they know about all of these escalations? And by the way, Venezuela is not the only one. You also have this uh Greenland situation. What's going to happen there on Poly Market is now 15% that uh there's going to be an acquisition of Greenland. What the hell it means? Uh let's see. Uh and of course Iran and everything it's I mean someone was probably buying up this defense stock uh seven months ago. I mean did they know did they not know? That's why we look at the price guys. We look at the price because the price is telling you a lot even before uh before the news. Then uh Loit of course LMT you can check it here still hasn't pumped too much on the weekly. So yeah I mean just now this one is just now turning uh turning bullish just now. So yeah, keep an eye on that. Uh, next Boeing, uh, as you all know, let's see, Boeing, Boing, not too much pump yet, only 8% since the the bull flip 3 weeks ago on the weekly. Next, uh, General Dynamics GD. Uh, there you go. 30% since a month since 10 months ago. Again, why is it up so much? Did someone know something? Who knows? Who knows? Uh, next you have uh North Rob. Let's see. NOC NOC NOOCC. Maybe I have to type it. Let's see if we have Yeah, here it is. Not not pumping too much yet. And there are other ones. I mean, you can also ask AI for for other defense stocks. We have uh we have uh all most of them if not all of them in our Bulman. So, if you're part part of Bulmania, you can easily check all of them. So, let's see how this will play out. But I find it interesting also and that's that in 2022 you had the midterm year you had a post top year in Bitcoin and you know what happened in the early 2022 you had Russia invade Ukraine. So I mean for me I just my there's you know like war PTSD kind of I have war PTSD uh from last cycle in in many in many ways. I mean in uh several different ways. Uh there there are some similarities which are like impossible to ignore. A double top is number one. Uh here uh people are hoping that uh we will have a repetition of what happened here. Okay, I mean it was guys I will soon show it was exactly the same. But you see there's a bit of a difference here. This bottom right here was downward sloping. When the bottom is downward sloping the chances are higher that it's going to bounce. This one is upward sloping and a noob a newbie may think that it's good. It's like you know uptrend. No, no, no, no. When it comes to this uh relief stuff, a relief rally, you don't you don't want uh this this is no banana. This is no banner. This is buyers trying to get it up and they're getting destroyed here. It is sellers that get uh tired. So, uh if you compare like just look at this uh stuff and then also of course with the escalation, the Russian ship that got captured, Venezuela, Iran, I mean there are all kinds of stuff, but it's the same here. You see double top, then you had this right here. People were hoping please, please, please, please, please. I hope it is like this. I hope it is a repetition of what we saw here. And we're still above. That's another thing. We're still above this previous low here. And people are saying, \"Oh, but we're still above and it's kind of pointing up.\" Uh, yeah. So, uh, let's see, guys. Let's see. Uh, I mean, for us, the good thing is, uh, just like in the last bare market, we stopped doing videos. I mean, we called it pretty nicely. The same thing is now we we are derisked in the way we want. And uh even if we go to 200 week moving average it's uh I mean for us it's uh it doesn't matter like either this either that I have 30% deployed in bitcoin if it goes here fantastic this is going to be a generational buy opportunity like there's no tomorrow uh and uh if before that we retouch the 50 or whatever we we're going to adapt also if we touch the 50 by the way likely it's going to be rejected but the the signal to be bullish people are asking Ivan when is your when is your thesis invalidated like when will you change the allocation. The allocation will be changed when we start pumping in here above the 50 moving average. Basically, we have close above 50 week and then continuation above and especially once we flip here and the average price for us here is going to be kind of the same as the average price of uh selling from October 8th towards the 50 week and then below 50 week and then when we flip the bearish shares is going to be approximately the same. So basically we avoid all the downside we have all the upside is the best. So that's in terms of uh uh BTC and uh BTC being in midterm year and midterm year uh we have we had the issues on geopolitical front uh last midterm year uh chart is kind of the same there are many things that are the same but hope dies last. That's why every day someone is saying Ivan you're wrong for cycle is wrong everything is wrong. I'm I'm showing them, man. We topped out on the same day like all the No, it's wrong. It's wrong. Uh here also this basically topping out the same day when you go from low. No, wrong wrong. I'm telling them, hey man, look at wrong. Everything wrong. I haven't fully wrong. Hope dice last. I know. I know. I know. Guys, at the same time, as soon as Bitcoin is bullish, bull bull bull bull bull bull bull bull bull. Very important. We're very important. If Bitcoin goes towards 200E moving average, bull bull bull bull bull, you can even start adding even if the trend is still bearish. If it's towards the 200 week moving average, you can do a sin. You can you can even buy a bit in a bare trend because it's I mean 200 it's cheap, man. It's cheap. It's cheap. It's cheap as hell. Yes. Sometimes it can still drop like another 30% below. It depends on who you are. I mean who you are. If you're convinced about Bitcoin buying at the 200 week, you could do even in bare trend. If you want to like optimize your portfolio, optimize like really be serious, then wait for bull bull flip. So guys, that's that's quickly about what's happening here with the defense spending. It will lead to inflation. It will likely to defense stocks pump likely to Bitcoin pump um especially later this year. We're not front running that Bitcoin pump before the uh 50 moving average as being above 50 moving average and so on so forth. Uh now something else that's happening here is that you have Trump building a wartime command economy without declaring war. I mean you can read yourself here but basically he's saying you know buybacks or what you cannot do buybacks defense are currently issuing massive dividends to their shareholders. This is actually an argument against defense stocks. Uh let's see if he can actually get get this through. But um you know defense stocks will pump if they actually can make the shareholders rich. Okay. if they can get big dividends this you know 1.5 trillion u new budget if it's going to go to defense stocks and then they can make a lot of profit I mean that that's the reason for buying defense stock but if Trump actually can change the game so that he can restrict how much the shareholders get I mean not nationalize but a bit move towards nationalization slightly I mean you can read the text yourself you know executive pay packages in defense industry or exor I mean it's a bit of government controlling how much you're paid, how much dividend, this and that. So read yourself here, but just a caveat as a thing uh against the defense stock uh pump. Okay, so a small caveat, maybe it's going to be a big caveat if he actually gets uh you know powers to control how the defense companies operate. I mean you look at Russia like they're basically nationalized like it's you know it's government decides everything you know you were doing this kind of fridge before now you do tank that's in Russian you were doing this kind of appliance okay now you do you don't do that you do you do this we need it for so if it's going to be something like that they're controlling what you're doing how you're building your pay your dividend obviously then the equation is a bit different for the defense stock pump but let's see it's far away from that um now moving we have a bit of news when it comes to uh XRP. So apparently XRP ETF will not happen at least with the wisdom tree because the investors are not really that interested currently when it comes to ETFs. I mean likely XRP is going to get ETF in the next cycle. But if we look at the performance of the ETFs since the start of the year, we did have two massive days right here in early early. Well, I mean we still early Jan but the first days basically 400 in 700 in and I mean this was strong but as you know this follows the price when price is down these things also go down big time. So now it's minus 2 250 minus uh yesterday was minus 500. So basically yeah almost all of this is uh is now out. So let's see guys institutions overall they're not I mean there's not big net there's net outflow. You look here it's net outflow net outflow net net outflow. So until that changes the bull market will have to wait and for now it is I mean it's a typical midterm year guys. I mean is it is it is what it is. I know the hope that last but for now until further notice it is like that and if it changes we're also going to change. I mean listen if we pump above 50 we go to bull trend we're going to be bullish. I mean that's it. That's it. That's it. We're going to sell we're going to sell orange juice. Orange juice which is doing very very nicely now. Where is it? It's on the daily. It's on the daily. Here, here. Very, very nicely. Dump the orange juice. Dump liium. Even the cows, guys. I mean, live cattle, it's up 8%. And then you look at your What did your do in the last one month? Go check it because even live cattle commodity, man. What is this? What is this? Anyway, anyway, uh what else? Let me go through a few news and then we'll go to Q&A because guys, I've been missing I've been missing the chat. We've been doing a bit of pre-recording. I've been missing the chat. So, we're going to go to Q&A in a in a second here. So, Sulana is going to launch SKR token for Secretone on January 21st. There you go. Um, CryptoQuant CEO, big shout out, but I mean, he's been a bit wrong. He's a great guy, but he he's he's been wrong. So, he's saying we're going to be chopping. And yeah, maybe. But all in all, it's bare trend whether it's chopper or not. We just look at the trend. And I mean, that's it. That's it. That's it, guys. Some call to actions before we go to Q&A. Go to bullmania.com if you want to get access to bullmania to the money scanner the software use for the flips. I mean as you can see it's like I mean it's it's priceless. I mean it's priceless. I mean if you get the signals in real time it's priceless. Uh look at stocks you get the signals in real time. I mean it is look at the daily. I mean it's it's price I priceless. It's priceless. So watch the video bulmania.com and if you are trading check out bullmania.com/partners basically the link in the description called exchanges I use. If you see description exchanges I use and sign up on buy bit you get nice big juicy fantastic signup bon you can go long you can go short you love that bit tuning is the same if you want bionx bots it's here I mean everything is here so use that and on this note let's go to Q&A and big shout to dab dab is time stamping us bum bum bum bum bum today timestamping big shout out to Dub Dab joined the chat right before we were going live Mr. Bara is right here on the mug and right here on the shirt. Coffee fantastic and let's go to Q&A questions answers debates. Let's go guys as soon as soon as soon as soon as possible. Live is back. Yeah, I was I was going to do live uh tomorrow and uh the thing is this with the trumpet. It was just like breaking news. Okay, let's go. Let's go. I mean defense budget increased by 50%. In my book is it's big. It's one of the biggest expenses that the government has. So if they go from one to 1.5, obviously it's a breaking news is going to affect the economy in one way or another. So we have to discuss we have discuss very quickly. I haven't sounded like Borat for some people say that. Uh let me know what you think. Problem uh is orange juice uh has Oh yeah. So by the way another thing people have been asking I saw it also in the chat here but in in our discord as well. Um what and I had the question myself also. Why is it that there's only orange juice? Okay, when you look at the futures markets, it's only orange juice that is trading. You cannot find apple juice. You cannot find, you know, pineapple, where is grape juice and all of that. And apparently it is for historical reasons where in the past when all these you know futures markets were established uh at that point in time orange like the actual fruit orange it was concentrated in Florida. a lot of oranges across the world. Um well the it was grown there and then exported across the world. So whenever someone want to buy orange a lot of it came from Florida like now this is from AI. I'm telling you what AI told me. If it's wrong go to go complain to AI. I'm just telling you like what what I learned yesterday. So when you have concentration of where these oranges are growing you need to be able to hedge. So that's why a lot of companies needed hedging in case there is bad weather in Florida or earthquake or whatever you guys have there. let me know there needs to be hedging. So a market futures market was established or oranges because oranges had this concentration risk because it was one geographical area where a lot of them were coming from and now I read now it's a bit different now so orange production is distributed now way more but the market is still there the market is is still there and other fruit other juice I guess they didn't need it or something they they were distributed already but yeah a a bit interesting um a bit interesting stuff here with the with the orange And I mean we're looking into adding more stuff also. Let me know guys what kind of commodities you want to be added. Obviously we have the most important ones whether is lithium silver. I mean we have we have most important important ones here also. But yeah sometimes I discover a new one like oranges. I I didn't even know you can trade freaking oranges. And then I see it's pumping like what the hell is this? It's I look at my how the have been going. It's crazy. And then you see orange 38% nice up. Very very nice. H let's go. But in all seriousness, 50% increase in defense spending is big. 500 billion. Yeah, it's quite big. Absolutely. Orange juice for the orange man. I mean, what percent of your portfolio is Well, I don't have orange juice. I mean, in al we just added yesterday because I found it yesterday. I was like, what the hell? It's I I don't have it. I don't have it. I mean, what are your thoughts on the colonization of Venezuela? Oh man, it's complex topic. You ask me about the my thoughts about V. I can write a whole essay. I mean, a whole dissertation on it if you want. Uh, I mean, simply put, listen, most Venezuelans I know, they are very happy. They're very happy. Uh, those that have immigrated that didn't like the regime, they're extremely happy. So, that's my data reading. And I mean I can imagine them being I mean it's you go from isolation you go from socialist dictatorship to US colony. Yes. But at the same time is it better or is it worse? I mean that's that's the question. It's not like Venezuela with Maduro was benefiting their citizens with the oil. People say oh no Trump wants he wants the oil but listen before it was Madur and France. Now it is Trump and France. And um all in all it's a big question. So, I mean, if you are from Minnesota watching this, you can probably answer this, but my guess would be that they're not they're not too sad that that Madura got to fly an airplane to New York. I I would guess they're not too sad. Uh, not at all. And then, I mean, you look at uh, you know, look at Puerto Rico, look at other US uh, US col colonies, then compare them to, I don't know, Somalia. Well, now Somalians are in Minnesota, but I mean, you understand that a lot of prior British colonies, but also like US controlled uh places. I don't know if you call them colonies, like is Puerto Rico colony? It's like, you know, US controlled. I mean, not too bad. Not too bad. Better than uh better than in Vela, most of them likely. But listen, it's a bit outside of my we're here to discuss the markets, but you get the point. You get the point. I think there are many people in many countries that would also hope maybe there is a the helicopter that can take their guy and uh we can do an oil deal or like some some trade deal with orange man. Let me know guys. Let me know what you think. And Maduro man, what the hell? Such a stylish guy with the Nike. I I also read Let me check Nike stock by the way or Nike. You say Nike, it's wrong. It's Nike. Repeat after me. Nike. Nike. It's not Nike. It's Nike. Anyway, so uh Nike not pumping too much, but I I I read that they they sold out that um that uh you know, how do you say the the thing that Maduro had like this sports thing that sports wear guys outside of crypto? My English, I don't know words. I I can speak about crypto in English, but you know what's this called? You know, this overall, how do you say this jumpsuit? Jumpsuit. Jumpsuit. Jumpsuit. Exactly. jumpsuit. So, uh, jumpsuit. It's sold out. It's sold out. I will try after the stream to buy it. I I want next stream I want to be in Maduras and then with the headphones like people are doing AI videos with him like DJing. Exactly. Dr. Disrespect. So, yeah. Uh, that's that's my unprofessional unlicensed thoughts, but uh I mean probably correct probably correct. Um, if you are from um from Venezuela, let let us know in the comment section. Staff at Nike will tell you it's pronounced Nike. It's Nike, man. It's Nike. It's Nike. Nike. Repeat after me. Okay. More questions. More. Is that a Wimbledon sweater? Exactly. It's Yeah, it's a bit of Wimbledon. A bit of this, a bit of that. It's uh but it's it's bare. Most important is bear. We have bear everywhere. And in the bull, I haven't found something like this with a bull. So, it's going to be bear. It's going to be bear. Mr. Bara, I'm waiting for another one like this. Also white, but with another kind of design. And that one doesn't have Wimbledon. I think that one doesn't have I I need to double check. Yeah, exactly. This one is Wimbledon. What resources does Greenland Oh yeah, that's another one. See, that's another very important thing. When it comes to resources, Greenland has quite a lot. And let me see this map. I saw a map the other day. Here, here, here. They have quite a lot. So, obviously, orange man needs it for national security. But listen, most likely the resource. Okay. Uh what you have here titanium, you have uh zinc, they have this and that it's uh yeah platinum. It's all kinds of stuff. All kinds of stuff. It's a lot of stuff there. It's a lot of stuff. So yeah, I'm Let's see what's going to happen here. with uh odds now being 15% chance that Trump will acquire Greenland before 2027, these kind of maps, they're going to be more and more popular, spreading what can be adopted here. And you know, the thing that I appreciate with Trump also that he doesn't even hide it. He said, \"We're going to take the oil and with we're going to take the oil. Uh we're going to use it. They're going to they're going to transfer transfer the oil. So that's that's the goal. That's the uh that's the objective. So I think it's it's pretty clear here as well. He he's up front. I mean he's we need the oil. That's it. That's it. That's it. Can we use electricity on all mechanical so Trump can stop? Let's see. Ah dirty. Dirty. So so Trump doesn't go after oil. Not happening, man. Not happening. The renewable like this electricity stuff. It also needs a bunch of precious metals. You see here you you need all these precious metals and all of the other industrial metals. Why is lithium up so much? It's because uh you have EVs, all of the battery stuff. Okay, they need they still need all of this. I mean they you need resources. You need resources. So unfortunately there's always going to be fight with resource. Okay, there we go. Mr. Garden, what is this? I woke up at 4:00 a.m. See you live. What happened? Yeah, re-watch re-watch re-watch the the stream. We we had to do a bit of urgent news as Trump increased the defense spending by 50% in the US, potentially preparing for a wider escalation. Let's see what's going to happen. And uh yeah um all in all there are many similarities with uh 2022 guys. Military escalation being one of them, chart being another. uh you saw uh initial pump in in in into the year uh is very common for midterm years also. And if you want to see these charts yourself, go to booming.com and then it's a button here called free charts. Boop. Right here. And uh yeah, here you can you can compare all the midterm years. You can see how the current 2026 green one is doing against the other midterm years. you can see uh topping years when Bitcoin topped here 2025 in comparison to the last ones. Well, I mean all of them are smaller and smaller. This is also why you know sometimes people are saying that oh no well well actually I did a video yesterday about this four cycle. You should watch it if you if you didn't see it. Uh all the videos this week uh I did a video on why I'm not buying the pump. I did a video on um on uh why I'm not believing in the liver more pattern on Tuesday and yesterday I did a video on the foyer cycle. You should watch all of them because this standalone videos guys they are a bit evergreen. I mean, as much as they can be when you're analyzing a market, but probably for the coming month month, this standalone ones we did during the week, they they're super valid and that's also I I I wanted to a bit of standalone. So, we have a bit of evergreen stuff and the message is super condensed and everything. So, go go and watch them. But there one of the guys in our discord was saying that, oh no, it's not the same. You know the cycle is not the same because look at previous cycles how much they pumped here and here and here and look at you know current one did not pump even though the top the top date is like exact as the other cycles he was saying that yeah because we didn't pump too much is it's invalid it's everything is invalid well the same thing can be said here when you look at the topping years uh you see that 2021 when we topped it was also very small in comparison to 2013 and 2017 I mean so it's all relative we have dim diminishing returns we have diminishing returns it is what it is And the 2025 was a weird one because we did go to alltime high but it just stopped out in October. So before the year ended that October pumped to 127k or what it was it had time to deflate. So it's it's a bit interesting to analyze these different things because technically we did have quite okay year. I mean to the top it was uh I mean around was around what is 30% or something like that and then it deflated to minus 5. Uh but all in all these different things are models they and and they can be more or less more or less useful. uh the the the the thing I replied to the guy listen it's it's a model it can be more or less useful and uh the way we used the 40 cycle this this time around was that when Bitcoin started to go bare on the daily when it did the fake time high when it went below the 50we moving average when it went bearish on the money line then for cycle for us was a confirmation it's not the grade one signal it's grade two sign it's confirmation of the trend so for us it was very useful it was extremely useful It gave extra confidence, extra confirmation. Um, and I mean that that's it. That's it. No model is 100%. I mean you will not have exact repetition of things year in year out. But it's all about how useful is. So for me it was very useful. I don't know how it was for you. Let me know in the comment section. Best exchange to trade commodities. You go you can go to capital.com. Capital.com. They have most of it. Most of the commodities you can buy orange juice I think on capital.com uh well I don't think I know that you can buy you can buy it there capital.com yeah go there should be available in the US people always have issue with us but should be available worst bull run for alts uh yes but um you know these are the altcoins go to the weekly now these are the altcoins the metals the metals right here. Bum bum bum bum bum. Let's look at the worst performing um commodities. Cotton not doing too well. Cocoa doing very bad. Natural gas I guess because of the Venusella stuff. They have a lot of gas. Sugar, oats, leanhog, oil. I love that it's leanhog. Why it's leanhog? You know, commodity stuff, guys. I haven't I didn't trade commodities before. Well, outside of precious metals, like all of these other comments, I didn't even like touch them before 2025. So, I mean, to me, it's also a fascinating world. A lot of the tools that we're building here, it's I mean, I'm building for me primarily, but then I I know everyone else finds this useful also. You know, why lean hog? Why not? Is there also like uneven unlean hog like tough hog? Let me know in the comment section. All of the commodity traders. So, yeah, I mean, we had to adapt. That's why, like you say, all coins did not do well. We had to adapt. We had to adapt. We had to discover a new market. The some something is pumping somewhere. Okay. Some somewhere something is pumping. I'm only buying. Oh, yeah. Fat hog. Okay. Yeah. So, there's lean, there's fat, but you can only trade the lean one. And also, the guy asked where to trade stocks. It depend you have brokers in your country. I mean, it depends on which country you're in. You can trade it on in the EU if you're in Europe, you can trade most stocks on Revolute. Super simple. Then of course you have more like professional brokers with Schwab with uh in in Europe it's very frag like this professional ones. It really depends on your country but if you want the retail one then it is Revolute. Uh they have it's you can be anywhere in Europe. For US you have Robin Hood for Asia I don't know what you have something you have let me know but uh it's there are some apps like Robin Hood entire US or Revolute entire uh Europe but they're retail they're retail so maybe you're going to have a bit higher fee maybe but you're going to have nice app nice UI and many of them also have very low fee but then if you want more professional you know you your private banker you depend you can you need to speak to your bank or or also there is this um uh what's called uh the red one. What's it called? Very very big also. I don't remember what it's called. Oh yeah, interactive broker. Exactly. Interactive broker. That that one is also I think worldwide. Uh but it's not real. It's like CFDs, but you can speculate there. Can you withdraw with Revolute? Yeah, I mean Revolute is actually very interesting because you can deposit crypto into it. I think you can you withdraw crypto from it? I think you can withdraw also but it's it's one of these banks where you can actually deposit crypto into it. So it's quite good. Now the problem with Revolute is that if you have some issue there is no one to call so you will have to chat with them and that may or may not be helpful. Some people have been saying that they've been banned this and that but you know it comes with the with the thing. It comes with it being a retail app. So you you cannot call anyone. There is no you cannot visit the office. So if you you have any issue KYC or whatever you you will not contact anyone. So that's the downside. The upside easy nice app you you get going in like 10 minutes you have stocks you have crypto you have everything but that's the problem. There's no you're on your own. You can buy and deposit crypto but not withdraw. I guess that yeah maybe you cannot withdraw. Maybe maybe that's true but deposit you can for sure. I know that it's all about the oil. It's about the oil payment settlement in USD. Yeah. Yeah. I mean, no one is hiding it. Uh let's see. Trump did. I think in this New York Time article, which is behind the pay wall, I think he said that, you know, we're we're here for the oil. I think he literally said that. I I don't think he's hiding that for the oil guys. uh in that um article where he said they're going to be in Venezuela for years. They I think he said we're going to be there for a while. Uh and yeah uh where is this? Let's go to latest man. It's behind the I don't want to pay New York Times guys. I don't want to pay now, but I believe I saw it. If you guys have New York Times subscription, read it and confirm the comment section. US president and his advisor planning AN INITIATIVE TO DOMINATE DOMINATE the cell and oil industry for years to come according to Wall Street Journal. Exactly. Let's see. Maybe this site has copied the article. They're going to dominate the crap out of it. Exactly. Uh, you know, it was with these woke guys before when they said, you know, we're going to bring democracy and they take oil. Uh, now with the nonwoke, it's there's no no more of that. We just say, you know, they just take it. Uh here Trump said he expects US would be running and extracting oil from its huge huge reserves for years. Exactly. No more woke, no more bringing democracy is extracting oil from the huge huge reserves. Oh yeah. Guys, that's it. That's it for today. Smash on the like. Subscribe to the channel. See you all very soon. See you tomorrow. Big shout out to Dub for time stamping us today. Have a great day. Check out booming.com. Watch the free video. Check the exchanges I use. And goodbye guys. Goodbye. I got"
    },
    {
        "video_id": "bqiloeNcy94",
        "title": "BREAKING: TRUMP JUST LAUNCHED OWN QE BYPASSING FED!!!",
        "published_at": "2026-01-09T23:19:50Z",
        "sort_date": "2026-01-09",
        "url": "https://www.youtube.com/watch?v=bqiloeNcy94",
        "transcript": "Guys, welcome to another episode. And as you can see right now, we do have an interesting situation on the Bitcoin chart where Bitcoin currently is still struggling. We're still struggling with this resistance. We're still under this very important level of 94 approximately where if we break it, we would have a good chance to go all the way here to the 50week moving average. But guys, something big happened yesterday. something massive massive massive occurred and that's that Trump basically said that they will be buying they will be buying uh mortgage securities okay in order to put down the interest rate themselves okay normally this is something that the Fed would do if the Fed sees that there is a need to buy some mortgage securities or go in and support some kind of market some kind of bond market that's what the Fed would be doing if they that there is a need. But as you know, Trump is not happy with the Fed. Instead now he's taking budget that is supposed to be for the government basically government budget and he's himself deploying that money into financial markets buying mortgage bonds which will put down it's going to put down the interest rate for mortgage which obviously is going to be super super bullish for risk on assets when it happens. It's going to be very good because people will have more money pay less into the for the mortgage and more people will be able to buy a home as well because if the mortgage is less now your budget makes sense. more demand for housing. When there is more demand for housing, obviously more demand for innovation, for all kinds of things related to housing, all kind of business related to housing. And this is new guys. I mean, this kind of stuff is new. Just like Trump did a very interesting, innovative solution with Maduro coming with a chopper bum bum bum bum bum extracting the guy and leaving. This is one of a kind kind of creativity. The same thing is here. The Fed is refusing is refusing to ease. The Fed is refusing to be as fast as Trump wants them to be. And Trump cannot change the Fed chair until next May. So yeah, why not just take the budget, the government budget and go heavy go heavy into the mortgage market yourself. Buy the bonds. I mean, basically they're buying mortgage bonds. Okay, this is what Fed is doing. The Fed is also buying bonds. They support government bonds. They sometimes they support mortgage bonds. Now instead of the Fed, the White House is going to be buying and buying and buying. Fantastic, guys. Fantastic. Now, what does it mean for us? This is a nice picture by the way. You remember when the Fed was renovating their their building and Trump pointed out some issue which I don't know if it's was true or not, but uh it's a perfect picture of what's happening. Fed is sidelined. What's happening right now is the Fed literally is getting sidelined and that's something that the markets will have to price in. For now though, the way it is looking right now is that um we don't see any effect currently this very day. And normally these things they take a bit of time. Normally it takes a month or two months or three months for this money to really hit the economy and for this to be fully confirmed and all of that. So this can still take until March, until February, March, maybe even April uh for this to happen for actual money to hit the market and to put down the interest rate because when there is demand for the bonds, the price of the bonds go up and that by definition decreases their interest rate. There is an inverse relationship between the price of the bond and and the interest rate. So let's see how how it will play out. But just another uh signal that later in 2026 guys, we will have to be extremely bullish as soon as Bitcoin goes above 50 average and then especially when it goes into the uh bull trend on the main line because we have all of the different pieces now being positioned for a mega pump uh for the next cycle. When it's going to happen, that's secondary. And uh it can still dump a lot until then to go to 200E moving average easily until then because we're not even that far away. Okay. I mean, if you think about it, this thing goes up like this. So, if we're to derp here for some time, I mean, the distance here, let's say, let's say we we we start going to it in March. I mean, the distance is like, you know, it's 30% is not a lot for Bitcoin to dump another 30% is not it's not it's not a lot. So, it's not even that far away. So, we can easily go there before that. But, um, uh, let's see what's going to happen. All in all, we are keeping the patient in check. And looking at the ETF data, by the way, here we now added the ETF data over at bulmia.com/free data. Uh if you go to bullming.com/free data, you see all of these different charts we added. And the reason why I'm adding them here is because, you know, there are so many different websites for looking at Bitcoin daily market data that I look at. There is one website for the ETF, another website to check the hyperlquid uh data. Hyperlquid. I also check every day because it shows you what the big wallets are doing with big P&L profitable wallets and what less profitable wallets are doing. For example, wrecked plebe who is minus 1 million or more in P&L is very bullish. While the gigachad 1 million or more in profit. So here is basically how much they lost. 1 million or more lost is wrecked plebe. 1 million or more in profit is gigachad. So you can see that giga chads now are bearish mainly bearish while direct plebe is very bullish. So you can see kind of what's happening here behind the scenes and this is based on onchain trades on hyperlquid the decentralized leverage decks but so you know there are many charts I look at every day it's ETF inflow outflow it is hyperlquid this and that and normally this websites they're done by some boomer developer you know sometimes to load these charts when we're looking for example at the hovering cycle or ETF man like takes time to put them together so let's just put everything on our own website it's super easy and it's even better for example with the ETF chart with ETF inflow outflow we now added this summary. So you can see for example in January 2026 this month all in all we are still uh positive we have positive inflow in December we had mega negative inflow minus a billion basically and then if you scroll down in November we also had mega mega outflow mega negative outflow minus 3 billion outflow and then we have the data also for October minus 1 million 1 billion 1 billion I say million it's billion with a b so 3.4 4 billion and October 1.2 billion out. Uh let's see if January is bullish or bearish but we can now track it in real time and we see the total. Okay, so for the daily checking of the market, I do recommend going to bullmay.com/free data. It's fully fully free. You can see the hovering cycles, you can see the ISM chart if you love that. The social risk, this one is interesting because uh this is inspired by Ben Cowan's social risk. But I believe this is a bit better because his ones is looking at uh uh social media data and that can easily be tricked and uh faked while this is looking at Google trends data basically searches searches searches searches. And this shows a bit different because here you see for example we did have quite uh overheated uh situation with Google trends around the Sana top and around the the Trump launch of the of the memecoin. So it shows a bit different picture here where I mean yes indeed we we didn't see as red as before around the tops but it wasn't fully dead either. We did see a bit and then all the ETFs and all of that. So guys that's that in terms of the big big moves that that that have happened during the last 24 hours. Trump is now pumping himself taking the money himself from the budget government budget straight into the bond market. And um uh it still it still may take months. Let's see. But as soon as soon as Bitcoin turns bullish on the money line or goes uh or goes above 50 moving average, massive massive massive signal. So that's number one. Uh number two, if we look at the overall uh market uh and see what is currently happening in the last um let's check what flip bullish on the daily. Let's say in the last four days, do we have anything that flip bullish? Let's see also what made the the most gains. Well, you have Islamic coin up 296%. Holy crap. some kind of new one. Let me know if you have this one, guys. Holy. What happened here, guys? Holy Yeah, I mean, there you go. On cool coin. On cool coin. Holy crap. You have this Yay! Finance up 90%. So, it's still possible to make money even when Bitcoin is in a downtrend in this shortterm trades. And again, it's only for short-term trading. Only short-term trading. As soon as they go uh bearish, you're out. As soon as they hit some target you wanted to hit, you're out. There you have Babylon 7%. this world uh mobile what it is 20%. So this is just in the last uh you know in the last four days what bullish in the last uh four days. Let's check if there's anything today today. Uh a few different one horizon privacy QB no no clue what it is but up a bit. Uh in terms of stocks guys let's see what we have here. Stocks is quite interesting to see also because there is some craziness here. I mean sometimes it's it's quite a lot of craziness. You look here, this creative global in China, some Chinese stock that went absolutely ballistic 80%. And the best thing, of course, you don't really need to know what the hell they're doing. You just see the trends. You see what is happening. And what do they do? Creative global technology engage in sourcing and reselling recycle consumer. Yeah, there you go. Some kind of news, I guess. Uh massive pump. Uh and this one flipped when? Yeah, there you go. Fly exclusive. Do you guys A lot of this is penny stocks, of course, because they pump so much. What is this? Engages in owning of jet aircraft. There you go. Massive pump. So again guys, short-term trades. You don't have to know what they're doing if you are trading for short term. And as you can see, it can be quite good for uh for short term. Uh then you Yeah, you can see here all kinds of things. Uh in terms of market cap, let's see the biggest ones that recently flipped. You have here uh Alphabet recently flipped just two days ago. Bullish. So if you don't want to go into the [__] into the Chinese penny stocks that we that we looked at, you want to buy blue chip blue chip blue chip, you have Alphabet that flip bullish now two days ago. Coca-Cola, Coca-Cola, not too good for your body, but potentially good for your portfolio if they sustain the bull trend. Uh and yeah, then you have this other ones uh as well here. Colgate. Colgate. No, no, where is it? Here. You brush your teeth. Well, Colgate 2% up today. So guys, a lot of opportunity for trading short-term. If you want to get access to Bulmania, to the tools, to our platform, everything, go to bulmania.com and watch this free video right here about the mechanical rules that teaches you how to think first. Before we give you access to software, you need to understand how to think, how to apply all of this, then you can get access. All of this is in the video, all the instructions. And if you click right here on free charts, this is where you get to that free charts website. Now, let's go through some more uh news. Here we have Sam Bankman Freed. Likely not getting pardon, guys. No pardon for Sam Bankman Freed. Uh he's been trying he's been trying very hard as you know he has been very pro-democrat, very pro Biden in the last month or so. He has been trying to say that no, I actually did not like did not like Biden. He said that you know I viewed myself as a sort of center left but he gave so much money to Biden. So much he was full full woke. He was pandering to the woke woke woke woke. was the biggest donor to Biden. But now he's trying to say, \"Oh, no. You know, I changed my mind and I didn't like Biden. He had incredibly destructive and uh policy and it was difficult to work with his administration. I don't think Trump is going to buy it.\" Trump actually said in a recent interview that he's likely not uh not pardoning SBF. So, yeah, there you go. Maybe if there's a new guy in town and after Trump, maybe he can try again. But uh then he needs to say, \"Oh, actually I like Biden.\" Now he said he did not like Biden. Trump said, \"I'm not going to pardon you anyway.\" Then Trump is out. Maybe a new Democrat is in. So he will have to say, \"Actually, I liked him.\" And you know, actually he was Biden was very Let's see. Let's see what the hell is going to happen. Now, now, now there is again talk about option expiring. Guys, personally, I'm not really, you know, going heavy on this speculation with options because in most cases, you just have to look at the price and uh and not worry too much. You know, some options inspiration, this and that. You remember on December 26, there was supposed to BE A MASSIVE MASSIVE option expiration. Everyone was saying, Ivan, we're going to pump everything is going to move after the expiration. What happened? We did see the expiration and nothing happened. Okay, so you know this massive option expiring just look at the price run. You have the price. That's it. Don't don't over complicate it. Don't over complicate. We have the price here. It's in downtrend. It's bearish. It's below 50 week. You cannot even break this resistance. I mean, at least can break this resistance. Then we can at least speak about return here to 100K. Now, cannot even break that. So, I know people love speculating on options. You know, now options going to expire. We're going to pump. We just need that final expiration on December 26. They expired. Nothing happened. Now people are saying now they're going to expire again. Maybe something happens. Maybe not. But it's not tradable, guys. It's not tradable. It's not whether you know they pump. Maybe it will pump at some point when the some kind of option expires. It's just not tradable. It's not tradable. It's more of a hopeium. But uh yeah, let's see what's going to happen. Uh we we just look at the price trend next. Iran Iran is cutting the internet. Okay. And here is where it's important to realize that crypto can actually work without the internet as well because you can um do SMS, you can do any kind of communication basically. Okay. Any kind of communication network is okay. H it's all about having a message where you sign the transaction and then that message getting to all the nodes. So as long as you can get that message somehow to all the nodes whether it is via SMS or whatever uh you that your job is done and when I say to all the nodes I really just mean to one internet connected node. So for example you could have a satellite that can receive SMS and then boop just propagated to the broadcast it to the internet. So it's all about like you know how can you take the information your transaction that you signed how can you get it out and then also how can you get the latest state of the blockchain which is which is a harder issue but if there is starlink if there is a satellite it's not that big of an issue so the question is can Elon enable freaking Starlink that's number one and even if Starlink is not there technically it's possible to transact with Bitcoin also even without inant but you need to have wallets adapted to that and that's uh not really a thing so Technically, you can absolutely use Bitcoin uh without internet. Practically practically uh I wish more wallets would be adding other u uh communication networks such as SMS or whatever. Uh it can be mesh network. It can be I mean it can be whatever. You just need to take your transaction and somehow that it gets to a node that has the internet via mesh, VS man. You can make it I can print out I can print out the Bitcoin transaction on paper. I can mail it to you. you you put it into your node. It's connected to the internet. Now my transaction is confirmed. I mean that's how Bitcoin works. It doesn't matter how you you know how you sent it. It's all about will it get into a node or not. So that's that. Uh also it is interesting that um it's a bit a bit off topic but um I I just had to cover it because I read it before the uh before the stream. Guys, if you are in UK, you are you're cooked. I mean, you're cooked because now even UAE is cutting funding to their citizens, to students that want to study in the UK because they're worried that they're going to be radicalized. Okay? Isn't that crazy? UAE is worried that their youth is going to be radicalized in the UK on campuses. So that's why the modern education guys and you know this whole establishment with universities I mean keep keep out and stay out stay out sending kids there you never know what's going to happen because you have this thing with this kind of radicalization that we just looked at then you have another type of radicalization with the gender stuff then you have another type of radicalization with just political socialism. So what you have coming in is maybe a nice person, nice kid, nice teenager coming out is this radical from different directions from the religious, from the gender direction and from the socialism direction. You have this interesting creature. I don't know what all you can you call them, but it's like an interesting creature that comes out on the other end. And if you want your kids to stay out, do online education, homeschooling, I mean figure it out because all the information now is uh AI, you can do ask AI anything. That's number one. Number two, before people said, but university is great for connections, man. I don't know if it's great for connection with this kind of stuff, with this kind of connections you get that even UAE, Dubai, they're they're worried, man. They're worried for for this connections. You have to be extremely careful, guys. I mean, it is what it is. Even the good universities uh like in the US Ivy League universities you saw what happened to all of these protests. You know which protests even there they are. I mean you pay so much money to send your kid there and they have to watch all of this uh you know agenda. So anyway let's let's move on. Let's go back to crypto. Let's go to Q&A. Uh I want to keep this uh this short without any you know max alpha per second. Want max alpha per second. So let's go to Q&A. Questions, answers, debates, discussions. And by by the way another important thing guys is that just speaking about the connection I was just thinking about it because people before said oh no you got to mingle you got to this you got to meet you got to listen at the end of the day the people that go to you know entrepreneur meetup or or business meetup I mean in many cases it's it's good maybe if you're like starting from scratch you just want someone to be in to meet that is on your level and you can do something together maybe that's good but you know maybe people think you know they're going to go they're going to mingle somehow they're going to meet some dude that's going They give them money or something, you know. They're all there. Business breakfast, business entrepreneurship. They're trying to see like who can improve. They're like, listen, just go bidded bidd work work yourself. This mingles shingles. Uh listen, it's unlikely unlikely to move the needle for you. Okay. Uh literally, I mean, dudes looking for richer dudes to change their life. I mean, that's it. Now, if you have another perspective that you maybe want to re meet a co-founder, it's is different. That that's more okay. That's that's actually quite good. But, you know, I just know, you know, maybe, you know, it's not about what what you know, it's who you know, okay? And then they try to meet like a shake who's going to be their business partner. Get out of here, guys. Q&A, questions, answers, the base discussions. Go to boom.com to learn the mechanical rules, get access to mining scan, all of that. All of that if you want that to monitor the flips. Next, next. Next. Go to boom.com/partners to sign up for exchange. You can go long, you can go short, all that good jazz. Uh, and you get a nice sign up bonus and you support the channel and we go to Q&A. Go, go, go, go, go. Let's go. And big shout out to Guzman for times something us guys. Fantastic. Guzman is here time. While you are thinking about questions, let me just quickly see if we missed something, but I don't think so. rate cuts and QE anyone from Kite. So let's check the poly market. Let's check the poly market. What poly market is pricing in? I don't think anything drastic is going to happen before u Jon Powell is out which is going to happen in in May. Before that if we look at uh let's see finance Fed decision in January what's going to happen? No change man if there's no this is what I mean guys I mean listen when people are saying they're going to print money they're going to do this they're going to decrease rates it's true but it just takes time man it takes time we can go the entire midterm year down to 200 week moving average before they meaningfully decrease the rate so now for example in January if there is no change it takes time and the next one is when March is there no February why is March next and you know next one is March and it's also no change is the highest likelihood so guys this is what I mean it takes takes time. It takes all of the macro guys are going to be correct. The issue is that you know it can take until the end of the year. Look at how quickly the year goes. It's already soon half of January. Okay, the year is going to be over quite quick and this is how midterm years normally look like. So let's say you know in May we get a new Fed then it's going to take maybe some months for him to warm up to get into position. Maybe here towards the middle of the year he does some significant change to what's happening right now and the effect is going to be felt only towards the end of the year and there we can very well just do another one of these midterm years. So I'm looking at midterm year I mean you see it's is actually exact it's freaking exact we have beginning of the year small pump then deflation of the pump the pump is deflating and then continues down. Listen, obviously the this can break the the similarities to previous mutter years can break very quickly and uh if that happens, we're going to see it right here. So obviously we don't know what's going to happen, but previously it looked like this. I have no reason to believe something is different. But if we see big deviation, let's let's say Bitcoin starts pumping a lot and really goes higher here. I mean, we're going to see it. We're going to see it. This is the midterm years. And the average, if you take the average, it's literally freaking exact. Look here. I'm looking taking the average of the all of the midterm years. And you see where the green line is? This is where we are now. Bam. We're exactly exactly exact where the average is. But the good thing is we don't have to wait long if if to see if this is if this average is going to hold this time in a very close manner or not. I mean within the coming weeks. Either Bitcoin is following down. I mean, all of these other years uh or you know, we're pumping a lot. uh if we're sideways, it's going to be a bit undecided because here in 2014, it went sideways basically until February. Here you see 2014, this yellow one. So if it just continues sideways, it's going to be kind of like 2014. So listen, either it follows more exactly, then you have more certainty that it's exact or it pumps like hell and then it's also big certainty that it's deviating. For now, guys, it's exact. It's exact. So yes, we're going to have printing. We're going to have all of that. Trump is now even starting his own QE. But it's gonna take time. It's gonna take it could take until the end of the year for this to really make a difference. Ian, did you see the dump in Zash? Yes. Yes. Yes. Indeed. And yet again, it's another thing why trends are so important. I know people want to make it about the team. You know, the team uh left this and that and the team is now I don't think they even left, guys. They have just another company. Um, I mean that's what I hear at least that they have another company that they're going to uh work uh work at and they just restructured basically they they're no longer doing foundation they're doing a company and so they restructure to be more efficient at least that's their official story and uh uh what you have to keep in mind is let's see Zcash Zcash Zcash Zcash if we look at what you have to keep in mind is that on the big time frame uh has been bearish already since when if the money line loads. Let's see. We need some bigger uh chart. Let's see. Binance. Yeah. So, it's been bearish since here back in November. Okay. So, you have to be careful when it's bearish because here's the thing about the news. When a trend is bullish, news like this that the team restructured or they change from foundation to a company, in a bullish trend, that kind of news wouldn't really matter. I mean, bullish trend you some have very bad news. No one cares about them. So that's why news-based trading is so bad because the same news in different market environments will have totally different results. Yes, we did see news yesterday that the team left or restructured or where the truth is only they know how you know did the exit scam or not or there's a conflict or no conflict. Let's see. I don't really care about that. I know that the trend is bearish. So any kind of uncertainty, any kind of kind of bad news, even badly worded news, maybe the news is not bad. Like for example with the Zashion we don't know did they really stopped working and they quit or not let's see it's impossible for us to know but the news still dumps they it still dumps the price so this is why uh price Uber Alice it is price that is the king it is the trend that is the number one signal the news and everything is uh is less important because literally the same news could doesn't matter in a bull and now it matters in a bear and is the same with Bitcoin is the same with all kinds of assets. In a bull trend, you can have the worst news, no one cares. No one cares. So when people are saying, \"Oh, you have to watch the news more. You have to watch this.\" We watch the news, but we're not trading on that. We're not trading based on that. We're traing based on a trend. So whether it's Bitcoin, small altcoin, altcoin like Zcash, any stock, you need to look at the trend. When the trend is bearish, that's it. That's it. You're out. So this my take on Zcash and uh is bearish. So you you knew it was better since November. So that's that. What about Monero? Let's check Monero XMR USD. So Monero currently is a bullish. Monero surprising looks quite strong. Look here. Monero is actually very strong. you see going to be pushing alltime high now without Bitcoin pumping it's going to be tough to work against gravity. It is working against gravity but for shortterm uh uh short-term trading is still bullish. Absolutely bullish. Um even though it's on weekly time frame I would still see it as shortterm. Why? Because if Bitcoin takes a poo poo it's going to be taken down guys. Monero is going to be taken down. If we go here towards uh the 200 week moving average, there is no way Monero will survive on its own. Okay? There's no way. So that's why I'm looking at it as a shortterm uh trade. It's still in in bull trend. So you can still speculate that uh it's going to is going to continue up. Uh but uh yeah, this is is speculation. Speculation, not you know, long term you're going to be buying big here for long term. I I mean I wouldn't be doing that at least uh I would only be considering that in case Bitcoin is in a bull trend because all altcoins including Monero they go to zero versus Bitcoin through time if you look at all altcoins they go to zero versus Bitcoin. So it makes sense to trade altcoins only when Bitcoin is in a new bull trend because temporarily all coins outperform Bitcoin in bull market. You look at Sena for example. Slana also goes to zero versus Bitcoin long-term, but from the bottom of the bare market, Sana went from $8 to $300 this market this cycle. And Bitcoin went from like 15 to 120. So obviously with Solana, you had uh 3x four, what is it? 4x more gains from bottom to top. So that's where you want to time all coins um for big moves like for more, you know, long term longer term uh with longer term being a year or two years during the bull. Hope that makes sense. Do you think silver will hit a new all-time high? Uh, as far as I know, it's still in bull trend. Let me quickly open up the scanner right here. We go to commodities. By guys, by the way, one thing we have coming very very soon here are ETFs. ETFs are going to be super interesting to add because you can see like emerging markets, biotech, like is I am so excited for the for the more uh more market expansion. So, ETFs are going to be here very very soon. Uh but yeah, you asked about uh silver. Let's check here. Silver still bullish on the daily, on the weekly still bullish. So when is bullish likely it is to continue higher. So don't over complicate it. Um you never know for sure because it's a market. It's not a free money machine that you just know something for sure. You never know for sure. But uh it's still bullish. When things are bullish, they they tend to continue to be bullish. So entering here, setting some nice tight stop-loss uh for for trading makes perfect sense. It makes perfect sense. Um but again, nothing is guaranteed. Silver also has been pumping a lot. Ideally, what you wanted is to be buying when it flipped seven months ago. That's the ideal uh ideal entry. But is it, you know, impossible to make money in silver now? It's not impossible. You're not super early. Ideally want an early bull trend, but um it's still bullish. So you can still speculate that it's going to continue to the upside. If it would be bearish, I would just tell you no. Now I mean there is there is some potential. You you're not going to be Scrooge MDAK. You're not going to be billionaire. You're not going to be richer than Elon Musk by buying silver at 77 when the whole world already is excited about silver. But can you make some profit? Can you train your up your skills? Can you apply, for example, mechanical rules to uh to the chart and see what's going to happen? and uh and see it as a learning opportunity then absolutely you know it's it's a good u bull trend is always good in terms of the riskreward. So, if you don't know what I'm speaking about, go to booming.com, watch the video here, and you're going to know. Yo, Matt Pet, I don't even want to speak about the Pulse. Just sad and yeah, it's uh I just feel so bad for the community and and also the community is Yeah, they it's it's such a sad state with the pulse, with the PA, it's not I mean, before it was at least fun. It was at least fun before. Now it's uh such a wreckage and I think what what we wanted to say it's sad. It's sad. So what what more can I can I say? It's it's uh it's very sad and um before I thought it was funny now I don't know a joke is funny for first 500 times then then it's not funny. So I kind of feel like that with puzzle I don't know how how much we can laugh more. Let's just check if if they're holding their alltime low or they have a new alltime low. I remember a few week a week week ago or so around the new year they had a new alltime low. Let's let's just check in on that if they're holding it or it's another alltime low or what's happening. Alltime low. So the good thing is that they are holding it. They're holding it. 31st of December was alltime low. So that's something. What's going on with Polygon? when it comes to actual adoption and tech, I don't really know because uh I'm not using it and I haven't seen too many. I mean pol they have poly market. Is it still on polygon or they or they move to their own thing? But I guess that's the biggest thing on polygon. Um and if I check all well oh guys guys for the short term for the short term maybe there's an opportunity for the long term 11 months ago bare trend since it's bearish minus 66%. So, and it can still go down a lot more. Um, I mean, if it goes to minus 80, it's a big loss. From -66 to minus 80, it's uh yeah, like you're going to lose half your money. If it goes to - 80 approximately, approximately. Let's check on daily. What's happening? 6 days ago, it flip bullish on daily and since then, it's up 29. So, this is an example where on the daily you can use it for the shortterm pump. On the weekly, don't drink the Kool-Aid too much. Oh man, this was quite clean actually. This was very clean on the on the money line. This was very very clean trend catch right here. Um, so yeah, can can it let's speculate here a bit. Can this thing go to at least this high right here? So that's a 30% pump. So overall for the short-term trades, guys, Polygon doesn't look too bad. It can try to come to this high right here. So that's a 30% uh opportunity. If you use exchanges like buy bit or others with leverage, obviously it's higher, but you need to manage risk more. And if you click the link below, exchanges I use, you can sign up and get the bonus and all of that. So all in all, it's not too bad. Uh when it comes to trading, if you're hoping for your bag to recover and like go to new highs, you're concerned about your huddle, long-term huddle, I don't have too much hoping for you. But if you are a short-term trader, it doesn't look too bad. You can make u you can make money here on this daily reversal and on the weekly let's see how much it oh man yeah I mean on the weekly it's not even let's see if at least we can pump here on the weekly you're going to have resistance here at the flip which is still 24% up so short-term trade absolutely I think it makes sense for for short-term trade if you want to trade shortterm then polygon chart looks quite good I mean because it's far away from the resistances It's in a massive bare trend, but from resistance is far away and it can still pump that 30% and still be in bare trend and continue further down. And of course, you can trade this upward and then you can short. I mean, does that many people don't uh consider the other side, but let's say that you see it get rejected here on the weekly moneyline flip, you can short on buy, you can short, you can use the link below and you can short. Okay, so you can go long and that's what I say. You can go long, you can go short, you can go long, you can do anything. Another Bart Simpson formed on Bitcoin. Uh yeah, I mean uh if we zoom in on the which time frame do you look at? Let's check u let's check 4 hour. Maybe you see on 4 hour something more or less. Yes. Yes. Yes. Yes. It's right here. It's right here. This one took a bit longer to play out, but uh this one is more Christmas tree kind of uh formation kind of inverse head and shoulder or something else that looks a bit like this with two things like this and one thing in the middle. Uh but yeah, it's also called in head and sorry not inverse, it's head and shoulders here or something else. I mean you can call it head and shoulder. I guess they want to be a bit politically correct because you they could have called it not head and shoulders but something else. So anyway, potentially some uh something here with on the 4hourly. Uh but yeah, so this one was a bit longer. That's what she said. This one was shorter. This one So we had many of them. We had many of them. Some are longer and some are shorter. Holy crap. We had many of them. You see? Yeah. So um with Bitcoin just wait for a resolution. I mean with Bitcoin best thing is to just sit on your hand. Sit on your hands. Don't do too much. Um just observe the spectacle. Either it's going to touch this or it's going to take elevator closer down towards the 200 moving average. And by the way, it would be good if if it went very fast here. If it goes fast here, we can have the next pump quicker also because this is the fair value that it's just so cheap at the 200E moving average that you cannot help yourself but to buy. Okay, so there's going to be a lot of demand here. A lot of demand here. Even if Bitcoin is still in bare trend, you can I mean if for a long time you can still buy here around 200 week moving average because long long term we bottom out here always some I mean some somewhere around 200 week moving average. So it's like the fair price. That's what I mean that if we go here fast, we're going to be reversing faster. Also, if we bleed, man, if we bleed for a long time, all coins are going to get so cooked. So, for all coins sake, it would actually be better to go fast here because the amount of demand here at the 200E moving average is going to be crazy crazy or or close. We don't actually have to go to 200 week. We just need to go to that area. That's why I have here you see a green area that is even a bit above the 200 week moving average because it's close enough. So it's you know how how close we are to it. Now I do think still with highest likely we're going to touch 200 week moving average but you know buying here is uh for longterm is it makes sense. It makes sense fantastic sense. So let's see what's going to happen there. So does the Bitcoin have to go? Business doesn't have to go do anything. It doesn't have to do anything. What's your question? Does it have to go to 200 week and then 50? So your question is a bit backwards because we don't know what's going to happen. We're just uh speculating a bit here and it's all about positioning. Bitcoin could so for example, Bitcoin could easily go and test first 50 moving average and that's why we have this uh breakout area like no one knows what's going to happen. Can you understand that people think that it's uh you know pred predictions instead it is positioning your portfolio so you're you're okay with the different scenarios and you can react when they happen okay uh most it's new for most people but if you go to booming.com and you watch how to become consistently profitable you need to switch your mindset towards reacting not predicting but reacting so uh we have a scenario where uh basically there there are a few scenarios I mean scenario number one is that uh it just goes here we don't do anything likely it's going to get rejected. So that's why we don't do anything. If it's not rejected, that's why I have this arrow. This is the time to be bullish. If it's not rejected, okay, this is the time to be bullish, especially if we go above the lip here. It's time to be very bullish here. But and we will be starting to get bullish already here. And this average buy price between here and here is going to be the same as our average sell price since October 8th. So basically we avoid all the wreckage down if we go down in a bare market but we don't have any uh any uh issue buying back at the same price basically average. So that's that's how we handle that scenario. Uh and the reason I say that 200 week is important is because if it is like any other midterm years, if it is like the for and everything everything which it is currently exact and people say every day it's not exact. It's exact. But then in that scenario we're also okay because here we know it's time to buy like a mfer like a literal mfer and um yeah that's it. Basically we're we're Gucci no matter what. That's the most important position to be in. But yeah, just so you know, guys, we're now in the midterm year. So, this can easily continue down for longer. Just looking at the other midterm years and taking the average, which is this white line. So, don't don't blame me. Don't yell at me. I'm just is just data. I mean, it's just data. And we're here to react and position ourselves in the best possible way. And if you've been watching this channel since October 8th, people ask me, Ian, when did you risk? We started risk on October 8th. uh we are uh in a very good position now because no matter what happens whether we buy here or we buy I mean it's fantastic fantastic anyway hope it makes sense the and also since October 8th we risk the altcoins so we don't have all coins because the altcoins are going to be slaughtered here if we go sideways let's say for another months all coins is going to be slaughtering if we go down it's going to be slaughtered like uh there's no tomorrow so this scenarios where we go down or sideways or up and then rejected for all coins since it means wreckage. So basically here, how many scenarios we have? We have one scenario down, one sideways, one up and rejected. So that's three. And then this one here that we actually break it, that's another one. So that's three out of four scenarios mean wreckage for your old coins. Like there's no tomorrow. here's an example where you know based on probability you can just position yourself in a smart way where you have you know most scenarios mean GG what do you say GGVP good good game well played to your altcoins good night good night okay so this is how you can make money consistently in the market without p predicting no one can predict anything but based on the trend if it's bullish or bearish we can say with highest probability what's going to happen and highest probability is not prediction it's highest prob probability and we adapt the portfolio after that. If you want to learn in detail all of this, go to bullmayer.com, watch watch the video about mechanical rules. Anyway, hope it makes sense. I think I mean that's also why I love doing these streams because this I mean this idea that you have to adapt that you can make money even though you don't no one knows what's going to happen but it's it's not the it's not the point. It's about adapting based probabilities. It's a powerful idea but people they're slow to get it and I understand it takes a bit unusual way to think about it especially if you your whole life you thought that uh there's some baba vanga who's going to tell you exactly what's going to happen and now you know people speak about probabilities instead speaks about probabilities it's weird it's weird but I feel that the the knowledge is getting out there slowly but surely it is getting out there and that's good that's good then I feel that my uh purpose is uh in the is getting fulfilled. To be a bit, you know, philosophical, a bit a bit philosoph philosophical. Moving on. Does bit Oh, yeah. We just took that. Um, we love the streams. We did more of them in 2026. That's good to hear. We start to hate you, Ivan. See, someone loves, someone hate. That's I mean, both emotions are strong. So, that's uh that's good. That's good. And you you see it's all about ideally guys, you know, you don't want to be messenger of bad news. Let's say you work somewhere. You going to tell your boss bad message. He's he's going to dislike you instead of the bad message. So I'm kind of in that position. I mean, I'm telling you how it is. We've been spot on since October 8th to be riskoff and conservative. We've been derisking this fantastically well. Uh so that means that I I basically had to tell you that it's time to be a bit bearish. And of course, people don't like hearing that, but uh I would rather you not be you be not okay temporarily and then long-term. You see, man, Ivan was right. I mean, that's I if I have to choose I I I would rather choose that than than to uh wreck you all like Mura did. Um where is his list? Because that's not good for the long term. Me, I need a I need a uh profitable community long term. Even if in the short term not everyone like likes what I'm saying uh because I'm I mean we're correct but it's you know portfolio goes down so people still don't like it. They they hope it's going to come back come back. But you see here on the other side you have other people who are extra bullish mega bullish and this is how their portfolio looks like. Giga minus 95% from the top. Okay. Many people told you to believe believe in something. Believe in something. Okay. Okay. Believe in some. Okay. Okay. Okay, believe in something. Giga minus 95 lock in minus 98 man is down 98.3. You need to do more than uh you need to do like a 100x to to come back to break even sigma minus 98. You have to do 50x to come back and it's very hard to do a 50x. So yeah. uh fog m it's very hard you you're going to do a and the reason why you know it's down so much you have to do a 50x during that time people like us we use the the money scanner we can see that okay these things they turn bullish so we can take trades here also and uh outperform all of the wrecked pleb holding down so much so yeah anyway and then that's and then it becomes a problem for them because let's say that we enter all of these [__] when they become bullish. We're going to take profit on the way up and so we're going to be pushing down the price. That's the problem. We have to make so much gains. Like there are so many traders that going to come and join your coin in the meanwhile on the way to recovery and they are going to want to take profit because they use your bra they use their brain in comparison to you. I mean if you hold down 99% then I mean you have to at least acknowledge that the brain could be utilized slightly better. And I'm not saying it as a negative comment. We've all been there. I've been there. I'm not saying it as a derogatory term, but it it is true. When you're down 99, at least you need to acknowledge, man, maybe my brain should have been utilized in slightly different ways. So yeah, you're down, you need to do a 50x. People come in, they do a 10x, they start taking profit, lading out. That's dumping pressure now on your chart. That's why it's very hard to recover like this this amounts because you have now new guys making so much money. you know, they have such big profit and if they just think a bit more than you, then they're going to be realizing it's all for like it's all for like this coins is therefore believe in what do you mean believe like it it is for you got to see for what it is. It is fugazi. It's fugazi, man. It's fugazi. It can still pump a lot. You can make a lot of money trading them. Fortcoin, we loved forcoin 2024, early 2025, we loved fortcoin. It it did us so many so many. We love Fortcoin. when it's bearish, we don't touch it. That's it. That's Anyways, I I've been there. Like I've been everywhere. When I when I'm saying you have to use brain more, I mean, I've been there myself also. You know, you're like, man, what the hell? What am I doing? I'm holding this crap. I thought it was real. I mean, at least have a bit of uh uh reflection, a bit of reflection. But one thing I tell you guys, as long as you stay until next cycle, it's going to be okay. It's going to be just stay until next cycle. That's it. That That's the That's the best decision. um you can make stay until next cycle. Things figure themselves out. I mean people have been mega wrecked in 2013 then they make it big in 2017. The mega wreck in 2017 they make it big in 2021. So don't don't get u uh don't get disappointed or discouraged. Just you know be here. It's all all for guys. It's all for guys. U as long as you the only requirement is that you long along the way at least something. So yeah you're part of the bull trends. You see also the other opportunities because at this day and age in this day and age stocks are becoming more like crypto. They I mean you see yourself you see how stocks are trading stocks are trading like crypto. Like there's there's a lot of pump here. Uh even commodity gold and silver are trading like crypto. Okay. But platinum 126% in 7 months since the flip. Silver in seven months since the flip. Lithium 106% even orange juice. Where is orange juice? It was on the daily I think. Orange juice 36% since four weeks ago on the daily flip. So as crypto is becoming bigger, other classes like stocks and commodities, they have kind of similar returns. I mean it's not like crypto was like it was in 2013 when it was super returns. They kind of have similar I mean look at what Nvidia has been doing. Look at even you know this USB companies you know SanDisk. Do you guys know Sandisk? Did you buy SD card in the last 20 years? Because SanDisk is up 38% in the last two weeks alone. How many altcoins are up this much? Not many. Okay. So, and this is a 43 billion company working with AI all of that as you know. Probably that's what they do. Is that what they do? Because they did SD card. Now I guess it's AI. And look also here we we avoided this uh dump here. Uh and look at what they did in this previous bull trend. Holy crap. I mean yeah there you go. There you go. You got to be in all markets. That's the way of bullmania. Can you check micro strategy on bull mania? Is it weekly guys? You don't want to know. Are you holding are you holding micro strategy? Let me know. Are you holding micro strategy? Do you really want to know or no? Because at this point, maybe it's better that you don't know. Sometimes, you know, ignorance is bliss. You can be in La La Land without knowing. Anyway, let let me check. Let me check. So, in stocks in stocks here, uh we have now category crypto and blockchain. Bam. Very good. Let's check quickly what's happening. Let's check since flip. So Micro Strategy guys is in a deep deep deep bare trend. It's minus 52% since the bare flip four months ago. I mean this is how fast you can lose four months ago. This is in what is it? August or something. Bam. Gone. Need to do 100% gain to recover 50% loss. Okay. when you when something dumps 50% you have to do 100% gain to recover it. Okay? And now work against all of the sellers along the way who are going to be buying it. Because for example, our community likely going to be buying it when it flips bullish. Um and when it's going to flip bullish. Yeah, man. It needs to pump a lot to flip bullish. Here is a good thing, guys. Here's a good thing for Micro Strategy. It is at the 200E moving average. Okay. So that's the only good thing. Let's see if it can bounce. But you see last cycle it bounced here. But here's okay, here's the problem. It took it a long time to bounce, man. It took it 75 weeks even long. I mean, if you count all the way here, guys, this is when I tell you things take freaking time. I mean, 7 one and a half years of sideways. That's what Micro Strategy did last cycle. One 72 weeks of S man. Okay. So yes, it it kind of uh bottomed out here at around 200E moving average, but things take time. I mean in markets they take time, freaking time, especially this, you know, interest rate stuff, macro stuff. It takes time. Uh so the good thing for you is that the losses are potentially not going to be way bigger. uh maybe it drops a bit below 200 week uh but it can still take a lot of time before it returns. So yeah and also see this this is the big big problem guys with news just to point back to this thing that news don't really matter it's the trend that matters we had very good news for micro strategy it's not going to be removed from Msei it's it's confirmed it's not going to be removed from Msei so where's the pump there is no pump trend just like Zcash they had some news that is getting restructured big dump I'm concerned that team is going to leave big dump. That's the same news in a bull trend wouldn't even matter. Just like good news now in a bare trend, they don't matter. So guys, the trend, the trend, the trend is your friend. Trend is the king. News and everything is is secondary. Guys, listen. Great questions. Great. We're already at 51 minutes. Fantastic guys. Fantastic. Thanks a lot for being here. Big shout out to Guzman four times something else today. See you all uh Monday. Probably Monday. Uh, let's see if we do some videos during the weekend, but otherwise Monday. Big shout out to Guzman. Smash up the like, subscribe uh to the channel, check out bullion.com for mechanical rules. Watch the video and go to bulmania.com/partners or click the link exchanges I use for exchange incentives. Guys, that's it. Have a good day and goodbye, guys. Goodbye. Goodbye. Bye."
    }
]