[
    {
        "video_id": "MvKQDMV8azs",
        "title": "EMERGENCY: TRUMP PREPARES FOR BIG WAR (Bitcoin, Commodities, Stocks)",
        "published_at": "2026-01-09T17:48:19Z",
        "sort_date": "2026-01-09",
        "url": "https://www.youtube.com/watch?v=MvKQDMV8azs",
        "transcript": "But um oh yes oh yes guys welcome to is not and we actually have a bit of an emergency because the US is increasing their defense budget by 50% from 1 trillion to 1.5 trillion. Obviously it's a big big change. A lot of money is going to flow into hard assets because they will print a lot in order to accommodate it. But also, we have to discuss the defense industry and unfortunately a potential for a broader conflict. Listen to this. All the signs suggest that we're going to have a big war soon. The president announced that he is hiking the Pentagon budget from 1 trillion to 1.5 trillion. Just announced that. That's the kind of budget that a country that anticipates a global or regional war has for its military. Obviously, we're moving in that direction toward a world war. Sorry. So, how do you position yourself for that? Well, you look at a map and you ask, \"What areas do I want to control? Where are the trade routes? Who's got the resources?\" And if you were to do that, you would arrive at the most obvious conclusion of all, which is the United States has to have a relationship with Russia in order to survive anything like that. Now guys, listen, whether Russia is the the key here is in my point is in my view secondary. The key thing here is that we have a big big big problem when it comes to inflation and when it comes to government debt and this will not help it. Of course, this will not help it. At the same time, at the same time, you do have the expansion of the US towards Venezuela kind of colonizing Venezuela. I mean, let's see how this will end. But Trump said that Venezuela will only be purchasing American products. They're going to give all the oil to the US oil deal. only American products, all the oil to the US. Also, also Trump said that listen, we're not leaving Venezuela, okay? It's going to take years and years and years and years before they're out of Venezuela. And the question is, uh, will they ever be out? I mean, is it five years? Is it is it 15 years? 20 years, is how many years? So you you have an interesting balance here where yes it is more resources at the same time bigger budget but I think it inevitably will lead to big big big printing and big big big expansion of the debt and that's why we have to look at bitcoin we have to look at precious metals as soon guys guys as bitcoin enters bull trend whether it is now whether it is when we are at the 200 moving average is going to be a monumental insane insane signal okay keep this in mind as soon as bitcoin enters bull trend it's a monumental big signal now I mean we're struggling a lot. Bitcoin is struggling a lot. It it it it is risking still to go down here towards this uh 200 week moving average. These things with the debt with budget with defense spending and all of that. This will still take months to propagate throughout the financial system. And if you look at the performance of Bitcoin in midterm years, it's not too good. And right now we are in a midterm year. And so until you have inflation really hitting until you have the new Fed chair which is going to be in May, Bitcoin could very well go to a 200 week moving average and then bounce from there. So the thing we look at is the trend. Then how we arrive at the bull trend that's yet to be seen. We just relax. We sit on our hands. We'll look at what's happening. But something very interesting is that commodities, they're not waiting for any kind of any kind of propagation of capital. They're pumping as is. I mean their trend is bullish like there is no tomorrow. On the weekly you have silver as you know 7 months ago it flipped bullish on the weekly. Then you have platinum 7 months ago also. Then you have lithium four months ago and as you can see it's in hundreds of percent that we have the gains. If you look at the daily it is interesting here for the short-term trend. Lithium is up 60% since 3 weeks ago. Uh, silver is up 51% since a month ago. And orange juice, I mean, surprisingly orange juice, we added orange juice to our money scanner. Okay, orange juice because I mean clearly there is trading happening there. Even freaking orange juice is up 38%. While all is bleeding, while crypto is bleeding, all of that orange juice is pumping and of course all other commodities that are used in the industry and also precious metals are having a very very fantastic time. And as you know to get access to Bulmania to money scanner use the link below bullming.com and watch the free video right here which will explain you the mechanical rules and then tell you how to join Bulmania to get the tools. We also have free charts if you look here on booming.com. We launched free charts for for everyone who just wants something free for all the players will also get something. We we give something for you who want to join us for real. But if you don't okay we have some we have some free charts as well. uh things to look at here is for example the performance of midterm years which we are and as you know now we're in a midterm year. Bitcoin uh is going down in midterm years. I mean it it is where it is. It's always been like that. Uh will it be different? Maybe maybe not. You don't want to bet your money against this. Okay. Uh you don't want to bet your money against this. If we pump, we're going to see it in the trend. So don't go against the the trend both when it comes to the midterm year and also when it comes to the the price. Okay? So, we wait for the price to be bullish. Before we're bullish, we're not predicting that this is going to break like many people try to predict. And as you can see, the current pump we've had in 2026, which was a few% at the beginning of the year, it's not that abnormal for midterm years. So, the green chart here is the is the uh 2026 uh price performance of Bitcoin. And then you have the yellow and the orange chart. Those are the 2018 and 2014 midterm years. So, they actually pumped even more at the beginning of the year. Uh and then they all I mean they all end up in the same place and that's uh between 50 and 70% down. Now will Bitcoin have the same fall? Who the hell knows? But it is midterm year so we're treating it uh we're not taking any chances. I mean Bitcoin loses. Imagine what all are going to do. If Bitcoin does this, imagine what all are going to do. So wait for bull trend. That's number one. Also another chart we added is Bitcoin social risk. Uh this is basically Ben Cowan. He also has this social risk kind of thing. But um I think ours uh free version it is a compliment which is very good and maybe even better in some in some ways because we're not basing it on social media which easily can be tricked uh where you know he's is looking at um you know views subscribers followers to exchanges sell one sell two and so forth and his chart is great so I see it more more as a compliment because we don't look at that uh because social media is very easy to fake instead we look at Google trends uh which is already normalized and here you see that when people are searching for Bitcoin a lot is normally the top here. People were searching and um uh and looking to Bitcoin a lot. It was the top and this time around we haven't really had that except for the Sana top. Okay, Sana top happened here in 2024. Trumpcoin launched here. So we did see a bit of uh social risk increasing but overall uh not really in the same extent as before but we also had institutions but other things but so that's another chart you can check out. Then the ISM chart people love the ISM. This is the manufacturing PMI. How much the manufacturing companies are saying they will spend on new supplies in the coming months and quarters. So, it's a way to see how the economy will grow because if you survey all of the manufacturers and they say, \"Hey, we're going to be buying a lot of supply, you can imagine the economy is likely going to grow.\" And so, the idea here is that when uh the this ISM goes up, Bitcoin goes up and all the tops are when ISM is above 50. And now we didn't have ISM above 50. So some people love trading that uh personally as you know I mean I'm not looking too much at this. I I'm looking at the price trend but I'm just telling you that there are charts okay there are charts charts are here. We're doing all kinds of charts fully fully for free because we want to give back. It's time for you guys to get because a lot of people charge for the stuff you know for like is you have to charge for it. I mean number one following ASM would be very bad because you missed the October 8th top which we did not miss and then you also pay just go check look at for free if you want. So guys, uh, number one, welcome everyone. We have a live stream here. Fantastic. We have and it is a bit of breaking news. The fact that the US is increasing the spending so much, it is a bit of breaking news. When it comes to Bitcoin, I think towards the end of the year is going to be great. When it comes to commodities, right now already bum bum bum, they're pumping like there's no tomorrow. When it is uh bull trend, when when things are bullish, you don't want to fight against it. You just see that it's bullish and that's it. So the lesson overall for 2025 is and beginning of 2026 is that we need to be modern investors that have access to everything. Whether it's commodities, whether it's freaking orang juice, whether it's lithium, whether it's gold, whether it is shitcoin. Forkcoin pumped a lot in 2024 and early 2025. Forcoin pumped a lot. That was the way to make money. Now it is lithium and orange juice during the last three weeks. And if you look at the daily trend, it is lithium, silver, and also orange juice. Okay? So all of the assets they're just they're just tickers in Trading View and we have different kind of emotional attachment. But if you want bull mania in your portfolio that your portfolio goes up, we have to be a 360 kind of investor with everything with that's why we're building bullmania in this way. We don't just have crypto because only cry, you know, just having crypto look here on especially when you look at the trend, man. On the uh on the weekly, you're going to see that most coins are down in a bare on a long in a long-term bare trend. 87% in a long-term bare trend. On the daily, we have most of them having a bit of a relief rally. But on the week, I mean, it's if you're only in crypto, I mean, it's it's not good. It's not good. You have to be in stocks, you have to be in commodities, you have to be in things that are bullish, that are bullish. Now, uh, to give you some, um, uh, things relevant to what we're seeing now with this Trump stuff, it is, of course, defense stocks. And I know many people they they're saying that they don't want to touch defense stocks for moral or ethical reasons. And I fully get that. I fully get that. For everyone else who is going to hell, you can you can check out the following. Uh, RTX defense stock already. I mean, it's up a lot. Someone bought it seven months ago. Did they did they know about Trump plans or not? Uh anyway, it was bullish 7 months ago on um bullmania and uh you know that's why we look at the price on bull and bare flip because I mean someone was buying it a lot. Did they know about all of these escalations? And by the way, Venezuela is not the only one. You also have this uh Greenland situation. What's going to happen there on Poly Market is now 15% that uh there's going to be an acquisition of Greenland. What the hell it means? Uh let's see. Uh and of course Iran and everything it's I mean someone was probably buying up this defense stock uh seven months ago. I mean did they know did they not know? That's why we look at the price guys. We look at the price because the price is telling you a lot even before uh before the news. Then uh Loit of course LMT you can check it here still hasn't pumped too much on the weekly. So yeah I mean just now this one is just now turning uh turning bullish just now. So yeah, keep an eye on that. Uh, next Boeing, uh, as you all know, let's see, Boeing, Boing, not too much pump yet, only 8% since the the bull flip 3 weeks ago on the weekly. Next, uh, General Dynamics GD. Uh, there you go. 30% since a month since 10 months ago. Again, why is it up so much? Did someone know something? Who knows? Who knows? Uh, next you have uh North Rob. Let's see. NOC NOC NOOCC. Maybe I have to type it. Let's see if we have Yeah, here it is. Not not pumping too much yet. And there are other ones. I mean, you can also ask AI for for other defense stocks. We have uh we have uh all most of them if not all of them in our Bulman. So, if you're part part of Bulmania, you can easily check all of them. So, let's see how this will play out. But I find it interesting also and that's that in 2022 you had the midterm year you had a post top year in Bitcoin and you know what happened in the early 2022 you had Russia invade Ukraine. So I mean for me I just my there's you know like war PTSD kind of I have war PTSD uh from last cycle in in many in many ways. I mean in uh several different ways. Uh there there are some similarities which are like impossible to ignore. A double top is number one. Uh here uh people are hoping that uh we will have a repetition of what happened here. Okay, I mean it was guys I will soon show it was exactly the same. But you see there's a bit of a difference here. This bottom right here was downward sloping. When the bottom is downward sloping the chances are higher that it's going to bounce. This one is upward sloping and a noob a newbie may think that it's good. It's like you know uptrend. No, no, no, no. When it comes to this uh relief stuff, a relief rally, you don't you don't want uh this this is no banana. This is no banner. This is buyers trying to get it up and they're getting destroyed here. It is sellers that get uh tired. So, uh if you compare like just look at this uh stuff and then also of course with the escalation, the Russian ship that got captured, Venezuela, Iran, I mean there are all kinds of stuff, but it's the same here. You see double top, then you had this right here. People were hoping please, please, please, please, please. I hope it is like this. I hope it is a repetition of what we saw here. And we're still above. That's another thing. We're still above this previous low here. And people are saying, \"Oh, but we're still above and it's kind of pointing up.\" Uh, yeah. So, uh, let's see, guys. Let's see. Uh, I mean, for us, the good thing is, uh, just like in the last bare market, we stopped doing videos. I mean, we called it pretty nicely. The same thing is now we we are derisked in the way we want. And uh even if we go to 200 week moving average it's uh I mean for us it's uh it doesn't matter like either this either that I have 30% deployed in bitcoin if it goes here fantastic this is going to be a generational buy opportunity like there's no tomorrow uh and uh if before that we retouch the 50 or whatever we we're going to adapt also if we touch the 50 by the way likely it's going to be rejected but the the signal to be bullish people are asking Ivan when is your when is your thesis invalidated like when will you change the allocation. The allocation will be changed when we start pumping in here above the 50 moving average. Basically, we have close above 50 week and then continuation above and especially once we flip here and the average price for us here is going to be kind of the same as the average price of uh selling from October 8th towards the 50 week and then below 50 week and then when we flip the bearish shares is going to be approximately the same. So basically we avoid all the downside we have all the upside is the best. So that's in terms of uh uh BTC and uh BTC being in midterm year and midterm year uh we have we had the issues on geopolitical front uh last midterm year uh chart is kind of the same there are many things that are the same but hope dies last. That's why every day someone is saying Ivan you're wrong for cycle is wrong everything is wrong. I'm I'm showing them, man. We topped out on the same day like all the No, it's wrong. It's wrong. Uh here also this basically topping out the same day when you go from low. No, wrong wrong. I'm telling them, hey man, look at wrong. Everything wrong. I haven't fully wrong. Hope dice last. I know. I know. I know. Guys, at the same time, as soon as Bitcoin is bullish, bull bull bull bull bull bull bull bull bull. Very important. We're very important. If Bitcoin goes towards 200E moving average, bull bull bull bull bull, you can even start adding even if the trend is still bearish. If it's towards the 200 week moving average, you can do a sin. You can you can even buy a bit in a bare trend because it's I mean 200 it's cheap, man. It's cheap. It's cheap. It's cheap as hell. Yes. Sometimes it can still drop like another 30% below. It depends on who you are. I mean who you are. If you're convinced about Bitcoin buying at the 200 week, you could do even in bare trend. If you want to like optimize your portfolio, optimize like really be serious, then wait for bull bull flip. So guys, that's that's quickly about what's happening here with the defense spending. It will lead to inflation. It will likely to defense stocks pump likely to Bitcoin pump um especially later this year. We're not front running that Bitcoin pump before the uh 50 moving average as being above 50 moving average and so on so forth. Uh now something else that's happening here is that you have Trump building a wartime command economy without declaring war. I mean you can read yourself here but basically he's saying you know buybacks or what you cannot do buybacks defense are currently issuing massive dividends to their shareholders. This is actually an argument against defense stocks. Uh let's see if he can actually get get this through. But um you know defense stocks will pump if they actually can make the shareholders rich. Okay. if they can get big dividends this you know 1.5 trillion u new budget if it's going to go to defense stocks and then they can make a lot of profit I mean that that's the reason for buying defense stock but if Trump actually can change the game so that he can restrict how much the shareholders get I mean not nationalize but a bit move towards nationalization slightly I mean you can read the text yourself you know executive pay packages in defense industry or exor I mean it's a bit of government controlling how much you're paid, how much dividend, this and that. So read yourself here, but just a caveat as a thing uh against the defense stock uh pump. Okay, so a small caveat, maybe it's going to be a big caveat if he actually gets uh you know powers to control how the defense companies operate. I mean you look at Russia like they're basically nationalized like it's you know it's government decides everything you know you were doing this kind of fridge before now you do tank that's in Russian you were doing this kind of appliance okay now you do you don't do that you do you do this we need it for so if it's going to be something like that they're controlling what you're doing how you're building your pay your dividend obviously then the equation is a bit different for the defense stock pump but let's see it's far away from that um now moving we have a bit of news when it comes to uh XRP. So apparently XRP ETF will not happen at least with the wisdom tree because the investors are not really that interested currently when it comes to ETFs. I mean likely XRP is going to get ETF in the next cycle. But if we look at the performance of the ETFs since the start of the year, we did have two massive days right here in early early. Well, I mean we still early Jan but the first days basically 400 in 700 in and I mean this was strong but as you know this follows the price when price is down these things also go down big time. So now it's minus 2 250 minus uh yesterday was minus 500. So basically yeah almost all of this is uh is now out. So let's see guys institutions overall they're not I mean there's not big net there's net outflow. You look here it's net outflow net outflow net net outflow. So until that changes the bull market will have to wait and for now it is I mean it's a typical midterm year guys. I mean is it is it is what it is. I know the hope that last but for now until further notice it is like that and if it changes we're also going to change. I mean listen if we pump above 50 we go to bull trend we're going to be bullish. I mean that's it. That's it. That's it. We're going to sell we're going to sell orange juice. Orange juice which is doing very very nicely now. Where is it? It's on the daily. It's on the daily. Here, here. Very, very nicely. Dump the orange juice. Dump liium. Even the cows, guys. I mean, live cattle, it's up 8%. And then you look at your What did your do in the last one month? Go check it because even live cattle commodity, man. What is this? What is this? Anyway, anyway, uh what else? Let me go through a few news and then we'll go to Q&A because guys, I've been missing I've been missing the chat. We've been doing a bit of pre-recording. I've been missing the chat. So, we're going to go to Q&A in a in a second here. So, Sulana is going to launch SKR token for Secretone on January 21st. There you go. Um, CryptoQuant CEO, big shout out, but I mean, he's been a bit wrong. He's a great guy, but he he's he's been wrong. So, he's saying we're going to be chopping. And yeah, maybe. But all in all, it's bare trend whether it's chopper or not. We just look at the trend. And I mean, that's it. That's it. That's it, guys. Some call to actions before we go to Q&A. Go to bullmania.com if you want to get access to bullmania to the money scanner the software use for the flips. I mean as you can see it's like I mean it's it's priceless. I mean it's priceless. I mean if you get the signals in real time it's priceless. Uh look at stocks you get the signals in real time. I mean it is look at the daily. I mean it's it's price I priceless. It's priceless. So watch the video bulmania.com and if you are trading check out bullmania.com/partners basically the link in the description called exchanges I use. If you see description exchanges I use and sign up on buy bit you get nice big juicy fantastic signup bon you can go long you can go short you love that bit tuning is the same if you want bionx bots it's here I mean everything is here so use that and on this note let's go to Q&A and big shout to dab dab is time stamping us bum bum bum bum bum today timestamping big shout out to Dub Dab joined the chat right before we were going live Mr. Bara is right here on the mug and right here on the shirt. Coffee fantastic and let's go to Q&A questions answers debates. Let's go guys as soon as soon as soon as soon as possible. Live is back. Yeah, I was I was going to do live uh tomorrow and uh the thing is this with the trumpet. It was just like breaking news. Okay, let's go. Let's go. I mean defense budget increased by 50%. In my book is it's big. It's one of the biggest expenses that the government has. So if they go from one to 1.5, obviously it's a breaking news is going to affect the economy in one way or another. So we have to discuss we have discuss very quickly. I haven't sounded like Borat for some people say that. Uh let me know what you think. Problem uh is orange juice uh has Oh yeah. So by the way another thing people have been asking I saw it also in the chat here but in in our discord as well. Um what and I had the question myself also. Why is it that there's only orange juice? Okay, when you look at the futures markets, it's only orange juice that is trading. You cannot find apple juice. You cannot find, you know, pineapple, where is grape juice and all of that. And apparently it is for historical reasons where in the past when all these you know futures markets were established uh at that point in time orange like the actual fruit orange it was concentrated in Florida. a lot of oranges across the world. Um well the it was grown there and then exported across the world. So whenever someone want to buy orange a lot of it came from Florida like now this is from AI. I'm telling you what AI told me. If it's wrong go to go complain to AI. I'm just telling you like what what I learned yesterday. So when you have concentration of where these oranges are growing you need to be able to hedge. So that's why a lot of companies needed hedging in case there is bad weather in Florida or earthquake or whatever you guys have there. let me know there needs to be hedging. So a market futures market was established or oranges because oranges had this concentration risk because it was one geographical area where a lot of them were coming from and now I read now it's a bit different now so orange production is distributed now way more but the market is still there the market is is still there and other fruit other juice I guess they didn't need it or something they they were distributed already but yeah a a bit interesting um a bit interesting stuff here with the with the orange And I mean we're looking into adding more stuff also. Let me know guys what kind of commodities you want to be added. Obviously we have the most important ones whether is lithium silver. I mean we have we have most important important ones here also. But yeah sometimes I discover a new one like oranges. I I didn't even know you can trade freaking oranges. And then I see it's pumping like what the hell is this? It's I look at my how the have been going. It's crazy. And then you see orange 38% nice up. Very very nice. H let's go. But in all seriousness, 50% increase in defense spending is big. 500 billion. Yeah, it's quite big. Absolutely. Orange juice for the orange man. I mean, what percent of your portfolio is Well, I don't have orange juice. I mean, in al we just added yesterday because I found it yesterday. I was like, what the hell? It's I I don't have it. I don't have it. I mean, what are your thoughts on the colonization of Venezuela? Oh man, it's complex topic. You ask me about the my thoughts about V. I can write a whole essay. I mean, a whole dissertation on it if you want. Uh, I mean, simply put, listen, most Venezuelans I know, they are very happy. They're very happy. Uh, those that have immigrated that didn't like the regime, they're extremely happy. So, that's my data reading. And I mean I can imagine them being I mean it's you go from isolation you go from socialist dictatorship to US colony. Yes. But at the same time is it better or is it worse? I mean that's that's the question. It's not like Venezuela with Maduro was benefiting their citizens with the oil. People say oh no Trump wants he wants the oil but listen before it was Madur and France. Now it is Trump and France. And um all in all it's a big question. So, I mean, if you are from Minnesota watching this, you can probably answer this, but my guess would be that they're not they're not too sad that that Madura got to fly an airplane to New York. I I would guess they're not too sad. Uh, not at all. And then, I mean, you look at uh, you know, look at Puerto Rico, look at other US uh, US col colonies, then compare them to, I don't know, Somalia. Well, now Somalians are in Minnesota, but I mean, you understand that a lot of prior British colonies, but also like US controlled uh places. I don't know if you call them colonies, like is Puerto Rico colony? It's like, you know, US controlled. I mean, not too bad. Not too bad. Better than uh better than in Vela, most of them likely. But listen, it's a bit outside of my we're here to discuss the markets, but you get the point. You get the point. I think there are many people in many countries that would also hope maybe there is a the helicopter that can take their guy and uh we can do an oil deal or like some some trade deal with orange man. Let me know guys. Let me know what you think. And Maduro man, what the hell? Such a stylish guy with the Nike. I I also read Let me check Nike stock by the way or Nike. You say Nike, it's wrong. It's Nike. Repeat after me. Nike. Nike. It's not Nike. It's Nike. Anyway, so uh Nike not pumping too much, but I I I read that they they sold out that um that uh you know, how do you say the the thing that Maduro had like this sports thing that sports wear guys outside of crypto? My English, I don't know words. I I can speak about crypto in English, but you know what's this called? You know, this overall, how do you say this jumpsuit? Jumpsuit. Jumpsuit. Jumpsuit. Exactly. jumpsuit. So, uh, jumpsuit. It's sold out. It's sold out. I will try after the stream to buy it. I I want next stream I want to be in Maduras and then with the headphones like people are doing AI videos with him like DJing. Exactly. Dr. Disrespect. So, yeah. Uh, that's that's my unprofessional unlicensed thoughts, but uh I mean probably correct probably correct. Um, if you are from um from Venezuela, let let us know in the comment section. Staff at Nike will tell you it's pronounced Nike. It's Nike, man. It's Nike. It's Nike. Nike. Repeat after me. Okay. More questions. More. Is that a Wimbledon sweater? Exactly. It's Yeah, it's a bit of Wimbledon. A bit of this, a bit of that. It's uh but it's it's bare. Most important is bear. We have bear everywhere. And in the bull, I haven't found something like this with a bull. So, it's going to be bear. It's going to be bear. Mr. Bara, I'm waiting for another one like this. Also white, but with another kind of design. And that one doesn't have Wimbledon. I think that one doesn't have I I need to double check. Yeah, exactly. This one is Wimbledon. What resources does Greenland Oh yeah, that's another one. See, that's another very important thing. When it comes to resources, Greenland has quite a lot. And let me see this map. I saw a map the other day. Here, here, here. They have quite a lot. So, obviously, orange man needs it for national security. But listen, most likely the resource. Okay. Uh what you have here titanium, you have uh zinc, they have this and that it's uh yeah platinum. It's all kinds of stuff. All kinds of stuff. It's a lot of stuff there. It's a lot of stuff. So yeah, I'm Let's see what's going to happen here. with uh odds now being 15% chance that Trump will acquire Greenland before 2027, these kind of maps, they're going to be more and more popular, spreading what can be adopted here. And you know, the thing that I appreciate with Trump also that he doesn't even hide it. He said, \"We're going to take the oil and with we're going to take the oil. Uh we're going to use it. They're going to they're going to transfer transfer the oil. So that's that's the goal. That's the uh that's the objective. So I think it's it's pretty clear here as well. He he's up front. I mean he's we need the oil. That's it. That's it. That's it. Can we use electricity on all mechanical so Trump can stop? Let's see. Ah dirty. Dirty. So so Trump doesn't go after oil. Not happening, man. Not happening. The renewable like this electricity stuff. It also needs a bunch of precious metals. You see here you you need all these precious metals and all of the other industrial metals. Why is lithium up so much? It's because uh you have EVs, all of the battery stuff. Okay, they need they still need all of this. I mean they you need resources. You need resources. So unfortunately there's always going to be fight with resource. Okay, there we go. Mr. Garden, what is this? I woke up at 4:00 a.m. See you live. What happened? Yeah, re-watch re-watch re-watch the the stream. We we had to do a bit of urgent news as Trump increased the defense spending by 50% in the US, potentially preparing for a wider escalation. Let's see what's going to happen. And uh yeah um all in all there are many similarities with uh 2022 guys. Military escalation being one of them, chart being another. uh you saw uh initial pump in in in into the year uh is very common for midterm years also. And if you want to see these charts yourself, go to booming.com and then it's a button here called free charts. Boop. Right here. And uh yeah, here you can you can compare all the midterm years. You can see how the current 2026 green one is doing against the other midterm years. you can see uh topping years when Bitcoin topped here 2025 in comparison to the last ones. Well, I mean all of them are smaller and smaller. This is also why you know sometimes people are saying that oh no well well actually I did a video yesterday about this four cycle. You should watch it if you if you didn't see it. Uh all the videos this week uh I did a video on why I'm not buying the pump. I did a video on um on uh why I'm not believing in the liver more pattern on Tuesday and yesterday I did a video on the foyer cycle. You should watch all of them because this standalone videos guys they are a bit evergreen. I mean, as much as they can be when you're analyzing a market, but probably for the coming month month, this standalone ones we did during the week, they they're super valid and that's also I I I wanted to a bit of standalone. So, we have a bit of evergreen stuff and the message is super condensed and everything. So, go go and watch them. But there one of the guys in our discord was saying that, oh no, it's not the same. You know the cycle is not the same because look at previous cycles how much they pumped here and here and here and look at you know current one did not pump even though the top the top date is like exact as the other cycles he was saying that yeah because we didn't pump too much is it's invalid it's everything is invalid well the same thing can be said here when you look at the topping years uh you see that 2021 when we topped it was also very small in comparison to 2013 and 2017 I mean so it's all relative we have dim diminishing returns we have diminishing returns it is what it is And the 2025 was a weird one because we did go to alltime high but it just stopped out in October. So before the year ended that October pumped to 127k or what it was it had time to deflate. So it's it's a bit interesting to analyze these different things because technically we did have quite okay year. I mean to the top it was uh I mean around was around what is 30% or something like that and then it deflated to minus 5. Uh but all in all these different things are models they and and they can be more or less more or less useful. uh the the the the thing I replied to the guy listen it's it's a model it can be more or less useful and uh the way we used the 40 cycle this this time around was that when Bitcoin started to go bare on the daily when it did the fake time high when it went below the 50we moving average when it went bearish on the money line then for cycle for us was a confirmation it's not the grade one signal it's grade two sign it's confirmation of the trend so for us it was very useful it was extremely useful It gave extra confidence, extra confirmation. Um, and I mean that that's it. That's it. No model is 100%. I mean you will not have exact repetition of things year in year out. But it's all about how useful is. So for me it was very useful. I don't know how it was for you. Let me know in the comment section. Best exchange to trade commodities. You go you can go to capital.com. Capital.com. They have most of it. Most of the commodities you can buy orange juice I think on capital.com uh well I don't think I know that you can buy you can buy it there capital.com yeah go there should be available in the US people always have issue with us but should be available worst bull run for alts uh yes but um you know these are the altcoins go to the weekly now these are the altcoins the metals the metals right here. Bum bum bum bum bum. Let's look at the worst performing um commodities. Cotton not doing too well. Cocoa doing very bad. Natural gas I guess because of the Venusella stuff. They have a lot of gas. Sugar, oats, leanhog, oil. I love that it's leanhog. Why it's leanhog? You know, commodity stuff, guys. I haven't I didn't trade commodities before. Well, outside of precious metals, like all of these other comments, I didn't even like touch them before 2025. So, I mean, to me, it's also a fascinating world. A lot of the tools that we're building here, it's I mean, I'm building for me primarily, but then I I know everyone else finds this useful also. You know, why lean hog? Why not? Is there also like uneven unlean hog like tough hog? Let me know in the comment section. All of the commodity traders. So, yeah, I mean, we had to adapt. That's why, like you say, all coins did not do well. We had to adapt. We had to adapt. We had to discover a new market. The some something is pumping somewhere. Okay. Some somewhere something is pumping. I'm only buying. Oh, yeah. Fat hog. Okay. Yeah. So, there's lean, there's fat, but you can only trade the lean one. And also, the guy asked where to trade stocks. It depend you have brokers in your country. I mean, it depends on which country you're in. You can trade it on in the EU if you're in Europe, you can trade most stocks on Revolute. Super simple. Then of course you have more like professional brokers with Schwab with uh in in Europe it's very frag like this professional ones. It really depends on your country but if you want the retail one then it is Revolute. Uh they have it's you can be anywhere in Europe. For US you have Robin Hood for Asia I don't know what you have something you have let me know but uh it's there are some apps like Robin Hood entire US or Revolute entire uh Europe but they're retail they're retail so maybe you're going to have a bit higher fee maybe but you're going to have nice app nice UI and many of them also have very low fee but then if you want more professional you know you your private banker you depend you can you need to speak to your bank or or also there is this um uh what's called uh the red one. What's it called? Very very big also. I don't remember what it's called. Oh yeah, interactive broker. Exactly. Interactive broker. That that one is also I think worldwide. Uh but it's not real. It's like CFDs, but you can speculate there. Can you withdraw with Revolute? Yeah, I mean Revolute is actually very interesting because you can deposit crypto into it. I think you can you withdraw crypto from it? I think you can withdraw also but it's it's one of these banks where you can actually deposit crypto into it. So it's quite good. Now the problem with Revolute is that if you have some issue there is no one to call so you will have to chat with them and that may or may not be helpful. Some people have been saying that they've been banned this and that but you know it comes with the with the thing. It comes with it being a retail app. So you you cannot call anyone. There is no you cannot visit the office. So if you you have any issue KYC or whatever you you will not contact anyone. So that's the downside. The upside easy nice app you you get going in like 10 minutes you have stocks you have crypto you have everything but that's the problem. There's no you're on your own. You can buy and deposit crypto but not withdraw. I guess that yeah maybe you cannot withdraw. Maybe maybe that's true but deposit you can for sure. I know that it's all about the oil. It's about the oil payment settlement in USD. Yeah. Yeah. I mean, no one is hiding it. Uh let's see. Trump did. I think in this New York Time article, which is behind the pay wall, I think he said that, you know, we're we're here for the oil. I think he literally said that. I I don't think he's hiding that for the oil guys. uh in that um article where he said they're going to be in Venezuela for years. They I think he said we're going to be there for a while. Uh and yeah uh where is this? Let's go to latest man. It's behind the I don't want to pay New York Times guys. I don't want to pay now, but I believe I saw it. If you guys have New York Times subscription, read it and confirm the comment section. US president and his advisor planning AN INITIATIVE TO DOMINATE DOMINATE the cell and oil industry for years to come according to Wall Street Journal. Exactly. Let's see. Maybe this site has copied the article. They're going to dominate the crap out of it. Exactly. Uh, you know, it was with these woke guys before when they said, you know, we're going to bring democracy and they take oil. Uh, now with the nonwoke, it's there's no no more of that. We just say, you know, they just take it. Uh here Trump said he expects US would be running and extracting oil from its huge huge reserves for years. Exactly. No more woke, no more bringing democracy is extracting oil from the huge huge reserves. Oh yeah. Guys, that's it. That's it for today. Smash on the like. Subscribe to the channel. See you all very soon. See you tomorrow. Big shout out to Dub for time stamping us today. Have a great day. Check out booming.com. Watch the free video. Check the exchanges I use. And goodbye guys. Goodbye. I got"
    }
]