[
    {
        "video_id": "k20uF7LEBmk",
        "title": "Palantir Stock Update: What's Really Happening With AI Stocks!",
        "published_at": "2025-12-23T04:48:31.000Z",
        "sort_date": "2025-12-23",
        "url": "https://www.youtube.com/watch?v=k20uF7LEBmk",
        "views": 3343,
        "duration": "00:10:23",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch and happy Monday. I hope you guys are having a good start to your holiday week as we kind of gear up for the holidays here. Ready to take a little bit of a mental break from the markets. However, trading is still live at action. What we see is a little bit of a float up today. Uh the broader index doing quite well and some of the individual names that we've been talking about on the channel are doing quite well. We're also seeing some consolidation across the board and we're going to be talking about, you know, what is my own personal opinion regarding the whole Santa rally? Are we going to get that? Uh, it seems that time is closing in here. There's only so many trading days left. Not a ton before we enter 2026. And I think that's going to be quite an interesting year. Uh, but we'll be talking about Palanteer, the AI data center trade, crypto, BMR, kind of all the big things we've been talking about. So, if you're new or returning viewer, hit that like button, subscribe for daily videos, and let's see if we can hit 30,000 subscribers. And also, if you want to talk more on X, follow me down below. I'm trying to get more active on there. Now, popping up on the screen here. The Palenteer currently is at 194 basically. Uh it's just holding steady in the overnight hours and it basically didn't do anything today. It consolidated uh which isn't necessarily a bad thing. Uh especially because Palanteer has liked previously to consolidate between this 170 and this 185 area. This whole consolidation zone, it's been liking to hang out here for a while. So, a little bit of consolidation right underneath this $200 kind of resistance. the psychological and we see a little bit of a technical resistance there. I think is awesome for Palenteer, especially like I said as the broader market is kind of floated up today. So no big individual news here. Palanteer is just cooling off taking a break at about 194. Um I still think there is a chance here in the short term for Palenteer to test the 200 again uh depending on what we see from a macroeconomic situation. Um and as that leads here, let's talk about the general market here. You know, the S&P 500 is now at 6878. Came up about 6% today. Uh, some of the movers that we did see that helped that was Nvidia came up about 1.5% currently at 183. Uh, so some of these MAG7 stocks doing a good job to hold up the index. Um, anything above 6,800 for the S&P 500, I like. Uh, personally, what we've seen, you know, is a lot of consolidation. Just looking over here on this month, a lot of consolidation and support above that 6,800. Of course, of course, we had that recent dip here to the 67s. Uh but what I like here, we'll probably see testing of alltime highs here. Now, the question is, are we going to see a breakthrough? Uh the only reason I do question that is because technically what we've seen is any type of basically runups that we've seen, especially in the morning, uh all of a sudden we've kind of seen that intraday sell-off. uh what seems to be is a lot of buying pressure that comes and all of a sudden it kind of gets exhausted. Uh if that exhaustion takes place, if all of a sudden we don't see a breakthrough, that's where we could see maybe more consolidation or even maybe a retesting of these lower levels and maybe around 6,800. But nonetheless, of course, I think the bullish opportunity is still there. However, I am seeing just some personal signs of exhaustion. That's not necessarily a horrible [snorts] thing um leading into the year here. uh one of the key expectations that we do have you know for tomorrow in terms of macroeconomic data is going to be the GDP the initial estimate now this I believe is a delayed uh actual economic data release from the government shutdown uh followed by Wednesday here and then we're going to be heading into Thursday where we're going to see a shortened trading day on Wednesday remember and of course Christmas markets are going to be closed with Friday reopening uh initial jobless claims are coming out on Wednesday so some macroeconomic situation However, you know, with these AI stocks, whether they can retain their leadership, we are seeing a little bit of buying pressure across the board. Um, in terms of the whole goal of the S&P 500, you know, hitting 7,000 by the end of the year. Personally, I don't really care if it hits it by that, you know, by a certain time. Uh, I don't think it just needs to be shot up to 7,000 by the end of the year. Um, if that does come, I mean, that'd be awesome. Uh, because personally, I do have a bullish perspective in terms of a long-term scenario. Uh but talking about what we've seen looking at Cipher, uh didn't move a ton today. Uh basically kind of consolidated on the day. Like I said, this kind of moved up here a little bit to about 17. We saw the same thing with INE that had a little bit of some buying pressure. Moved up here to about 43 on the intraday. And then we saw a pull back down here to about the uh 41 area. Uh what I like about INE from a technical perspective is we kind of have this triple bottom area around this 4041 spot. I think as long as this support can hold and if we see some volume coming in here and hoping to bring some more buying pressure into high that's where I think we could see a possible move back up to the 50s especially any type of um announcement or lease deals or anything like that. Uh any type of specific deals individually to a lot of these stocks I think would be important like Nibbius looking at things like coreweave um you know nas actually did quite good today up about 4%. So, data center stocks did well. Uh, like I said, what we're seeing and you see the same thing with NBUS right here on the intraday. Nice huge green candle bar here at the open pushes up here to about 96 and then we kind of see the sell-off. So, this is where kind of we're seeing this exhaustion across the board. Um, we're probably going to see kind of similarity across all these different stocks. I don't have to go through them right now, but just looking at the general type of scenario that we're seeing. Um, and of course, this could be some just some cooling off. we maybe might might not have the volume here during the holiday week to push this through. So, like I said, not necessarily a bad thing. Um, but however, still bullish longterm on Cipher. I ran specifically hoping to see these stocks kind of regain some momentum back to the bullish side. Uh in terms of some of the uh more fint tech type of platforms looking at Robin Hood. Robin Hood currently above its 50 and it's 200 moving day right here at 122. You see SoFi SoFi's been launching a lot of products recently. I'm actually bullish on SoFi right now. Right here at 2736. You know, I think we've kind of seen a float up with SoFi and any type of bullishness. I think SoFi could kind of re-enter and test these 30s again. I think that'd be a really healthy spot for SoFi. I think there's a lot of opportunity here behind that. Looking at the space trade, uh talking about like ESTS right here, Rocket Lab, we've seen an incredible runup and this is just because of the theme momentum that we've seen, of course, with the whole Space X IPO type of rumors that we saw. You know, with that, you're seeing a huge theme here that's rotating. You had the AI data centers and spade uh space. A lot of liquidity coming into these names. Now, as I do like this stock as an individual, but personally, you know, it's kind of hanging out here around these previous all-time highs. You're going to have all these bears coming out here calling double tops and stuff like that. Um, it's not necessarily the worst thing. However, I think I would personally, you know, and I didn't add down here at the dips or take advantage of these swings down here just because I didn't want to be overexposed uh in my short-term type of swing trading portfolio. So, you know, right here at the 60s, that's where I think, you know, AS and these things become more attractive. I'm personally not going to chase up here. However, for the people that are along and are holding equity in that, you know, congratulations to them. Some good positive moves across the board. Looking at some of the stocks, I think that brought a lot of uncertainty into the market. That was like Oracle and Broadcom finally seeing a little bit of some buying pressure and relief. What you see here, Oracle has had a nice local bottom here at 178 and that has now returned up here to about 200. I think once it breaks through the 200, is able to reclaim the support area, hold some consolidation there for even a few trading sessions. I think that'll be incredibly important for Oracle as this was one of the main stocks that came remember from 222 all the way down here to 177 draw 50 bucks after, of course, the capital expenditures uncertainty that really spooked the markets. However, I think a lot of that is kind of phasing behind us uh in terms of the tech giants. You know, of course, we're still seeing a lot of demand into the AI data center leases. So, I think that is still the bottleneck, the power demand that's going to be needed to be required for AI compute. Now, if we toggle over to cryptocurrencies, talk about that cuz a lot of people are losing patience for crypto. Uh you know, in terms of Bitcoin and Ethereum, they're just kind of hanging out here. Ethereum is like, hey, Ethereum is like, I really don't want 3,000 right now. I want to keep losing it. That's basically what's happening. But Ethereum, you know, needs to get a nice push above 3,000. I think we need to see Bitcoin to reclaim 90,000 to see more bullishness coming back into here. Uh, nonetheless though, you in the terms of BMR, you see Tom Lee that's still accumulating Ethereum at a rapid pace. And Ethereum or Bitmine is really holding this nice support level right here at about 31. You know, Bitmine does have some decent support at about 30 even though this is highly correlated to, you know, of course the volatility of Ethereum itself. Uh but Bitmine itself and Tom Lee now have over 4 million Ethereum right here at an average cost of about 2,991. So literally right now they're at their average uh right where Ethereum trades at. Um they also are trying to work a course towards their alchemy of 5%. Um and with that they're achieving that rapidly quickly or pretty rapid. um they're at like 3.5% I think now the Ethereum circulating supply and then once they introduce staking and stuff like that it's going to bring a lot of revenue into their actual balance sheet and just looking here you know in terms of the cash they still have 1 billion right here they have 193 bitcoin so a lot of exposure across the board uh personally you know with the administration and with the regulation that's bringing more clarity towards crypto you know I think crypto is going to have its run the thing about cryptocurrency is typically you know we do see it when it does have its run it usually goes incredibly quick and we've even seen Tom Lee address this that you know that these runs can happen uh in just the matter of like 10 days out of the year. So these moves happen quick and sometimes it just kind of hang out here as people anticipate this and especially with the whole Q4 rally what we've seen in seasonality, you know, that's just not all playing out right now. Um so I think it's just kind of one time when it'll come is when it'll come. Uh but of course nobody can predict that because you even see the top people like Tom Lee that have had some insane price targets that did not come through uh and probably won't come through unless some crazy things happen. Who knows? Let me know what you think down in the comments. Peace out. Take care and I'll catch you guys later."
    }
]