[
    {
        "video_id": "a4xpA5d9rls",
        "title": "Dan Ives: This Stocks About to MOON!",
        "published_at": "2025-12-23T12:00:00.000Z",
        "sort_date": "2025-12-23",
        "url": "https://www.youtube.com/watch?v=a4xpA5d9rls",
        "views": 27127,
        "duration": "00:10:47",
        "transcript": "Dan Ives just called out a stock he thinks is being underestimated and dropped a stat that should make every investor pay attention. Only 3% of American companies have even started their AI journey. I'm about to break down why that matters and what comes next. >> All right. You say investors are underestimating Microsoft and Azure growth. What what are we not seeing that you're seeing right now? >> I think look the last month we've seen 25 30% of the deals accelerated. I mean, you're seeing these use cases explode. I think we go into January when they report the quarter and I think as the forecast continue to move higher, look, I think the stock has a six in front of it, you know, as we go into 2026. That's really the call here. This is a table pounder in my opinion, especially on hypers scale or investors giving it no respect. It's almost the Rodney Dangerfield, the software the way they're treating it. [laughter] >> I love the analogies as always, Dan. The Rodney Dangerfield. I do want to talk about valuations. That seems to be one of the things really pressuring the tech trade. Also some concerns about the AI buildout. Are you saying Microsoft is immune to those concerns? >> Look, I get the concerns, Frank, but I mean the reality is all our checks are showing I mean demand and supply is what 12 to1 you when it comes to Nvidia chips. The hypers scale bill that only 3% of US companies have gone down the AI path. I think when it looks to valuation I think investors are underestimating the growth. I think street numbers are underestimated here anywhere from 15 to 20% for 2026. And that's really the call as it plays out. I get the white knuckle moments now and the bear sort of winning the last few weeks. They're not going to win next year. I think tw I think tech stocks are up 20 25% in 2026. >> Dan Ies says Wall Street is making a classic mistake with Microsoft. They're looking at a company sitting at the center of the AI revolution and treating it like it's yesterday's news. Meanwhile, the data tells a completely different story. Deals are accelerating, demand is overwhelming supply, and we haven't even scratched the surface of enterprise AI adoption. Wall Street has a pattern. Every major technology shift creates a window where institutional investors can't seem to see what's right in front of them. They get anchored to old frameworks. They demand proof that only becomes obvious in hindsight. We saw this with cloud computing. Go back to 2010, 2011. Amazon Web Services existed and was growing. The smart money understood that renting computer power over the internet would eventually replace buying your own servers. But most of Wall Street kept asking, \"Where's the profitability?\" They wanted the new business model to look like the old one before they'd believe in it. Microsoft went through this exact cycle with Azure. When Microsoft's current CEO, Satia Nadella, started pushing cloud in 2014, analysts were skeptical. Microsoft was a Windows and Office. Today, Azour generates massive revenue and nobody questions it. But getting there required years of Wall Street underestimation. Now, we're watching the same movie again, just with AI instead of cloud. So, why does this keep happening when you're managing billions of other people's money? Being wrong in a conventional way feels safer than being wrong in an unconventional way. If you bet big on Microsoft's AI growth and it doesn't pan out, you look like you got caught up in the hype. If you stay cautious and miss the run, well, everyone else missed it, too. The incentive structure pushes towards skepticism even when the evidence points the other direction. But the real story is that 3% number. Only 3% of American companies have supposedly started implementing AI. We're sitting here in what feels like the middle of an AI explosion. Every headline mentions AI. Every earnings call references AI. And the actual enterprise adoption is just 3%. All the noise we're getting at the moment is happening before the real adoption wave has even begun. Think about what that demand curve looks like. Right now, you have the early adopters, the tech companies, the big banks, and sophisticated enterprises with internal AI teams. They're the 3% competing for limited AI computing capacity. Now, imagine what happens when the next wave shows up. The midsize companies, the regional businesses, healthcare systems that need AI for diagnostics, law firms, insurance companies, logistics providers. When that 3% becomes 10%, demand multiplies. When 10% becomes 25%, today's supply constraints will look quite small. Microsoft is positioned at the center of that coming wave. They have Azour for cloud infrastructure. They have the open AI partnership for AI models. They have 365 embedded in hundreds of millions of workflows. They have enterprise relationships with basically every major company on Earth. When the 97% starts moving, a huge portion will move towards Microsoft because Microsoft is already embedded in their operations. This is what Wall Street is underestimating. They're pricing Microsoft like the AI story is mostly priced in. But if only 3% of companies have started their AI journey, how can the AI story possibly be priced in? If you want to know more about the potential of AI in companies and how it all works from one end to the other, I built a course that teaches everything from first principles to compute and physical AI. I did it in a simple, approachable way. If you buy now, you get lifetime access, and pricing only goes up each time we add new modules. So, if you want in at the lowest price, now's that moment. and it could make a good Christmas present for you or someone else. Back to the video. So, if we're only 3% into enterprise AI adoption, what does the next phase actually look like? Dan Ives has a specific framework for that. And it's all about when AI stops being an expense and starts generating returns. >> 2026 will be an inflection point in the AI revolution. That's just one of the predictions Wed Bush's Dan Ies is making as he looks ahead to the new year. Joins us now as you see. It's good to see you. >> Great to be here. >> What does that mean? an inflection point. >> I think it's about the monetization of the AI revolution specifically on the software side. You know, I think obviously Palunteer, we've seen that front and center, but you look at MongoDB, Snowflake, the use cases. I think really the infrastructure buildout. I mean, this is really going to be a key period to show the next stage of the AI revolution from a software, cyber security, and infrastructure perspective. >> All right. So the headline here is that you think tech stocks are going to be up over 20% in 2026. When you say you're talking as a sector, >> the sector is going to be up 20%. >> I think sector is going to be up 20%. I actually think large cap tech in terms of like some of the mag 7 names could even be up more like I think like a Microsoft could be up 30 40%. I look at names like Google. I look at what ultimately in my opinion you have 3 to four trillion that's going to be spent next 3 to four years. You're just starting now this next phase like I've talked about third inning in terms of this non-ining game but but now the second third fourth derivatives play out across software across infrastructure across cyber security and that's why I just anytime you talk about AI bubble I mean I was just in Asia right for 3 weeks I mean demand and supply is 12 to1 and US for the first time in 30 years ahead of China >> what isn't known about the Microsoft story at this point and why is the stock underperformed relative to some others why could it possibly be up 40% next year. >> Yeah, I think to some extent if you like, okay, it's not just Microsoft, it's what Google's done, they've had a lot of success on cloud, it's obviously AWS and what Jassis's done is, you know, is is impressive, but I think what investors are underestimating is we've seen deals accelerate 30% from Azure from our checks. So I think as Microsoft comes out in late January as you start see the numbers play out I mean I I think it could be conservative 30 to 40%. I mean in my view like Microsoft's a name where when I look at large cap the table pounders here Apple and we could talk about that Microsoft and I've said I think Oracle the selloff here way way overdone that like I think it could be a $250 stock. Why are you so sure the sell-off is overdone in Oracle? >> Because I view it as like when you think about the AI revolution, the stack and their install base and all the and all the checks that we do. I'm not saying there's not going to be bumps in the road in terms of the data center buildout. >> Isn't that what we're witnessing sort of right now? How the street is viewing the financing behind the buildout that the very buildout you're talking about? Yeah, I think the street is basically giving it little to no credit for the 500 billion that they're essentially going to have in terms of, you know, in the future in terms of not just open AI, but building out the building out the stack over the coming years. You're going to have growth accelerating from 17% to 30% to 45%. I think investors are basically putting a massive discount saying like, \"Okay, I'll call that.\" And you're not going to ultimately be able to hit that. And I think that's why Oracle right here I continue to view as a huge prom moment that they're going to show. >> 2026 marks a critical shift in the AI story. We're moving from the infrastructure phase where AI has been dominated by companies spending money building AI capacity to the monetization phase where those investments start generating measurable returns. This transition determines whether AI becomes the next great growth driver or fades into disappointment. Every major technology cycle follows a pattern. First comes infrastructure, then platforms, then applications, then widespread adoption. Each phase has different winners and different ways to measure success. We're in the infrastructure phase right now. Although there has been some widespread adoption with chat GPT already, the headlines are dominated by chips, data centers, and cloud capacity. Nvidia's valuation reflects the insatiable GPU demand. Utility companies are suddenly hot because data centers consume massive electricity. This is the picks and shovels moment of AI. Money flows to whoever provides the raw materials that makes AI possible. But infrastructure spending is a cost. It's a bet on future returns. Every billion dollars poured into data centers represents capital that needs to eventually generate profits. The infrastructure phase is exciting because the numbers are huge. It's also nerve-wracking because all that spending has to pay off. That's where the monetization inflection comes in. 2026 is when we find out whether the payoff materializes. YouTube isn't just entertainment. It's one of the best client acquisition tools because it builds trust at scale. We've helped businesses grow from scratch to a $100,000 month just by launching them a YouTube channel. Book a call with me below and let's see how YouTube could help your business scale."
    },
    {
        "video_id": "GVqvN5QMrLQ",
        "title": "Dan Ives on Picking the Next Tesla/Palantir",
        "published_at": "2025-12-23T16:43:40.000Z",
        "sort_date": "2025-12-23",
        "url": "https://www.youtube.com/watch?v=GVqvN5QMrLQ",
        "views": 24143,
        "duration": "00:16:43",
        "transcript": "Ladies and gentlemen, I've got two banger clips for you today, both from Dan Ies. And in one of them, he explains how he picks out investments which then go on to 10, 20, or even 50x in their returns for him. But a quick plug before I show you that, if you are struggling for a Christmas gift this year for yourself or for someone else who's a bit of an AI nerd, why not consider buying them my course? It's the course I wish I had when I started learning about AI. If you're interested, check out the link in the description. Check out this first clip. >> So, in terms of the kind of more recent period of time since Wed Bush 2018 when you joined there, I mean, have you had to ignore valuation? Maybe ignore is too strong a word, but I guess one of your successes perhaps has come from not weighting valuation as highly as many other equity analysts. Yeah, I I'd say you can find AI in the spreadsheets. I I I think to some extent you have to valuation's important, but my whole view is like if you focus just on valuation, you've missed every transformational growth stock the last 20 years. You have to be able to look out three, four, five years to really build a thesis to where you think that's going. And I think that has probably been you know philosophically like our view is that you got to focus on the tech and where ultimately sort of we'll call it a bullcase scenario could go but also it's doing the work yourself CIOS in Asia to make sure and validate where it's like you know what you can miss a quarter stock could go against you but as opposed to so many selliders you know where it's kind of like they all head for the elevators downgrade stock it's kind of like steady hands when you have a sort of thesis. >> So, you said something really interesting there. You said, you know, you can't spot these winners in a spreadsheet. Do you have to spot them in your gut? Do you have to think this is the winner of the next 5 years or is there something more tangible than just that or is that very important? >> No, I think part of it is like I bet on leaders, right? Like, you know, it's like it's knowing Musk, you know, back a decade ago. It's it's knowing Jensen, it's Lisa Sue, it's Nadella, it's car. I mean, I think Palanteer is a good example like knowing Karp understanding Palunteer stocks like 10 bucks or and I'm like this is going to be a generational name. Now people at that point I mean the hate mail was was pretty like pretty insane. >> You got hate mail from that >> from from institutional investors. How could you bet on Palunteer? This is one of the worst calls I've ever seen. But my view is like Palunteer is going to change the world from an enterprise perspective. It was betting on the leaders but also it's understanding the culture, the technology and it's doing the work yourself. And I think that's something where I think that that's probably been like if I look back on our career from the Apple calls and TAS and Nvidia and Microsoft and others, it's sometimes like going against the grain like look Nadella takes over Microsoft 2014. The view is like disaster like how could you have an internal guy but just knowing him and what he was going to do I'm like he's going to rip the carpet up. I want to talk about individual stocks in a he maybe we'll come back to this but I think he's underpriced. He's perhaps the best CEO there is. >> I mean we're talking Hall of Famer like he's really almost to me what he's done at Microsoft. It's for the history books especially understanding the red tape and what was at Microsoft before he took over. And he was an internal guy. He basically like he rapidly changed that company. And I'd argue we're not at AI. We're not in the AI revolution. Of course, Jensen, you being the godfather of AI, if it's not for Nadella recognizing open AI back to early 2023 in terms of where it was heading. The biggest winners in the stock market over the last two decades couldn't have been identified through traditional financial analysts. Dan Ives says directly, you cannot spot these winners in a spreadsheet. He lists the specific leaders he personally bet on early. Elon Musk, Jensen Wang, Lisa Sue, Satia Nadella, and Alex Karp. Some big names there. And Dan specifically mentions Palanteer as an example where institutional investors sent him hate mail, calling it one of the worst calls they'd ever seen. His response was that Palunteer will change the world from an enterprise perspective. Guess what? Dan was right. And thankfully, so was I. This channel used to be called Palunteer byite-sized. Check out the old archive of videos. But what Dan lives is describing goes against almost everything Wall Street teaches about picking stocks. The traditional approach is quantitative. You pull up financial statements, look at revenue growth, profit margins, cash flow. You build a model projecting earnings. You calculate what the stock should be worth. Then you compare that to the current price. And that works great for stable, mature businesses, utility companies, consumer staples, banks. These companies grow slowly and predictably. You can reasonably project what they'll earn in 5 years based on what they earned last year. Technology companies break this framework completely. For example, technology can create winner take all dynamics that spreadsheets cannot capture. When Microsoft was trading at what looked like an insane valuation in the mid '90s, the spreadsheet said it was wildly overpriced. The spreadsheet couldn't have accounted for the fact that operating systems have network effects. The more people that use Windows, the more developers write software for Windows, the more people want to use Windows. That flywheel creates a monopoly position that compounds for decades. No financial model predicts that. Dan Ies is making a specific claim about what actually predicts these outcomes. The leader and when you look at his list of names, a pattern emerges. Elon Musk, Jen Wong, Lisa Su, Satiana Dela, Alex Karp. Very different people running very different companies. They share characteristics that matter enormously though. Genuine technical depth. These aren't professional managers who climbed corporate ladders by being good at politics. Jensen Wang has been running Nvidia for over three decades and understands graphic processes at a fundamental level. Lisa Su has a PhD in electrical engineering from MIT. When Jensen decided to pivot in video towards AI years before anyone else saw that market, that decision came from his technical intuition about where computing was heading. They also share extremely long time horizons. Elon Musk talks about making humanity multilanetary. Jensen Wong talks about accelerated computing transforming every industry. These aren't quarterly earnings targets. The willingness to sacrifice short-term results for long-term positioning is something most public company CEOs simply cannot do. Their boards won't let them. Founder CEOs with long tenatures think differently. They can make investments that won't pay off for seven years because they plan to be there when the payoff arrives. When Palanteer stock was at $10 and below, sophisticated professional investors thought Dan Ives was an idiot for recommending Palanteer. They had spreadsheets showing why it was overvalued. They were completely wrong or at least according to the stock price today. And it's not because their analysis was bad, but because they were measuring the wrong things. So that's the framework. bet on transformational leaders with technical depth, longtime horizons, and proven ability to execute through adversity. Now, Dan Ies applies that exact philosophy to the most controversial stock in the market. >> So, what a wild year for Tesla. Um, closed at an all-time high today. Uh, I had no idea, frankly, before I looked at it that it was on this massive run of the last couple of weeks. So, Tesla had a hell of a year. The stock was down 40. Chart on please. the stock was down 45% like year-to- date through May. I mean, the stock bas the stock got cut in half effectively in uh a couple of months. Really ugly. And then a hell of a turnaround. The stock is now up 19% on the year again, all-time high. Um all right, the the car business kind of who cares about it. I mean, obviously like that got us here. It's not going to get us there. Nobody is buying the stock today at an all-time high expecting that the car business is going to be a great business. Um, so what even drives the stock today? Why is the stock at an all-time high right now? >> Because it's the autonomous and robotics future is now in the doorstep. That that age is here. The AI revolution now at Tesla. >> So what does that mean? >> What that basically means is that when you look at true autonomous in 2026, we're going to see robo taxis in 30 cities. We're going to see full-scale production of Cyber Cab. We're going to see true buildout of Optimus in terms of humanoid robotics. That's finally here. So, every investor that's looking at Tesla, yeah, you went through some dark periods this year with brand issues, Doge, you know, everything we saw with M deliveries, but M got through that. That political, you know, obviously, you know, is is in the background. and now wartime CEO focused on taking Tesla into the AI revolution chapter. And I don't believe there's a bet the two best physical AI plays in the market or Nvidia and Tesla. And now you're going to see that AI valuation come through. >> The past couple of weeks, um, Uber stock has been under pressure. Uh, I assume that's the autonomous vehicles driving that. >> Let me ask you this question. Is this a good business? like, okay, they're gonna be in 30 cities. Is that going to is it going to be a profitable business or again, does that not matter? >> No. I I'd argue given the profitability in what's really a softwaredriven business from FSD to autonomous margins. I mean we think core numbers go up 4x over the next 3 to four years in terms of EPS earnings in terms of free cash because because the view is is that a car business is the most capex intensive business there is. You're now essentially going into a softwaredriven technology model that's built through autonomous as well as Optimus. The whole business mod, the whole margin profile is going to change. >> Are the cars that are on the road the same cars as like the regular Teslas or are these completely different vehicles? >> No, I mean they're the same one. I mean, obviously like it's about the software in there, right? Like in other words, like it's about true full self-driving technology. Today, less than 15% of Teslas subscribe to FSD. You we think you actually get over 50%. That's pure software margins. >> So if somebody if somebody like bought a Tesla a year ago, like are they going to be able to turn this on with their car or is that not how it's going to work? No, it's like they're going to be able to turn in if they want to put into the network, but then the cyber cabs that are going to be built, those are specifically for the robo taxi service. >> So, let's say that somebody has a Tesla and they're like, \"This is incredible. I never like I could work while I drive. I could whatever watch whatever I want to do.\" Is it like, \"Uh, all right, for $99 a month, you get FSD.\" Like, how does it work? >> Well, it's going to be FSD that you're going to pay But the biggest thing too is is that when you think about how the network's going to get built out, you're going to be at work and technically your Tesla could be picking up rides, getting paid, and then the car returns to your driveway. >> I think that's going to be I don't who's going to want that? you be. I'm just I'm telling you that when you think about the future and how Tesla's building this, there's true cyber cabs and that's going to be the vast majority. But when you look at FSD and the network effect and what they're building, that's like they're building it for optionality for anyone that buys a Tesla in the future. >> Tesla is no longer being valued as a car company. Investors buying at all-time highs are betting on a complete business model transformation from capital inensive auto manufacturing to high margin software and AI services. Dan IV says the car business basically doesn't matter for Tesla's valuation anymore. Nobody's buying all-time highs expecting the car business to drive returns. Dan predicts robo taxis in 30 cities by 2026. Full-scale production of the cyber cab and real deployment of Optimus humanoid robots. He thinks Tesla and Nvidia are the two best physical AI plays in the market. Dan Ies is describing one of the most dramatic business model shifts any company has ever attempted. To understand why investors are excited, such as myself, you need to understand why software businesses are valued completely differently than hardware businesses. A car company makes money by manufacturing physical objects. Every car requires raw materials, factory workers, assembly lines, logistics. The cost of making each additional car is almost as high as the cost of making the first one. That puts a ceiling on profitability. Even Toyota, if you're not including Tesla, arguably the best run automaker on the planet, operates on net profit margins around 8 to 10% in good years. A software company makes money by writing code once and selling it millions of times. The cost of the first copy is enormous, but the cost of the second copy is basically zero. As a software company grows, almost every additional dollar revenue turns into profit. Tesla is attempting to take a car company with car company margins and transform it into a software company with software company margins. The mechanism is full self-driving. When you buy a Tesla, you can pay for FSD as a subscription. The car is already built. The cameras and computers are installed. Tesla just flips a switch to enable capabilities that exist in the hardware. That subscription revenue is almost pure profit. No factory cost, no materials, no additional labor. Dan Ives points out that less than 15% of Tesoners currently subscribe to FSD. If that goes to 50% Tesla's profit margin expands dramatically because that additional revenue has almost no associated cost and the subscription is just the first layer. The real transformation happens with robo taxis. Robo taxi fleet shifts the revenue model from one-time hardware sales to recurring service fees. Instead of making money once when someone buys a vehicle, you make money every time that vehicle transports a passenger. Because there's no human driver taking a cut, the unit economic radically better than Uber or Lyft. So Dan's phrase physical AI deserves attention. Dan IVive says Tesla and Nvidia are the two best physical AI plays. Most of the AI boom has been about software running on servers. Chatbt, image generators, code assistants. They are powerful tools, but they operate in the digital realm. Physical AI controls machines moving through real environments. Self-driving cars navigating roads with pedestrians. Robots walking through a warehouse. A mistake in chat GPT means a weird sentence. A mistake in a self-driving car means someone might die. The difficulty is exactly why it's valuable. Any company that solves physical AI at scale has an almost impossibly wide moat. This connects back to the earlier discussion about leadership. The transformation depends entirely on Elon Musk. Shifting from a car company to AI company requires a leader with technical depth who understands artificial intelligence and robotics. It requires a longtime horizon. Tesla's been putting thousands of dollars worth of AI hardware in their cars for nearly a decade now. That's been hammering their margins. It also requires attracting elite AI researchers and it requires holding through the strategy through periods like earlier this year when the stock got cut in half. Investors who understood the long-term thesis and trusted Musk's ability to execute held through that pain. Now there are all-time highs. Exactly what Dan Ives described earlier about betting on transformational leaders. YouTube isn't just entertainment. It's one of the best client acquisition tools because it builds trust at scale. We've helped businesses grow from scratch to a $100,000 month just by launching them a YouTube channel. Book a call with me below and let's see how YouTube could help your business scale."
    },
    {
        "video_id": "jqFGq1k8FRg",
        "title": "David Sacks Brutally Honest Rant!",
        "published_at": "2025-12-23T20:18:11.000Z",
        "sort_date": "2025-12-23",
        "url": "https://www.youtube.com/watch?v=jqFGq1k8FRg",
        "views": 18139,
        "duration": "00:13:09",
        "transcript": "I've got two huge clips lined up for you today. The first is from David Saxs, who goes on a brutally honest rant about AI, and the second is an update on Gene Monster, who gives us an update on how bullish he is looking forward on some of the key AI players. If you're loving AI and wanting to become more knowledgeable on the sector and you're still looking for a Christmas present, why not consider buying the AI course I built, which is designed to be exactly what I wish I had when I first started studying the niche. Check the link below if you're interested. Now, I'll let loose David Sachs. I feel like I do this every week now, but there's a new study from Vanguard where they analyze job growth and wage growth in occupations that are highly exposed to AI automation versus all occupations. And they find that both job growth and wage growth is higher, not lower, in the occupations that are exposed to AI. So if you look at job growth in occupations exposed to AI, it's 1.7% compared to 0.8% for other. For wage growth, it's 3.8% versus 0.7% for other. So what you see here is something maybe it's counterintuitive, but it makes sense to me, which is as you make workers more productive, the value of their labor increases, not decreases, and they end up getting paid more, and you want to hire more of them. So this is a huge narrative violation. And again, this is coming from Vanguard and it's showing that AI productivity is good for workers. This follows on the heels of that study from Yale Budget Lab, which I talked about in a previous show that it said there's no discernable disruption to the job market based on 33 months of data after the launch of chat GPT. Now, I understand that you can make predictions as to the future that this state's going to change, that there will be AI job loss, but what I'm saying is that if you look at the data so far, there is no AI job loss. Quite the opposite. It's job growth and job gains. By the way, we have a 2% tailwind to GDP growth right now. That's coming from this AI boom, this capex boom that's happening. And so, this is, I think, a very good thing for the US economy. Now, why do people want to sabotage it? There's a really interesting article in Semaphore recently that described how AI critics were funding journalism fellowships at major publications like NBC News, Bloomberg, Time, The Verge, LA Times, which by the way, I mean, I track these things. They're relentlessly negative about AI. These fellowships were funded by future of life institute which is a doomer group that thinks that AI is going to become sensient and replace humans and they were funded by a donation by Vitalic Buterine from Ethereum. It's an interesting story actually. He donated his dog coins to future of life. They ended up being worth $600 million. >> Dogecoins. >> Doge. And then you remember how there was like those other dog coins. >> She had a collection of dog coins. >> He had a collection of dog coins. Apparently people like air dropped them to him as like a promotional thing. >> Got it. >> I don't think he wanted them. So he's like, \"How do I get rid of them?\" So he donates them to Future of Life and they end up being worth $600 million. So by this >> Oh my god. >> almost like this accident, this Doomer think tank ends up with a $600 million war chest. And they've been funding these journalism fellowships. They've been funding grants for academics to study AI. Obviously, that's going to end up being very negative. And they are funding a lot of these nimi organizations that are opposing data centers because their goal is just to get it to stop. That's their goal. They just want the development to stop. And you can't, I don't think, underestimate how much of an impact this has had on the public discourse. But if you look at their actual claims, like for example, the water use claims, it's a total hoax. >> Vanguard's study proves that AI productivity is making workers more valuable, not expendable. With AI exposed jobs, showing 1.7% growth and 3.8% wage increases versus 0.8% and 0.7 for everyone else. David Sax laid it out plainly, \"As you make workers more productive, the value of their labor increases, not decreases, and they end up getting paid more, and you want to hire more of them.\" The numbers from Vanguard tell a story that runs completely opposite to what you're hearing in the mainstream press. Job growth in AI exposed occupations is running at more than double the rate of other sectors. Wage growth is more than five times higher. And this data comes from Vanguard, one of the largest asset managers on the planet, not some pro tech group with an agenda to push. The economic logic makes sense when you think about it and without the doom and gloom filter. When a tool makes a worker twice as productive, that worker can now generate twice the value for their employer. Companies want more of that, not less. The whole premise that productivity gains automatically means fewer jobs ignores basically everything we know about how labor markets have responded to technological change over the past two centuries. Right now, the AI boom is generating what Sax calls a 2% tailwind to GDP growth through capex spending alone. That spending creates construction jobs, engineering jobs, operations jobs. Data centers don't build themselves. The infrastructure buildout is one of the biggest job creation engines in the American economy right now and is being funded by the same company supposedly eliminating everyone's positions. Yale's budget lab looked at 33 months of actual employment data after Chat GPT launched and found no discernable disruption. And that's not a slowdown in disruption. No disruption. Zero. The study they expected to confirm the doom narrative instead showed that the AI apocalypse simply hasn't materialized in the numbers. Now for some more gems on AI, we've got Gene Monster who's been one of the most consistently right voices on AI investing. >> Gene Monster, he's managing partner at Deepwater Asset Management. And Gene, I'm curious what you think c I I have a theory, but I want to know what yours uh what you think is going on here. I mean, I to me it seems like a lot actually improved sentiment after OpenAI. did that massive raise last week after Sam Alman came out and defended kind of the idea of where's all the money going to come for for their data center um ambitions over the next few years on that uh podcast Alex Canowitz did that is that what turned things around here what do you think is going on >> I think it was that was the moment and just to put some more context on that this $830 billion valuation the fact that they're confident that they can raise tens of billions I think is evidence of example of a private market company that's really setting the the narrative on the public side and I think that this whole concept that this uh this is a profitless prosperity around these large language models I think is continuing to be put to rest. Uh we understand and investors understand that the pricing of tokens is going to go down by Sam Alman's account 10x per year but the uh ultimately the usage is going to increase by more and I think that that is at the center of this big raise. I want to put some more quick context about why that was encouraging. If you look at his expectations about where their revenue is going to go over the next few years, doubling in each of the next few years, that basically puts uh OpenAI at a valuation of about 12 times calendar 26 revenue. Now, that is very favorable relative. That's kind of in line, maybe like a slight premium to the rest of software, for example. And keep in mind that this is growing at 100% versus software growing at 15%. So Kelly, >> let me just jump in there and say in other words, what you're saying is they're trading at about 12 times price to sales. I know it's not a perfect metric by the end of 2026, which is in line with where other software type companies would trade it. They're not trading, in other words, at some crazy multiple if their revenues are achievable in just the next 12 months. >> Exactly. And I you know that I just want to emphasize one comment which is where the whole AI conversation comes down if that is achievable and uh ultimately I'm in the camp that this is achievable. I think that there's upside to that 100% growth. They've showed that they've uh continue to do that and I think that this uh commentary about this raise gives some investors some confidence to look back over the past month. There's been five uh positive data points, large positive data points related to the open eye. Everything from uh Micron earnings to commentary from AWS's CEO about how they're building out Nvidia raised their guidance for uh for calendar 26 from 50% growth to mid60s and that excludes age 20s. And so I think what this has given us this gift essentially from OpenAI from their fund raise has given investors a chance to step back and saying wait a minute maybe I looked past what has been some really impressive uh updates related to where AI is over the past month. And so I think that's part of the recovery and I emphasize the word recovery. It still isn't fully I don't think the market is fully factoring in all the good news we've heard around AI over the past month. >> Sure. And I'm going through your list here and you're like, look, I you've mentioned some of this. Amazon Web Services demand keeps skyrocketing. Nvidia raised their calendar 26 growth to 65% from 50 just at the end of November. Broadcom, I mean, let's talk about what a quarter that was. And look at what happened with the stock. Oracle, right? Can I ask a weird question, Gene? It seems like in a way the better OpenAI's prospects look, the better the whole AI trade does, whereas the better Gemini's prospects look, which seem to come at the expense of OpenAI to some degree, the more that trade looks a little shaky, even though it's good for Google's shares. Am am I overemphasizing that distinction? >> I I think so. So I think at the end of the day the the the central question we're all asking back to a comment you had a minute ago about if they hit this I think when it comes to Google uh when it comes to open AI all the large language models all these companies is just that simple question of do you believe that ultimately the growth of these companies will exceed high expectations and I think if Google continues to grow a surge higher than where investors think it's kind of 11 12% for calendar 27 they recently grew at 14% % if you look at what's happened obviously with Google Cloud and that impressive growth. If they continue to do that, I think it's going to be a positive read for the overall AI trade. I think that um whether it's Google or positive commentary uh comes out. Now the that's the good news is that across the board the data points continue to be most positive. Now again the market may not give it credit in any week to week but the data points have been most positive. Yeah. that the challenge there is that imagine what would happen if we actually got a negative data point. I don't foresee one, but I think that is the the question that continues to nag investors. Are we one week away from a negative data point, which ends up kind of putting us in a funk again? Gin Monster argues that OpenAI's $830 billion valuation is trading at just 12 times calendar 2026 revenue in line with software companies growing at 15% while open AI targets 100% growth. And Gene believes this proves the profitless prosperity narrative is falling apart. Gene Monster generally speaking has been calling AI correctly by his little hiccup with Google and has been calling AI infrastructure correctly when others have been running away scared. The math on OpenAI works out differently than a lot of headlines have been suggesting. If they hit the revenue estimates to double through 2026, you're looking at a multiple that's actually fairly reasonable for a marketleading software company. The difference is Open AI is growing five to six times faster than companies trading at similar valuations. Either the growth expectations are wildly wrong or the market is still discounting AI leaders more than the fundamentals justify. Jean's track record matters here. He called Apple's iPhone trajectory before most analysts understood what they were looking at. He's been bullish on Tesla's autonomy story when the conventional wisdom said it was all hype. And on Nvidia specifically, he's repeatedly noted that the street consensus underestimates their growth. The Open AI fund raise at $830 billion is essentially institutional validation from Wall Street investors. Most people pour money into ads people ignore. YouTube changes that. It builds trust, authority, and a real connection at scale. One law firm we worked with landed 33 clients in just 5 months worth $330,000 from their YouTube channel. If you run a business, this is one of the most overlooked opportunities right now. Book a call with me below and I can show you how we can make it"
    }
]