[
    {
        "video_id": "stbLDRHD7Gk",
        "title": "I am betting $1,000,000 on THIS Stock",
        "published_at": "2025-12-23T14:00:06.000Z",
        "sort_date": "2025-12-23",
        "url": "https://www.youtube.com/watch?v=stbLDRHD7Gk",
        "views": 120684,
        "duration": "00:07:01",
        "transcript": "Look at this number. That is $1 million of my own cash. Well, about half of it. The other half is sitting with the bank that is meant to send it and they are making money off it in the process. Bastards. Anyway, over the next day, that'll become a million dollars. And over the next few months, I might lose a significant chunk of this. Seriously, I'm just sick of this trading industry. Everybody shows you their back tests. Everybody shows you lines on the chart that go up to the right and they say, \"Look, if you followed this system, you'd be rich.\" But back tests, guess what? They're fake. They don't account for fear. They don't account for slippage. They don't account for the fact that when the market drops 20% in a week, you don't buy the dip. You panic and you sell. And I'm tired of the theory. I want to know if the logic actually works in the real world. So, I'm doing something stupid. Or maybe it's genius. You'll tell me. I'm taking a theoretical institutional system. It's called Trend Monster. And I'm putting it to the ultimate stress test. I'm trading it live with a million dollars. The system works. You'll see me compound this capital. And if it fails, we're going to see me lose money. Well, yeah. And I'll look a little bit sad. So, welcome to the experiment. But let's talk about why most of you fail. It's not because you're stupid. It's because you're human. The S&P 500 averages about 10% a year historically, right? I've got a chart for that, too. Here it is. Since 2010, you know, it's gone up very, very, very, very nicely, right? So, it's easy to make money, right? So, why do most retail traders lose money? Because of drawdowns, these things here, these things there. When the market crashes like 30% like it did in in in 2020 or 2022 here, that one, you don't hold. You freak out. You sell at the bottom and then you miss the recovery. And the buy and hold strategy, well, look what it works, but it works for robots. It sucks for humans, right? So my head coach Elliot who used to be a market maker, we had a conversation and he said or I said to him, \"Is there a way to know when the crash is coming?\" And the answer is sort of we can't predict the future, but we can read the weather. So this is the system I'm testing. It looks like this. It's based on something called the VIX term structure. And I won't bore you with the complex maths, but think of it like a traffic light. When the VIX is calm, the light is green. This means the big money, the institutions are comfortable. The road is clear. In this mode, the system goes risk on. How do we buy? When the VIX spikes, the light turns red. And this means the institutions, they're buying insurance. They're scared. In this mode, the system goes risk off. We sell. We go to cash. We don't try to fight the storm. We just go inside and we wait for it to pass. So, the goal isn't to make money every day. The goal is to avoid the one bad day that wipes you out. If we can sidestep the 30% crash, the math of compounding takes care of the rest. Now, here's where it gets dangerous. And here is why I might lose money. To get the institutional advantage, I'm using a vehicle called TQQQ. Right? This is a three times leveraged ETF of the NASDAQ. Think of TQQQ like a Formula 1 car. I know this isn't a Formula 1 car, but it's the only car model I have lying around. So, on a straight road, which is a bull market, it's incredibly fast. It can triple the market returns. But on a curvy road, like a choppy market, it is deadly. If the market drops 1%, TQQQ drops 3%. If I hold this thing during a crash, my million dollar could turn into $300,000 in a month. That's why the red light is so important. We only drive the F1 car when the light is green. When the light turns red, we park the car and we walk away. So, does it work? Well, on paper, this is paper. We ran a simulation going back 15 years. We put $10,000 into it 15 years ago. We added $100 a month, nothing more. So, overall, $55,000 and we turned the $55,000 into 1.8 million. Beat the S&P by a mile. But this is a simulation. It assumes I never slept, never made a mistake. I got perfect prices every time. Real life is messy. Maybe the signal turns red on a Friday, but the market crashes on a Monday morning before I can sell. That's called the gap risk. Maybe I get emotional and I override the system. That's why I'm doing this experiment. I want to see if the reality matches the simulation because it's insane. And I'm not asking you to invest in this. I'm not asking you to copy me. In fact, please don't. If you copy me and lose money, that's on you. But if you want to see exactly how this logic works, if you want to see the dashboard, the rules, and the exact plan I'm using to manage this million dollars, I'm hosting a free live training on the 27th of December, just sandwiched between the holidays. And in that session, I'm going to pull back the curtain. I'll show you the VIX indicators. I'll show you the back test data in detail. I'll explain the safety brakes we use to try and stop the F1 car before it crashes. And the end of our training, if you're serious about learning this style of training, which by the way will take less than 15 minutes a week, like it's the we we do almost nothing at all. I'll show you how you can apply to join our mentorship program and watch the experiment live. You don't have to. You can also just show up for the for the live training only. But first, you need to understand the risks. Now you can sign up for the live session. There's a link down below, felix.org/training, and grab yourself a free seat before the room explodes. I think there's a limit of 3,000 people, which I think we might hit. So, make sure you grab yourself a seat early and just show up on time. So, what's the risk? Well, you need to understand the machine. So, click the link below, register for the free training. It's happening on December 27th. And come to see if the machine can beat the market or if I'm about to learn a very expensive lesson. Click the link and I'll see you there. Winston and I are very excited about this, aren't we, Winston? Suddenly excited dog. He had a good morning. I think that's what it means. If you own any AI stocks right now, what I'm about to show you could be the difference between protecting your wealth and watching it evaporate going into 2026. The AI stock correction has already"
    }
]