[
    {
        "video_id": "_5QBOW2_8Dk",
        "title": "SOLANA TO $5 DUE TO NEW LAWSUIT!!!?!! 5000 Messages Leaked...",
        "published_at": "2025-12-23T11:15:02Z",
        "sort_date": "2025-12-23",
        "url": "https://www.youtube.com/watch?v=_5QBOW2_8Dk",
        "transcript": "Okay guys, this one is juicy. Let's talk about the Sana lawsuit. This is the most requested video on the channel because now you have the lawsuit being accepted by the court. People are saying that Sana is going to go to $5. Another guy saying this is going to $5. This tweet, they get quite some engagement here. People are going crazy as you can see a lot of engagement. And of course, you have the spice on top of all of this. and that is that 5,000 secret charts have been leaked from the Sana Foundation, from Gito, from Pump Fan, which obviously makes this way more interesting and also potentially way more dangerous for Sana, for everyone else involved because when you have the chats, you know, the intent and intent is something very very important when it comes to legalities. Okay? Even if you do a DEX, if you do neutral infra, if you have bad intent, you may still be in trouble. And this lawsuit just for you to understand the size of it. It is 5.5 billion billion billion dollars. So in this video we'll be discussing will Sana go to $5 or not. How dangerous is this situation for Sana for the dexes for developers and the broader crypto ecosystem. Because if Sana is in trouble for doing this you can imagine what happens with Binance chain. You can imagine what happens with Dexes on other chains. It's not like everyone is a holy priest and just a white angel. You understand that this ecosystem is is the way it is. Okay. [laughter] So, smash up the like, subscribe if you want more of these videos, and let's start as soon as possible. So, first and foremost, let's discuss the accused parties, what they're accused of, and what this lawsuit is really all about, and then at the end of the video, we'll be discussing the Slana price, whether it will fall to $5. The first and most well-known accused party is, of course, Sana Labs, the creators of the blockchain. And the lawsuit alleges that they created the blockchain and they created the SPL token standard which means that they supported and provided infrastructure for the fraud that took place the alleged fraud that took place with pump fun. Of course, this is a very very very very weak argument. Why? Because there are so many blockchains. If you have ETH or Binance chain or Solana and something happens on this neutral infrastructure, how can you be held responsible? But then yet again guys, there are 5,000 secret chats which the judge the judge is going to read them. Okay? And we're going to see if there's any ill intent because there can still be all kinds all kinds of people from Sana involved in all kinds of stuff. Maybe there is some personal gain, personal interest. Who the hell knows? But in general, this kind of argument makes little to no sense. Um, next, GTO labs. So GTOBS, they are used as an infra provider for validators. So when the validator creates a block, validator is kind of a minor in the Slana ecosystem in the Slana blockchain. The the validators don't do the blocks themselves. Instead, they use JTO to create the block because then the validator can get some MEV. They can optimize the block in different ways to make it more profitable for the minor. And this uh this area is a whole research area you can say how to do the block in the most optimal way. And that's why validators they don't do it themselves. They don't construct the block themselves. Instead they use jto to do the to do it and jto constructs the block selects the best the best transactions and give it to the validator. So jto has control over which transactions get confirmed when on the blockchain. You can say that you can say this is what the lawsuit alleged that because they had this control they had priority execution for insiders. Okay. So the whole idea with pump fun is that it should be this very very safe environment for creating memecoins and trading meme coins because you know that on pump fun there's no way to give yourself allocation or your friends allocation. If you are a token developer you have to buy the token yourself from the open market after you create it. So the branding has been that okay guys it's super safe no one has any insider advantage here but but the lawsuit alleges that they work together with JTO in order to fasttrack insider transactions. So they for example could buy faster and uh because GTO could order transactions it also means that ordinary users got put last they got put last in the transaction queue executing advantageous trades that helped the insiders and generated billions for insiders. Okay. And then finally they accuse Pampan. So Pan is the third uh accused parsy here and as you know pampan is the website where all of this is taking place. They've said that it's fair and rug rug pull through proof. Sorry, get my English. Rugpool proof. And um that's why they are also accused here to basically be the platform where all of the trading is taking place. So the lawsuit is about the insiders having fasttracked transactions where Sana allegedly did the blockchain and the infra. You have JTO doing the transaction ordering and PF fun is the website where all of the trades are taking place. Now that you understand what the lawsuit is about and I accuse parties, let's discuss the risk for the different parties here. So what you see in front of you is a document where my team and I have summarized the situation for the different parties and their respective risks in this lawsuit. Of course, we're not legal professionals, but by consulting our AI overlords, by using common sense, by doing our own research, this is what we have come up with. You should know that the judge maybe the judge reads this 5,000 secret chats and has a fully different picture but this is what what uh we have found when doing research and you should do your own research. So first and foremost Solana Solana Solana likely not a problem because Sanaam is doing blockchain they do neutral infrastructure and primary risks to Sana uh come not from memecoins existing on the chain but only in case plaintiffs can show active coordination. And this is why these texts are so so important. Without the text, Solana has nothing to do in the lawsuit. But with the texts, in case the Sana Foundation actively has conspired against the retail plebe, then it's more serious. So uh the the plaintiff and the judge will have to find some kind of active coordination economic entanglement for example that the Sana team themselves somehow got money from all of this or problematic internal messaging for example where they make fun of regulation or they write something else which may be interpreted as ill will. And so active coordination would include internal communication showing awareness of exploitive launch dynamics, coordination with launch platforms or insiders or engineering decisions made to favor specific speculative behavior. For example, if they say listen insiders should be very very fast uh with their transactions. So let's speak with jito so they make it. I mean all kinds of stuff like that. Uh this would theoretically be a a uh a problem. Now we don't know what these chats say. We have no clue. Maybe there is nothing nothing like this at all. Uh but just so you understand the risks here. Uh economic entanglement would involve directly revenue directly tied to specific token success or preferential commercial relationships with launch platforms and messaging risk arises if developer or foundation communications appear to endorse encourage or normalize extractionbased behavior. So all in all the risk is quite low here because it's all about this chats and then it's all subjective. is about ill intent and so on so forth. So low to moderate risks likely Solana is not in any trouble here. Now let's speak about jito. JTO is a totally different situation because JTO effectively can order transactions and decide which transaction gets included when and how and the validators use JTO in order to construct the blocks. So here is where this is more of a gray zone. This is not as clearcut as Sana because Sana just does neutral infrastructure. Here you do have potentially more risks. For example, if you have knowledge combined with optimization, for example, you know that by doing this kind of software, you are wrecking so many retails and you knowingly do that. And especially if there are this different chats that also show that you somehow benefit from it yourself. Maybe you have a deal with one fan like who the hell knows it will be all about the ch like this losses guys. It's mainly about this charts. Okay. Uh then it's a different story. Obviously it's a very different story. evidence showing awareness of extractive memecoin launches combined with token specific MV strategies materially weakens neutrality because the judge can say listen you guys are talking directly with one fan you're doing so that the traders from these meme coins get in first if they're insiders and non-inssiders don't get in first. So let's see what kind of evidence there's. We have obviously no evidence. We're just reasoning here alleged stuff. But this is the risk. This is the risk in case they they are involved with with this kind of behavior. Economic linkage is inherent because ME revenue scales directly with speculative activity. Plaintiffs may argue profit sharing in allegedly unlawful marketplaces. Next, coordination risk arises if there is evidence of collaboration with dexes or launch platforms or shared incentives. Again, if somehow they're earning money from people getting wrecked, it's way way way more problematic than just doing me optimization. And so why leaked messages matter here is um uh because is one of the actors where intent it's all about the intent could possibly be inferred from engineering discussions. Okay, what are they saying when they are doing engineering decisions? Is this going to be key? So realistic risk is moderate uh and highly fact dependent. It's difficult to say because we have no no chats. We need the chats. We need to see the chats. The judge needs to be uh basing the the decision on the charts here with the highest likely. Finally, let's speak about pump fund because pump fun is the highest risk here because pump fun is not just infrastructure. It enables issuance, shapes market dynamics, monetizes launch behavior and explicitly targets speculative activity. They do the website, they do the UI, they decide which coin is trending, they decide which coin they promote, they decide everything basically everything, everything everything. So primary risk vectors is issuance and facilitation of the of the coin creation and it may be characterized as operating an unregistered securities issuance platform depends whether these things are securities. I think the security angle here, I mean just my non-legal professional opinion just being in the space every day. I mean to me it seems that uh these coins are not securities. Uh freaking Trump has a coin. Okay. [laughter] So it's more uh I would guess and I would guess that this is less and less about security stuff. It's more whether it is insider trading because you can have insider trading in nonsecurity stuff also. Look at the open C. Open C employee went to jail for insider traing like 100k of NFTs. So let's see if it's security or not. Likely not security. Uh retail expectation of profit is strongly implied through the UX and branding with no plausible utility framing. Exactly. No utility. P extraction is directly tied to launch volume and churn and internal communications pose the greatest risk. Again is all about the chats. We need the chats guys. We don't have the chats but the judge has the chats. any acknowledgement that most users lose money, insiders extract liquidity or enforcement risk is minimal. For example, they're chatting that, oh no, we're good. We're good because we're onchain. We don't care about law because we're on chain. If if they write stuff like that in their chats, then it's a no bueno. For them, it's no bueno. So, the realistic risk here is high. Pampan is the most legally exposed actor in the in the stack. So now you understand the lawsuit, the different parties, and the potential risk levels for each party. Let's speak about the potential outcome here because at the end of the day, it's all about the outcome. The plaintiffs, of course, they want $5.5 billion. And in these cases, uh, normally they will have a settlement. I mean, the class action lawsuits, they happen all the time in crypto. This is not the first time. And it would be way worse in case government sued them. And maybe this is still going to happen. Maybe this is downstream of this lawsuit. If the government actually gets involved, as long as government is not involved, as long as the SEC, CFTC, DOJ, as long as they're not involved, I mean, my non-legally licensed understanding, not being a legal professional, is that this is going to be a civil lawsuit and uh they're going to agree likely sooner or later. This normally takes years and years and years and years and years and years. Also, this happens very often in crypto and crypto parties have survived way worse. I mean, Binance has been in trouble with the government. the government sued Binance. Coinbase the same. So when you have a civil lawsuit like this in most the highest likelihood is that they will that they will find some kind of middle ground here. Uh 5.5 billion may sound like a lot in crypto. It's not a lot in crypto for a lot of these parts for them to figure something out here with a few billion here and there. Uh likely this is what's what's going to happen in my view. In my view and if you are an actual legal professional, please let us know in the comment section what you think. Finally guys, let's speak about the price. Will Sana go to $5 just like all of the FUD is saying Solano to $5? Sena to $5. The thing is Solana doesn't really need this lawsuit to dump. Sena does look quite weak. Uh even without the lawsuit now, whether it's going to go back to five or not, that's uh still to be seen. But all in all, if we lose this support, guys, if we go below 100K, we'll lose this moving average here, the 200E moving average, and we'll lose this massive area of support. Solana's next support is at around the 30 20 here. Okay, 30 20 15 30 20 here between 15 and 30. Okay, so that's going to be the next big area of support. I mean, you see yourself visually as well. There's not too much support here. So, it's not like Solana needs a loss to double. Okay. [laughter] And by the way, it's totally Solana is XRP the same XRP by the way. Oh, it's kind of losing support in real time now with a target of 0.6 0.7 approximately. So, be careful with that. So all in all, lawsuit or not, the price is disconnected. The prices normally don't care about losses because lawsuit is not it may sound big, especially when you 5.5 billion, 5,000 messages, it happens so often in crypto. Like it happens so much in crypto and in comparison to other crypto cases. This one, just by reading what we just read, it's it's not big. In comparison to the Binance lawsuit, it's not big. In comparison to Coinbase lawsuit, it's not big because the government was involved. It was a totally different beast. But it can still develop into that. I mean the government can get involved later on. A civil lawsuit can transform into a criminal lawsuit later on. So let's see what's going to happen here. But don't get confused that somehow the price is is affected by a lawsuit especially one like this where it's uh you know class action is going to take years and years and years. There are way way way way stronger factors here. And the strongest factors for the bear is the price potentially losing support if we go below a 100. So be worried about that. Don't be worried about some lawsuit here and there because uh the price is king. We look at the chart and the chart tells us the direction. Trend is your friend. Until then guys, smash the like, subscribe to the channel. See you all very very soon. Let me know if you love this video, this kind of video. And after Christmas, we're going to be back with uh streams as well. For now, we just do videos. Okay guys, see you. See you. Bye-bye."
    }
]