[
    {
        "video_id": "9VtBEoYXE7M",
        "title": "Retail Investors ARE GONE!! Can Crypto EVER RECOVER!?",
        "published_at": "2026-01-13T14:00:26Z",
        "sort_date": "2026-01-13",
        "url": "https://www.youtube.com/watch?v=9VtBEoYXE7M",
        "transcript": "This crypto cycle should have been the biggest one ever. Large cap cryptos like BTC, ETH, and XRP hit new all-time highs, and narratives like tokenization took off. Regulation was better than ever, and investors now have easy access to crypto through spot ETFs. But despite everything seemingly going right for the industry, it looks like the buyers never showed up in size. So today, we're holding up a mirror to crypto, asking why the hypes felt so muted and tackling the question on everyone's mind. Where are all the investors? My name is Lewis and let's dive in. Before we begin though, I'm not a financial adviser and nothing in this video is financial or investment advice. It's educational content intended to explore the surprising absence of crypto inflows. If that sounds good, then punch that like button and let's get into it. Now, back in 2021, everyone was buzzing about crypto's cuttingedge tech and the possibilities that came with it. Memecoin moonshots were everywhere. NFTts had taken over profile pictures, and even your technophobic uncle was buying VR headsets to explore the metaverse. Like all good things, though, the 2021 bull market came to an end. Some people walked away from crypto for good, while others stuck it out through one of the most brutal bare markets ever. And that was fine because they knew that the next bull market would be even bigger. and better than the last. Or so they thought. Despite all the progress made around crypto market structure, regulation, education, and marketing, retail excitement just hasn't shown up, especially compared to previous cycles. This is evident across several metrics. For starters, exchange trading volumes haven't experienced the same parabolic surge seen in 2021. Even when volumes spiked this cycle as BTC reached new all-time highs in 2025, they remained well below 2021 levels, signaling low retail investment. Google search trends confirmed this with search terms like crypto, cryptocurrency, and even Bitcoin being at multi-year lows. Although, intriguingly, search trends for things like stable coins, tokenization, and RWA are actually at multi-year highs, which indicates more institutional interest. More on that later. Anyway, another indicator of low investor interest can be found onchain. As you might have heard, the number of active Bitcoin addresses has been gradually declining over time. As I record this, the active Bitcoin address count sits at roughly 650,000, about 50% down from its peak of around 1.3 million back in April of 2021. For what it's worth, the number of Bitcoin shrimps, while it's holding less than one BTC, has been steadily rising, which could be a sign that existing investors in the crypto market have been turning their focus towards Bitcoin. Evidence for this can be found in Ethereum's onchain data. If we track wallets with small ETH holdings, you'll notice a sharp drop off after July 2022 with little recovery since. Since Ethereum is the largest altcoin, it serves as a proxy for the broader altcoin market. And the data clearly shows that attention remains far more focused on Bitcoin rather than altcoins. This is also reflected in Bitcoin dominance, which has been in a long-term uptrend since August 2022. But it's worth noting that Bitcoin dominance began falling last summer. If Bitcoin dominance continues to fall, this could either signal more money flowing into altcoins or into stable coins and tokenized assets as they become a bigger sector of the market. In any case, there are plenty of other indicators we could point to, but you get the idea. Investors haven't been as excited about crypto this cycle. This doesn't mean that it's not possible to make money, though. Many retail investors have found that trading crypto is a great way to make gains regardless of market conditions. And if you are trading crypto, then you have to check out the Coinbau deals page. That's where you'll find exchange signup bonuses of up to $100,000, trading fee discounts of up to 50% and deposit cash backs of up to 75% on the best crypto exchanges. Just hit the link in the description or scan this QR code which will take you right to the deals page. There you'll see all of our offers across a range of exchange partners. Then click one of the sign up now buttons and that should take you right to the deal. These deals won't be around forever, though, so take advantage of them while you can using the link in the description below or by scanning the QR code. So, where have all of the investors gone? Or more accurately, why haven't we seen the same euphoric rush of retail investors FOMOing into the latest shiny thing? Was it something we said? Was it something we did? Was Harry Potter Obama Sonic 1 Enu just one step too far? I mean, maybe. But that's not really the problem here. For many, the reason they're keeping their distance from crypto this cycle is simple. They still have PTSD from the 2022 crash. I am, of course, talking about the collapse of FTX, which rocked the entire market and triggered a cascade of major crypto companies going under in its wake. The FTX collapse remains one of the most catastrophic failures in crypto history, leaving long-asting damage across the industry. Beyond the billions lost, it left a stain on crypto's reputation. stain were still trying to erase. Retail investors who lived through it remember the fallout all too well, while those who didn't have likely heard enough to stay away. Some may never return. Thanks a lot, Sam. But to be fair, we can't blame everything on SPF. It's easy to forget that many retail investors had already left by the summer of 2022 due to the collapse of Terara's US stable coin, which ultimately led to the collapse of other large players in the crypto industry, such as Celsius and set the stage for FTX's own collapse. If the collapse of entities like Terra, Celsius, and FTX were the factors that pushed investors away from crypto, then the rally in stocks, especially tech and AI focused ones, and commodities like gold and silver were factors that pushed investors towards other assets. And honestly, who could blame them? The trend is your friend, as they say. And many investors have decided to follow the strong trend of AI and gold rather than wait for crypto. Now, one of the biggest reasons this cycle feels so different is because of something we touched on earlier. A lot of capital is coming into crypto through ETFs. Basically, ETFs give traditional investors a way to gain indirect crypto exposure in a simpler, more regulated way. But here's where things get interesting. According to a coin shares report from Q1 last year, just 23% of US ETF shares were held by institutions. Logically, this means that the rest were held by retail investors like you and me. This is significant because it shows more people are taking advantage of the simplicity and regulatory certainty that ETFs offer. In other words, retail investors are still here. They're just investing differently than before. On top of that, onchain data shows cryptonative whales buying even as retail investors sell. For context, some analysts argue that tracking whales is more important than tracking retail because a single whale can shift the entire market. This is significant because when whales scoop up crypto that retailers dumped, it's the retail investors who get left behind when the markets eventually rallies. This trend has been happening for some time, but there has been a huge divergence since mid December. This could simply be because retail investors were selling their crypto getting ready for the holidays, giving whales a chance to scoop it up. Whatever the reason though, whale influence is growing while retail influence is shrinking. And to make matters worse, much of the remaining retail capital has been lost in the PVP gambling arena of memecoins. In the first half of 2025, while whales and institutions double down on major cryptos like BTC and ETH, retail investors were distracted chasing memecoin gains. The result was that the memecoin sector became flooded with thousands of new tokens every single day thanks to launchpads like Pump. Fun that let anyone create a token in seconds at almost no cost. Traders scrambled to get in before a pump, then raced to sell for a profit, and it all happened incredibly fast. Case in point, an October 2025 report from Galaxy Digital revealed that the median hold time for meme coins on Salana, where most of the action was, was just 100 seconds, not hours, not minutes, seconds. Eventually, fatigue set in. Investors grew tired of the pump and dumps, the bots, the snipers, and the mental strain of watching charts constantly. This was made worse by crypto's largest ever liquidation event on October 10th, which sent risk appetites plummeting. That's because the event exposed flaws in small cap altcoin liquidity and the dangers of leveraged positions. Intriguingly though, memecoin mania might be making a comeback. Recent data shows an uptick in social media activity around memecoins since the start of 2026. At the same time, the total crypto market cap has risen, suggesting investors may be regaining an appetite for risk. Now, if there's one thing that we can agree on, it's that the lack of new retail investors is why this bull market has felt so, well, boring. The speculative frenzy that once drew new investors has been replaced by muted institution-led flows that move prices without real excitement. What once felt like a cultural shift now feels more like a professional balance sheet adjustment. Sure, it could still be profitable, but the euphoria of past crypto bull runs just isn't there. In the previous bull markets, the same pattern would play out. BTC would hit new all-time highs, pushing the fear and greed index into greed territory and putting Bitcoin on the radar for investors everywhere, both inside and outside of crypto. As crypto made mainstream headlines, investors would FOMO in, chasing higher returns in altcoins, often causing newer retail investors to ape in right at the top. However, this pattern hasn't played out in this bull market. Retail capital has been weaker, fragmented, and more focused on high-risisk bets like memecoins or short-term narratives. While attention on these areas can be bullish for the cryptos within them, it doesn't create the upward pressure needed for the broader crypto market. Nor does it generate the FOMO of past cycles. The real underlying winners of this cycle have actually been layer 1's utilitydriven projects and most notably tokenized real world assets or RWAs. As you'll probably know, Wall Street and other institutions are racing to put assets on chain, unlocking new opportunities. Opportunities that could earn them some serious bank. The biggest winner here was stable coins, the most widely used type of RWA. For context, stable coins are tokenized dollars, mainly backed by short-term US treasuries. 2025 was monumental for their growth thanks to regulations like the EU's Mika bill and the US Genius Act, pushing the stable coin market cap up nearly 50% in just one year. But it wasn't just regulation. Stable coins also became an integral part of fintech payment rails like Stripe, PayPal, and more. Taken together, this allowed the stable coin market to reach more than $300 billion by December. To be clear, this is huge. The growth of the RWA sector, stable coins or otherwise, is a clear sign that crypto is on track for mainstream adoption. That said, it's not exactly thrilling for retail investors. Stable coins aren't exactly going to pump anyone's bags. And let's be honest, are people really going to lose their minds over a tokenized government treasury? Probably not. All right, folks. So, so far we've faced some uncomfortable truths and done some hard self-reflection. Admittedly, it's starting to feel a bit doom and gloom, but there is still plenty to be excited about. So, let's flip the script and tackle the question on everyone's mind. Will retail hype ever return? Well, the good news is that yes, it will. While things might feel a bit meh right now, retail investors are bound to come back for one simple reason, and that's greed. Human greed has no limits, and it's also one of the biggest drivers of market activity. As crypto prices reach key psychological levels, this will grab the attention of the masses, prompting many investors to ape back into crypto. These key levels could be BTC reclaiming 100K or even hitting new all-time highs of say 130,000. Or it could be Ethereum breaking above 5K or the total crypto market cap climbing back over 4 trillion. And it's worth noting that in recent weeks, market sentiment has turned more positive. So, these targets might not be as far-fetched as they seem. Alternatively, retail investors could feel the FOMO if prices have been going up for a sustained period of time, or they might turn to crypto if other assets like gold or AI stocks start to cool off. In that case, investors would chase higher upside potential, and crypto will likely be one of the first places that they'd look. And believe it or not, retail investors could get swept up in the hype sooner than you expect. As we touched on earlier, the memecoin space is showing some signs of revival. After dropping 65% in 2025, memecoins are resurfacing on social media, and some tokens are seeing massive gains again. This potentially signals a renewed risk appetite among retail investors, potentially sparking the same contagion effect that drew in new market participants last cycle. And in the longer term, another factor that will seriously attract new retail investors is if the next US presidency is also pro crypto. Hypothetically, if the Democrats win the midterm elections and don't reverse the regulatory progress made so far, this would reassure skeptical retail investors that crypto isn't a partisan issue. But even if retail FOMO doesn't kick in immediately, there are still plenty of opportunities in the meantime. As Bitcoin has become more institutionalized, the market has grown less volatile. On the surface, that might sound boring, but it actually has some benefits. That's because institutional capital has been lapping up Bitcoin while everyone else has been selling, making it a powerful buffer against retail panic selling. This is great news for both traders and investors. For investors, it makes holding a more viable strategy since BTC is likely to rise over the long term. For traders, the added stability makes BTC's price action more predictable, making it easier to plan and execute profitable trading strategies. The point is, this lack of retail interest is likely temporary. Eventually, people will be scrambling to chase the next pump that could bring life-changing gains. And the best news is that you're already better positioned simply because you're still here. So, while things might feel a little gray now, the future still looks bright. Okay, folks, that's quite enough for me. Now, we want to hear from you. Are your friends still talking about crypto, or are you the only one left? Let us know in the comments below. If you want to learn more about the rotation from gold into Bitcoin, then check out that video right over here. And if you're wondering what are the top trends to watch in 2026, then check out this video right over here. Thank you all so much for watching and I'll see you again very soon. This is Lewis signing off."
    }
]