[
    {
        "video_id": "dI-VVpRSN0g",
        "title": "Get Rich in 2026! No Bs Guide",
        "published_at": "2026-01-13T12:30:20Z",
        "sort_date": "2026-01-13",
        "url": "https://www.youtube.com/watch?v=dI-VVpRSN0g",
        "transcript": "Happy new year. Here are my three New Year's resolutions for 2026 and I hope you will find them useful in your own life. And yes, yes, we will also look at the major charts for Bitcoin, gold, silver, altcoins, stocks and so on. Resolution number one, I will stop posting about the mismanagement of Western countries. I get so angry and it's never ending. The fraud in Minnesota. Billions of dollars meant for the children. Gone. Europe. Here are new companies in the US versus EU market [clears throat] cap. Wow. EU makes more fines from US tech than tax from all public European tech put together. Wow. Our plan for the future is to be a parasite. Really? And what are they doing about it? More hostile regulation which will obviously make this problem even worse. United Kingdom arrests for online social media posts. Here's UK, Bellarus, Turkey, Russia, Iran is like down here. Wow. Less known maybe but perhaps even bigger impact. The UK is removing the nondom regime which was one major reason as to why London became the financial capital of the world. It basically meant that if you were from somewhere else and you had money and you moved to the UK, you got a favorable tax setup. It was a smart way to attract profitable people to your country, business owners and people with money. Then what do you think happens if they remove it? Well, those people will probably move out again, right? And it's not only the Revolute founder. No, here is United Kingdom. more millionaires are now moving out of the UK than from any other country in the world and by a huge margin. And in the UK, the top 1% of taxpayers pay 31% of all income tax and the top 5% pay more than half. So if they move out, who's going to pay for everything? It's like a slowm moving avalanche. Nothing happens immediately because there is so much money collected from the great work of earlier generations. People are still sipping their hot chocolate, watching the beautiful snow on the mountain. It doesn't hit immediately. So, no one feels any consequences from the bad decisions yet, but it will hit. Ah, but at least they provide a safe and secure society, right? Well, in the west, we used to have this mind the gap at the subway or metro. Now it's mind the grab. Someone tried to grab your phone. UAE announced that it will cut funds to citizens who want to study in the UK out of fear of Emirati students being radicalized by Muslim Brotherhood Islamists on British campuses. Norway introduced tax on unrealized capital gains. Doesn't sound so bad, right? But what does that mean if you're a startup founder? Well, they will tax you based on the paper value of your company, which can be a lot, even if you have no money to pay the tax. So, no sane digital founder will build their company there anymore. Again, the avalanche doesn't hit immediately, but they don't want any more companies and my own country of birth. This post became my most spread post of 2025. When I was born, Sweden was the richest country in the world. Today, I can't live there. You can read the post in full. It's on my ex profile on New Year's Eve. What the problem is, what I think needs to be done to fix it is in the post. They are doing something steps in the right direction, but it needs more, tougher, faster. I made a lot of posts because I hate the current state of Europe enough to want to change it. And I love Europe enough to think it's worth saving, but I won't do that by posting on eggs. and I'm not willing to become a politician and actually put in the work to fix it. At least not now. So, my New Year's resolution is to stop whining about it. From 2026, I want to be a beacon of positivity and opportunity. Now, I've shared my insights, my suggestions for what to do on my ex profile, and this video rounds the subject off on my YouTube channel. That's it. Now, I wish the legacy countries good luck and I'm covering it today in this video for a specific reason. There is an investment related opportunity here outside of what I usually talk about here on this channel. It's not crypto, not gold, silver, not American tech stocks. Can you guess? I rarely talk about real estate but there is an obvious opportunity when there is massive change and you can clearly see where things are going. So let's look again at this chart where people are moving from and to UK especially stands out especially when you consider the size of the countries because these are number of people not percent. So if you compare the size of UK versus China and India, many people in China and India dream about a life in the west or America while many people in the west dream about a life in Asia. But there's also a huge number of new millionaires created there which we will look at later. Same like Vietnam, they typically want to move to Canada for example. So these countries in Asia will remain big winners for that reason. But then we have more western countries here. France, Spain, Germany, Norway, Sweden. Again, we have to consider the size of the countries. So, these are the losers. Huge winners that have done everything right, which I have said since like forever or obviously countries like UAE, Singapore, secure, good tax setup, active strategy to attract entrepreneurs and people with money. It's not rocket science that it works. Switzerland has done really well. Region Zuk for example, massive entrepreneur magnet. The US is doing well too compared to the other western countries. Supportive of businesses, culture of pro- entrepreneurship, good access to venture capital, reasonable regulation, not trying to find and stop everyone trying something new. If you followed crypto and AI, the contrast between EU and the US has been stark. US talking about making their country the world capital of AI and crypto while in EU Apple has to disable basic AI features on the iPhone because of some weird regulation. The US dollar is now almost the entire stable coin market. I think the eurobased stable coin has a market share of 0.1%. So of course a lot of people move there. Less obvious and very interesting are these countries. Italy, Portugal, Greece, Malta, Cyprus. What's common among those European countries? Well, they offer a good quality of life and they have good tax schemes. So, rich people move where they are treated well. Then they move to that country and they will pay the tax there. Instead, they will fuel the economy by participating in society and if they have active companies, they will create the jobs there. So, there's many great examples here. I love this chart. It brings me hope. It's promising for the future that people do vote with their feet. Attracting people actually works. If you offer good setup, good quality of life, good tax setup, people come to you. bad setup, people leave. Good work by good politicians is rewarded. Bad decisions have consequences, not immediately, but over time. There is a fairness here that I like. Now to the important part. So what I think will happen now in 2026 and accelerate onwards is that more and more people will move. This will get more extreme. It will accelerate because work is increasingly digital. So people with money, entrepreneurs with digital companies, they can move. Countries will more and more compete to attract the best people just like a company would. The winning countries who try to attract the best people, the professionals, the experts, the entrepreneurs, the investors will start winning more and more. And the losing countries and regions will be those seemingly determined to instead attract the slackers who don't work or people who come with no papers at all and therefore could be pirates or thieves or worse and at the same time making it more and more difficult for their star workers, their entrepreneurs, their builders of the future. I think this chart will get even more extreme, even bigger differences. So, the practical conclusions for you. Number one, for yourself, realize that you can move. Instead of being sour and whining like I did, move. Number two, if you own or plan to buy a property, think very carefully of where to do that. You don't have to be Einstein to figure out that the property market in central London if the trend is like this not so great down 35% down 20% from peak which was 10 years ago while prices have gone up in UAE and in Singapore in real estate you make or lose money on the change right but there will be other countries playing their cards right less obvious earlier on the trend Singapore and UAE I talked about 10 years ago. Try to find them early and they will seem unexpected when you do. If we now look at the total millionaire growth in percent over the past 10 years. So now not only people moving in but also including those already living there and becoming millionaires. What do we find then? Shenzhen, China, USA, India, USA, China, Dubai, Bay Area, USA, Miami, Washington, Austin, Wangju, Dallas, and before New Delhi. We have Warsaw in Poland as the only city in Europe. Poland was a poor country not long ago when I was a kid. How long ago was Poland a socialist country? Poland was a socialist country from the end of World War II until the fall of communism in 1989. Known as the Polish People's Republic, characterized by Soviet influence, a Marxist Leninist government under the Polish United Workers Party, ending in 1989 to 1990. And now Poland is on track to surpass Japan in real GDP per capita. Blue line Japan, orange line Poland. Wow, we've just seen El Salvador transformation. Maybe Venezuela will turn around now. Here is the Venezuela stock market after Madura was captured here. Cyprus, which we also found here on the list. Instead of removing it like the UK, they are improving their nondom scheme and they're lowering crypto taxes. There's quite many of these Mediterranean countries that are doing everything right. So even if you don't want to move to or invest in Asia, there will be other places for sure. There are many other winners maybe closer to home. If you live in the US, look in South America. If you're living in Europe, look at which countries are playing their cards, right? Look for the new winners. That's what I will do. That's the positivity and opportunity in this. I wish the legacy countries best of luck. No more posts on X. And this wraps up my commentary on this subject on YouTube. My second New Year's resolution that could also possibly be useful for you is this. I will take exercise more seriously. Wait now. I know everyone says that every year, but I have a new mindset that I think could help. I'm not 20 anymore, and from the YouTube stats, I can see that you probably aren't 20 either. At 20, you can just take it for granted that the body works flawlessly. Those days are over, guys. The body needs maintenance now. And a day where you have no issues, no cold imported from kids school, no influenza, no joint inflammation, no freaking dental operation, no pain or disease. That's a chance to train your body. That's a gift not to be taken for granted. I did exercise in 2025, but not enough. I didn't get fat, but I lost some muscle. I didn't maintain load on my joints. I postponed it too many times. Now, from 2026, I've changed my mindset. Now, a day where I'm perfectly fine is a gift to train my body, and it's a gift I shouldn't carelessly throw away. and neither should you. My third New Year's resolution is to execute even better on my own investments. 2025 was a massive success for me. I actually doubled my net worth and my crypto trading portfolio even more almost 4x 3.81x to be precise. It's audited in my company so it's pretty precise. And that was in a difficult year in crypto. But there was a brief period during the summer where things worked in high volatility also dominance actually fell like a stone. While if I overlay the price of Bitcoin, Bitcoin held stable after a period of going up. And if you've been here for some years, you know that that's the environment that I always talk that I'm looking for where Bitcoin has gone up to a higher level but then stay stable. So starts getting boring and people then take some of their new found riches and deploy it into higher volatility also it great many of the altcoin versus BTC charts went up a lot while Bitcoin versus the dollar held stable or also went up. But then it was over almost before it started. That's what she said. Everything else in crypto 2025 was mostly just chop and fakes and at best I managed to lose as little as possible and I didn't get wiped out here on the 10th of October as many others. So I'm very proud of my results. It wasn't easy. I also got a lot of growth on my YouTube channel over the year. You guys have appreciated what we've done. We covered gold before the pump, silver before the pump instead of after the pump as all the other influencers. Huge thanks to Mark Coops here. Turns out that commodities and tech stocks weren't so boring after all, was it? I helped many steer clear of the big bomb on 10th of October which liquidated many other people after a decade of trading. I think some of you will remember that bare cap forever. We did pretty well analyzing Bitcoin in this terrible market, not only here, but in the earlier moves as well. The new launch line process and launch line Pro 3 really delivered in what could have turned into a disaster year. So, looking at the growth, hundreds of thousands of you have clearly appreciated the value I could bring you this year on the channel. Thank you very much. So in summary, an amazing year, epic success on every metric. I could kick back now and start living on past achievements, but I won't. I've been here before. I was very successful also in my past life in the telecom industry. And success is a dangerous place. The risk is not when you are struggling. Success like I have now, that's where I stand the risk of getting fat and lazy. That's the dangerous spot. I need to resist it. And the antidote is constant improvement. Kaisen, this year I want to take my own investment to a new level. I have great plans and ideas and I will reveal them over the year as it goes along. Hope to blow your mind a bit. One final point of wisdom at the start of this new season, if I may, before we go to the charts. I'm very excited to be back today. I've had a wonderful holiday with my amazing family, my incredible four kids, full of love and togetherness. Beyond the basics, I haven't worked much. I try to take at least two periods of deep rest every year. The concept of seasons has been very useful to me in my professional life. Seasons of intense work than a season of deep recovery. I think that fits us humans better than a constant average. You go out to hunt the mammoth, trek for days and nights, barely eat or sleep, and you kill the mammoth. You drag the mammoth home. Even tougher, you arrive exhausted. Then you have a period in the cave sch smoozing on the mammoth fur, eating mammoth meat, allowing yourself to be a little lazy and maybe come up with new ideas for the new hunt. I've concluded that for myself this is one reason as to why I can easily stick to one field long enough to get really good at it. for decades. While most other people get bored or fed up after a few years or even months, mastery doesn't happen overnight. Time in the field, time in the market wins. So, here's my advice for you. Use this tactic with seasons or any other tactic that suits you to stay in the game long enough. That's how you win. Investment is a long game of gradual improvement. If you don't stick to it long enough, you won't make it. So, find a way to stay in the game. Find a way to hold the course. Oh, I talked so much. I lost my breath. Clearly, that lack of exercise is showing. Now, I know you want to hear about Bitcoin. It's very easy and clear here actually. And I'm happy to be able to offer you that today. This is a welldefined range here guys. I have put the lower range boundary at 84,788 and the upper one at 93,860. A range or a rectangle can be a powerful reversal pattern if this breaks up on the upside. It can also be a continuation pattern if it breaks on the downside. Rectangles are among the more reliable patterns. So I will definitely take action depending on which direction this breaks out. We can also observe that if we include the weeks, this is actually sloping upwards here which makes an upside breakout more likely in percent. But I'm not going to guess the breakout direction. I'm simply going to play what happens when it happens. But it's a great time to be back because actually nothing has happened during my break. prices back to exactly the same level and it's once again an exciting time. A lot of people have lost interest. They have quit which makes this even more interesting and exciting. There is also life again in several of the alt coins. Solana versus USD could be setting up for a small inverse head and shoulders here if this level at 144 breaks up. Solana has been a huge disappointment for 2 years straight. It has basically not been able to move out of this range at all and in fact it faked out on the downside so many times that it has morphed and I will revise the lower boundary here. XMR is another chart. I have to switch to weekly here for you to see it that has made a multi-year breakout clearly on the privacy narrative. And BCH that I haven't looked at in ages is also close to an horizontal breakout here. Cap and handle also interesting to follow. Gold, I hope you're entertained, guys. I'll make another video with Mark Coupoops as soon as possible. And I have a feeling it's going to be more views on it this time than when we talked about it before the pump. Silver, there was zero interest basically when the setup confirmed. Now everyone is emailing me asking if they should buy silver. I think it's late guys. This is high up on the parabola. Where are you going to put your stop loss exactly when the chart looks like this? I think if you missed it, you missed it. Better riskreward to look for the next opportunity instead. tech stocks. Similar story. Difficult to find new entries here. The entries were back here, guys. The clean entry in Nvidia was here at 18 in 2023, 10x ago. The riskreward is not the same now as it was then. Tesla, remember we talked about these entries at 200 something. Now price is 448. One stock where there is at least something is this wedge breakout in Alibaba. I've covered this in the Friday TA Pro report for quite some time. But in summary, it's difficult to find new entries in the old assets in the gold, silver, the tech stocks that we have covered. Instead, my plan from here is to look for the new ones. That's where I traditionally have had the most success and that's what I intend to continue to do and I hope to be able to continue to bring value to you guys here. Thank you for being with me. 2025. Today a new season starts of 2026 and let's try to smash it again guys. Thank you, D. CTO Lson out."
    }
]