[
    {
        "video_id": "gW5jD0YpAaQ",
        "title": "Palantir Just Got a SHOCKING Price Target From a Major Analyst!",
        "published_at": "2026-01-13T04:17:03Z",
        "sort_date": "2026-01-13",
        "url": "https://www.youtube.com/watch?v=gW5jD0YpAaQ",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. I hope you guys have all had a wonderful day, especially as I surprisingly saw more buying pressure than I was originally expecting in yesterday's video. And the volatility pushed us in the green with the market closing at all-time highs here. Uh interesting spots for a lot of these individual names that we've been talking about. We also see more headlines that are being released left and right that could cause more volatility, especially with the data center stocks. We're talking about things like Nibbius, Cororeweave, Irene, Cipher. We'll be talking about things like that. And also, we see Palanteer that gets a new upgraded price target from a big analyst kind of aligning with Truis's last big price hike in terms of their targets. Now, also in addition, we see crypto in a very interesting area, and we'll be talking about some of the other secular themes that I'm still bullish on in the beginning of 2026 here. So, if you're a new or returning viewer, hit the like button, subscribe for daily videos. Let's try to hit 30,000 subscribers. Follow me on X down below and pop it up on the screen. Palanteer here closes at 178.43. Uh it's down about, this is in the overnight session, down about 55 basis points. Uh you see right here, down about a dollar. So not making any crazy moves, basically consolidating on the dayto-day. And when Palanteer actually opened up, you had a decent push here to the 180s, met with some resistance, and now Palunteer is basically kind of right between its 50 and its 200 day. Um, in terms of the 3month kind of zoom out, we talk about this all the time with Palunteer is that it's in its consolidation phase here between 170 and 184. Anytime Palunteer is within this range, it basically gets kind of stuck until we see any big type of macroeconomic moves or catalysts or things like that uh that can help make a big move for this stock. One of the big things that we do have though here is City upgrades Palanteer to a buy target with 235, which is pretty close to Truis's, uh, target. I think they were like 220 or 230 something something along the lines of that. Uh remind me down in the comments down below. But actually hiking their price target to 235 from 210 really pointing to accelerating enterprise AI adoption and a potential super cycle in the Palunteer's government business driven by US defense spending. And this is because remember Trump proposed uh the defense budget to be increased to 1.5 trillion from 1 trillion. And Palanteer could be a huge benefactor out of that. forecasting here a 70 to 80% revenue growth in 2026 in an upside case. Uh basically showing here year-over-year with commercial up 121% and government up 42%. Uh while bulls cheer on the validation, you know, we still see these premium valuations, but Palenteer's been able to hold those valuations for a long time. and any of the critics that have been not getting involved with Palanteer ever since it was, you know, deemed overvalued at 20 bucks, then they've missed a lot of capital gain. Um, what you do have here on Palunteer is earnings. And I think this is going to sneak up faster than we're kind of thinking about cuz not a lot of people are talking about it right now. Uh, maybe in a few weeks here. Uh, but nonetheless, you have in the beginning of February here, post market February 2nd. That's what is the announcement date right here for Palanteer. Uh in terms of revenue estimates, that's estimated to be at 1.34 billion. Uh and with earnings per share normalized, that correlates to 23 cents. What I do like here for the earnings per share revisions over the last 90 days. You see 21 in the bullish direction, zero in the bearish direction. So still, Palanteer is, you know, really priced for perfection. What I mean by that is they really need to come out with slam dunk earnings in order to be able to maintain their valuation to continue to catch a bid. Um however, they've been doing that historically for the last multiple quarters. So I don't see any changes within Palunteer specifically in the nearest future. One thing that we can talk about here uh before we get into some of the more interesting headlines that we should start to digest and even Mark Zuckerberg coming out with a big statement today regarding compute uh you see the S&P 500 here closing near records and we saw uh some more you know uncertainty that was brought yesterday. Remember when we talked about uh the whole POW statement and regarding uh the whole criminal investigation into the spending budget on the renovations of the Fed, you know, people talking about how was, you know, more of a politically charged type of move, what's the independence of the Fed, blah blah blah. A lot of that was brushed off um to more of my surprise. Um however, you also have Trump here calling this cap to credit card rates for 1 year at 10%. That's also causing some in, you know, indigestion here. We do have big banks that are going to be releasing earnings this week. Big banks and that's going to be on the top of our radar. But, however, what you see here is the S&P 500 continued to grind up. Um, currently closing here at 6977. I mean, this thing really wants 7,000. The bulls have pretty good control here. Uh, spies right here at $694 down about 87. really not making any crazy moves. Uh in terms of the SPY, what you do see it is um kind of right underneath its 50, above its 200, the S&P 500 index uh both above its 50 to 200. So the bulls are pretty much in control right here. I do like this in terms of it broader macroeconomic perspective. Um in terms of the market though, kind of ignoring Trump's attempts to pressure the Fed as the central bank went away uh went on anyway to cut rates. And I guess that's true that any of these type of threats that we've seen all through 2025, the Fed still operated pretty independently. So maybe that's why the market did brush it off. I can see that as a definite argument in perspective. Um in terms of the Fed largely expected to hold off further cuts. Um definitely could be an impact. Um however, I think this impact right here, I agree with the statement. It's not going to change interest rates in the near term. We got CPI data that's coming in with the anticipation of pretty good earnings this week and CPI possibly coming in below expectations. Uh, a lot of things are just growing rapidly. The economy is growing rapidly and there's a lot of good things in the short term here that are continuing to lead a bullish type of perspective. So, um, I see that and I kind of see how the market's just kind of brushing off these threats from Trump because they are continuing to come out at a rapid pace. So, we have a lot of different headlines I guess that maybe is just being digested. One of the big things here you see uh tariffs that are going to be placed on Iran or basically uh any country doing business with Iran here is going to pay a tariff at 25%. So you see some new news there. Um one of the big things that we do have from Mark Zuckz here talking about establishing a top level initiative called Meta Compute. This gets interesting because Meta is planning to build tens of gigawatts this decade and hundreds of gigawatts or more over time. saying how we engineer, invest and partner to build this infrastructure will become a strategic advantage. How we partner to build this infrastructure data center stocks really caught a bid today and made some positive moves. Uh in terms of the architecture and what Mark is doing here, I think he's competing with some of the big big players in the game. uh looking at like Amazon, Microsoft, looking at their platforms, their compute power, Zuck wants a piece of the pie, and I think he's going to do anything to try to get to that competitive advantage. Uh in terms of data center stocks, you also have Trump coming out here releasing a statement that tech companies must pay for data center electric bills. Uh have much to announce in coming weeks on data centers. Talk about taking any trades on data centers right now. uh the amount of volatility on serene have much to announce in coming weeks on data centers. Hopefully we see some green things uh because currently I do have a bullish position on a few of them. Uh but nonetheless what you see here for Cipher um at 1769 doing quite well. Uh caught a nice bid today and Cipher has been kind of in this three-month consolidation phase as you can see right here just kind of between the 20s and has a lot of support here at the 14s. A lot of people predicting that the bottom's locked in. And if this gets a push above this $18 level, this $18 right here, $1840, $11830 area. That's where you could see another breakout type of opportunity for Cipher. A lot of people are predicting that on the short term, and I can definitely see that if the bid does hold strong in Iran. You can see here also back up at 50. So for people that got in on this low here at 33.88 are making some quite good gains on INE. Uh cool to see there. And on top of that, some of the agentic AI names, I'm still having a bullish perspective here on the short term is Path. Path is up above 5% today. Was not mad at that. And you see Zetta right here that is holding this 2433 very strongly here after a pretty incredible run since it's been holding this at this level for this, you know, amount of time. I think if we get a breakout above 24, that's you could see a push possibly retesting these areas again. Could we see 30 on the plate? Um I think if the macroeconomic situation holds strong once these moving averages continue to climb up and catch up then there's opportunity for short-term uh bounces and even continued breakouts if the macroeconomic situation continues to hold strong. One thing that is not experiencing as much juice and rotation and positive volatility in terms of the bullish perspective right now is Bitcoin. Bitcoin is still at 91,000. this thing any time it tries to catch a bid back above 93, if it tries to get 94, it gets immediately sell sold off. So, we'll see what happens. Bitcoin was up here at about 92,000. Uh, you also have Ethereum that's just been kind of hanging out here at 3,100. BMR bag holders and long-term holders probably, what is going on here? But, I mean, if people are still bullish, they've had a lot of time to accumulate and add at these prices right now at 31. Uh, so we'll see what happens. I'm looking at Strive right here. The digital asset treasury for um uh Bitcoin right you see right here is at 113. This actually came up about like 14 some percent today or whatever. Um people are possibly expecting a possible merging I believe I saw with that. So that's why you could see some possible confidence coming in here even though cuz this is doing quite uh making some decent moves even though Bitcoin is not moving that much. So let me know what you think down in the comments. Peace out. Take care and I'll catch you guys later."
    }
]