[
    {
        "video_id": "PV7T7WCTHZQ",
        "title": "BITCOIN IS BACK!!!! (Bear Thesis DEAD?!)",
        "published_at": "2026-01-13T21:35:19Z",
        "sort_date": "2026-01-13",
        "url": "https://www.youtube.com/watch?v=PV7T7WCTHZQ",
        "transcript": "So yes guys, welcome to another episode and as you can see right now, Bitcoin is coming back. Bitcoin is coming back with a vengeance. It's pushing back towards 94 94.5. Basically coming back to the area we tested last week and a few weeks before that and a few weeks before that. The question is are we now going to pump and finally have a relief rally to the 50week moving average which is currently at 100K. This is of course the bullish scenario and you have a nice ascending triangle here with the target of approximately 100K. So all in all this would make perfect sense as a shortterm trade. In fact, when you go to the bull mania terminal and you see what recently flipped bullish, you'll see something very interesting and that's that Bitcoin actually flipped bullish 20 hours ago. So, as a short-term trade, I think it's a perfect perfect perfect reasonably reasonable perfectly reasonable trade to take as we are now bullish on the daily money line and we do have an expected relief rally that finally potentially will take place. Now, in terms of the long term, as you know, we're still bearish in the weekly uh on the weekly view in on the weekly time frame. We are still in a quite deep bare trend. We're below the 50 moving average. We're still in a bare trend. All in all, as a short-term trade opportunity, I think it's great. As longterm, we're still risk off. I know we started to do risk on October 8th. People still ask me, Ivan, when did you do risk with Disc October 8th? And the two here are the two things that will make me bullish long term. Number one is in case we go back towards the 200E moving average down here because when you look at the statistics and you can get all of the stats and all of the charts for free if you go to bullming.com/chartsfully free. But here at the bottom there are statistics about buying at the 200E moving average. If you simulate all of the times when Bitcoin was at 200E moving average and then you see one month return you see six month return you see one year return here is fantastic. It's very very very very good. So this is why from a riskreward perspective buying at the 200E moving average you can do it easily easy easy. Even if the trend is still bearish, you could frontr run the trend is the only exception I make in terms of front running the tra the trend. If the trend is still bearish, you can you can still buy the 200E moving average and put it into your long-term huddle and forget and forget that. So that's the power of the 200 week. So that's number one scenario where we become long-term bullish and start buying heavily. And then the other scenario long-term to be bullish is in case we really start going above the 50week moving average and basically we say goodbye to the 50week moving average here from the upside and we start going higher higher and higher towards this flip right here. That is when we lather in heavily as well. Be before that in between here it is still no man's land from a long-term perspective from a short-term perspective. Super tradable. Super super tradable. And as you know if you use the link below to partners bullming.com/partners whether you sign up on buy bit or pionx or bitunix or wix you get nice signup bonus. And then the trading here makes way more sense because if we pump to the 200 week moving average, it may seem like a small pump of 7%. But of course with leverage, it's a totally different story. So if you want low fees, if you want nice incentive when you sign up, go to bullming.com/partners or click exchanges I use in the description for for that whether it's by bit or pionex and so forth. And what's interesting with pionex is that you do get the signup bonus here for the Nvidia. You get Nvidia position if you sign up before the end of January. And actually what's interesting is that you can trade silver, you can trade gold, you can trade TRDFI and metals on Bybit and Pionex as well. I mean as you can see our silver uh bot is doing fantastically well over on Pionex. I think I'll open more because this is very important. Bots work nice in a bull trend. When the asset is trending bullish, the BS are fantastic. They're fantastic. And now as you know the silver is trending bullish like there's no tomorrow. All of the precious metals are still trending bullish. If you look here on the weekly and you see what has happened, silver, platinum, lithium, paladium, gold, all fantastic, fantastic, fantastic bull trends. Very, very nice. And then the Pionex bots, they work fantastic. If you want to copy bots, you also find it on this uh partners' uh website. And um yeah, so that that's in terms of what I'm doing right now. Short-term trading this and uh short-term with the bots. long-term as a long-term uh positioning. In terms of long-term positioning, we're still risk. Now, if you go to bullme.com/charts, which is fully free, as you know, you'll see we added a lot here. We added a lot because now we added the bubbles. It's very, very nice. Also, when you click on the bubbles, for example, you see Monero pumping. You will see also the uh token page for Monero. Very nice. You can see the chart. Uh you can open the chart in trading view. Uh this is fantastic as well. You see here bull trend for monero bam basically a 100% pump and then people are telling me see sometimes people are telling me that trendbased trading is not good because it's lagging indicator I hear something oh no money line is lagging you know all of the trends they're lagging well the thing is no one knows what's going to happen we can only react so yes in one way you can say that we only act on a confirmed bull trend in one way or another you can say potentially lagging but listen who cares if it's lagging or not lagging I mean you see yourself when the bull trend is confirmed is the best kind of entry you can wish for and from a riskreward perspective if something is in a bull trend it likely will be continuing in the bull trend that's why when you go here on let's say commodities you have 153% pump since the bull trend in silver I mean silver is it sling I mean it's fantastic the best riskreward also instead of guessing when to enter entering on fakeouts being absolutely destroyed you have a very nice system here with trend following and mechanical rules that ensures that no matter what happens you did the best possible riskreward scenario. And really, it's all about the mechanical rules. I keep repeating if you click the link below for bullming.com, you can watch it. But I I just want to comment on this because some people they're they're confused. They think that you can predict. They want to predict. But the thing is just predicting what will happen is impossible. But then you also need to predict when it will happen. So it's double impossible what will happen and when it will happen. You want the two double impossible predictions. Instead, just see what the trend is. Relax. Let's take it easy. Relax. Is that how the song goes? Anyway, it's very very correct. Now, also looking at the ETF, you see here also ETF inflow outflow. We did see a bit of inflow yesterday. So, that's good. That's good. Uh ETFs getting a bit of inflow. And all in all, January currently is minus 92 million. Not too bad. I mean, you look at December, it was minus a billion. So January so far not too bad when it comes to the uh ETF inflow outflow. When we look at what the uh wallets are doing over at the hyperlquid you see the giga chads with 1 million or more uh profit are slightly bearish. So this is an interesting change. I think they are now positioning for the breakout uh towards the 50 moving average. Guys, I think this this is quite significant because normally they are bearish. Normally they're just bearish. Now these giga chads are positioning more towards the bullishness and I think they are expecting the 100k to come very soon. We will of course play the 100k song if we get back to 100k. People also ask Ian will play. We will play the 100k song if we get back. But this is new. This is new. As you can see they're now slightly bearish. Before they were mega bearish. And just so all of you who don't know Hyperlquid is decentralized uh per trading decks. So we can see all of the traders their P&L and what they're doing. So uh you have also big brains 100K to 1 million profit. They are slightly bearish. Okay. And before they were just bearish and then everyone else sacrificial plebe who just lost 10K. He still thinks he's going to make it big and not having mechanical rules just going for gut feeling. Lost you know between 10k and 100k still hopeful sacrificial play but he's super bullish. This guy has been super bullish. Minus 90% in all coins. Then this one 100k to minus 1 million. We call these guys other holders. They're also slightly bullish. And then you have the recess. Very bullish. Not just bullish, very bullish. Fantastic. Fantastic. Fantastic. So that's that. Also, we added crypto news. If you click here, booming.com/charts and com to crypto and trap news, you can just see what's happening. 39% of new sentiment is bullish. Okay. 17% is bearish. And here we also added a bit a bit of AI analysis on what's happening. So for example, JP Morgan is warning that the stable coin yields are dangerous. And this is by the way a very very dirty trick they use because basically want to kill their competition. The banks want to kill stable coins that give yield. So JP Morgan CFO is coming out. Why is he coming out? Why is he coming out? Because right now you have the market structure bill uh being debated because they just put in this prohibition about the stable coin reward. So this just happened today like this just happened today. Both this JP Morgan and the Senate thing it just happened today. Okay. That they want to ban the banks in the new market structure bill for crypto. They want to ban stable coin yields because of course it's competition for them. Instead of having the uh bank account with yield now you can have stablecoin with yield. It's way better. So they are panicking and uh yeah you can read more what's happening here also you can sort by sources for example you can just read the high trust and high trust is just you know this bigger sides then you have low trust it's you know it's this uh yeah I mean some of them are are you know a bit homemade website but sometimes they still have interesting news so we still keep them but if you want to filter you can filter on the on the trust so to speak. Now speaking about news, you see here Soul is eyeing a potential breakout. If Bitcoin runs towards the 100K level, Soul could try to go here for for 190 if we see this cup and handle play out. So keep an eye on that. Also again, uh may not seem that big if you just measure 1x, but if you use Pionex, you use weeks, you use by bit using the links below, nice bonus. I mean, it's way more. It's way more. Obviously, you need risk management. obviously need to know what you're doing way more. But uh that's that's how I'm thinking and that's how I'm approaching this because obviously short-term trading may sound I mean it may sound boring if you have never done it but that's that's the name of the game. Longterm with the bigger bags just sit on your hands because the market is mainly bearish. There is no big sign of reversal which may come later on. Uh but for now longterm we're sitting on the hands. Shortterm fantastic opportunities of course in alts but also in metals. I mean to be fair also in metals uh and also in stocks okay not only in um in in crypto but also in metals and stocks because there is a different regime now I mean there is a different kind of regime now in in the in in the markets where you have Nvidia 45 alphabet 96 I mean this is kind of crypto returns but in stocks you look here what has pumped the most since it flipped I mean a lot of this some of them are smaller companies but you know it's 1 billion two billion company here's some small penny stock from Malaysia that pumped a lot If you have Bulmania, if you have joined Bulmania, you watch the video about the mechanical rules below, you have access to this. But you see, you need to be 360 investor that is looking everywhere, not only crypto, but every ever ever every everywhere. Now guys, I have one chart I want to show you. It is a bit spooky. What can I say? It's a bit spooky. It's a bit of Christmas past. The ghost that is haunting us from the Christmas past. If you want the spooky chart, smash up the like. Let's get to 4K likes. Big shout out to uh to Crypto for you for time stamping us today. I see everyone in the comment section. Fantastic. Smash up the like. Let me know where you're in from and let me know about this uh this time. I thought that we switch up morning evening, but let me know if you like if you like this time. So guys, let's go to the spooky spooky spooky chart. If you go to bullmia.com/charts, this is a fully free website as you know and you go right here to performance by year, you can compare the current year to previous years. And if you want to look at the midterm years in particular here, midterm years, midterm years uh is 2026, 2022, I mean whenever there is midterm, some people complain that it's a very US-based naming, but I mean that's what everyone knows it knows it as. So uh you see here the green chart is 2026 and we're pumping into the 13th 13th day of the year which is today. We pumped also into the 13th day of the year in 2022 and also this orange chart in 2018. Okay. And in 2014 the yellow one we pumped into the 11th day as you can see. Also, interestingly, if I put in the average, it's also like the average of everything is that we pump on the uh on the 13th day here and then we go down and down and down. Okay? And then another uh small pump is going to be on the 20th. So guys, will this spooky chart basically overlaying midterm years have any effect? We will see in the coming days. Okay, we will going to see in the coming days. That's why if you're trading, set stop-loss. If you're trading, do position sizing. If you uh if you do all of this, it's a fant I mean you have fantastic opportunity. But you should know that this is one of these things where the ghost of Christmas pass is coming for us. It may come for us. That's why stop-loss we have we have bull flip on. So we have to follow the strategy. I mean again these charts they're more as infotainment. We have trend is there. Chart is looking good towards a 100k breakout. If guys still we need to close above resistance. We may get rejected here. If the ghost of Christmas past is correct, then we're just going to get rejected here. Tomorrow you wake up, it's going to be 90. But if we close above here, then you can take the trade with a tight stop loss knowing that the ghost is is is haunting you. But um yeah, that's uh I think in the coming days we're going to know. We're going to know for sure what's going to happen. Okay. Uh that's that. Next uh let's move to other charts. Let's see. I added a bunch of charts here. We have fear and greed. As you know, fear and greed index. I think we commented on it. uh a few days ago, but uh now it is pretty much uh fearful, but uh it's where normally bottoms are. The problem with the bare market is that bottoms never end. I mean, yes, it's bottom here, it was bottom here, it was bottom here, but here the bottom just kept bottoming. So again, until Bitcoin is bullish long-term on the weekly, uh we are riskoff. We we're uh we're cautious. We're protecting capital. Uh then what else? We added global liquidity. You've seen I showed you dollar strength index. You've I've showed you balance sheet. I've showed you. Oh, yeah. Yeah. Yeah. And then also the uh crypto prices here uh and the crypto bubbles here. You can go nuts. And uh let me know what what else you want. I think we're going to be adding more stuff here to the token page so you can easily understand where it's tradable. Now we have uh open and trades in view, but I think we're going to add some exchanges here so it's easily to to get trading. But that's it. basically put it as your homepage because the goal with my my goal with this like booming.com/charts is that whatever I check every day I want it in one place one place if I check let's say oh yeah the another thing global asset ranking this one this one if I check if I want to check global asset ranking I don't want to dig up that page I mean god knows where it is uh I need to remember like a million hero you check fear and grid here you check global assets here you check uh global liquidity you check like you have a million tabs you need to keep track of them websites are made by freaking Boomers. They are so slow loading. They're not nice design. They're not nice design where you check news to go. It's I don't want it to be like this every day. Every day I want the coffee every morning. Very nice. Very nice coffee. And then I just open it here. Everything is here. Whether you want the global asset ranking silver now by the way bypass Nvidia in the last few days and it is now the biggest asset behind gold. Okay. Then you have Bitcoin here above TSMC below Amazon. Berkshire, our friend Warren is right here below Tesla. Okay. Then you have platinum right here below Samsung. Then you have let's see paladium. Padium here below Proctor and Gam. That's fantastic. That's fantastic. So set bullman.com/charts as your basically homepage. I mean why why not? What else you going to check? What else you going to check instead of checking your local news? Check this. Check this. Check crypto news. You see here bam. 39% bullish virtuals explodes 86%. Did you know that? Well, now with uh bullncharts, you know, you can read what it is. Some pump. Okay. Now, the be the best thing is if you can frontr run a lot of these pumps. Oh, boom. You see new news. New news published. Bum bum bum bum bum bum bum bum bum. News. New news in real time. Bum bum bum. Now, the best thing of course if you can frontr run the news. And the way you front run the news guys is when you look at bull trends. When a trend is looking bullish, you're front running in the news. That's why normally I call news a bit of infotainment because big players already position themselves before that. I mean big players, you know, the news this and that. They already position themselves. Insiders already position themselves. The chart has already changed. The chart has already changed. You see now we just looked at that virtual thing. The thing is it's it it was already bullish before that. Okay? It was already pumping before that. So yeah, it's uh you see I mean uh here was the bull signal for the for virtual. Okay, now we read the news the pleb now read the news. If you have the money line, you have bulmania, you know, here there is pumping. Okay, easy, easy, easy, easy. But at least it's better to be the plebber reading news than to be the normie seeing it in like mainstream media. At least here it's still a bit underground. But the best thing you should do is to go to bullminga.com, watch the uh watch the training, watch the free training so you can get access to all the tools. So that's like one step ahead of the news. Um I think I showed you everything now uh now. Yes, in terms of the charts. I'm thinking every day what else I should add. Uh and yeah, let me know if you have any ideas what we should be adding. But uh I I just want everything in one place. So uh we did discuss Sana, we did discuss the market structure bill. Let me just double click on the fact that JP Morgan wants stable coins out. They want stable coins out as soon as soon as soon as possible. And that's why they're pushing now for the stable coin yield to be removed from um from from legalities from the world of legalities. It should be illegal that you cannot have stable coin yield. Instead, you need to use the bank account. And interesting that they are pushing they're pushing this into um they're pushing this into this market structure bill which theoretically should have been super bullish for us. Okay. But now the bankers maybe are ruining the party. I mean this market structure it should been very nice. Okay. It should been very nice. Basically telling you how crypto is legal, what you can do as an entrepreneur. But now maybe the bankers are going to make it not that nice because you know stable coin yield is one of the key use cases in DeFi that you can have your stable coin you deposit it you you enjoy the very very nice uh yield. Now maybe we're going to get a bit of a a bit of a backward no backhand compliment. Not really but kind of no should have been good but then you're kind of like man is it really good? Maybe not really. So that's going to be on Thursday. The vote for this market structure bill is going to be on Thursday. Yeah. I don't think it's the final vote. It's one of the votes. Also, interestingly, the big bankers, you know what else they don't like? They really don't like gold. They don't like silver. They say it's a mistake. Okay. Investors flocking to gold for safety may be making a big mistake, says gold, man. Well, I I don't know, man. I don't know, man. Like, it's a big mistake. What do you mean? Uh I mean, if you if you're late, maybe it's a big mistake, but if uh again, it's all about the trend. Like so. But are you just forming in blindly? If you're just forming in blindly, it may be a big mistake. If you are lading in like we have in bulmania, the process it's it's not a big mistake. I mean, and it doesn't on the weekly you have all of this precious metals, but even on the daily commodities are doing very well. You have copper one month ago flipping bullish, but still you see not too much gain could be the next runner. Aluminium, aluminium 10%, one month since bullish could be the next runner runner. Then you have uranium hasn't pumped too much yet. So keep an eye keep an eye here. And again you can trade them on by bit if you use the link below or on Pionex or on the Capital.com which is a trady platform. But if you already have Bbit or Pionex you can just go there. So I don't know what JP Morgan like really they have their own interests here. They obviously don't want uh hard money to go anywhere. They want full full control of everything. And yeah I mean it's disgusting but it is what it is. Uh, now let's quickly see some bubbles. You guys love the bubbles. And for all of you who don't know, we have the black hole mode. You can suck them all in. Someone asked Ivan why why why did you do it? Why did you spend developer time on making the black hole mode? Guys, the thing is we didn't have to spend any time because in the age of AI, it's all vibe coding. Like believe it or not, this whole website is vibe coded. Okay? like showing data on the screen. You can vibe code. You can vi vype code the crap. We were basically open sourcing Benjamin Cowan and into the cryptoverse with the power of AI. I mean literally. So like Ivan, why you spend time on black hole mode? I don't know. But I just told AI to do black hole mode. They did it in like a 3 seconds. Then I told it man isn't it fun if we would have nightmare mode. You wake up. Holy crap. You wake up. You're an ADA holder. Cardano holder. Bum bum bum bum. This is what you see. This what Oh. And then you wake up. Oh, it was just a dream. It was just I guess I'm not building. We're not building any of this. We're just selling a bum bum bum bum bum. Do black hole is fantastic. It's done. It's like I told it do tornado. Boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom. Very very nice. So guys this whole website I mean believe it or not it's vibe coded. I mean I am an engineer. I mean after all I I'm on tech. I have computer science education. So for me it's quite easy to tell it what I want, how to how I want back end, how I want caching, how I want API call. So for me it's very efficient to tell it listen this is what I want. Bum bum bum. But even if you're non-technical, you're a noob coder, you can still make it work. You run the risk of it making a dumb implementation. It can do that. But um still I mean try it try vibe coding nowadays. I mean it's fantastic. It's fantastic. If you and if you are an engineer you definitely have to do it because man I mean you you tell it I want backend like this. And of course, if some people are saying, \"Oh, but it's not good.\" Listen, it's very good. You just need to spend time defining what you want. The AI can create a whole PRD, the whole road map for how you want to do it. Then based on PRD, you can create technical um technical um chart exactly how you want. So nothing is effed up. Then AI implements it and AI also can check all of the requirements. No, it implements one part check requirements. Fantastic. time. I mean, if you've seen what hap what's happening with Rolf with uh cloud code, if you don't know what I'm speaking about, don't worry. But if you've been in the vibe coding ecosystem, you kind of know. So, yeah, we spend zero time on this black hole. Bam, bam, bam, bum bum bum bum. And zero time on this uh nightmare. It's very nice. And uh yeah, so what's what's happening? What's happen? Let's get back to crypto. This IP thing uh a bit of pump and dump, but yeah, always pumping nicely and also dumping. But yeah, keep an eye, keep an eye in terms of the quality, quality, quality. What do we have? I mean, XMR, fantastic, man. Fantastic pump right here. You see, bum. You opening trading view. Bum. What you see? Fantastic. Since the bull flip. Bum bum bum bum bum. Very very very nice. Uh, let's see how long it's going to pump without Bitcoin pumping. I I mean, my bet is that is it's a good thing to speculate on it, but short term short term because Bitcoin is still bearish. If Bitcoin nukes, this is going to go boop very quickly. But in in terms of trading, good stop-loss, uh good uh position size. Fantastic, man. Fantastic. Fantastic. So, yeah, good to see. Um let's see what else. What else? What else is in the bubble? Uh you have I mean all of this L2 scams having a bit of a pump. Oh my god. Yeah. I mean, oh my god. All of the ETH podcasters had big location here and like, oh, it's the real ETH. It's real ETH in real is aligned. It's ealign. We're ethyl. What do you mean ethaligned? What do you mean ethaline? What do what what what is that ethaligned? How you ethalign? Because holy crap is down a lot. It's actually like alltime low kind of thing. Okay. Oh, but we're ethine. Okay, great. Ethalign. It should have been, you know, this blue chip blue chip. What happened? What happened, man? Like, it's crazy how like how much clout some of this stuff gets. I mean, I understand if you're like a crapcoin kind of, you know, bad reputation and you dump. I mean, I kind of understand that. Like I don't blame uh policy or hexacons. I mean they got all the information possible and they still so it's like their own fault. Okay. In terms of you know someone who is responsible who believes in the vision of ETH he comes into the ETH ecosystem. He thinks okay let me find some nice blue chip nice blue chip investment. I love ETH. I believe ETH. I love Italic. And then the ETH podcasters, they shill him the crap out of optimism and uh arbitum and he thinks that oh man it's blue chip so it's kind of you know ETH arbitum man what's happening what's happening what's happening it's crazy man it's crazy that's why as soon as Bitcoin is bearish we're out of alts we're all long-term positions boop boop boop gone gone gone just now just short-term trading bum bum that's it uh now in terms of more bull bull bull We have Michael Sailor acquiring more Bitcoin, 1.2 billion. So, he's still there, still buying. That's very, very nice. I mean, for investors, it's it's very important. Now, also, I want to read to you a a bit of a story here. Let me see. I linked it in our Bull Mania Discord while I'm trying to find it. Check the link below for bulmania.com. Watch the free training about mechanical rules if you want the access blah blah blah. I mean, you know it by now, but uh in case you're new, do we have anyone new, by the way? Because you know in this market there are not too many new people. There are not too many new. Everyone is kind of uh yeah I don't know where they are. They're in gold. They're in stocks. They are in invidia. They're in SanDisk. There's we're also in SanDisk inside Bulmania. Jason was explaining SanDisk trade has been fantastic. Well for us if you are in Bulmania in SanDisk makes make some noise. I want to share with you this scam that happened. I mean it's not a real scam. I mean it's a it's a heavy word the scam but uh it's kind of like that because you see speaking about you know ETH align this is a founder who built a lot of stuff for base L2 and as you know I don't really like L2 guys I mean this is what it is I don't like L2 I don't like that you copy paste like the whole thing of ETH and there's like no good interoperability and no liquidity sharing and they [ __ ] that there is ETH align but they just steal users from ETH and like I mean I can go on here I can go on but okay okay okay let's say that you like you like bass you like bass Jesse says We love developers. Developers will love developers. Jesse on Twitter, leader of bass. Bum bum. We love the devs. Come build on base. You are my greatest friend. If you build on base, your ether line, Vitalic loves, you Jess. Okay. Okay. This guy thought, okay, okay, okay. Let me build on base. Let's see what's going to happen. Let me build on base. So build on base. We will support you. That was the promise. We believed it for three years. We shipped 10 plus products, games, a agents, prediction markets, zk, cls products. We poured our lives into building on base. What did we get? Nothing. Not a retweet, not a reply, not even a group chat. Last year, we built infected.fun, the most viral game on base. We grew a brand new account to 50k followers in a month. It it went viral everywhere. People couldn't stop talking about it. Bass didn't even retweet the launch. That was the moment something finally clicked. Something was deeply wrong. Okay, deeply wrong. Why we believed? When I discovered Bass, it felt like a no-brainer. Back then, L2 fragmentation was pure chaos. Building products was uh already hard. Choosing where to build was even harder. Then Bass launched. Built by Coinbase, ship by friend take Jesse and the team push me the push the app first narrative hard. For the first time in a long while, it felt like someone actually cared about applications, not just infra. It felt like a real builder first chain. They said they cared for the builders. They said they would help with marketing. They said they were different. In hindsight, it was just better marketing and we fell for it. We fell for it like sheep. Over time, I started losing my belief in base. The real crack, the real crack, not the bad crack, but the real crack was when they started aggressively pushing Farcaster and Zora because they invested. That was the moment, the moment I understood how this actually works. Crypto loves to pretend blockchains are permissionless and open that anyone can build and the best products will win. Since only a few apps ever hit real PMF, I thought experimentation was encouraged. But in reality, of course not. You either build what they like or you're or you're part of inner circle. Everyone else is just there to bring attention and liquidity to their chain. Exactly. On X, they say come build on base. We're going to help you go viral. We believe in them. We spent three years and so on so forth. He said zero support. Uh, I mean, I could have told you that before, but what do they do now? They go to Sanszo. They go to Solanzo. We move to Sena. 6 months later, we build this new game, the biggest crypto game of 2065, 4 million in revenue in 40 48 hours. They go to Solanzo. We did not suddenly become smarter. We just left the chain that treats builders like NPC. So, I mean, it's true, guys. It's true. I'm not bullish Lana now like because the price is bare trend and all of that but uh everything we said about Sana before October 8th you know we were super bullish Lana before October 8th I mean look where Sana was I mean it went to 300 it went from 8 to 300 since October 8th we're out we're out we're not we're not touching but what he's saying is true in the next bullo man it's going to change the world like and I'm not saying listen I don't even have the asset now I'm I mean until it's not in bull trend or weekly I'm out I'm I'm I'm out so I'm Not even like because the biggest critique is that Ivan is speaking good about Slana because he has Solana this and that. Listen, I have no Slana now until it's in bull trend. We follow the plan. Um I think man is going to change the world. Not even from the price. ignore the price like f the price. F the asset. It is really the best chain for trading for this you know building. The community is there to spend money on apps. There is no this um you know fake uh fakeness corporate fakeness. Listen listen. Coinbase is a publicly listed company. Can they a lot of these games you know you know how crypto games are it's a bit of ponzomi. I mean it's it's like that look at a any any crypto game. So by definition coin cannot really promote real crypto use cases like what digents want. They don't want they cannot promote they're publicly listed. They're going to get so much uh backlash from Wall Street. They cannot they can only promote the boring stuff no one cares about like Zora, you know, you mint a tweet. Like what what the f what what the f they promote. Okay, Jesse's main thing was you you mint a tweet. It was like it was a big thing. Did they have pump fun? No, they tried to copy but they were too like they don't have the dig DNA. They they don't have it. They're they're ashamed of it. They they see it as dirt and I don't think you can comply. Listen, I the the thing is that you cannot short like there's no nothing to even buy on base like it's Coinbase stock. I'm bullish Coinbase like as a business I think it's actually like their ETF they're powering mostly I'm bullish Coinbase but the base man it's it's this you know corporate but they try to be like you know what do you get you get you can mint you can mint a tweet I I don't get it anyway guys that's it go to Q&A bum bum bum quick Q&A and then we're out I'm going to go to the sleeping the sleeping position Let's go guys. Let's go guys. Big shout out to Crypto for you. Check out bulmania.com for the free training. bulmia.com/charts for free charts. bulmayan.com/partners for all of the exchanges. That's it, guys. That's it. That's it. Let's see. Did I forget to show something? That's it, guys. That's it. If you can just boom.com/charts.com/partners. That's the only three things you need to know about. Bum bum bum. That's it. Like one, two, three. That's it. Okay, let's go, guys. Slana stock for now must break. Yeah. Yeah. I mean, ignore the price. It's bare trend. Ignore the price. Sana is bare trend. Like, ignore it. Ignore I'm not even speaking about the price. I'm just speaking about there's a freaking nice chain and when the bulls are back, holy crap, they're going to be back. I mean, uh next uh bull trend. Fantastic. And as a builder, al also as a builder, I mean, maybe we should code something with AI on Sana. I mean now it's so easy you know instead of uh instead of inventing the real innovation here with the with the black hole mode the real you know pushing the crypto industry forward I mean guys this is more useful than Zora like all the base apps on base chain this is more useful at least you know at least you need to check the daily prices you can have a bit of fun here with the daily like this okay it's more useful than Zora or like forecaster there is always a Twitter you don't need you you need another one. And so yeah. Uh so from a builder perspective, I'm actually man I'm actually bullish on on uh on trying soul and and seeing Oh, by the way, we have chaos mode. You saw the chaos mode. Let me show you again in case you missed. Bam. Bam. You see there like chaos. So yeah, that's that. That's that. Yakimash Kazakhstan selling G reserves to buy ETH. There you go. They're not buying arbitum or optimum. Why the change in stream time? Well, I mean we didn't do this morning. I thought let's do this evening. That's it. I mean this morning I was uh coding well vibe coding. I was coding with the with a bit of AI to build uh I you know I I'm addicted to to to vibe causing guys. And I'm telling you that as an engineer, you know, I I'm computer scientist. I work full-time engineer before I started crypto. Um and I really know my name is Ivan on Techis for a reason because this was an engineering channel back in the day. It's long gone. But uh I mean listen if you if guys if you know a bit of programming like really try vibe code like it's nice because if you are a programmer you can really utilize the tool fantastic even if you don't know programming you can you can still do many things but if you are a dev man you have a bit of a superpower like it's uh you if you define the task you tell it can oneshot most things like it's crazy it can literally oneshot mo most things. I have thoughts on midnight token guys. I'm not a fan of ecosystems when there is two coins. Um there is ADA, there is midnight. It's like it's promoted by uh by other team. So I mean in I don't like that in general. I'm not a fan. So for the long term that's the answer. For the short term you you I mean you know yourself. You if you have Bulmania you trade the trend. Let me check quickly what trend it is. I mean, anything is tradable for the short term. I have no discrimination on the short term. It's bearish on the daily. It fle bearish four days ago. So, you should actually be careful here. And on the weekly, I think it's too new. Yeah, I believe it's too new to have a weekly trend. This is like Let me just open it up. Yeah, it's too new. Oh, actually, no, it's not too new. Yeah, it bearish here. So, yeah, there you go. So all in all u I mean as a am I excited I'm not too excited because again it's double coin ecosystem ada night I'm not a anywhere it happened it meant down to zero I mean the recent one hex and pulse and pulseex and all of the other craps it's like what the capital gets spread it goes to zero and also in the past I remember I was excited about the the the idea about two coins in the early DeFi days you remember when it was quite common that you stake the initial coin and then you get this like secondary coin. Do do you remember it was very common like many projects had that well guess what no one survived all went to zero so that's a lesson learned I remember like 2021 it was like it was a lot like that do you remember you stake like one coin you get like there's a third coin they of course the team they just want another coin so it's it's another uh opportunity for them but yeah so that's that's that's my uh nonfiltered I mean you want unfiltered you get unfiltered I don't want to you know blow smoke up you up your donut here uh if If it's not too great, it's I mean that's how I see it. Um, also some some news you have Poly Market now being in Golden Globes. Okay, they're going to be like using Golden Glo not using but they're going to be used by Golden Globes. That's number one. Also, Polygon bought bought a stable coin thing for like 200 million. Let me see. We need to find it somehow. It was here a few a few hours ago. Uh let's see if Polygon can finally get a bit of Mojo Mojo back. But yeah, if Polygon is on your radar, then know that they have bought some stable coin thing for 200 uh 200. Yeah, 220 million or something. Let's see. Polygon stable coin. Yeah. Yeah. Here it is. Here it is. Here it is. buys blockchain startup sequence to power disable and push. There you go. Sequence module crypto infrastructure will support payments platform powering stripe and poly market. But is this is this going to benefit Polygon holders? I don't know. Why would Stripe like have only Polygon? Stripe will have all of the assets. But yeah, it's a nice they need to do something with the capital. So that's good. I mean overall good. I love seeing something. So that's fantastic. Sky dweller. Very exactly very humble. Nice. Hermes. So you mean this one? This is not Hermes. This this is another one. But um it's the same brand as uh as the bear. But we should I'll check it. I'll check it. I mean it's it's my kind of new bare market hobby. I feel we snipe the bull market so nicely that man I like let me buy something and guys normally I never buy I really am I really am humble. It's only like this time like let me actually do something with the funds because that's what I learned in the previous cycles when when my exit wasn't as glorious as this time around and sorry for toing my own horn but I mean it's been I mean it's been quite spot on. I mean October 8th what what do you want you go check the date but you know last times when I was less skilled and when I didn't get it as good you know a lot of dollars lost even if the percent is uh of the portfolio is not too bad loss I remember like I was looking at the do I was like man you know like this crap like you know some of the stuff you buy like it's nothing in comparison to the losses you know back then so I was then I was thinking man I should have enjoyed it more, man. I mean, what what the hell? It's just numbers on the screen. And in dollars, it's so much like And then, of course, when you're down, like you you don't want to spend. So, then it's like, okay, let's uh let's rebuild. Let's rebuild. When when you're down, you're not in the mood to uh to to do anything. So, so yeah, we're updating the the studio. We updated the studio. You may have seen on um on Twitter. It's like, you know, I'm like in a pyramid here. I'm like in a pyramid. There's like Egyptian walls everywhere. And uh yeah, I mean there you got to enjoy this. I mean why you why we trade, man? Why we trade? We trade for something and that's it. That's it. Uh what is the song you're always singing? I don't know. I don't know. It's hallucination from AI. I have no clue. Uh I almost followed you and wish I did when you bought that page. You missed it. But mocha vers man similar opportunity guy guys I I don't know about mocha mo mochaverse maybe it's good but it's too too corporate man it's too corporate there's something with this and also guys I did get burned on a few like one of the things I'm thinking this cycle I mean a lot of the projects they said that they were backed by mocha anima man they went to zero holy crap like yeah I mean There have been some launches during the last bull where they said we're we're backed by mo like it was quite a few and they were actually backed by but man the quality was so bad. It was like rugs. It was almost rugs. It was rugs but with the landing page where they [ __ ] about some game. It was crazy. So yeah, I I don't know man. Maybe maybe it is like you say, but uh kind of left a bit of bad taste in my mouth there with the with that. But uh you cannot man you cannot compare you can you cannot compare to listen is still a good brand. It's still a good brand. Maybe it was just you know I was unlucky to just see those that that were like that. Maybe they had other ones that did great but I haven't seen them. I haven't seen them. Yeah. Anyway, uh you cannot compare to the Pango brand. Pango is so clean. It's a very nice brand. I hope they don't ruin it. I don't think Luc is gonna do it, but man, you cannot compare. Pango is uh I I I think Pango is going to come back big time once bullish trend on the weekly. Boop. I mean, it's it's Luka. It's going to come back big and uh the uh the penguin. I don't even track the price. It's my identity. I don't think I'll ever going to sell it. So, I don't even know what the price of penguins is. It's not something you check in the bearish times. Let me check open. Let me let me check in ETH terms. I remember I bought it for like 9 ETH when ETH was like one and a halfk or something. And now floor price is five E. And five E is worth how much? Three. Maybe I'm like break even from the last uh uh but I mean it's I don't care about it. It was 20 so it's it's my the that's also with the NFT man. You you don't sell it. It's not trading. It's not it's not a thing just for for the culture culture. Uh just look at it. Moiverse. Okay. I'll look at it. I'll look at it. But what is it like it's what is it? I I have no clue. Let me check. I'll check it. Um, can't get Helium off Coinbase. Um, yeah, I mean, Coinbase, I don't use Coinbase because I did have some issues with drawing stuff from there. It was long time ago. Oh, yeah. Also, we tried using Coinbase Commerce. This was long time ago. Man, it did not work. I remember we sold we sold something on Coinbase Commerce. I don't remember what it was like five, six years ago now. Uh, and it was so bad, man. I remember you couldn't even get an export of all transactions. I mean, obviously all transactions are onchain, but you were supposed to get a nice uh export for your accountant with everything you sold. Holy crap, we did not get it. Or actually, we got it, but it was wrong. It was wrong. And uh, you know, when it comes to accounting, man, I wanted I want it all perfect. I want all perfect. So, I was like, man, what is this? Like uh our accountant doesn't know how much we sold for what. Like what happened? Uh we export the file. It's wrong. It's fully wrong. Like it's missing stuff. It's really wrong. What happens? We need to hire a guy to go on chain, find everything on chain. Man, it is the coin with commerce was very bad. Maybe they fixed it now. If you use coin with commerce, I know do they have good export? Since then, I think we shifted to Utrust since then. And uh yeah, one time al I was also like locked from Coinbase. I just withdrew everything. Uh because back then buy bit was getting big. By bit was fantastic. Binance. So yeah, there is something with this you know buy bit they're more I mean they're so fast. You write to the support bum bum bum bum bum everything is fast. You you write to coinbase. I couldn't get any help man especially with the coin commerce. I think it took a month for it to get back. I mean literally and then I wrote back instantly because I I get notification on my phone telling them hey guys I cannot with I cannot get any export. what's happening two months later they say some corporate mumbo jumbo you know some crap uh like AI generated before AI uh with this this what I like with bid guys you write to bid support you know it's a real person because he's like no punctuation he has like spelling mistake it's not AI I mean it's always been like that he's like hello sir and then he's like spelling mistake I know I know he's there typing he's there trying to solve my issue with the uh Coinbase man got never sold solved. It got like out is like randomly they unlock the funds after like six months and that's it. I mean since that just say okay if it is this you know uh gaslighting kind of entity that uh u yeah that just speaks corporate mambo jumbo I'm out. I'm out. I'm out with bit. No issue. No issue. Always fast. Always great. That's why we work with them. That's why if you go to boommy.com/partners or click the link below exchange just go to buy bit never had an issue never had an issue even when I remember buy got hacked last year for like two billion it was crazy even then everything worked all withdrawals worked you could withdraw any amount like it it was like I I was blown away how they handled that you remember when Bit was hacked a year ago like they handled it so nice withdrawals else ever got it was mad like the team there it's anyway anyway anyway with Coinbase everything would be on lockdown for like five years okay that's it that's it obviously use your brain I don't know what's happen like you know be be use your brain okay uh use several exchanges if you use bit between bit weeks by like you know don't don't put your life savings in one place no matter how great it seems use your brain please confirm that you use your brain many people they don't they many people they they they don't but yeah I think you guys uh you guys are here so yeah some something is happening uh okay uh I just bought 1 million pengu did I buy my penguin slaughter you buy the bull trend um I think it's going to come back but you know price is price price I uh I will I've never sold my airdrop uh because that I'm not even counting it as my like my portfolio. I just got it for free for having a freaking penguin. But oh, by the way, on the daily it's bullish 23%. Fantastic trade on the daily if you have the bull mania. On the weekly, let's see. A still Yeah. Wait for this to be bullish for the long term. For the long term. Okay. What is I think penguins are going to come back big time. Big big time. But I I I just have the airdrop which which I don't view as part of my portfolio because I got it for free. So I respect the team. I respect them. I don't want to get for free and dump. I mean, I'm I'm not legit, you know, just what is this? I don't want that. I don't want that. So, yeah, I don't see it as part of my portfolio, but whatever I invested, that's that that's been um uh off the table from the free market. That's that's off the table since they flip bearish and that's it. Careful, ladies. Even a koala bear scratches stinks and pieces on you. That's true. You have koala in Melbourne in Australia. Man, you got to be careful with the spider. It's a lot of spider. A lot of spider. Holy crap. It's a lot of spider. But I'm kind of okay with spider now, guys. You know, before I lived in Sweden, it's it's a country where the spider is not that big. You know, but and and that and at that point, you know, I I I really don't like sp but now I live somewhere else where there is a bit of spider. I'm actually quite okay with it. So now I feel I'm ready for Australia. I come to Australia and was it the huntsman? The huntsman is like laying in your in your bed. You come there, the huntsman moves over. Fantastic. Fantastic. How come you hate link? I don't hate it, guys. I mean, I don't uh I It's like neutral, you know? I for me it's another one of this Hoffazi Hoffazi like supposed to be blue chip. It's in a bare trend on the daily. Still also bare trend. Uh, I mean, I I I don't have any strong opinion, you know. So, it was supposed to be this blue chip, blue chip, blue chip. But listen, don't don't drink the Kool-Aid. Look at uh what's happening. Blue chip. Blue chip couldn't even go to alltime high. Like, what what is this blue chip? Couldn't I mean, it's uh still in some kind of distribution. Okay. Still in some kind of, you know, head and shoulders. Holy crap. I mean, you see if this place like what do you want? Like I I it's not of I I don't see like how I will use it. I don't think that maybe some bank is going to use it somewhere. Like I don't know. They're not using it too much. Like where is the use? Where where's the use? Like this is see I don't have link. I don't have Salana either now for long term. So but it's different like with Sana I know like the dig energy is there. is going to come back like I can I can see it's coming back link I mean maybe it's it's like you know it depends on if bankers is swift is going to use like swift is going to use link and just it's just so uninspiring guys and I if it's bullish I mean I will be bullish on it I follow but I don't I don't like the story I don't like want to be in a community that is excited that swift is going to integrate link Oh, it's big big. Okay, go go go in Monero now. Go Zash Monero like buy something that's truly change if Okay, let's say you're not using Brain. You want to buy things in a bare trend. Okay, buy Zcash. It's in a bare trend. At least it's privacy like Cyberpunk. I think it has a great use case but don't buy stuff in a bare trend that also going to be like swift at least buy stuff in a bare trend that is cyberpunk. Solana is cyberpunk like it really is like it's you know you can build any anything is the whole world can use it fantastic on ETH L1 also cyberpunk optimism orbitum B for guys don't don't touch it's not cyberpunk it's corporate mambo jambo L2 mambojamo anyway that's that guys I think that's it I need to go to bed that's it thanks a lot for being here thanks a lot for contributing remember boom.com for education free training how to become consistently profitable. bullmayman.com/charts for free charts. Put it as your starting page, your homepage. So you come guys, I think you also crashed my vibe coding. I after this I need to check what happened because did did you all go to the token page because now token page doesn't load. I need to check it. I need to check with AI what else happening there. I think I think you guys use it too much. Let's see. Most things work but this I see you guys have effed up the token page. It's good. It's good. AI and I we're gonna fix it now before bed. Let's see if we can fix it before I mean normally know you start vibe coding it can be like five hour. Guys, that's it. That's it. Big shout out to Crypto for you for time stamping. See you all tomorrow. Have a good good day. Good evening. The bias."
    }
]