[
    {
        "video_id": "y9m4BQLXvnY",
        "title": "Bitcoin&#39;s Week From HELL, The Secret Indicator Nobody&#39;s Watching &amp; Where Smart Money Is Going Now",
        "published_at": "2026-02-09T13:56:50Z",
        "sort_date": "2026-02-09",
        "url": "https://www.youtube.com/watch?v=y9m4BQLXvnY",
        "transcript": "[music] [music] Hello, darkness, my old friend. Crypto endures the week from hell as Bitcoin crashes below last cycle's all-time high and sentiment goes from bad to worse. The one to watch. Everyone's talking about the ISM numbers being the best indicator of where crypto could go next. So, what are they and what do they tell us? Beating the bears. With crypto struggling, AI running dangerously hot, and metals cooling, where else is good to invest at a time like this? We examine some sectors that could do well in the months and years ahead. and a look at last week's top performers, tweets of the week, America's finest TA, and much more besides. This [music] is the Coin Bureau News Live. GM, happy Monday, and welcome back to the Coinbau weekly news live stream for another amazing week in this wonderful cryptoverse inter cryptoverse. How you doing, guy? >> I'm all right, thanks, Nick. I'm all right. >> Did you like the intro reel? >> I I I [laughter] did. I did. There was those photo shoots were great fun to do. >> Yeah, they were indeed. >> I liked us as potatoes actually. [laughter] >> Genetically modified guy. >> That was I wasn't really expecting that one. Maybe we could have us as different types of uh vegetable or or >> who came up with that idea? I mean, what was your thought? Like we're just going to make them a potato like >> I think I think this is just AI. This is this is what AGI is >> having fun with us. Yeah. Anyways, guys, welcome back to the Coin Bureau weekly news. Uh we've got a lot to cover this today. Of course, looking back on the week, we hope we could forget. It was quite a shocker. Um and uh we'll be taking a look at that in terms of what happened, why it happened, why we had that massive crash below the previous all-time high. >> Oh, don't Nick, don't. >> The previous cycle alltime high, not even the previous year all-time high. >> That was that was >> Yeah. So, um we'll take a look at of that. And then of course another thing, the next uh M2 indicator for this cycle, the most important altcoin season indicator is now the no longer the M2 indicator. It's the ISM. >> Okay, >> the ISM numbers. Yes, everyone was alluding to pointing to that as the most important factor to watch last week. So, we'll be talking about that and why it may be a bit misleading. And then of course with crypto struggling and you know in a bare market right now, where else could there be rays of sunshine? Where are we pivoting to next? [laughter] Where's where is the where are the good times? Where can we find the good times? Yes, we'll be talking about some uh alternative asset classes that you can invest in. And of course, you know, given the uh given the way tokenization is going, you'll be able to do all of this on crypto rails before very long. So, it is it is relevant to uh to us as a crypto channel. >> Um and uh but Nick, you've you've signaled uh with your Hugh Hefner outfit quite how uh quite how you feel about the market at the moment. >> Not in a good mood, man. market some bleeding red. Also, it's the last few days of winter here in Dubai, so I'm going to try and enjoy wearing something nice, warm, and comfortable while I can before it starts getting slightly warmer to the temperature of the surface of the sun. >> It's It is already heating up. Now folks, if you hit the like button, um Brett, uh ever reliable Brett in the comments was saying, um, \"Rumor has it that if we hit a thousand likes, Guy is going to send every person who has liked a t-shirt and five lucky people a flight ticket to Dubai to attend his secret bare market party when we hit the bottom.\" Brett, if you tell everyone about it, >> then it's not a secret anymore, is it? You absolutely blown it. Brett, your your invitation to that party is rescinded. Um, [snorts] but uh yes, hit the like button and I will at least consider the t-shirts. >> I would just love to imagine what a secret guy bare market party would look like. [laughter] >> Trust me, Nick, you don't want to know. >> At the door, the $5 wrench attack as guy tries to [laughter] make his way in crypto. >> You don't understand. It's a bare market. There is nothing. There is no token. I love you. >> Okay. Uh let's kick off uh and have a look at last week in Bitcoin. Let's get it over with. >> Let's get it over with, [laughter] man. Okay, so if you will recall, we started Monday off with a massive crash in Bitcoin below 76K, which now in hindsight [laughter] is our new 76 for >> Oh, if only we could go back to those days. Anyway, 76K, this was crashing on the news that the US government was shutting down on Saturday and it took a bit of a delay, but Bitcoin did eventually catch up and collapsed on Monday morning or Sunday evening, Monday morning. And as of per usual, this would open up a CME gap. was a large CME gap. We talked about it last week. One of the second largest ever and it still is up there. We have unfortunately did not come back and close. >> Still unfilled. >> Still unfilled, man. There we go. >> Um then as you recall last week, as I talked about at the beginning, uh we were alluding to these ISM numbers. These are the ISM manufacturing numbers which we we will get on to in the next uh section. But uh yeah, this was above 50 which signal there was an expansion in manufacturing. >> So that takes us to Tuesday and um Joy, oh joy, metals started recovering. >> Yeah, it's great. And one could only hope that Bitcoin and crypto would follow suit, right? >> Yeah. I mean, surely, you know, metals uh and then and and then we get the rotation [laughter] out of Bitcoin. >> Losing the will to live just basically staircase. It just is an elevator down, staircase up, elevator down. >> Horrible. >> This took us to a new yearly low. >> Starting the year off on a bang, bro. 73K. Um, good news though, the shutdown did end. >> Okay. Yeah. >> Okay. We got to take the positives from this. Positive. >> So, the government reopened. The US government reopened to start doing whatever it is they do. >> Yeah. >> That takes us then to weddednesday. Um, this was when the ADP numbers came out and they were below expectations. >> Below expectations. And we also had um data and from the survey, the challenger survey and this is a jobs survey. and they basically it was disclosed that it was the highest number of layoffs uh since at the start of the to start the year since 2009 which is crazy obviously that's takes into account for example Amazon for example they remember >> they laid off tons of people didn't >> tons tons >> um all while all while and then also announcing that they're investing something like 200 billion into AI >> yeah 200 billion into AI >> so they can lay off even more people >> and 50 million or be 50 million into the Melania movie. So, you know, [clears throat] money >> well spent. >> Meanwhile, he's also cutting jobs at the Washington Post. >> Oh, yeah. Exactly. And leaving reporters in the middle of war zones having to crowdfund via GoFundMe to get back. >> Yeah. Jeff Bezos, he's he's not a very nice guy, isn't he? He kind of feels like he should be in crypto. [laughter] >> Okay, >> come on, Jeff. I think I think you might have found your foundated. I know. Okay. >> Anyways, uh that brings us to Well, how does Bitcoin react to the bad jobs numbers? Well, as it usually does. just completely collapses and it kept on falling and you thought the selling was over. Well guys, um let me tell you the sellers are not getting exhausted. >> No, no. And then it just kept getting worse. Uh we broke below 70K. >> 70K 74 72 70K. We even wicked overnight to just above 60K. Oh, >> I mean >> so glad I was in bed for that. >> Me too. [laughter] Me too. I can't imagine what it and thankfully recovered in the morning because it wasn't so much of a heart attack when I looked at the price. It was still a shocker but >> and we and that was a massive crash and uh if at the worst time possible talk about timing >> Thursday was when strategy had its earnings call. [laughter] Well, do you know what though? Like I I was thinking about this and I sort of thought, god that would have been that must have been a hellish call to do like you know if you're if you're sailor and the rest of the strategy seuite and then I thought do you know what if you're on a strategy earnings call you are probably a massive sailor stand. I mean these are the hardcore people. They would probably been they were probably even more frothing at the mouth. >> They would probably had that schedule for weeks in advance. You know they were sitting there at the behind their TVs you know with the popcorn and everything getting there. Don't sell, Michael. Don't sell. Hold firm. Huddle. Huddle. >> Anyways, uh this is pretty interesting. This is the state of the timeline at that moment. And I thought it was quite funny because we posted a meme from Titanic. You if you guys remember the scene when they are playing the violins as the as the ship is sinking and gentlemen, it has been an honor playing with you tonight. So that's kind of like how Crypto Timeline felt last week. And at nearly the exact moment, Sailor puts out an image, an AI generated image of him on a boat floating as the Titanic sinks behind him. >> Yeah. Was question. Was the Titanic also on fire? >> No, but this is a very good analogy for the Bitcoin on crypto markets because even just sinking is not good enough. It also needs to burn in hellfire. [laughter] >> What a what a multitasking man. Okay. So, uh so come uh Friday, um there are a lot of theories going around about what caused this meltdown. So there's so one of the first that came out that seemed to get quite a lot of traction was this theory that there was some sort of a Hong Kong trad hedge fund that had actually been uh taken massive losses post 1010 and they tried to make it all back you know as you usually do uh trying to catch the metals trade and then they also crashed out on that and then they got wiped out because of an overleveraged IBET options margin call. That was one theory. another um although Jeff Park who is quite you know well-known options guy he's also uh used to work at Bitwise Asset Management he had a lengthy post which I kind of summarized here it was this was it's easy to point to one particular bad actor or one particular fund blowing up it's an easy quick uh explanation but there was a lot more going on there was violent moves that were driven by positioning hedging and just forced rebalancing of portfolios and it all resulted as a as a result of crypto integrating with Tradfi because you don't only have the IBIT ETFs, you now also have uh the options that are attached to that. And one other anal explanation of what happened here and speaking to that is from Marcus Telin from 10X research. And this is what dealers, if you're an options dealer, you usually have you have to hedge out gamma risk, right? Uh and um the dealers are counterparties to the buyers. And if you have large negative gamma around the $75,000 um strike level, which is where Bitcoin was, this large negative gamma means that uh they need to hedge in the same direction as the price is moving. So if price is moving continually down lower and you've got a negative gamma uh the dealers actually need to short they short that gamma and therefore they're required to sell Bitcoin to hedge out that risk. >> So that's one of the ps >> it piles on the pain. Exactly. But either way Bitcoin managed to catch a flaw with tech stocks rebounds rebalance um rebounding on Friday evening. >> Okay. So, we closed a pretty awful week on a terrible something of a high note, if you can call it that. Um, and then it was a fairly sort of quiet weekend, kind of sideways and down. Um, the big news over the weekend was uh SA Takahichi winning a landslide in the Japanese election. Now, we put out a video on this on Coin Bureau Finance, didn't we? Um, and we were talking about there how, you know, this was a this was a bit of a Hail Mary from her, wasn't it? >> It was, but it was it paid off. it paid off this she got a big majority and there's lots of people are very excited about this because she's now going the fiscal stimulus in Japan the reinvigorating the Japanese economy uh monetization of the debt that BOJ is going to print the Japanese stocks ripped so that's what happened overnight um so now what's coming this week uh so interestingly we've got because the N the government was shut down uh the delayed NFP numbers are coming this week as well and this is in the same week we've also got the CPI numbers coming out so these two are going to obviously be very important in terms of determining where Fed policy could go. Um, just quickly looking at the charts, uh, I pointed to this chart last week, the weekly chart is wild. Um, so you can see there how we fell below the 100week moving average. We fell below the the the gap was left opened. The price last week fell all the way down past the election initial election price. So we've re we re we basically roundtrip all the gains since Trump got elected. elected, not not um inaugurated. We fell through the previous all-time highs, the previous cycle all-time highs, and came incredibly close to touching the uh 200E moving average, which is the target many people have been pointing to. >> Although thankfully, we did bounce and we just just just closed above the week. We closed above the previous uh cycle all-time high and we now slightly we're at that point right now. So, we really need to close and hold above this level this week. Um and there is still hope because there is that CME gap up there. But uh you know it's quite hopeful >> still. Yes, that is that's a tough one to close. >> That's a tough one to climb. >> That maybe maybe that's the sort of one that we'll be talking about in about 6 months time or something. Oh, by the way, that CME gap, do you remember that? Finally closed. >> Finally closed. But we first need to go and close the one down to I think 3,000 or something. No, >> don't we don't talk about that one. That's the Voldemort C gap. Um, we've also got uh uh news coming in as well. We can um double check this, but uh strategy look sailor is buying again by the >> Here we go. 8 million worth. >> Nothing stops him. He's still going. >> Um, quickly, one more chart I want to show you guys. This is also interesting from a momentum perspective. Now, what this basically shows is the days with which Bitcoin trades below on a weekly chart trades below the 100 week moving average. And I've mapped this out going back to 2018. And it shows that generally once Bitcoin has fallen below the 100week moving average, it tends to remain there for an average over about um you know 200 or so days. And the shortest time that it has remained below the 200E moving average was back in 2018 uh no 2020 sorry with the co crash when it was for 34 days and currently we're at about 13 days or so um that we've been under the 100week moving average. So what that basically means is the longer we stay down below that price without uh below the 100week moving average without a snapback the more likely we are to remain down there for some time and go and touch that 200E moving average much down below at about 58 to 60k. So that's interesting as well. >> We've just got to ride it out Nick. We just got to deal with it. If you know look at that chart you you can see the general direction of travel but there are there are bumps in the road along the way. Mhm. >> Um, so people are dealing with it in the comments uh fairly well. Yikes. We're in for weeks of pain. Well, yeah, possibly. Possibly. But, you know, this is where this is where uh diamond hands are are forged. Um, uh, Rusty Lantern, I think, is echoing a lot of uh sentiment. Watching from under my bed, holding my ledger, hiding from all the monsters outside. Good call. Good call. Um, did you see this in the news? Um, someone sent BTC to Satoshi. I wonder what the thinking there was. I don't know. >> I wonder whether they were sort of trying to provoke a response. >> Is Satoshi running a uh you know a giveaway giveaway scam? You know, send one Bitcoin. That's >> Hi. Hi. This is Satoshi Dakaboto here. You sent me one Bitcoin. I will send you 10. Um I How are you? Are you warm in that jacket, Nick? >> That's okay. It's not too hot. >> Okay. They're speculating that you might be a little bit on the sweaty side. >> Do I look sweaty? No. Really? >> No. >> Hopefully that hopefully that's just the lighting or something. I [laughter] told the production team that's the worst the cardinal sin is to make me look sweaty or shiny. [laughter] >> But if you but if >> Yes. Go on. >> Oh, well I mean I'm thinking if these guys are thinking of trading these markets, these volatile markets, then uh there's no better place to do it than on our first brand partner which is Tubbit. They're a top tier international international exchange. Uh and uh they have a solid interface, deep liquidity, competitive fees, and onboarding is super simple. All you really need is an email address. Uh that's you go and create an account by scanning the QR code or hitting the link down below. Go and create an account simple as an email address. Once you have an account, have a play around, see if you like the interface, if you want to trade there. And if you do and you deposit, there is up to $90,000 in trading rewards as well as an immediate VIP level one upgrade which gets you 50% off trading fees for life. >> Nice. >> So yeah, go and check it out, guys. Tubit. >> Absolutely. Thanks to Tubbit. Okay. Now, um if you've been on crypto Twitter this week, um you must be insane. What on earth are you doing there? Um but you may have seen uh a bit of back and forth um about ISM. Uh now, if you're not familiar, never fear. We are going to talk you through because this, as Nick mentioned at the top of the screen, uh stream, this is the new M2 money supply. This is the new metric that we're all pinning our hopes on um to take us to the moon. So we better start by explaining exactly what the ISM is and why it matters. >> Yeah, we will. But first and as you Benjamin Kh alludes to it is the it's this year's versions of the Bitcoin follows M2. So the ISM manufacturing index is basically an index. It's done by a survey um by the supply chain management institute or something. Um and this is basically is an indication of expansion or contraction in the manufacturing sector and it's been contracting for the past few months uh uh on fears about tariffs and all that kind of stuff and [clears throat] many people were pointing to we need to see some sort of an expansion in manufacturing capacity and expansion uh over the next few if we're going to see any sort of recovery in the economy and sure sure enough we saw uh on uh on f on Monday last week that it it got above we got the reading above 50 which many this is an expansion. It was the highest since 2022. So as usual everyone on crypto Twitter was excited about this >> clutching at that particular straw. Obviously 2022 coming out of the pandemic slump. So I mean that is that is um that is significant the fact that US manufacturing is putting out and obviously this is something that Trump has talked about a lot. He wants he wants America to go back to making things. Um and yeah, a lot of people see this as a kind of I guess I guess a sort of proxy for consumer sentiment. >> Exactly. Yeah. Well, I mean, yeah, manufacturing capacity. Yeah. I mean, consumer sentiment will come eventually because if you have additional manufacturing, this means that the economy could be growing and the manu and the manufacturing jobs could be coming back. Although there were some nuances in the actual survey results themselves and and the actual uh statements and and comments made by people responding, but that's a nuance we're not going to dive into right now. The point is the theory for crypto is that analysts argue that Bitcoin is essentially a high beta uh play on global liquidity and growth and when the manufacturing sector expands it typically leads to increased liquidity and a higher appetite for risk assets. >> Okay. Now, we've seen uh these what are called PMI reversals before uh 2013, 2016, and 2020. Uh and anyone who's been in crypto for a while will know that those dates all preceded big legups uh for Bitcoin and of course the wider crypto market as well. Um however uh not everyone was on board with this as we mentioned Ben is Ben Cowan is a little skeptical about this right? Yeah, his his argument was he took a look for example at the co at what happened in 2016 and a few other occasions or 2014 and a few other occasions where you had PMI expansion and the crypto markets didn't react and then someone else came out with a counter to that saying the correlation only really started in 2016 um and and therefore it didn't really it doesn't really count. We even had Mr. R Pal jumping in um himself basically with this interesting uh midcurve meme and it's a fair argument to the extent that if economy is doing well crypto should do well people who you know have jobs and they're going to want to spend on food or just throw all their money into crypto and become exit liquidity for someone else. I don't know. That's the theory. But yeah, I mean, uh, that and he's also a big proponent of the, um, the 50 ISM reading and why it's important. And we actually talked about this two weeks ago when we had him on the podcast. >> So, it's it's all liquidity, stupid. >> Yeah, that's it. Well, to be fair, that's the main argument. It's like if is it going to lead to an increase in liquidity? And in indeed, are we going to see increased liquidity not just on the fiscal side, but like what's happening with monetary policy? Um, now this also relates to a conversation I had on a on the podcast channel with Michael Hal, who is a leading global liquidity expert. >> Uh, and it's definitely worth watching if you guys haven't already. But according to his theory, he breaks it down into different types of liquidity. You've got financial liquidity and then you've got uh real economy liquidity. And these two obviously um where liquidity flows if it's flown into the real economy, it's leaving the financial economy which means risk assets and and assets sell off. But his according to his theory uh we peaked in in in Q3 last year in terms of top top cycle liquidity and as a result we started selling off in the most risky assets on the on the on the um asset spectrum and those are crypto the most sensitive to risk >> and he's got he maps out the liquidity with uh with of Bitcoin's price movements with the Salana and the global liquidity indicators and moves. So what was what was Michael's what was Michael's advice then? >> Well, in a regime of slowing he's got this interesting chart which he's shared in his slides. In a regime of slowing liquidity, you should now be out out of high-tech high-risk equities and into the likes of commodities because if we moving down the uh his wave chart there, we're at the peak. We we were at the peak in Q3 last year. we moving down. We should be in the likes of commodities which many people are and have pivoted to potentially cash then when we get out in towards the middle of the year and um as we get to the bottom of the liquidity cycle you move into bonds etc. >> Okay. >> So that's his theory. >> And do we know do we have a kind of rough timeline on this? So can we just go back to that? Do we know sort of roughly how long that that bonds how how long are we supposed to be in bonds for? >> Uh I mean I think that's a few months. So we're talking like maybe Q middle of the year, okay, >> with to the trough of the liquidity. Uh but yeah, I mean it's a it's all based on the debt refinancing cycle. >> Um the TLDDR is that according to Michael's theory, you shouldn't be long high risk assets right now. Although he did mention, and this is very interesting, many people uh in the crypto space have thought, okay, well now Bitcoin is not trading uh it's not correlated to gold. It's no longer a debasement trade. It's no longer digital gold. But he made the argument that in the short term it has kind of diverged from that and decorrelated. But the long-term correlation with gold, it should still remain and it still is a good debasement trade. Uh and he said that if Bitcoin was trading one standard deviation away from the current price and on a daily chart, you should consider adding at 75K. Indeed, that was when Bitcoin was trading, you know, just below 75K. So anyways, that's another angle to take from this whole question of global liquidity, economic expansion and the how the two the interplay between the two. >> Yes. And as Dre says in the comments there, it was a great chat with Michael. There are a lot of experts out there in all sorts of things and Michael How I think is uh one of the few really worth listening to. Very smart guy. So was he nice bloke to talk to? >> Very nice bloke. Yeah. Yeah. Yeah. Very smart as well. And it was uh it was really eye opening in terms of not just the factors around um you know how you calculate liquidity in an actual country like the US but broadly across different countries as well. And he also has a really interesting theory about why gold has been rallying around China. China China basically and the fact that China has um suppressed rates because they were because of all the debt on their balance sheets, right? So they have this balance sheet recession and as a result they can't allow their currency to appreciate. So they have to basically the people get out of the yuan into gold, right? And the Chinese not just Chinese central bank but also Chinese retail buyers are just aping into gold. >> Okay. So it's not just Yeah. So the PBOC and and the Chinese people all however many billion of them. >> Okay. Interesting. So yeah, do check out that uh that interview that Nick did with Michael Hal. All right. Now, if you guys are looking to keep your assets safe, then there is no better option than Tang. Uh the Tang wallet is your all-in-one crypto solution. Not only does it function as a very safe and secure and easy to use hardware device, you can also use it as a web wallet as well. Um, lots of asset support, all the stuff that you need. And if you scan that QR code on screen, you get a 10% discount. How about that? >> There we go, guys. Scan that. >> Now, given that we seem to Is it fair to say we're in a bare market? >> I think, Nick, >> I think I'm going to ring the bare market bell. We got a bell amongst allins here. >> There's the You can read. >> I'm going to I'm going to The bear is going to roll. >> The bear is there. We are. There are still a few of those Japanese soldiers on the islands on the timeline who think that Elcoin season is just around the corner with that PMI number. But yeah, I think it's fair to say we're in a bare market at least for crypto. Now, this then brings up the question of how are you thinking about asset allocation in a cryptobear market and what other asset classes are you looking at? And I just wanted to gauge sentiment, get a bit of a community poll out last week when I asked a few people. [laughter] >> So, what other asset classes and assets have you invested in? Um, and there was many answers. Some were like metals, ETFs, and infra, uh, defense and space stocks. Good ones. >> Interesting. >> Many replies saying they didn't know that other asset classes existed beyond crypto. To which [laughter] I >> to which I had this meme. Yeah. You know, guys, you can fly out anytime. you [laughter] know, just the cage is all I know. >> Just allow yourself to take flight, but keep watching us. Um, yes. Okay. So, yeah, there's I mean, I think diversification is is the name of the game at the moment. >> Do you hold stocks then? >> I do hold stocks. Yeah, I get I get someone else to invest on my behalf. Not not not my wife. >> Um, but yeah, we have to clarify those. [laughter] >> I mean, she would probably do a better job than me. Um, but uh yeah, so I hold Yeah, I do hold stocks. Um, it's a fairly sort of it's fairly kind of safe, but there's gold in there. Um, I did I did persuade the guy to go in on uranium. >> Okay. >> Um, and it promptly went up big time and I was feeling like an absolute genius. And then it >> was it like how you get an exposure to that? Is it through an ETF? Is it >> through the ETF? You through the UR ETF, which um if you saw our uranium video, I think we talked about it there. Uh that's sort of exposure to the actual metal and the miners and refiners as well. >> Oh, okay. Cool. >> Um so yeah, it's it's it's volatile, but then you know if you're in crypto, that's what you live for, right? >> Yeah. Yeah, for sure. And then I mean if you're talking about like interesting sectors though, uh defense like like you some have mentioned it in response to that. But if you think about like sectors that are spending a lot and if you also want to play on the manufacturer and expansion but then also in the most uh bullish sector there is the they call the defense super cycle that is defense stocks and how much these have rallied and how much defense spending is going to to run hot in the next few years and just because of many obviously the most obvious reasons what's going on in Europe but then also the nuclear arms race between Russia and the US now with the collapse of the non-prololiferation treaty. Uh so that's another sector to look into. Um and then also miners like actual physical miners, copper miners and like the likes of Rio Tintos, Bulletin, all that >> Glen Core. Yeah. >> Yeah. Do you hold positions in miners apart from the ETF? >> Uh I think yeah, I think I've got I think I've got a miners ETF as well. Um but yeah, I mean you know it's that I because when you look at the metals trade it can be so you know there's so many options and and things and you think well okay is it going to be copper this week and you know zinc next week or something like that whereas if you're sort of invested in miners generally I mean I as far as I understand it there aren't that many miners that are very very specialized. So the likes of Riotinto will be pulling all sorts of stuff out of the ground like you you do get some sort of specialized gold miners and some sort of specialized lithium miners and things like that. But I think you know a lot of these big mining conglomerates are mining all sorts. So if you get you know you can get exposure to them and and that gives you sort of wider metals commodities exposure. >> Well to be fair many metals nearly all metals have been rallying right like copper uran I mean copper palladium as Ben has reminded us many times. So diversified miners may not be the worst choice. >> Yeah. And of course like with defense as well, we uh you recorded a video earlier today about the fact I don't know if you guys saw this last week. This is a little on the terrifying side. The doomsday clock um is now at 85 seconds to midnight. Um and this is because a non a nuclear nonp proliferation treaty between the US and Russia has just expired. >> Yeah. >> Um and we won't go too because you can watch the video. It's coming out soon. It's going to be great. But um you know basically we're moving into a much more dangerous world. China is trying to build up its nuclear arsenal. America is trying to modernize it. Uh Russia is you know trying to develop its as well. And in that sort of world you know and then you get like Germany taking the debt break off in order to uh in order to buy you know in order to refund uh defense and what have you. It's very hard to see how defense stocks aren't going to go up. >> Yeah. And it's and the also coming back to the NATO target was adjusted up to the it was previously what 2.5% of GDP and I think it's now NATO target is 5% of GDP that's a massive jump and I think yeah in Europe now they Europe is expecting to spend over 400 billion in like defense over the next few years. So yeah I think that's uh that's the real super cycle the defense super cycle. Yeah, >> it may it may end up with our with our eventual demise in a nuclear winter, but at least you can make money on the way on the way up. [laughter] >> At least you'll be able to afford iodine tablets and water purification and handguns and whatever. >> Um, yeah. I mean, it's it's a tricky one, isn't it? because I know a lot of people will be sort of ethically opposed to investing in defense stocks for you know I guess you don't want some people would object to sort of funding that sort of thing which is which is kind of fair enough really but you know do you want to be do you want to be right or do you want to make money I guess exactly >> what it comes down to um but yeah we are moving into this uh into this much more much more dangerous world so it kind of makes sense um whether or not we're going to see tokenized defense stocks anytime soon so we can you know buy them on chain I think we should. It's not hard to do it. You just tokenize it on Salana, Superstate. There we go. Raon on the blockchain. >> Yeah, >> there we go. >> Okay, you heard it here first. >> But if you guys are looking to um trade tokenized stocks or commodities on on a crypto exchange, uh then there's one way to do it. It's very super simp. It's super simple. All you can do is use Bitket. This is our second brand partner. Uh now you can basically go over there and you can trade all types of uh you can just swap your Bitcoin for tokenized gold and tokenized stocks. First of all, if you don't have a BitKit account, you can sign up right now uh scanning the QR code on the screen or hitting the hitting the link in the description. Uh and then you can there trade directly with your USDT up to 500 times leverage on on gold and and other stocks. >> Okay. >> And enjoy deep liquidity and low slippage. Uh, and also you can avail yourself of up to $50,000 in deposit bonuses on Bitket as well. >> Absolutely. Absolutely. Okay. Right. It is time uh it is time for a bit of TA now. So, we got something a bit different for you this week, but we're not going to tell you what it is. So, let us know. >> Surprise. It's an Easter egg. Let us know, guys. [music] EXACTLY WHAT >> Hey guys, Aaron here from Coinb Trading providing a quick technical analysis update for Bitcoin, Ethereum, and gold. First off, we know that there was a massive, massive drop and a pretty interesting rebound that happened last Friday. The price of BTC dropped down to $60,000 and then it shot up about 20% to 71K. But the big question you're probably wondering is why isn't Bitcoin just shooting up a lot higher? Well, the reason for that is because everything is super macro bearish and it's not just the trending breakout indicator. It's also onbalance volume. It's also a huge decrease in volume after the big spikes that we saw. Now, what I do expect to happen next is a pullback for BTC that will inevitably make a higher low, which is going to give a false sense of support for bulls. And what will happen next is possibly a higher high. But unfortunately, for those of you that have been watching the channel, you guys know that this is the textbook setup of a bare flag until finally that bare flag is broken and the price loses support, tests it again, and drops. I am not kidding because that is literally what happened back over here. Our low on Friday, November 21st to this low on December the 18th. If we draw it up here, you can see this exact thing happening. literally textbook comes up, breaks it, tests it, falls so much further. So, I expect the same thing to happen for Bitcoin and Ethereum. But Ethereum has even more bearish signs here. You can see this dotted line right here and the price failed to close above 2111. What's the deal? Why is that such a big deal? Well, if we go here to the weekly time frame, this price of 2111 is significant. significant as in it's been a pivot high and a pivot low for the price of Ethereum going back all the way over here to April 2023. Dare I say even over here to January 2022 is a significant level and it literally just got broken through like a bullet going through a wet paper towel last week. So looking at the current price of Ethereum, it is destined to drop a lot lower. But again, like Bitcoin, I'm expecting for a higher low, which means if we have higher lows and higher highs, we have another bare flag intact, which means it will give a false sense of hope before we lose it and we go lower. Gold. Now, a lot of you might disagree with me on this, but I'm actually very bullish on gold. I still think that gold has a good chance to shoot up to my target of $6,500, $6513. And what's crazier is that if we just draw a Fibonacci retracement over here from this top in January to this drop here in February, look at where it gives us our 618 right at $6,500. It literally lines up perfectly with that level. I'm not saying that this Fibonacci move is going to happen immediately. I think with all this chop consolidation, it's going to take a little bit of time, but inevitably I think gold is destined to move up another 30%. And that's my update for you guys. Wow, there we are. Yeah, TA TA courtesy of Aaron this week. Don't worry, folks. Lewis has not been fired. He is just uh taking a bit of time off. I think he's uh I think he said he'd gone to finalize the purchase of a warehouse to keep all his metal in. >> Exactly. Yeah, he's going into physic the physical metals trade. So, he's basically going to take delivery of all that that silver he bought at the top. [laughter] >> Um yes. So, don't worry, Lewis. Um, I'm not sure if Lewis will be back next week, but he will be back soon. Um, so our thanks to uh to Erin for filling in there. Wonderful as always. Erin, we we'd love to see your face next time. It's It's not the same, but thank you for that. And um yeah, see you again soon. Okay, Nick, should we have a look at some tweets of the week? >> We've got quite a few to be honest. This started off with like 20 different tweets cuz I was doom scrolling last week. I don't know why. I don't know. But there were a lot of good takes last week. But um you know, gallows humor. >> Mhm. >> This first one is pretty interesting. [laughter] Yep. Yep. That's that's that's the timeline summed up. Okay. Next up, uh we have this from Zerox Bags. >> Damn. >> You know that >> very good. It's some good photoshopping >> there. Just you know that scene when they're basically just looking at he's driving. The speedometer goes over 120 140. [laughter] I should have sold at the top. I should have sold at the top. Dad, are you okay? Are you okay? I thought you were in profit. >> We're going very fast. >> Oh my god. >> Okay. Uh next up um we haven't seen we haven't seen enough of Vitalik recently. What's uh what what's behind this? >> So firstly this yeah he came out of nowhere basically he gave a very long post and um as well as a blog post as well but the TLDDR is that he thinks that the L2 um ecosystem is it's basically you know the the road map of the L2 uh growth of Ethereum is kind of dead. Um which I think many people took issue with to a degree. uh he was also selling ETH last week albe it smaller amounts people were asking what's going on here mate um but irrespective that he came out of nowhere to basically throw shade at layer twos and the fact that he's dene there's one thing that we can thank Vitalik for and that's the fact that at least he's not [laughter] in the Epstein files >> absolutely well I mean dressed like that they wouldn't let him in >> I mean true [laughter] >> um okay uh right next up we have uh this um uh from Platinum Sombrero buying Bitcoin on the thesis that Trump may need to be left [laughter] for son. So this is is this is Eric Trump. So he's Yeah, he's now got is this American Bitcoin? >> American Bitcoin. He's taken them on a tour of their mining facility. >> Okay. It did look pretty impressive. >> Okay. Uh next up we have uh this Oh, so so Ben Cowan is Ben Ben is owning Twitter at the moment. He is going for it. He is he is not uh backing down from uh arguing with people on Twitter. Um and he's taken on one of the uh one of the big names, the uh the top G himself. Um I wish I could do an Andrew Tate accent. It's so easy. It's so difficult to do. Um but yeah, so um Ben basically just uh putting receipts. >> Here we go, man. And he's bookmarking. I I would love to know what Ben's bookmarks look like. I [laughter] mean everything from the Cardano shell to Andrew Tate to the eyes. >> He must be having to download them in a zip file surely by this point. >> Yeah, exactly. Oh, bro. >> Spends half his time just searching through his uh through through his bookmarks. You keep going, Ben. You you keeping those receipts. Um and uh we also have this one. Um >> yes. So, uh these are a list of possible Satoshi candidates all the way back to 2010. I mean, talk about diminishing returns. >> The fact that people are saying that god rather the fact that Craig Wright is now a better candidate than the likes of the current candidate [laughter] shows you how far we've fallen. >> We didn't know how lucky we were when it was uh when it was Craig Wright. Okay. Uh so that is tweets of the week. Um and any dates for the diary this week, Nick? >> Yeah, so as I mentioned, the delayed US employment report is coming out on Wednesday. There's 55K, which is the expected number versus 50K previously. Um, Thursday, we've got initial jobless claims. So, 220K expected versus 231K previous. Uh, Coinbase earnings as well on uh Thursday. I don't know if you guys caught the Coinbase ad over there in the States on the Super Bowl. There were quite some quite a few takes on that. It was interesting. Uh, >> I think that kind of summed up crypto, didn't it? [laughter] Let's just say the normies weren't too much of a fan. But anyways, Friday we had C we have CPI inflation numbers uh 2.5% expected versus 2.7% previous and the core number 2.5 versus 2.6. >> Okay. Okay. >> All right. Uh we'll just quickly check in with what's in the comments. Guy, please get Thor's autograph for me. What's going on here? >> I think that's Was that drawn up just Oh, that's amazing. That is where we going. That's where we heading, bro. That is Yeah, that is you you laugh, but I mean >> we pivot we pivot from being pre- rich to now poor. >> Yeah, guys, I found us a nice new office. The good news is uh really good air flow. Um lovely uh lovely sound. >> It's got it's it's a roof over technically technically a roof over your head. Not really. Well, you know, >> not really, but >> it's still a roof of some description. >> So, um yes. All right, Crypto Steo, you can have you can have Thor's autograph, but um I'll only send it to you if we get to 100% likes next week. That's that's the uh that's the um the deal. >> Okay. Um and uh Obie Wayne, great name. Isn't there also some beef going on between the American I banks and crypto because the banks don't want you to stake stable coins and getting four and four to 5% interest? >> That is true. Exactly. Oh, there is a meeting coming out I think tomorrow or yeah tomorrow where they're going to be again discussing this is this relates to the clarity act banks yeah I mean to be the banks don't want uh the likes of Coinbase offering banking services which well offering interest because this would lead to deposit flight from the banks to Coinbase and and other crypto platforms. >> Yeah, this has been the big stumbling block uh for the clarity act. The banks you know basically kind of circling the wagons. It is quite a nuanced argument because um I think we've just we've talked about this a little bit before, haven't we? You know, it's it's not just mega banks like JP Morgan, but you've also got to think of kind of regional banks which are responsible for lots of small business loans, etc. Um but yeah, basically the banks don't want um stable coin issuers passing on uh the yield to stable coin holders um because that would undermine the bank's uh current model which is to lend it out well to take your money, buy US treasuries with it, get what four to 5% or whatever it is and pay you 0.03. >> Yeah. >> Um and pocket the spread. So obviously, yeah, there's a bit of protectionism going on with >> that was more important. Just that was a very important question over there, guy, at at your bare market party. Are you going to have an all-white Diddy party as well with [laughter] Diddy? >> Diddy has been invited, but so far um his uh my messages to him are going unread. I don't know. He he seems to be otherwise engaged. Um Crypto's so bad I bet on the Patriots. Uh yes, congratulations to the Seahawks, I think it was. >> Look at me. Look at me all up to date with American >> culture. Um and uh other people Jason is saying Bitcoin on its way to 58K. We are almost at max pain. >> We getting close. We're getting close. >> I kind of agree. I kind of agree. I think we are headed in that direction. Adam uh CPF. I'm I'm going to put some link to something nice up. Number one YouTube channel. You guys are the best. Thank you, Adam. Cheers, mate. >> I think I mean I think we should probably >> That's the best place that Yeah. End on a bang. End off on a good on on a good uh note. Uh guys, thank you for thank you for tuning in. Um let's hope it's a better week this week. I think we are still probably uh going lower. Um maybe, you know, if not this week, then soon. >> Um end on a good note, bro. We said we're going to end on a good note. >> Yes, we're the number one YouTube channel. You guys are the best. No, you guys are the best. >> But it's fine. [laughter] >> Thanks for watching. We'll be back next week. Keep a lookout. Lots more videos coming your way across all our channels. Great to see you. >> Cheers, guys. This show is fueled by British dry humor and he ain't sarcasm. [music] Glad you were able to talk Lewis off the roof. Don't call them alcohol coins. We [music] got metals crash before GTA. You guys are as funny as krypto. Hot [music] potato is a British specialty. I like potatoes, baby. Boiled or fried. Let's go. Oh, my mom talks about [music] me. Potato is a British specialty.",
        "summary_hu": "A Bitcoin árfolyama drámai módon csökkent az előző ciklus csúcsára, miközben a piaci hangulat messzire romlott. Az ISM adatok most az egyik legfontosabb tényező a kriptopiac jövőjének becslésében. Az elemzők arra figyelmeztetnek, hogy a áremelkedés mellett általánosan emelkedhet a kockázatos eszközök iránti kereslet a gyártási szektor növekedésével. A kriptopiac bizonytalan állapotban van, és sokan az alternatív befektetési lehetőségeket mérlegelik, mint például a nyersanyagokat. Az amerikai kormányzati zárásokhoz is kapcsolódó piaci mozgalmak kulcsszerepet játszanak a trendek alakulásában, továbbá a borongós kilátások fokozott eladási nyomást eredményeztek. Az ISM adatok alakulása befolyásolhatja a piaci likviditást, és ennek hatásai a Bitcoin jövőjére is kihatással lehetnek.",
        "summary_en": "Bitcoin has seen a dramatic decline below the last cycle's all-time high, resulting in worsened market sentiment. The ISM numbers have emerged as a crucial indicator for predicting the future direction of the crypto market. Analysts warn that an expansion in manufacturing typically correlates with increased appetite for high-risk assets, potentially benefiting cryptocurrency. The crypto market is in a precarious position, prompting many to consider alternative investment avenues like commodities. Movements triggered by U.S. government shutdowns have significantly impacted asset prices. The behavior of ISM data can influence market liquidity, which will ultimately affect Bitcoin's prospects.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 25,
        "key_points_hu": [
            "Bitcoin árfolyama jelentősen csökkent az előző csúcsról.",
            "Az ISM adatok kulcsfontosságúak a kriptopiac jövőjének előrejelzésében.",
            "A gyártás bővülése nagyobb keresletet eredményezhet a kockázatos eszközök iránt."
        ],
        "key_points_en": [
            "Bitcoin's price has significantly dropped from its previous high.",
            "ISM data is crucial for forecasting the future of the crypto market.",
            "Manufacturing expansion may lead to increased demand for risk assets."
        ],
        "main_topics": [
            "Bitcoin Price Decline",
            "ISM Indicators"
        ]
    }
]