[
    {
        "video_id": "5Dnw9rzM4eo",
        "title": "Bitcoin: Green Box Signals Potential Bullish Momentum #shorts",
        "published_at": "2026-02-09T19:28:20Z",
        "sort_date": "2026-02-09",
        "url": "https://www.youtube.com/watch?v=5Dnw9rzM4eo",
        "transcript": "Now for the first time you see we have a green box and that's very important because for the first time there is a bit of change it's a bit of bullish momentum and as long as you buy around 200 week it's going to be okay if you buy too high like for example now 69 it's a bit too high because I still expect us to go a bit below 200 week and chop around maybe until October until the summer at least until the summer and me buying here at 200 week already is just that it's nice long-term average price normally if If you buy around 200 week, you're going to be in a very nice profit very soon."
    },
    {
        "video_id": "kL5Kytc7ZWc",
        "title": "Is This BTC Pump a Trap? #shorts",
        "published_at": "2026-02-09T16:29:22Z",
        "sort_date": "2026-02-09",
        "url": "https://www.youtube.com/watch?v=kL5Kytc7ZWc",
        "transcript": "We are at 69.8. But sadly guys, I'm not trusting this pump whatsoever. We said that if we don't see a big fat recovery, big fat confident pump this week that just started, likely it is not a real pump. Likely it's not a real recovery this week that just started. Have a candle that goes like this. Basically erases all of the losses from last week. Then yes, we can speak a bit about Vshape recovery. That is an increased possibility that we're going to pump and there's some kind of vish. However, currently when you open the week and it is meh, it doesn't even have to dump. As long as the price is kind of sideways, as long as the price is not doing anything to really show strength to the upside, I see it as a trap,"
    },
    {
        "video_id": "EORmtCdczdo",
        "title": "BITCOIN AND ETH: I DO NOT TRUST THIS PUMP!!! 🚨🚨 (wtf is happening)",
        "published_at": "2026-02-09T10:08:40Z",
        "sort_date": "2026-02-09",
        "url": "https://www.youtube.com/watch?v=EORmtCdczdo",
        "transcript": "Um, oh yes, so yes, yes, yes. Guys, welcome to another episode. And as you can see right now, Bitcoin is currently at 69.8. Oops. One second, one sec. I need to update the screen. We are at 69.8. But but but sadly, guys, I'm not trusting this pump whatsoever. One second. One second. Let me do like this, then we do like this, then we do like this, then like this, then Oh, yeah. Bam. There we go. Uh why? Why? If you watched the stream on uh Friday, we did a Friday stream and also yesterday, I think we did a stream as well. On Saturday and on Friday, not yesterday, we said that if we don't see a big fat recovery, big fat confident pump this week that just started, likely it is uh not a real pump. Likely it's not a real recovery. If you have this week that just started have a candle that goes like this, basically erases all of the losses from last week, then yes, we can speak a bit about Vshape recovery. That is an increased possibility that we're going to pump and there's some kind of Vshape. However, currently when you open the week and it is meh, it doesn't even have to dump. As long as it's meh, as long as the price is kind of sideways, as long as the price is not doing anything to really show strength to the upside, I see it as a trap, guys. And I see it also as someone who is actually a bit bullish now overall. If you compare me to a few weeks ago to now, I'm actually way more bullish now overall. And you can read this to this tweet from last week where I said that I'm actually starting to buy a bit. But I'm still expecting us to go back to 200 week moving average. I'm only buying at around 200 week moving average or below. Okay? I'm not buying here at 69. It's too expensive. So overall, I'm leaning more bullish now than a few weeks ago. Why? because we came way closer to 200 week. We actually went like a 1K 2K from 200 week. It's fantastic. It's fantastic prices here. Uh and so we are getting there. We're getting into the buy zone. We are getting to very very good fair price for Bitcoin. We're getting into quite cheap. I mean, Bitcoin is going to become quite cheap. If it goes below 60, it's going to be quite cheap. That being said, there is there's a lot of hope. People hope that it's going to recover now. Everything is over. Bare market is over. Everything over. We just go up and up and up. Likely not, guys. the way it looks like now with um with with this kind of opening with this kind of I mean it's it's heavy, man. It's heavy. It's heavy. And again, it doesn't even have to go down that fast. If it's just slow here, you know, maybe a bit like this, it's not good. It's not good. The only thing that would change the trajectory here is a big fat nice strong green bull candle that says that we're erasing we're erasing the loss. we're going up and uh and that's what we're looking for. Currently, we're not seeing that. But listen, the week just started. It's just the first day of the week. Anything can happen this week. Let me know what you think, guys. Will Bitcoin put in some kind of bull candle or not. Um I mean, if you look here on the alts, it's just gravity pulling everything back down. Sana had a bit of a pump from the lows from last week back from 67 all the way to 87. But remember, last week started at 100. So yes, it did go to 68 67 then it's recovered to 87. It's still lower than it started. And now this week it just continues even even lower. So no no recovery, no strength. Looking at ETH, ETH went to 1.7 then recovered to 2K. But the week last week started at 2.2 and now it's even lower than the than the week started that the week closed. So the week closed here at 2,000 something something and now we're we're just going lower. So that's not looking too strong. BNB the same the same picture everywhere guys. The same picture everywhere that last week was super mega red. We did get a bit of a bounce and this week just continues the redness. So bounces are normal. I know that within a bare market when you are inside of it every bounce feels like hope. It feels like the light at the end of the tunnel. A bit of bounce. A bit of bounce. You get nice positive feeling. You get nice hope. You start being happy again for the first time in months and months and months and a bounce happens. Even though it's still lower than when the week starts, it's still the bounce feels nice. You go into the hourly chart, it's all green. [laughter] You go into one minute chart, it's even greener. You feel good. You feel the bird chirp chirp chirp. The bird is chirping. You look at the bird, you say, \"I love you, bird.\" You're still wrecked 99%. It just went from - 99 to - 98.7. But it's all about momentum. We humans, we love the momentum. As long as the momentum is up, we're happy. So, I understand the feeling, but you look at it uh objectively. This is this is my read. This is my read. Okay? It's my read. And I'm telling you at someone who've been in this position where is only down then a bit of up. And I feel freaking amazing. [laughter] Still down 99, but we're up. We're up today. I've been there, guys. I mean, listen, when I when I say that people have the plebe mindset, it's true. Most people have the pleba mindset. They get wrecked. They don't know what the hell they're doing. And I'm telling you that because I've been there and uh I know how it is. Since 2013, I've been in all of the positions. Now, I have upgraded uh updated updated the track record over at bullme.com/ivan because we did have this tweet from February 6. Basically, that the tweet I just showed you where uh or sorry, it's actually not correct. I need to update it. It's uh it needs to be this one. It needs to be this one. Um so I will put this tweet here on February 6 because this was on uh yeah February 6 where we actually started to buy again. So you can anytime go to uh bullmay.com/ivan and uh see the recent calls. And before that the call before that was that we risk off uh gold and silver and before that you can read here more since October 8th we're de-risking and selling Bitcoin. And now for the first time you see we have a green we have a green box and that's very important because for the first time there is a bit of change there's a bit of change it's a bit of bullish momentum and as long as you buy around 200 week it's going to be okay if you buy too high like for example now 69 it's a bit too high it needs to be closer to 200 week um if you buy too high it's still not not going to be too great because I still expect us to go a bit below 200 week and the chop around maybe until October until the summer, at least until the summer. And um my me buying here at 200 week already is just that it's nice long-term average price. Normally, if you buy around 200 week, you're going to be in a very nice profit very soon. Uh but it can still go below. So, that's that. Looking at Soul, let's look at Soul again. What's interesting with Soul is that it's actually breaking down now from this u uh support that it tried holding last week. You see, we dumped all the way to 67, then we bounced back within the support area and now we're breaking down again. So, this could be yet again a nice shorting season for Saul because if this support is lost, which Saul kind of wants to lose it now, you know that it is the flash button being pressed and it opens up the door towards 30 Sana 30 and uh many people in our community have been making a lot of money shorting Sana like a lot a lot a lot. You can just see all of the screenshots here. A lot of them are shorting soul. This guy shorted soul on 5x. This was uh a few days ago. Um XRP also big big shorting going on. And u we didn't really break the support yet. We just had this week. So when week happened, we went back to support. And now that we're breaking down from support, it kind of increases the the chance here of us having a nice leg down for Solana because we tested a support tried holding and now support is not holding anymore. So we even we retested the support and now we look on the weekly on the daily you see more clearly that it went down and it went back and now gets rejected again. So let's see what's going to happen over the last 24 hours. We did see Mooncat in our community over at bullion.com shorting uh Trump with a nice game. Uh then you have also this guy right here to Forting Tao. I mean he's the Tao guy in our community to Fort although he made a bit of profit shorting towel and a bit of profit shorting uh Bitcoin. There you go. Very very nice. Now is this time around when Soul is breaking down and you have a week closing below the support zone is going to be a bit different. It's going to be a bit different because it's more confirmed of a breakdown. So yeah, let's see what SOL is going to give us this week, but potentially juicy juicy short towards the 30. And if you don't want to short, some people don't want to short, it's fine. You can just buy around 30 as well. Uh so you don't have to, you know, you don't have to short. You don't have to use leverage, but if you want, you can do it. If you go to bulling.com/partners, we're now starting to organize all of the exchanges here. If you go to booming.com/partners, you have the link below. The link is called exchanges I use in the description. So now we have organized a bit here where you can see what the different um exchanges support. For example, buy bit supports crypto precious metal, stocks going long going short, leverage, debit card, you can get debit card. You can also get a bank account soon. So it's coming very very soon. On pin, you have crypto, precious metal, stocks going long going short, and trading bots. You can use here the different buttons to filter whatever you need. And of course, if you go to bullme.com/partners, you come to this page, you will be able to get nice signup bonus if you sign up from these links right here. Uh, if you want low KYC, then go to bluffin. Bluffin, we have low KYC badge right here. So, let us know what kind of other badges you want, what kind of other criteria you have for your exchanges. We can add that. We can also add more exchanges, but these ones are the ones I use myself the most. That's why we keep the list quite small. for Bibbit for example you see here we've been using it since 2019 every day all you guys who've been watching since 2019 you know about BIB since 2019 also but it's because I use it every day since 2019 so from that perspective from a track record perspective bibbit you could say is the most trusted because I've used it for so long and that's the whole point where I can share what I use myself every day uh now let's look at the overall market looking at the bubbles here what do we see daily I mean it's a mixed bag I mean Nothing is really pumping here. You have WY Financial, but it's wrecked anyway. You zoom out a bit, you're going to see it's wrecked anyway. So, uh, yeah. Uh, I would say the overall market now is either you short either you short the crap out of it or you wait for nice buy zones. And it's been like that honestly since October. Either you short the crap or you wait for nice buy zone. And nice buy zone can hit sometimes. For example, Bitcoin around 200 weeks. Solana around 30. It would be very nice. You can obviously buy Salana even a bit above, but all in all, you look at I mean, look at this on the monthly. E down 33, Bitcoin down 22. Suie, oh my god, Suie roll. Paul, what's happening? 46. XRP 30 32. Holy crap. Ah, the 31. This is the business cycle, guys. The business cycle, guys. Right here. Waiting. Bonk on the Yeah. Orbit room 45%. Well, Arbitum is in a big trouble now because Vitalic said that L2s don't really matter if they're not really needed. Monero, Monero, people shilling Monero. We we looked at privacy coins also with Zcash with Monero, but as soon as soon as they are in a bare trend, we're out. We're out. It it's simple simple. So, the monthly has been quite brutal. Monthly has been quite brutal. The only exception is, for example, hype. Hype has been doing quite okay. But again, it's all about the cards. You want the cards stacked in your favor. the cars are not stacked in your favor if you are bullish or accumulator in this kind of market. Now the market will change at some point and probably later this year market will be different but it's all about having the cars in your favor. When I look at the biggest wins that people are having in our community, it is shorting. It is shorting. I mean look here. Dot short the crap out of it. Sana short the crap out of it. Uh Sana again short the crap. Dot again short the crap. Um what else? What else? What else here? short XRP, short Sana. So that that's where money is made now. Uh mostly mostly. So either sit on your hand. ZK short the crap out of it. What else? Zcash short the crap out of it. Um ADA short the crap. Render short the crap. I mean everything. Everything. Everything. Dot short the tia. Mania very bad. Very bad. I mean even gold and silver are not really doing too well since the beginning of Feb. I mean, they're they're kind of, you know, volatility wise, they're okay. They're going up and down, but pump- wise, they're not doing that well. So, guys, this is the game plan for this week. Personally, I'm not trusting this pump. Let's see what's going to happen. We're not changing anything too drastically. Uh, I want to warn though against people getting too excited because I don't think it's the time. And again I'm bullish now in ways I haven't been since October where we are starting to buy slowly at around 200 week but we expected to have another leg down at least to 200 week probably below probably be here for months chopping around there is no V-shaped recovery in um inside because you don't have any pump this week is week so far obviously it can change I mean again we're on a ship we use the telescope what is this uh thing called we use the the telescope or how you say the on the ship. If we see something on the horizon that's different, obviously we're going to tell you in real time. For now, for now, uh there is no pump. There's no bull inside. So, that's that. Uh looking at some news, we have actually a bullish signal from mainstream media. They wrote this article. FT wrote the article. Bitcoin is still about 69,000 too high. Then Bitcoin pumped. They actually changed the title. Now the title is different. You see here the title in the tweet is 69K but the title in the article now is 70K. Actually I had to change it. [laughter] So now guys the new article is called Bitcoin is still about 70K too high. If Bitcoin goes to 71 they're going to change it again uh to 71K too high. But I think this is a bit bullish. I mean on the big picture it's a bit bullish. Uh why? Because you remember last cycle guys, people were celebrating the death of Bitcoin on 30th of November 2022. And those people that celebrated were employees at ECB, European Central Bank. These guys, Ulerish Binsale and Jurgens Sha, they're the worst possible at economy. I don't understand how these people can still have a job in the economic space because literally on 30th of November 2022 they wrote Bitcoin's last stand where they said that Bitcoin is going to die. This is going to die very quickly. You look what happened on the 30th of November 2022. It was I mean man I'm not kidding. It was right here. Okay. [clears throat] It was when Bitcoin was uh 16k 156 I mean actually for a day here we went to 15.9 or something like that. So here they published this article literally at the bottom at the bottom when these guys are publishing this it also gives me a bit of a bullish sign that potentially we're going to be forming a bottom potentially at 200E moving average. It would be would be a very nice bottom around uh 60 60k and 200 week moving average. Uh but all in all guys I want to keep it short because I actually have to go soon. Let's go to Q&A questions answers debates. I feel that we have captured most of the Z guys anyway and that's the this you know this pump. People get excited. We keep it cool. We keep it very very cool and there's no need to be you know moving too too much now. You don't have to move too much. It's the same as it was last week. The analysis is still that we have a massive massive bare trend with the target of somewhere here at 200 week moving average. We did go there very quickly last week, but I think we're going to revisit. We're going to revisit. We're going to make ourselves comfortable here. We're going to sleep over a few nights, maybe a few weeks, maybe a few months here over at the grandma, over at Papa 200E moving average. We're not running away quickly like many bulls hope. We're not going to going to run away quickly, guys. It it's not happening. It's not happening. I mean, again, everything is with highest likelihood. I'm happy to change my opinion any time. We adapt to new market dynamics this quickly. When it's sun outside, we have sunglasses. When it's raining, we have umbrella. We're not cornering ourselves into a position here that we have to hold to the death minus 99% like all of the plebas holding alts or any kind of other bullish thesis they had that they refused to let go of. Instead, we are we're we're mobile. We're nimble. If market changes for example if we see a big pump this week above 80 uh then we would be looking more at the relief rally maybe even towards the 50we moving average but I mean again it's like froto going to mortar you have to go through so much you now have this resistance number one you have now this resistance number two then you have to get back into the range and get another resistance number three then you need to have another resistance the actual 50we moving average okay number four and Then maybe you can go to alltime high number five. I mean again it's like fro going to mortar for us to go to Bitcoin alltime high right now. Right now. Uh instead you want this moving averages to come down like this is going down. Oh look at the look at the bull flip money line bull flip now is at um 97. It's getting very low. You remember guys? I mean this thing was at like 110 just a few few weeks ago. Now it's falling very quickly. It's also going to come down a lot. So that's when you form a bottom. Normally when you form a bottom you go sideways a bit. all of these moving averages they come down a lot so they're easier to break and then we can break to the upside and start moving to the upside. So I expect some kind of bottom like that. Uh I mean you see here for example in last bear we went to 200 week then it took like half a year for us to break out and form a bottom and during that time the 50 week went from uh being at 43 all the way to 25. Okay, it fell by basically 50%. and the money line uh flip went from here 37 all the way to here 22. So you want this moving averages to come down to go a bit sideways and for them to come down you don't even have to dump a lot. You just have to go a bit sideways. So something like that is the most probable scenario that I see in the coming weeks and uh yeah let's see what's going to happen. But on this note guys let's go to Q&A questions answers debates. If you have not our tools, if you haven't got our tools now, uh, money scanner and the money line, go to bullmayer.com, join it because speaking about shorting, look here, the assets that went bearish on the money scanner during the last two weeks, I mean, a lot of them are down a lot. You don't even have to look at this, you know, big assets that are down a lot. You can see every day there's something flipping bearish. every day something flipping bearish and most of them within a week or two they have these kinds of losses. Okay, that's the kind of market we're in. If you flip bearish, you can basically count on minus 30 minus 40% dump in the portfolio in the coming week or two and obviously if you are a smart person you short it instead you're on the other side of the trade. the player by holder they hope please don't break down please don't break down like for example we joke with Sana a bit many people now holding Sana they pray please don't break down please please please please don't break down but it's a very bad position to be in you're not in control you you just have to close your eyes and pray and if it goes slower you don't open your portfolio until the next bull market because it feels bad opening it I know myself again I've been there many times again I'm in crypto since 2013 I know that at the worst what happens is that you don't even want to open your portfolio. Just the, you know, clicking the button in the app feels so bad. It feels so bad. And uh by being through all of it, I can tell you it's not a situation and position you want to ever be in. Okay? So that's why I'm I keep reminding you, don't be this, you know, diamond hand, diamond hand. What happens? Okay, you diamond hound, diamond hand, you diamond hand a lot. What happens? You have this position. You don't even want to you're too scared to even see your portfolio. Instead, the best position to be in right now is either you short this crap or you buy at very nice price, which we're going to be doing as well. So, let's go to Q&A questions, answers, debates, discussions. Let's go. Sana weekly support B says 40. So, sports dollar would also be be good. It would also be good. Again, it doesn't have to go to exact 30. I mean, you have here a bit of a week. You could buy even below above. Uh, but it's the target. The target doesn't mean it has to eat exactly but the closer it gets the more attractive the price is the more you can start buying and buying also with confidence because uh when it's down so much to this levels um you have a massive support there at around 30 here it's massive support I mean basically here support since 22 will come in so it's all about stacking the cards in your favor if you buy here the cards are heavily stacked in your favor like insanely much Okay. Um, so let's see what's going to happen. Uh, at some point, I guess we're going to have a relief rally at some point, guys. But it's not here. It's not in this room with us yet. You would expect some kind of relief rally. Uh, but it's not here yet. I mean, I hope that for the bull's sake that this was not the relief rally. Normally, the relief rally is higher than this. Um, Bitcoin, I mean, looking at the history books, I'm afraid that the historians may call this a relief rally. Okay, it's not what uh bulls hoped for, but uh I mean technically it was a bit of a rally. It was from this low to this high. It was 20% rally. So the way it looks right now is that this is counted as a relief rally. Very very bad. But we didn't even get to 200 250 week. Normally we at least touched the 50 week. I mean what else did we touch? Maybe we touched some Fibonacci. Let me actually see. Did we touch some kind of Fibonacci? I mean it really depends if you measure from the if you measure from the wicks then yes we did touch 0.38 okay from the weeks we did so we did actually touch attach it from based on the wicks let's do without the wicks then we didn't really touch it but okay so with the wicks we did touch 0.38 uh um 0.38 okay right here let's see if we did it last uh bear because if We did then I guess we can call it a confirmed relief rally that happened. Wasn't really what the bulls expected but uh we don't make the rules. I mean we just follow what guys last cycle counting with the weeks the relief rally was also to 0 382. So what kind of conclusion do you make of it? Uh while nothing is certain we we we're trading a market. We're speculating guys. We're speculating. Speculation means uncertainty. So nothing is certain. This gives you slightly more certainty like you get a bit more certain when you are in a short position. Uh you have slightly slightly more short certainty because based on this the relief rally was valid. I mean this time around we we didn't go to 50 week but we did go to 0.38 Fibonacci. So you can squeeze you can squeeze out a bit of more certainty here. But as always using the mechanical rules you need to protect your your capital. That's why in our community we never have big losses. Uh we don't have 100% win rate. It's not what it's all about. It's just that when losses happen, they look like this. You see how the wins look like? This is how the losses look like because the whole idea of mechanical rules is to have a tight stop-loss and to never let small mistakes turn into big disasters. Um but yeah, so that's that with the with the relief rally. Let's see if we actually now start creating bottom. I think for the bulls is also the best that we go to around 200 week then we go sideways for a few months all the moving averages come down money line comes down flip level comes down we break it at some point and we have nice Valhalla in 2028 that will be the best what's your thoughts on new guys don't ask about this it's poop everything it's nothing has changed people ask about the new pulse chain this and that Uh it's just worse for the ecosystem to have another coin. It's uh that's it. That's it. There's nothing interesting about it. There's nothing like you know policy they think that they they somehow unique you know they everyone doesn't know crypto. They know crypto and then you look at the performance like the worst. It's the worst. It's the worst. It's all low every day. Uh if Bitcoin dips so will pulse would you sell stables and wait? Uh yeah, if Bitcoin dips, most altcoins are going to dip. Also, if you are in also you're in a very bad position. I honestly I don't know how you're still there if you're watching this channel because we've been riskoff since October 8th as you know. Um and uh as I always say, I get this question maybe once per per day. What to do if I'm still holding alts? What if Bitcoin falls? Uh what should I do with my alts? And again, there's no good answer to them. uh each and every day ask yourself if you have money in an alt uh would you buy using that amount of the alt if you didn't have it today let's say you have $1,000 in your shitcoin and you hold it to know whether you should sell or not ask if you had $1,000 in the without the shitcoin would you buy the shitcoin today ask yourself because it puts it into perspective if the answer is no then I would start to lather out don't sell everything at once because it's tough emotionally. If you sell everything at once and it pumps tomorrow, it can always have a dead cat bounce. It can always have a fake like it can it can happen any day. Um instead, if you do it step by step, it's way better. This way you relieve the mental pressure and so on forth. Um so that's the that's the best basically calling both ways so bro will never be wrong. Well, welcome to traing. Welcome to traing. I mean it's crazy this again the plebbea mindset big shout by the way it's I I like the comment overall but it's the plebbea mindsets where you are cornered in a position you are wrecked in a pos you're cornered and when I tell you that we have a bullish we have a bare scenario we derisk or we go more risk based on these scenarios some oh no it's unfair Ivan you it's unfair you should corner yourself like I am cornered where my BALLS ARE HELD BY THE BEARS and I cannot escape and you're here you have a scenario for Listen, welcome to it's it's you know with speculation is we're speculating. Never let the small mistakes turn into big disasters. I mean the only reason our community has small uh small losses is because the mechanical rules ensure that if the reality goes against your thesis, you're out. You can try again. You can try again and you can capture proper gains when the reality actually confirms your thesis which can happen literally tomorrow. There is no reason to be holding some crap to zero when it's a matter of uh closing a small mistake. Trying again tomorrow. Okay, [laughter] trying again. That's it. That's it. That's it. Wii with a trade where the cards are stacked in your favor. Guys, again, ju just to repeat, if the cards are stacked in your favor, it's not a guarantee. Most people don't know what trading is. They don't know how markets work. So even when I tell them this is the high highest likelihood, this is the lowest, they think that in their brain somehow they equate highest likelihood to certainty. Start thinking in probabilities. And if you start thinking probabilities then suddenly uh you have stop-loss because even if you're very certain it can still go against you. If you think in certainties if you're a pleber you don't know what you're doing. You think in certainties why have stop loss? That's why most plebers don't have stop loss. [laughter] They think in certainties they think that okay I have this idea this plan and uh it's so certain to them they don't even consider setting a stop-loss. But as soon as you start thinking in probabilities that even the most certain thing you have is just a probability. Yes, the cards are stacked in your favor, you can still lose. Okay, that's that's all about mechanical rules. But guys, I mean we can discuss it for hours. The best is to go to bull.com, watch the preview there. Yes, exactly. Good ban hammer there on some spammer. Uh, good call. Good call to the mods. Don't spam, guys. Don't spam. Uh, money line silver. when is when is a good time to go long. So my strategy for silver guys is uh uh to buy at the moving averages. It's currently uh bare chart uh kind of like we have drawn here a bit. Uh the moving average here is going up. If you can buy at around 50 moving average is very good. If you can buy at 200e moving average it's even better. So the 200 week is this white one is it goes like this. So buy a bit here then buy even more at the 200 week. Keep it simple here. Keep it simple and then buy even more when we go bull trap which will happen a bit later. So you have basically three entries. One a bit high risk but still good 50 week one a bit less high risk but still good 200 week. Why do I say that they are uh like more risk less risk because price can still go below. Silver goes below 50 week a lot. It's still good price still 50 week. You're you're not buying the top you're buying the yearly average. You're still good. uh but many cases I mean look through history silver loves smashing through 50 week so it's it's more that you accumulate for the for the long-term hodddle 50 week is going to be okay sometimes it gets supported but know many times it just you know smashes through like a 500 pound cow you know stepping on some kind of uh [laughter] some kind of brittle brittle thing okay here is 500 pound cow just breaks down from the 50 uh even it it's a fat cow at 200 and breaks down also breaks it down. But 200 week is better because normally it's not it's not for long then. It's not for long. And the best is to buy when you have the bull trend on the main line confirm because then it's like the the safest the safest. Uh but you may have to wait a bit longer. So it's more about what's your riskreward. Um I would lad somehow like that and have it more for the uh for the long term. Um 50 week 200 week and then the money flip. I mean, those are the those will be the signals for silver and gold, by the way, and gold. And again, uh 200 week may seem incredible now, but I can almost assure you at some point it's going to go there. It's now at 30, but it's going up a lot. In a few months, it's going to be like 40. So, can silver go to 40? It can easily go to 40. It was at 64 last week. So, it's just another, you know, $20 dump. It went from, how much it went from? It went from 120 to 60. So, can it go to 40? At some point, it will. And at that point the 200 week may also be at 14. So that's the plan for silver and for for gold also. Very similar. Very very similar. You can't skip the pleb stage. That's true. That's I mean [clears throat] it there is a lot of truth there that most people they don't learn from others mistakes. They learn from their own mistake. Like they really have to get rigged themselves first before they understand how the world works. Uh, sometimes I tell people how the world works because I've been there. I mean, again, I've been play because I entered crypto in 2013. I've done all the mistakes. I'm telling you like some some of the stories I tell you where I say, you know, you hold down, you're praying. I mean, I've been there at some point. [laughter] So, some people just have to learn the hard way. If you want to learn the easy way, you go to boom.com. You watch the free video, you understand the mechanical rules, but some people also just need to learn the hard way. So they basically have uh damage on a neurosystem level when you have pain for like 5 years, 3 years. I mean pulsy guns, how many years you're in like a third year of pain. I mean at some point on a nervous system level you have so much anxiety you have scars on a nervous system level. For some people it is the only way man is you know losing hundreds of thousands of dollars maybe some people lose millions. I mean, you look at the guy from this documentary about Pulchian. He invested at the top, put her put his family wealth there into the into the Fugazi and he he he knows, man. He at this point he knows. So that's why uh some people learn the hard way. But the good thing is you don't have to. You don't have to. You can learn on others mistakes. Learn my mistakes. Go to bullmay.com again. Watch the preview. Everything I teach is based on uh my journey from 2013. How many years is it? 13 years in crypto. 13 years in crypto. You can learn it easily. Okay? Just watch a video and that's it. [snorts] You can set aside the gambling percentage. I mean that's true. You can gamble. You can take bets in crypto which don't make sense, which don't follow the mechanical rules as long as you are planning for it. The big mistake people have is that they they have a plan. They have a plan that okay, I enter, I make money, I go on vacation or I buy a car or I retire or what the hell. That's their original plan that I enter, I make money. It goes down. Now they change the plan. The plan now is I'm a long-term holder and long-term supporter. They forgiate themselves. They gaslight themselves into being that. That was not the original plan. So, as long as you're not changing the original plan, it's okay. If you change your original plan, it's very bad. If you your original plan is just to go and play around with memes, for example, in Bullman, we also have a channel just based on memes, we tell everyone you you likely going to lose here. But it's fun. It's fun. It's fun to see what people are pumping and uh and dumping. And in that case, in many I mean, when you trade memes, setting stop loss doesn't really make sense because this is so volatile. It's just it's just for fun, man. It's not serious. It's not serious. You cannot apply mechanical rules on this newly created 10k market cap shitcoin, okay? It's not in the same universe. It's another universe just for fun. Maybe it works. Probably it will not work. So, if that's the intention, okay, great. For most people, it's not the intention. Most people don't want to be long-term holder in a community that's down only and be long-term supporter. That that wasn't their plan. Now, they have to do it because otherwise they will go loco. They will go crazy. So, yeah, it's all about the original plan. You have to be honest with yourself. What was the intention here? And if you see that man your trades are going against your original intention, you have to fix it. You have to fix it by real reallocating, you know, taking a step back, going back to the drawing board. And that's why sometimes a trading journal is good because each trade you can say what was the plan here, my plan for entry, my plan for exit and catastrophic stop-loss. Let's say it really goes against you. Where's the catastrophe? Most people don't even want to think about I mean for them it's uncomfortable. Let's say you buy Sulana at $200. If someone told you, hey, you know, it could go to 30. What? Like most people, it's not even in their in their known universe. You understand that they buy Solana 200 and it can go to 30. It's not even in their not even thinking about that, which is crazy. They don't they think that, you know, it's a blue chip. It probably is going to be okay. It's probably going to work out because, you know, it's so high market cap. And listen, it is, but if you don't have the experience of trading high market cap coins, you don't have the experience of Solana going from 260 to $8 in 2022, then you don't understand that you really need to have a catastrophic scenario already figured out. Let's say you buy Solana at 200, man, at least set stop loss maybe at 150, maybe at 170. Like think about yourself. Think for yourself. What would be an unacceptable absolutely unacceptable loss? Uh most people don't do it. And then you see they they are boiled like a frog. They're boiled like a frog where okay it goes from 200 to 190. They're like oh crap. It feels bad but okay. Then a week passes 190 is like feels good now. 190 feels like super solid now. In a few weeks they open up. Crap. It's 140. And then you know it goes sideways maybe one two week now 140 feels good 140 feels good they feel like man it's 140 sometimes it goes to 120 and then back to 140 like man it's a good day let me know if you recognize it you're like man it's a freaking fantastic day I'm going to buy a steak to celebrate enter that 200 [laughter] that goes to 90 you're like man At least it's back to 100. It goes back to It goes from 140 to 90. Oh [ __ ] Oh crap. It's so bad. And then it goes back to 100. Mine's amazing. It's three three digit again. It's amazing. [laughter] So you all of that. You could have avoided all of that if you just had a freaking stop loss. Catastrophic stop loss. But Pleba doesn't know. Plebbe says hodle diamond hand. Crazy. Again, some people have to learn the hard way. I mean, again, I I've been through all of this. I've been a bag holder. I've been through all of this since 2013. I've been I mean, I've been mega wrecked. I've made a lot. I've lost a lot. I mean, I' I've been I've been through everything, guys. So, everything you can possibly put a trader's brain like in some kind of torture, I've been there. So, [laughter] I don't want you to repeat my mistakes. That's why we have bull.com. And um yeah, I mean but also sometimes I wonder like what percentage of people need to feel the pain themselves first because it's it's not necessary like it's not necessary. Well, theoretically it's not practically like the the conviction some people have when they speak against me like they try to prove me wrong is crazy, man. It's crazy. And at one I mean on one hand I understand they're in a losing position. They just need to make their brain feel good. Okay. But sometimes I also think do they really believe the the stuff they say or no? [laughter] Sometimes it's crazy man. Do do you really believe what you say? Sometimes I speak to someone like he's so convinced business cycle ISM Ivan you don't know. Oh someone said you're not a real holder. Someone said to me you're not a real Bitcoiner. You're not a real Okay. [laughter] Yeah. Yeah. Crazy man. Crazy. Uh Evan, what's your uh take on quantum tech regards crypto? It's very important. Quantum is very important. Bitcoin should have quantum. I don't agree with anyone that says that quantum is so far away. It doesn't matter. Why? Because it's going to take 10 years anyway to change Bitcoin. To be quantum proof because there are many big decisions to be made. Some coins will have to be either uh made unreachable by anyone. For example, some Satoshi coins are in addresses which are not quantum proof. In the beginning of Bitcoin, addresses were not hashed. When an address is not hashed, it's just a naked public key, it is vulnerable to a quantum attack. Now quantum attack may not be here for another 10 years, but the problem is it will take 10 years to change Bitcoin anyway. Even the smallest change, it so much drama, so much debate. I mean, it should be hard to change Bitcoin. So, it's good. But I'm just saying that we need the work now. Um so some coins for example there's no good answer what to do with Satoshi coins in vulnerable addresses because if you move them to a protected address it means that Satoshi cannot access them because he doesn't have to the private key to the new protected address. So what what do you do with with this dormant coins in non-hashed addresses? I don't know what what you do. I don't know the good answer is it to make them inaccessible. Well then people will say it's confiscation. It's confiscation. What do you do? just allow a potential quantum attacker to grab them. Okay. Uh it's there's no good answer to that. I mean, some things there are no good answers to. So, it will take years to figure it out. Um if you have uh a person that is able to move their coins to a protected address, then it's not the problem. The the problem is when you have this vulnerable coins and they're not able to move because there's no one there. We don't know if Satoshi is alive. Probably not. So, that's going to be a big debate. Uh, so all in all, uh, quantum is a big question mark for Bitcoin. Uh, I think many long-term investors when they come into crypto and they hear that quantum is not solved for Bitcoin, it just makes them a bit less certain to invest big amounts over in the coming decades because yeah, three decades, two decades, if you have that time horizon, I'm not sure you can trust Bitcoin fully. Uh, because there's no big initiative to make it quantum proof. I don't see it. I don't see it now coming 10 years doesn't matter but again Bitcoin is a asset that that should compete with gold and gold if you have gold you have it in your backyard is going to be is going to be gold in 20 30 40 50 years 200 years [snorts] so that's a big problem I think with uh the current focus of the devs they should be focusing on quantum um then you ask about injective this and that uh bitcoin is the is the main thing all of the shitterters all of the old coins big shout out to injective it's a chain like great stuff, great tech, but it's a bit secondary. This is totally secondary. Bitcoin is what needs to get quantum proof uh as soon as possible. Uh everything else is u yeah it's secondary. It doesn't have any impact on the overall industry whether you know some um second tier third tier chain has quantum proof like it doesn't matter. Uh what matters is Biskin does have quantum proof or not. Currently it doesn't. We should focus on that. Aan, can we make quantum hash or encryption on ETH stand quantum to ETH to understand? You mean to understand quantum attack? You mean that we do like a demo? I'm afraid not. [laughter] I'm afraid I mean I'm afraid I wouldn't know how to do it. Uh I mean number one, I guess you need a freaking quantum computer to begin with. [laughter] I don't think it's a programming demo where I can just, you know, pull up an editor and and demo something. [laughter] uh I'm afraid and also you know I I I was in computer science in 2017 that's when I went full-time crypto so when it comes to the latest with quantum computing and all of that I guess you need a machine I mean it's uh maybe some of you guys have I mean is there I mean who has quantum machines Google has them but do do any universities have like the latest something normally universities have you know this you know quantum super this and that which university has something on quantum and the current state of it is still so nent that it's not really I don't know what it can even break nowadays yeah it cannot break anything nowadays it's within the coming 10 to 20 years that you can expect it but uh currently what is the the the bleeding edge demo if you guys are in the field let us know what's the bleeding edge demo of quantum that uh is tangible to something in the real world let's say breaking some encryption. I mean doing something. I think pro I mean from what I've read just you know from my uh on top of my head it's it's still years away from that but at the same time things go very fast. I mean people said AI is going to take time in 2021 and now I use AI every day like for for most things it went very fast. Um the worst thing you can do is to say that tech is not going to happen or going to h happen slow. You you never want to be a tech pessimist. I think that's that on the on the looking at the whole thing uh it's very bad for you. The cars are really stacked against you. I mean you have it all the time. People say that insurance will not be big then it's big. People say that crypto will not be big then it's big. People say that AI will not be big. There was a lot of AI skepticism. I mean before China GPT moment there was a lot of AI skeptism then it's big. [clears throat] Now even in you know 1800s you know end of tech. Do you remember end of tech? Who who said it? I remember in the 1800 people said that you know you don't need any new invention. Who said it? Let me ask a cloud here. Okay. Do you know in the 1800s someone said that you don't need any new inventions? Who said it? And uh in what context? Let's see what Claude says. Always if you're a skeptic on tech, very bad. Very bad. Ah, look here. Look here. You're likely referring to everything that can be invented has been invented. Famously attributed to Charles Dell. Don't be a tech skepticist, guys. Never, never, never. So quantum, listen, Hudel knows when it's going to happen, but for Bitcoin, what's the excuse to not focus on quantum? What could be more important? I mean, honestly, there's nothing more important. What could be possibly more important than the long-term u uh survival of of the of the chain with quantum resistant technology which already exists in principle I mean you you have it you have it it exists it's new it needs to be tested needs to really be uh scrutinized the solutions against quantum but you can implement I mean it's possible you can do it you can do it so I just don't understand the like riskreward analysis there what more could be moreant important the problem of quantum computer is you need very temperatures and cheap energy very few place have such thing well it's with the I mean yes yes tomorrow may be different I mean uh tomorrow maybe there's something else tomorrow who hell knows what's what's going to be tomorrow in 2020 there was no AI that is widely used in 2025 people create freaking movies with AI full movie you can do go to Google what is this uh um I don't remember you can create like a whole world with AI you can be you can create like GTA 6 with [laughter] so today like this tomorrow not like that and there's no way to quickly fix anything in Bitcoin okay you understand there's no way to quickly adapt to anything let's say you're a bank you're a boomer bank you see quantum thread finally being real let's say it's real you wake we wake up one day maybe in 10 years and now it's banks will not be affected. Guys, another bad argument is that, oh, but if Bitcoin breaks due to quantum, then everything breaks. It's false. It's very wrong. It's very wrong. It's it's incorrect. It's very incorrect. If quantum arrives, what will banks do? They will pull the plug from their online systems. Issue fixed. You need to go to a bank. You need to be in person. Easy. They can coordinate like this. Turn off. turn everything off until they figure out a way to make it resistance. Bitcoin cannot do that. There's no way to shut down Bitcoin. So, if something bad happens, there's no way to shut down. There's no way to, you know, quickly do something. Uh banks can quickly do something. They can shut down. They can uh fix it's centralized. So, uh that's that. But guys, that's it. We're at 50 minutes is a good length. Uh I got to go. Thanks a lot for being here. Big [clears throat] shout out to Dab for time slapping us today. Smash up the like as soon as possible. Subscribe to the channel uh as soon as possible as well. Check out bulmania.com/partners for the exchanges. You have all of them. And yeah, give some feedback to us if you want which kind of categories you want because now we added categories here. Bybit for example has crypto, precious metal, stocks, you can go long or short, leverage, debit card, but you can use a bank account soon. They're launching it soon. Uh Bionex, you have the trading bots. Um bluffin, you have low KYC. So use the link below bullmania.com/partners and you get big fat signup bonus on all of them and go to bullmania.com if you want to watch the free training, get our tools, get the mechanical rules most importantly. And big shout out to Dub for timestamping us guys. Thanks a lot. Was always fun, always great uh great time chatting together. Let's see what's Bitcoin going to do. Let's see what also going to do. If something drastic happens, we're going to be back this evening. Probably we're going to be back tomorrow morning. uh because after a bounce I mean if I'm to speculate a bit after a bounce it was quite some volatility likely we have a few boring weeks ahead let's see uh the best scenario for bulls would be a big fat pump now towards like 80 85 uh doesn't seem to be happening yet if that happens we're going to analyze it and that would change our short-term outlook if we see a bounce towards 85 it would change the short-term outlook to to be more bullish then you can short more on the short term you can long more on the short term instead shorting and so on. But guys, more more on that later in coming streams. Have a good day and goodbye. Yes, goodbye. Good."
    }
]