[
    {
        "video_id": "t-yD4FQdmIw",
        "title": "Bitcoin Holders Panic Sell: Is The Bottom In For BTC?",
        "published_at": "2025-12-10T14:25:05.000Z",
        "sort_date": "2025-12-10",
        "url": "https://www.youtube.com/watch?v=t-yD4FQdmIw",
        "views": 14686,
        "duration": "00:19:38",
        "transcript": "BTC has taken quite the hit since its 126K all-time high. The most recent drop took us to 80K in spectacular fashion as billions in leveraged positions were wiped out. And then after the dust had settled, Tradfi does the most tradey thing ever. Vanguard, the second largest asset manager in the world, reversed its anti-crypto stance and told its 50 million plus clients they could start trading crypto ETFs and crypto linked funds on its platform. Right on Q. So, did weak hands just hand over their coins to Wales? How has the recent draw down reshaped the market of BTC holders? And what does the onchain data suggest about the state of affairs? Well, we're diving into all of that and more in today's video. My name is Lewis and you're watching the Coin Bureau. First up, I must make one thing clear, and that is that I am not a financial adviser, and nothing in this video should be considered financial advice. This is educational content meant to show you how fear in the market is pushing coins from weak hands to strong hands. If that sounds good, then hit that like button and let's get into it. Let's go. >> All right. So, what's going on in this market? Well, before we jump into what the onchain data is showing us, we have to talk about the thing that makes every sell-off look 10 times scarier than it actually is. Leverage. When you read about billions in crypto leverage being liquidated, that's taking place on centralized exchanges, not on the Bitcoin blockchain itself. But it still matters a lot for onchain analysis because leverage liquidation cascades force emotional decisions from spot holders. Holders are often pushed to act at the worst possible time, setting in motion actions that show up on chain as things like coins moving and losses getting locked in. Here's a quick recap on what happens during liquidations. When traders are overleveraged and price moves against them, they could be forced to close their position by their exchange. For a long position, that means automatic selling into the market. If enough people are stacked on the same side of the boat, the forced selling pushes price lower, which triggers more liquidations, which pushes price lower, and suddenly you have a liquidation cascade. That's what the move of late November looked like. Liquidations hit around the $2 billion mark on November 21st as BTC rapidly slid into that 80k area. It was a classic onchain reaction of margin getting torched. Now, here's where the onchain insight comes in. When panic takes over, it's not just leverage being liquidated. Spot holders are also driven to dump their bags, too. Onchain, that shows up as realized losses, which is exactly what it sounds like. coins being dumped at a price lower than their cost basis, meaning someone is locking in a loss. BTC's realized losses surged back to levels last seen around the FTX collapse back in 2022 with Glass Node data showing that the capitulation was being driven largely by short-term holders. That's what people often refer to as weak hands, recent buyers who couldn't take the price action, so they cut their losses and sold. But to be clear, it wasn't just tiny wallets panicd dumping $200 worth of Bitcoin. According to data from CryptoQuant, BTC sent to exchanges reached around 9,000 coins on November 21st with roughly 45% of those coming from large deposits. That is transactions of 100 BTC or more. The average BTC deposit value reached up to 1.23 23 BTC for the month of November, the highest level in almost a year. Now, coins moving to exchanges doesn't guarantee that they were sold right away, but it does tell you the market was actively repositioning in size during the chaos. Once that first cascade burned itself out, the onchain backdrop didn't magically turn bullish either. BTC was stuck in a fragile 81 to 89K range with liquidity thinning and realized losses still elevated. Basically, the market was oversold and not exactly overflowing with fresh conviction. Then came December 1st, the follow-up liquidation cascade. Although it was relatively less dramatic, the market saw almost $1 billion in liquidations as a sell-off picked up another bit of momentum to drag prices down to around 84K once more. So, when we talk about big shifts in the holder ecosystem, these big liquidation events are often the trigger for a sharp change in key onchain metrics. Liquidations don't just move price, they restructure the whole market with urgency and panic. So, how did all of this panic show up on the blockchain during those recent sell-offs? Well, for starters, every time a coin moves, we can estimate its cost basis. That's basically the last price at which it changed hands. Stack millions of those together, and you get a map of where holders will start sweating and where they'll start smashing the sell button just to feel relief from market stress. To look closer at this, we'll rely largely on data from analytics firm Glass Node. When the market got stuck compressing between roughly 81,000 and 89,000, realized losses were running at about 403 million per day and the short-term holder profit loss ratio collapsed to 0.07x. In the simplest of terms, that's recent buyers getting rinsed and liquidity drying up. Now, at the time of shooting, BTC has found itself back in the 90ks. So, we've bounced, but we're also not back in the zone where short-term holders are truly comfortable. For that, we need to regain that short-term holder cost basis above 100K. If we use Glass Node's supply cost basis model, a key recovery zone is in the 96K to 106K band. Think of it as the range where the bigger, heavier buyers tend to have their average entries. Below 96K, more than 25% of the supply is underwater, which is why rebounds can seem fragile. Glass Node also noted in a recent report that the 7-day moving average of total supply in loss climbed to around 7.1 million BTC, highest since September of 2023. That means a lot of coins are sitting at unrealized losses, not profits. At the same time, net capital inflows is still positive at about 8.7 billion per month, meaning money hasn't completely stopped coming in. However, it's far below the 64 billion monthly peak back in July of this year. In other words, we're not in a full market freeall, but the structure is still bruised. The bid is there, but it's certainly not roaring. Now, let's have a closer look at those so-called weak-handed participants. A great quick read for recent buyer stress is the spent output profit ratio or SOPR of short-term holders. Don't worry, you don't need to memorize that. Just remember what it means. This measures whether recent buyers are selling for a profit or for a loss. This metric dropped to about 0.93 while BTC dropped below 80K. Any reading below one typically signals capitulation from newer entrance. For a reading of 0.93, that's short-term holders on average selling roughly 7% below what they paid. That may sound like nothing to seasoned holders, but that's capitulation behavior for short-term holders. Even after a bounce, that pain doesn't necessarily vanish. When loads of people buy higher, and then spend days or weeks underwater, they don't become fearless diamond-handed monks overnight, what often happens is that the price rallies, gets close to their entry, and suddenly the market runs into a wall of sellers. That's why you can get these really annoying heavy bounces where it feels like every green candle is just slapped right back down. Now, if short-term holders were selling off hard as we dipped into ADK territory, then who was buying? Who's adding coins while everyone else is stressing about their portfolio? Well, many suspect that big players were accumulating during the dip. So, let's look at those big wallet cohorts to see what they were actually doing. Well, sure enough, whales seemingly flipped back into buy mode. For proof, we can look at Glass Node's accumulation trend score. On a scale of 0 to one, a score near one means large holders are aggressively accumulating. And a score near zero means that they're distributing or staying flat. As the market flushed into the 80K to 90K range, the score rose higher and higher towards that top measure of one, signaling that big players saw that zone as value and stepped in as buyers. Now, the word will can mean a lot of things. It can mean a fund, a custodian, an early adopter, a desk, or someone who just never stops stacking. So, it's not necessarily a case of OG Bitcoiners controlling the market. These stats just show that as a group, bigger holders have been willing to take the other side of retail fear. And if we expand that range to include entities holding 10 to 10,000 BTC, the picture becomes clearer. Remember that 10 BTC is roughly 1 million in this day and age. Anyway, according to data from Santiment, entities holding 10 to 10,000 BTC have net accumulated over 47,500 BTC so far in December after dumping around 113,000 BTC from October 12th through November 30th. In other words, the big wallets stopped selling and started buying up coins again. So, if all of these big players are buying, why didn't the price instantly teleport back to all-time highs? Well, because buying isn't necessarily the same as number go up. Sometimes big players accumulate with resting limit orders into fear precisely because liquidity is thin and everyone's panicking. As for bullish spirits right now, Glass Node states that buyer participation is still relatively low. Onchain activity is soft and the market is trying to find a balance rather than just full send higher. There's also another factor worth pointing out. Whales don't buy 24/7, and many are more cautious of where we might be in the market cycle. Whales tend to slow down approaching the end of the traditional 4-year cycle, whether you believe it's still relevant or not. and smaller wallets are more eager to try to catch those drops. But either way, the onchain insight is still the same. Panic hit the order books. Smaller players and short-term holders puked into the lows, and big players were net accumulators. Coins have been moving, and lately, a meaningful chunk of that supply has been flowing into bigger, calmer hands. And if you're looking to emulate those calm hands or you reckon that you could take advantage of panic when it strikes, well then you have to check out the Coin Bureau deals page. That's where you'll find signup bonuses of up to $100,000, trading fee discounts of up to 50% and deposit cash backs of up to 75% on the best crypto exchanges. To get all these deals, all you need to do is just hit the link in the description or scan this QR code. Once you get on the deals page, just find a deal that suits you and click one of these sign up now buttons. These deals won't be around forever, so take advantage of them while you can using the links in the description below or the QR code on the screen. Now, back to the video. So, we know that whales have been buying and short-term traders have been fumbling. It's one thing to make note of these flows, but exactly where these coins are being held also matters. One useful metric to gauge the market in this regard is exchange balances. What do we mean by that? Well, most people don't keep BTC on an exchange because they love the UI. They keep it there because it's one click away from a sell. So, when we look onchain at exchange balances, we're effectively asking a pretty simple question. How much BTC is sitting in wallets that makes it ready to sell? Spoiler. Recently, that pile has been shrinking. BTC holders withdrew more than 23,000 BTC from exchanges over a 7-day period running into the beginning of December. That's roughly $2.15 billion worth. And it pushed exchange reserves to their lowest levels since January of 2021. That's a major move, and it's not the kind of behavior you expect from people who are about to smash the market sell button. BTC holdings are up while exchange balances drift toward multi-year lows which tightens near-term sell supply. Now, it's important that we provide a quick reality check before getting carried away. Exchange balance data is not magic. Exchange metrics depend on identifying and labeling exchange addresses. These can be revised over time and exchanges can reshuffle funds internally in ways that temporarily distort inflow and outflows. Just something to keep in mind. But even with those caveats, the trend still tells a story. For one thing, because psychologically deposits and withdrawals are two totally different animals. If you're panicking, you don't usually bother withdrawing. You sell. If you're withdrawing, you're doing the opposite. you're saying that you're not interested in trading this. So, after a proper shakeout, this dynamic and exchange balance data is what you'd expect when weak hands are done smashing the red sell button and stronger hands start settling in. There's also a bigger structural angle here that matters for figuring out who's buying the blood. BTC supply has been shifting away from retail trading venues and into more institution style pools. According to estimates from frosta using glass node data, there are about 6.7 million BTC held across ETFs, corporate balance sheets, and other centralized and decentralized treasuries. ETFs alone have absorbed around 1.5 million BTC since early 2024, while centralized exchange balances have declined over that time horizon. So, it's not just a few mega whales. It's generally been a slow migration into long-term custody. And as mentioned earlier, we now have Vanguard entering the market to offer its 50 million plus clients greater access to crypto. So it's reasonable to expect this structural shift in holders to continue in the coming years, although there will be a natural eb and flow of course. Now crypto leaving exchanges can be bullish and this latest dynamic certainly paints that picture. What's more, though, is that you could still have a ton of buying power sitting and waiting on crypto exchanges at the same time. How? Well, through stable coins. Stable coins are the chips people use to buy crypto. Cryptoquant data shows Binance's Bitcoin tostable coin reserve ratio dropping to its lowest level since 2018. That basically signals that relative to BTC, there's a lot of stable coin liquidity parked and ready to move if buyers wake up. So, while spot BTC demand has been lacking a bit, the ammo is there. It's just not firing yet. Okay, putting this all together, we have onchain data that paints a pretty clear picture of impatient traders handing over coins to patient, long-termminded buyers. That combo doesn't guarantee a pump, but it does change expectations. Fewer coins are sitting on exchanges and downside moves can run out of easy supply faster. And when real spot demand finally shows up, there's less inventory to chew through before price has to move up. Now, for the ultimate question, how should we proceed moving forward giving all of this information? Well, as we've alluded to, if you're trying to time this rough market perfectly, it's probably not going to work out so well. This is the kind of market that feeds on perfectionists. The current regime is still sensitive and jumpy. You get random wicks and sudden bounces that can make it seem like the market is mocking you personally. The onchain data we looked at earlier essentially confirms that while there are some bullish signals and dynamics that typically mark bottoms, the market is still in that fragile phase. Low participation makes timing all the more difficult. There aren't enough steady buyers and sellers to smooth things out, so price can move a lot on relatively little activity. At the same time, sentiment measures also reflect some nerves. Coin Market Cap's fear and greed index sits at 24 out of 100 at the time of shooting. Still in fear territory, even after the bounce, and around the time of the late November liquidation cascade, it printed the yearly low with an extreme fear level of 10. But as we've seen, when fear is high and short-termminded traders have capitulated some coins, that's usually where patient big money likes to operate. That's not to say that they have a magic crystal ball. These accumulators aren't necessarily buying because they expect an immediate bullish reversal, but they do see some value at prices in the $80 to $90,000 range. Glass Node recently framed the current market setup with a sober note, saying it echoes early 2022 style stress. There's rising supply sitting in a loss. Spot demand looks tepid and positioning remains cautious. In other words, it still looks a bit messy. But that's exactly why you keep seeing bigger and more patient wallets willing to begin nibbling with some buy orders. So focusing on trying to predict the bottom is probably not where energy is well spent here. Instead, it's better to make sure that you're not acting like a stressed out trader. Patient whales don't need to be right today. They're fine being early because they're not swinging the entire account on one buy order. They buy in chunks and they leave room for more potential downside and chop. The idea here isn't to copy a whale's actions, but instead to consider that these nasty market regimes can last quite a while. So, it pays to be patient, whatever your exact plan may be. Slow down. Remember that 1-hour candles are not life decisions. And give yourself the one advantage whales always have, time. Well, that's what the onchain data tells us about the state of the market. But what do you think? Do the big buyers know something that we don't? Or do you think that the market will punish them and push them to panic cell soon? Let us know your thoughts in the comments below. And if you want to learn more about how Vanguard has opened up to crypto, well, check out that video right over here. That's going to be all for now. As always, thank you so much for watching and I'll see you next time. It's Louis signing off.",
        "summary_hu": "A BTC 126K-ról 80K-ra történő zuhanása során a kereskedők pánikjának következményeként jelentős mennyiségű likvidálás történt. A gyengébb kezű befektetők eladták érméiket, míg a nagyobb szereplők vásárlási pozíciókat kezdtek felvenni. Az onchain adatok szerint a piaci struktúra lassan átalakul, mivel a BTC-érmék az erősebb kezekhez vándorolnak, ám a befektetői hangulat továbbra is óvatos.",
        "summary_en": "The drop from 126K to 80K in BTC triggered significant liquidations due to traders' panic selling. Weak hands capitulated while larger players began accumulating positions. Onchain data indicates a gradual shift in market structure as BTC coins flow into stronger hands, yet investor sentiment remains cautious.",
        "crypto_sentiment": "Neutral",
        "sentiment_score": 55,
        "key_points_hu": [
            "A BTC zuhanása pánik-eladásokhoz és jelentős likvidációkhoz vezetett.",
            "A gyengébb kezű befektetők eladták érméiket, míg a nagyobb szereplők vásárlásokba kezdtek.",
            "A tőzsdén tartott BTC mennyisége csökken, ami szűkíti a rövid távú eladási lehetőségeket."
        ],
        "key_points_en": [
            "The BTC drop led to panic selling and significant liquidations.",
            "Weak hands sold their coins while larger players began buying.",
            "The amount of BTC held on exchanges is decreasing, tightening near-term selling supply."
        ],
        "main_topics": [
            "Market Liquidation Events",
            "Change in Holder Dynamics"
        ]
    }
]