[
    {
        "video_id": "WrHDgOQgsjA",
        "title": "Palantir SOARS Overnight After MASSIVE Navy Contract!",
        "published_at": "2025-12-10T04:49:54.000Z",
        "sort_date": "2025-12-10",
        "url": "https://www.youtube.com/watch?v=WrHDgOQgsjA",
        "views": 7521,
        "duration": "00:10:07",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. I hope everybody has had a great day here. Just a few hours ago, we see Palanteer announce a major deal with the US Navy. We're going to be talking about that as its price is rising pretty quickly here in the overnight hours. It'll be really interesting to see how this reacts after the FOMC meeting and the interest rate decision come tomorrow. And with that being said, we're going to be talking about what could be in store for us tomorrow um after we do get that interest rate decision and what most investors are probably going to be looking at. On top of that, we see crypto that is experiencing a little bit of liquidity coming in here today. BMR is like up like 10% on the day. I didn't realize that I was it was shocking to see the stock finally green for once after a major uh pullback. And on top of that, we see some of the AI data center plays like INEN that are building out huge infrastructure um basically projects. We're going to be talking about that. So, if you're a new or returning viewer, hit that like button, subscribe for daily videos. We're trying to hit 30,000 subscribers. Let's see if we can do it. Thank you guys so much for watching. If you pop it up on the screen here, what we can see before we talk about the official deal here with Palanteer is it's currently at 18602. And even at this candle here in the overnight pushed up to 193 for a second. I saw it and I saw some notifications and I was like what the heck is going on here with Palunteer? Why is it at 193? Obviously there was some major news that came out and now you're currently seeing it at 186 up about 2% on the overnight up which equates to $4. Now it's currently in the top of this consolidation zone. We've talked about this multiple times. Uh if you've been watching on the channel, you know, Palanteer has this nice base that's formed between the 170 and the 186 and right now it is literally at that resistance point at the 186. If we see this open, this market open and there's going to be a lot of variables that play into this because we have the whole reaction to the interest rate and kind of what the future outlook looks like in terms of what Powell says. Um in terms of that, this could possibly be turning into a support level. I do like here some buying pressure in the overnight session though that can help kind of give this some security uh before we could have any type of macroeconomic volatility. It'll be really interesting to see what happens especially with what happens today in terms of price action. Now looking at the news you see here had posted this is where I saw it right away is that the US Navy has announced a 448 million strategic investment in the ship building operating system known as ship OS to help accelerate the adoption of AI and autonomy technologies across the industrial base. Now right here it says ship OS. It's actually going to utilize and leverage uh Palanteer software to bring bring the modern best practices to the complex very data heavy environment of Navy ship building saying they're seeing a mass level of infrastru infrastructure and software investments from the US government. So I mean people talking about very short position this is what Palanteer and the US Navy have to say against it. Uh so what we're seeing here of course with paneler just continuing to establish these key governmental uh very credible partnerships and I think this just helps brings more credibility of course with all the different types of uh uh operating systems and different type of software solutions that it can offer to basically any different niche out there. uh we've seen this especially with the last week you know with the announcement of that whole chain reaction on working on addressing the major issue which is the AI bottleneck and that's what we're seeing right now with some of the data center plays I mean talking about IN here it's been stabilizing and really kind of holding here in the consolidation zone between the 41 and the 50 uh what you see here I ran talking about here building Horizon with 750 mi of high bandwidth fiber and two 100 megawatt GPU superclusters AI demand, you can see scaling at an incredible rate. We'll be talking more about the AI data center play here in just a second. Let's talk about Nvidia first before we talk about the general market. Uh Nvidia is really interesting. We're seeing a lot of political tension that's starting to play into here. Nvidia basically hanging out at 184. I don't mind it here. This of course is after the announcement that we saw with uh Nvidia in terms of Trump allowing the sale of the H200 chips. Uh that kind of helped push Nvidia to 190 back down here back underneath its 50-day moving average. Uh basically sitting at about 184. Uh in terms of what China came out today with response saying they're refusing to accept Nvidia chips. So we had all that uncertainty. Trump said, \"Hey, you know, opening the doors to sell the H200 chips.\" And China comes out saying, \"Hey, they refused to accept it here uh despite the authorization of the sale of those chips uh to accept them and increase restrictions on their use, trying to maybe keep more domestic products uh and and chips within their own actual technology buildout. Um it's just funny here. What I think we're seeing is just power plays. It's like, okay, who has the last laugh?\" Uh that's kind of what I'm seeing here. So interesting to see, but that's just kind of what we're seeing on Nvidia. In terms of the S&P 500, it closes here down basically nothing on the day. Down .09% down six points right here at 68.40. Like I said, the market's just waiting. Futures are just crazy just flat across the board. Waiting for the FOMC meeting. um you know we do basically have about this 87% chance now uh that we're going to be seeing a at least 25 basis point cut uh what we saw here this anticipation we saw some interesting you know some names actually got a decent amount of liquidity and some buying pressure that was coming in with some big money that was moving around and typically we don't see that right ahead of the FOMC but um ray cuts they're basically priced in that's what it seems to be you know that's how things are appearing to Uh right now though, what everybody's going to be looking at are what are going to be the economic projections and POW's commentary that's going to be coming at 2:30 like Eastern time I believe. How is that going to play a big role for the last kind of meeting of the month and what are the anticipations and what's going to be the sentiment looking into 2026 in terms of how they're feeling in terms of rate cuts? that is going to be more important because the market is for sure always forward looking trying to price in the forward events on what they anticipate in the future. So a lot of moving parts for the Fed for 2026. Uh basically talking about that we're also going to see you know of course Paul's going to be leaving new chairs going to be coming in. So very interesting. It'll a lot of volatility. I don't know how the market's going to react but I guess we'll see. Let's talk about Ethereum and Bitcoin that saw a lot of buying pressure today. some very interesting I mean look at BMR here uh in terms of this I saw this you know talking about this these green candles and this volume that came in uh you could see a lot of big money was buying right here um Ethereum had a nice push to about from 332 up here to about 3300 and Bitcoin likewise got a nice push but it's experiencing a little bit of a pullback as we speak all the way up to about 94,000 for a second there and is back down to about 92,000 And we see a lot of volatility here. Of course, ahead of the FOMC uh in terms of what this is going to mean for the crypto industry. We could have some indications there if any of this is being referenced in Powell's remarks. But with that being said, you see BMR experiences actually a decent green day up about 10% on the day currently right now at 3928. So, uh, great to see here BMR finally seeing a little bit of a buying pressure. Um, especially after Tom Lee is continuing to accumulate Ethereum at a very rapid pace. Uh, basically becoming the largest institutional holder, uh, of the actual Ethereum currency regarding a digital asset treasury. So where BMR sits at about 3928 of course you know I yes I like to technically look at BMR a little bit but it's so heavily relying on Ethereum's price which has its own technical type of support levels and indicators and different types of variables but BMR did have a nice nice reversal right here at about the 25 uh and is basically kind of back in this zone. We'll see if it gets back above 40. And depending on what's going to be happening, you know, with Powell's remarks, are we going to be getting that year- end rally for crypto that everybody is expecting or is that run over? Who knows? Uh that's why I'm going to be kind of waiting to see what type of movement that we have being priced in before making any large positions or any large kind of short-term trades. Um, in terms of the AI data center trade, like I said, we saw that I Rend uh is really working on infrastructure holding nice here at 4660. You're seeing Cipher right here at 1954. I think once Cipher gets a nice break above 20, that's when you can possibly retest these alltime highs here in the short term. Uh, looking at like Nbius still under 100. Coreweave sitting here at about 90. a lot of people trying to pick the best one. But, you know, in terms of the whole playout, I think all these have a decent opportunity, especially as the whole AI dinner started trade. You know, even if these companies aren't as strong as some of the others, I think the market could do a possibly a decent job holding up the other ones. Of course, that's all my own opinion, but some of the stocks that we're actually seeing to continue to see a pullback. SoFi, this was up at about 30 here before they had their public offering in terms of dilution. You see SoFi come back here to 26. If this gets back into the 25 area, I'll probably be keeping my eyes out more for taking a long position on SoFi. Uh waiting to see if that opportunity presents itself or if it doesn't, uh if that gets invalidated or we see a reversal quick, you know, sooner. So, not too much else to say other than that. You know, great to see we see Palanteer announced to that deal ahead of the FOMC. I guess we'll see what happens and tomorrow's going to be more of an interesting day once we get that behind us. Peace out. Take care and I'll catch you guys later."
    }
]