[
    {
        "video_id": "UFIxH_4UZlY",
        "title": "The FED Just Rug Pulled Bitcoin",
        "published_at": "2025-12-10T21:58:26.000Z",
        "sort_date": "2025-12-10",
        "url": "https://www.youtube.com/watch?v=UFIxH_4UZlY",
        "views": 30540,
        "duration": "00:07:04",
        "transcript": "Holy crap, guys. The Fed just rugpulled us in the most dirty sneaky way possible. Look here, we did get the rate cut. We also, by the way, got the QE, the restart of QE. I will soon go through everything that happened today at OMC, but the Bitcoin price is down. It is down for the day. It is red. And of course, people are wondering, Ivan, what's happening? How can the price be red today when we have a very bullish event happening? We did have the rate cut, insanely bullish, and we did have also the restart of QE. This is for the first time since 2022 that QE is coming back that the Fed is using money to buy assets from the public markets. And in this case, uh they will be buying US treasury bills because they need to support the US government. Basically, they're going to be printing and giving money to the US government and US government is going to give them US treasury bill as a sort of repayment. But we all know how this works. basically sprinting and giving money to the government. So all in all, how can this not be a massive rocket booster to the upside? This is what people are asking, Ivan, how come this is not just pumping us like a freaking rocket booster to 100K, 120K and above? Because this is basically what bulls wanted. They got everything everything and more and more because they also got the uh QE and this wasn't actually something that most people were expecting uh today. So let's let's explain what's happening here and why are most people confused? What are they missing? So the first thing, why didn't we pump based on the rate cut? Because if you've been watching the channel, if you've been watching this morning, let me know in the comment section because this was already priced in. 25 basis points is what the market already expected and it's already priced in. So rate in itself is not something that's going to pump the market if uh we already thought that they would do 25 and they did 25. So no news there. That's number one. Number two, so why is it so that we still have volatility during FOMC if FOMC basically tells us what we knew already? In most cases, we know already what the rate cut is going to be because we look at poly market and other predictions market prediction markets and they show us beforehand. So why is it so that we still have volatility around the FOMC meeting if everything is priced in anyway? Why? Well, because it's all about what the Fed chair, what Powell says. Because if he says that we're going to continue cutting, this is something that markets did not know. It's new information. If a Fed chair comes out and says, \"Listen, next month and the month after, we're going to keep cutting. It's new information.\" And then we have to price it in in real time. And that's when volatility happens. So, what did he say this time that um uh that did not make us pump? He basically said that uh the rate cuts may be done for now. Okay. And this is not something that the markets like. Obviously, this not something that the markets like. Uh so this thing right here with the QE is by the way it's quite small. Like this is very small number for QE. Uh I think this one was canceled out by this one. Okay. The fact that they're going to do QE but it's a bit small. It was fully canceled out by the fact that he was a bit not too doubbish, a bit hawkish, not doubish enough for future rate cuts. And also you had these two members of FOMC that desented basically said that they don't agree with the cut and they wanted to keep rates as is and they said basically that the inflation is not under control and markets are at alltime high so why should we cut and so all of this gives the markets more of a concern whether this these cuts will continue how many will we have in 2026 is this still as bullish as we thought so yes this is monumental that they are starting QE at the same time this This is what I think canceled it out. So the result we have is that the rate cut in itself is not new. It was already priced in the QE was net bullish but then that net bullishness was canceled out by the Fed the chair not being super clear how they're going to do in the coming months and in fact he was a bit hawkish. He was a bit bit careful. So that's that. uh now uh with QE guys I think that this just strengthens our uh thesis because as you know our thesis has been that we are now in bare trend so we are conservative because all rallies will likely get sold into in one way or another and I still expect us to go to 100K I think we're going to go to this level and touch it the 50week moving average uh but listen if Bitcoin cannot do it on this news like this I thought it's going to happen today when we went here to 94 I thought okay relief rally to 100k let's go but I mean Bitcoin is now struggling to do that. So let's see if we can do it at in in this from this range to 50 moving average or in case we need another elevator down and then maybe retry from here and maybe I mean let's see let's see but at some point we will retouch the 50 moving average. I think so. Yes, I think so. Um and short term this what just happened doesn't change anything short term because the price is still king and the price is still showing us that nothing has happened. We don't even go to 50 moving average. we're still in bare trend and so on so forth. If we pump above this moving average, we're pumping strongly above above above higher and higher then obviously situation is more bullish for now the situation is um unchanged. So that's that. But here here's where the thesis strengthens because QE now started. Okay, it's it's very small now. It's super small. Like now it's it's not a Lambo QE like this guy saying. It's not a Lambo QE. This is more my Uber is 7 minutes away Q because it's very small and uh that being said, it is a paradigm shift. It's a paradigm shift where from now on we are in QE season and you know this takes years to build up. So I think into 2026 we're going to go from 40 billion now to hundreds of billions maybe even to trillions. And when those numbers start hitting the uh the market and that liquidity starts hitting the market that's when we will see proper proper proper proper uh proper pumps in Bitcoin and in and in stock market because with 40 it's too little guys it's too little but still it's the beginning. You got to start somewhere. you got to start somewhere. And so guys, 2026, that is when I think we're going to pump like hell. I think it's going to be towards the summer, maybe end of summer, and that's when we're going to start the the pump towards a million bucks for Bitcoin because they're going to hyperinflate the crap out of the dollar with the new Fed share and everything. For now, on the short term, we remain conservative. We're below 50 week. We cannot even pump today on the most bullish news ever. Let's see if it changes. Still a few hours to go. Maybe now it's green. Let's see. No, still red, but I mean almost green. I mean, let's see if we can go go towards the 50week moving average, guys. That's the target I expect at some point to be hit the 50week moving average. So, guys, smash up the like, subscribe. See you all very very soon. Hope you enjoyed this short check and subscribe and like, like, like, smash the crap out of it. See you all very very soon. Have a good good day, guys. Bye-bye.",
        "summary_hu": "A Fed legutóbbi döntése, a kamatcsökkentés és a QE újraindítása nem váltotta ki a várt árfolyam-emelkedést Bitcoinnál, mivel a piac már beárazta a várt eseményeket. A piaci volatilitást a Fed elnökének nyilatkozatai is befolyásolják, amelyek óvatos előrejelzéseket tartalmaztak. Jelenleg a Bitcoin árfolyama nem tudott felfelé mozogni, és a piaci hangulat továbbra is bearish, a jövőbeni kilátások pedig óvatosak.",
        "summary_en": "The Fed's recent decisions on rate cuts and the restart of QE did not trigger the expected price surge in Bitcoin, as the market had already priced in these anticipated events. Market volatility is driven by the Fed chair's statements, which included cautious forecasts. Currently, Bitcoin's price has failed to rally, and the market sentiment remains bearish, with cautious outlooks for the future.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 30,
        "key_points_hu": [
            "A kamatcsökkentés már be volt árazva, ezért nem okozott árfolyam-emelkedést.",
            "A piaci volatilitás a Fed elnökének jövőbeli kilátásokról tett nyilatkozatain múlik.",
            "A QE restartálása pozitívnak tűnik, de a hatása korlátozott a méretének és a Fed óvatos megközelítésének köszönhetően."
        ],
        "key_points_en": [
            "The rate cut was already priced in, hence it did not trigger a price increase.",
            "Market volatility depends on the Fed chair's statements about future outlooks.",
            "The restart of QE appears positive, but its impact is limited by its size and the Fed's cautious approach."
        ],
        "main_topics": [
            "Federal Reserve Decisions",
            "Bitcoin Market Reaction"
        ]
    }
]