[
    {
        "video_id": "H0-mwxr2-rw",
        "title": "Global Currency RESET Is Happening NOW",
        "published_at": "2026-01-02T14:00:06.000Z",
        "sort_date": "2026-01-02",
        "url": "https://www.youtube.com/watch?v=H0-mwxr2-rw",
        "views": 181647,
        "duration": "00:32:51",
        "transcript": "If you own silver or gold or any US dollar asset, including stocks, what's happening right now could multiply your wealth by like 10x or leave you completely unprepared for the biggest monetary shift in 50 years. While everyone was watching the silver crash, central banks were quietly preparing for a global currency reset. And I'm not talking about conspiracy theories. I'm talking about documented actions by the world's most powerful financial institutions. The US dollar's 80year reign as the world's reserve currency is moving towards a slow end and 12 trillion in American wealth hangs in the balance with it. By the end of this video, you'll understand exactly why gold hits an all-time high, why silver is being suppressed, and how to position yourself before the reset accelerates. I'm Felix Free. I'm an ex-investment banker. That's Winston back there who does all the hard research around metals around here. I'm also the co-founder or the real founder even um he's the co-founder of Goat Academy where we've taught over like 20,000 people how to navigate these markets. I'm also the co-founder of tradevision.io IO where we give you real market news on a Wall Street level. And our mission here is very simple. We want to teach regular investors, which is what I am nowadays like you are to to understand the biggest monetary transition since 1971 where Nixon took us off the gold standard. And what's happening right now? Well, we're living through the next chapter of that same story. And here's what you're going to learn in this very video. Why gold is at all-time highs. why silver is being strategically suppressed and what a global currency reset actually means explained simply the bricks gold-based currency launching in 2026 it's called the unit we've got the we've got the basil three banking rules that changed golds forever and why countries like Russia and for the other nations are dumping dollars so the critical 2026 timeline here and what that means for especially American investors and then how to protect yourself and how to potentially benefit from this. It's not theory. Central banks are doing this. The question is just, are you ready? Do you understand it? So, if you want to be ready, stick around. And in fact, I'm going to do one better for you. I'm going to give you a access for free to our daily or weekly gold and silver newsletter. You can sign up for that. There's a link down below, felix.org/s. You can choose whether you want a daily one or a weekly one. The weekly one is like a heavier PDF document on on on the weekend. And I've also asked one of my mentors who happens to be a London Metal Exchange market maker. And if you realize the exchange, the casino, well, the market maker is the house. And he's sent me a little clip explaining some of this. I'm going to put that in towards the end of the video. So stick around and watch that, too, because that's really like information and insight information you don't usually get access to. And the chap who's the market maker, it's called Elliot. He's also the head of our goat academy coaching team. this incredibly kind guy and a good friend of mine. So, let's start at the beginning. The most obvious piece of evidence. Gold is at an all-time high. Gold's rallied for like six consecutive months. The gold price on the screen here, however, is complete nonsense, isn't it? Winston, did you make this slide? 4,100 thereabouts. Right. Uh, new alltime high in 2025. even really Winston always blame the hound. Um but no, we've seen um a tremendous rally this year right in 2025, 6 months up, not a flash in the pan, a sustained powerful bull market and we participated early on in that through the gold miners and so on. But this only happened not because you and me are buying retail investors. Maybe you are, maybe I am, but that's not always what's actually driving this. It's central banks. Central banks like China, Russia, India are aggressively accumulating gold. Poland, Hungary, Singapore, Turkey, and so on as well. They're all adding to their reserves. And we're looking at about a,000 tons per year of central bank buying, which is the highest level of buying in modern history. And they're doing that every single year. Now, when was the last time they did that? 1967. The final years of the Breton Wood system, just before it collapsed. And we're going to touch upon that again in a second. But think about that. The last time central banks bought gold this aggressively, the entire global monetary system changed within a few years. So why are they buying? Well, they don't buy gold for fun, because it's shiny. They don't buy to speculate. They buy it because they know something is coming. They're buying gold because they're preparing for a world where the US dollar is not the sole dominant reserve currency. And that brings us to the next piece of evidence. We've got we've got the silver crash. So, let's connect the dots back to the silver crash I covered in the previous video if you saw that silver hit like $84 an ounce almost $83.990 on December 29th. So, the CME the exchange raises margin requirements. Silver crashes 10%. Leverage retail traders and smaller traders in smaller institution traders get forced to liquidate. And in the last video, I showed you how this was engineered through margin manipulation, the same playbook used in the 80s and the 2011. And they did it again, by the way, since I made that video. But the deeper question is this. Why suppress silver when gold is allowed to run to all-time highs? Well, gold is held by central banks, by institutions, by governments. Gold price going up validates the move away from the dollar towards hard assets. Central banks want gold to go up. It strengthens their reserves. But silver, silver is different. Silver is held by retail investors, by regular people. Silver is more volatile. It's more explosive. Silver is going, Silver going parabolic would signal to the masses, us, you and me, that something is wrong with the currency system. Silver is like the people's money, and they don't want the people front running the reset. So, gold is allowed to rise because it benefits central banks and institutions who hold it. Silver is suppressed because well it would benefit regular people and let's face it the institutions were short. But while silver is being suppressed the physical silver is hitting all-time highs. So physical buyers in Asia are paying like $35 more than the paper price in the US. So they're ignoring that and they're scrambling for the physical metal which tells you that there is actually real demand. So the paper market says silver is crashing, but the physical market says you desperately need this stuff. So the disconnect is part of this larger reset that's happening beneath the surface. The paper system is being manipulated. The physical world is preparing for what is next. The third piece of evidence will follow the action. Central bankers will tell you the dollar is strong, the system is stable, everything is fine. But the actions tell a very different story. US dollar share of global reserves dropped from 65% in 2008 to 58% in 2024. That's a 7% drop or 7 percentage point drop rather. That's trillions of dollars. So countries are diversifying away from US dollar holdings and people are also countries are moving their gold out of the US and the UK vaults and they're bringing them home. Germany repatriated hundreds of tons from New York. Turkey moved their gold abroad. Turkey moved their gold from overseas to Anchora. Poland moved 100 tons. Venezuela tried to do it from the UK. It was refused, which tells you everything, right? Your gold reserves in the UK or in Europe or the US, they're not really yours. They can get stolen at any time. And then the third part is we have these trade agreements that bypass the dollar. China and Russia are trading oil in the local currencies, northern US dollars. That is new. India and Russia are doing the same thing. China and Saudi Arabia are discussing the same thing. So everybody, every one of these deals reduces the dollar demand and chips away at the petrod dollar system that supported the US dominance since the 1970s. And the BRICS countries are also looking for a Swift alternative because the Swift system is what transfer all bank transfers basically go through Swift internationally. That is a US-owned system. So it could be shut down. You could be excluded from it if the Americans don't like you for a while. So therefore they are developing their own system and at the moment these are backup plans but they are operational systems. They're using them already for billions of dollars in transactions. And one thing I learned always was just follow the money, not the what the press release says. Right? So central banks are buying gold, reducing dollar reserves, moving their gold back home, and they're building alternative payment systems. They are doing big trade deals that bypass the dollar. So the evidence is pretty overwhelming. Question is just are you preparing for it? How are you preparing for it? So, well, you might be thinking, well, what the heck is a global currency reserve? What does it all have to do with silver? Well, let's take a step back. You keep hearing global currency reset or monetary resets that are thrown around. But what does it actually mean? Well, let me explain it to you in simple terms. Imagine you are at a giant international marketplace. There are buyers and sellers from hundreds of countries all with different currencies, yen, euros, rupees, pesos, you know, whatever. So, trading gets very complicated. So everybody agrees and says let's use one currency for all international deals. That way everybody knows the price. It's just a lot easier. Now that currency becomes the reserve currency, the one everybody holds and uses for global trade. Now if your currency is the reserve currency, you get a massive advantage. You can print money and export inflation to other countries. other countries have to hold your currency which creates constant demand for your currency. You can borrow very cheaply because everybody needs your currency bonds. So, so you essentially get to tax the entire world just through being this reserve currency and for 80 years that currency has been the US dollar. Now, a reset is when the world decides the current reserve currency system isn't working for us anymore. It's changing and that's going to happen because the reserve currency country prints too much money which is exactly what happened right co other countries lose confidence in that currency and you may also get new powers or coalitions challenge that system and the system becomes imbalanced. Now if you're holding the right assets during a reset you can multiply your wealth. If you're holding the wrong assets you can lose a lot. We've seen that before. Now I wasn't alive in 1944. born. My father was born that year. But after World War II, the world's power met in Breton Woods, New Hampshire. I have not been or I've been to New Hampshire, which is a lovely place. And they created a new monetary system. The deal was this. The US dollar would be backed by gold at $35 an ounce. All other currencies would peg to the dollar, which means the exchange rate is fixed. Countries could exchange their dollars for gold from the US. So the dollar became the global reserve currency. The US won the war, so they won the economic war. Now it worked because the US held most of the world's gold after World War II. The US had the strongest economy and military. Everybody trusted the dollar because it was as good as gold. Now the problem was the US started printing more dollars than it had gold to back them, especially to fund the Vietnam War and these Great Society programs in the 60s. Now foreign countries noticed that. So they started exchanging their dollars for gold and the US gold reserve started to drain. Now by 1971 the US was facing a crisis on August 15th 1971. President Richard Nixon went onto TV and made an announcement that changed the world forever. He announced the US would no longer convert dollars to gold. The gold window was closed effective immediately. So what did this mean? Well, the dollar was no longer backed by anything tangible. It became a pure feared currency backed only by trust in the US government. Every other currency pegged to the dollar also became feared as in nothing backing it. So the entire global monetary system became a trustbased system. Now in the immediate aftermath, gold prices exploded from $35 to over $800 by 1980. Massive inflation all the way through the 1970s. Currencies were going up and down like mad. Wealth transferred from dollar holders to gold holders. But the US made a strategic move to maintain dollar dominance. The petro dollar system. In 1974, US made an agreement with Saudi Arabia that Saudi Arabia would sell oil only in dollars. In exchange, the US would provide military protection and this created artificial dollar demand. If you wanted oil, you needed dollars. Now, every country in the world needs oil. Therefore, everybody needed dollars. So, this kept the dollar as the reserve currency for 50 years, even without gold backing it. In essence, Saudi Arabia is backing it, but that's also breaking down. So we're living through the early stages of the next global currency reset and the triggers are the petro dollar system ending. Saudi Arabia is now accepting Chinese currency for oil purchases. Russia is selling oil in rubles and and remb and and and the dollar oil link is so we're still in the preparation phase but this year we're expecting the bricks currency which is called the unit to launch. China has started silver export restrictions. 2027 2028 we're going to see that alternative currency system come to life and we're going to end up in a world where there are multiple currencies no new individual dominant currency. So we're in the preparation phase but it's speeding up. So quickly let me tell you about the bricks and then I want to tell you more about where we see silver and gold heading because there's some real fundamental shifts here that we need to understand. Bricks is launching a goldbacked currency. Well, it isn't entirely goldbacked. It's it's backed by a bunch of commodities, one of them being gold. And this has been discussed at brick summits. It's an active development. It's 40% gold, 60% backed by bricks currency. So, ruble, rupee, real. And that's very different because the dollar is backed by nothing but trust. The euro is backed by nothing but regulation. And the pound, well, it's backed by uh his majesty, but that's about it, right? So, this has actually got 40% actual gold. So, it's a partial gold backing, a bit like pre-1971, not quite 100%, but you know, 40%. Now, why didn't they do 100% gold? Because it's a little inflexible. There isn't enough gold for trade volume to grow. 0% gold is no no trust factor, which is a problem we have with the dollar. 40% gold backing gives some credibility while allowing them to be still flexible. They can still print some money and that kind of thing. And you might also want to take note of another number. Bricks nations control about 50% of global gold production. So these guys actually have the physical gold to back the currency. It is not theory. Now the next step might be a little bit boring, but it's probably the most important thing about this and nobody really understands this. I want you to understand this. Basel 3. Basel is how the Swiss say it. Basil is how the bastards say it according to the Swissies. Now, this is a little technical, but it's really crucial you understand this and it explains one of the reasons that gold is rising and why I'm continue to be very bullish on gold for 2026 and beyond. Basel 3 banking rules. Now, your eyes are glazing over. I can see it. And I'm going to explain this in a simple way because it's a gamecher. What is Basel 3? to set up international banking regulations created after the 2008 financial crisis. The goal was to make banks safer and more stable and more profitable for its management. The last part I made up. So the rules tell banks how much capital they must hold, what assets count as high quality reserves, and how to classify risk. Now banks are required to hold certain amount of tier one capital. That's the highest quality capital. It's the most liquid assets that can absorb losses if there is a crisis. Now, before Basil 3, gold was classified as a tier three asset. That's the lowest quality. It does not counted as reliable capital, which tells you quite a lot about banking. So, gold was traded as some sort of risky speculative asset like a you know, buttcoin. But after Basil 3, gold is now classified not as a tier 2, but as a tier one asset. It's now the highest quality. It is the same as cash and government bonds. I know you got to laugh about this. So gold is now the highest quality thing they can own. And let me be very clear about what this means. The global banking system reclassified goals from risky crazy lunatic speculation to equivalent to cash or the US debt and that's the most significant regulatory changes we've seen in financial history but nobody's talking about it because you know your eyes glazed over when I said basel three right but this is causing a seismic shift in gold markets so the incentive structure is now this banks holding gold is now incentivized Gold is now equal to or better than government bonds. You have no counterparty risk, right? Because the government doesn't pay you. There's still a theoretical risk. You own the physical gold. There is no risk. It's just you and your gold. So banks globally are buying gold not for sec speculation but to strengthen their balance sheets under regulatory requirements. So European banks for example, this is real. They're increasing allocated gold holdings. Asian banks have significantly expanded gold reserves. Central banks, which are subject to the same standards by the way, they've accelerated purchases. So the total demand from Basil 3 compliance is about 2,000 tons. 2,000 tons. That's a lot of gold. This is structural demand. Doesn't care about the price. It's not speculative. It is just required by law. And the regulation says no paper gold. We know what you comx lot are up to. No futures, no certificates, not ETFs, physical gold in your own vault. That's the regulation. Why is the regulation that? Well, there are somewhere between 100 to 200 ounces of paper gold for every ounce of physical gold in existence. I know, madness. How is that legal? I mean, seriously. But the banks need to own the physical stuff. So, where is the supply going to come from? What's annual gold production? It's about 3,000 tons give or take annual industrial demand and you know jewelry you ladies um and some men apparently you know rappers particularly doing their bit that's about 2,000 tons we have about a thousand tons left now the basil 3 structural demand is about 500 tons per year for the next couple of years central banks are buying about a thousand tons per year on top so just from these two sources just from these two sources we now have a deficit of about 500 tons which is pretty good if you own gold, right? Because it's just going to drive it higher and higher. So the gold system that Nixon closed, it's being opened up. It is now being treated as something you actually want to own again. So Basil 3 brought gold back into the core of the monetary system. Now the real smoking gun is the United States delayed basil implementation to 2028. Europe implemented it in 2022. Asia implemented in 2023. Most of the world around that time. The US delayed it until 2028. January 2028. Write that date down. The official reason US regulators said they needed more time for banks to prepare to avoid disrupting markets. Blah blah blah blah you know bollocks. Basically the real reason my opinion the US delayed implementation because it would have created an instant crisis in the paper gold market. Let me explain the comx problem. Comx the Chicago mercantile exchange is the world's largest paper gold market. The same bank is manipulating the silver system right now. Hundreds of billions in gold futures and options trade there. Most US banks have significant exposure to comx paper gold and this is unallocated. This is leveraged and if Basil 3 was implemented immediately, US banks would need to convert paper gold to physical gold, right? The stealth that's meant to bag the paper gold and it would create instant demand for comics. You got to give us the gold, right? We have a paper for it. Give me the gold. Now, Comx doesn't have anywhere near enough physical gold to satisfy all these papers. So it exposed the paper gold fraud and potentially collapse the system. Now it's my opinion but I think it's a fraud. There obviously different different views on that. I'm not accusing anybody but that's my opinion. That's what it is I am saying. So the delay buys time. It allows the system to slowly unwind paper gold positions quietly accumulate physical gold and avoid a sudden delivery crisis. But the problem is the rest of the world isn't waiting. You see European and Asian banks, they've been buying physical gold already. US banks are going to wait till 2028. Still hold paper till then. So physical gold is flowing. So when 2028 arrives and all these US banks need gold, where are you going to get it from? Asia maybe, Europe maybe. But when the US finally implements Basil 3 and they have to the demand shock will be even greater because there isn't any physical gold available at the level that it's required because all the central banks have gobbled it up. Okay, maybe you're realizing this is a bit complex. It's critical to understand what's going on here. And that's exactly why we put together our free newsletter. Get it every day or you can get it once a week. It's up to you. And just go to felixfrs.org/s. It also covers gold. Um and and we break down for you what happens in gold and silver markets like life in plain English in a way you can understand. It's completely free of charge. There's zero um credit card required or anything. No cost, right? It's just our bit to make the world better informed. So let's connect all the dots. Why is gold at alltime highs? Central bank buying about a thousand tons a year. Not the US central bank that's coming later. Basil 3 structure demand about 500 tons a year. Banks are required to basically own physical gold again because the ddollarization. They're moving from dollar reserves to gold because it's neutral. There is no counterparty risk, no political risk. And the US is debasing its debt. So they're inflating away its debt. So they're printing trillions of dollars more. And they're going to keep doing that. And gold is the classic inflation hedge. Now what's the gold price target? Look, some people are saying $8,000, $10,000 um an ounce. Possible. It's all possible. Um it's going to be volatile, so you're going to have to have a long-term horizon. I think most of you probably do that in the gold world. That's the way I look at it. Buy it, forget about it. It's it's a it's a backup plan that hopefully we never need. That's the way I look at it. And it's because we have these structural demand forces that anything nothing like what we've seen since the 70s. Now, let's go back to silver and why that's being so different, treated so differently. Now, very quick summary from my last rather lengthy videos. You don't have to watch it. We have a supply deficit, massive supply deficit. There's industrial demand that's exploding. Think solar, think AV, sync chips. China export restrictions kicking in now. And the physical market is just showing it's desperate for metal. So, silver should be following gold high, possibly even outperforming it because the physical demand is there. But the difference is strategy. Gold is held by institutions, by central banks, by wealthy individuals. It's less volatile. Prices rising strengthens all those people's balance sheet. Silver is held by well regular you and me, right? And it's therefore a bit more volatile. But I think silver is also the people's warning system. Silver is the canary in the monetary coal mine. When silver explodes, everybody notices. And that's exactly why it must be suppressed for now. also to save the institutions billions who happen to be short on it. Right? So commercial shorts are making billions on every arranged crash and the paper market is just a basket case if you ask me. So what's the endgame? Well, look, the suppression can only last for so long because the physical metal demand is very strong. And when we get to the point where COMX can't deliver on its paper because you have a contractual right to ask for the metal, um, which is what kicked off the gold spike in the beginning of last year, April or thereabouts, Comx actually has about two weeks of global supply of physical silver. So when that runs out, the paper price becomes an irrelevance. And that's the moment when I think silver could actually explode. Not telling you it will. I haven't got a crystal ball, but that's the way I look at it. And I think we're getting closer and closer to that. And if you go back in history, silver was a lot more valuable compared to gold than it is right now. I mean, I could come up with calculations that take us to about $250. Again, again, I'm not promising that, but I'm just saying in history, there is about 17 ounces of silver for every ounce of gold in the world. And that ratio seems broken. So, we're seeing gold being repriced as money. Silver has historically always been money. That was the first money. It was silver, right? Look at the tops of the Romans. So if silver regains even partial monetary status like gold or we get a monetary crisis, confidence in the dollar breaks feared breaks. Silver explodes as the people's money because let's face it, a lot of people are already priced out of buying gold. Silver is still affordable on a nominal unit basis. And that's the scenario that we're potentially heading into. So watch out for the paper prices and the physical prices diverging. The more they diverge, the more comx you know the banking lot are losing their ability to set prices and at that point the manipulation game ends and we actually go to real demand supply pricing which is what we haven't seen. So what does this mean for you? Look, the dollars in your bank account will buy less and less every year. To me, inflation is guaranteed. is much much higher than the government will acknowledge and it means that your retirement because your pension funds is is is is tied to the US dollar is a potential risk. So what can you do? Should you put everything in gold? No, I'm not saying that. I'm saying you want to be in high quality assets. That could be real estate. That could be high quality stocks, companies with brand power, pricing power that bring in a lot of money and good margins and good management. But it could also be gold. It could also be silver. So, without giving you a um financial advice, because we don't do that. We're not in any way, shape, or form licensed to do anything except for a napping. Apparently, Winston's really paying attention back there, isn't he? For your metals portfolio, not for your entire portfolio. I'm still would have more gold than silver. Why? Because gold is just the thing, right? Gold is money thanks to the Basil 3 banking lot. Now, um, silver could potentially outperform gold, I think, in the short term. I'd always have some cash. I think it's always good to have some cash, emergency funds, or the ability to buy more on the next um, you know, manipulated crash. So, what do we do? Think about buying some gold and silver. It's of course up to you whether you want to do that or not. Just think about it. Um, do it through a trusted dealer. Don't buy it at the gas station. They're going to going to rip you off. and monitor these policy shifts because they're bloody obvious and they're they're out there. Um the easiest way you can do that is subscribe to our newsletter. Um to me the reset is not a prediction, it's a process. It's happening and yeah, of course you could have bought gold or silver and it was cheaper, but people always say that and then well the second best time to do something is always right now, right? So sit down, think about it. When you subscribe to the new center, we're also about to send out to everybody who has and will a kind of beginners guide to gold and silver markets that really breaks down all of those key key components so you guys can really understand it because appreciate it isn't you know natural and logical and not everybody's as fortunate as I am to have a have a you know London market London metal exchange market maker at his back and call um not back and call obviously but I can WhatsApp him and I can talk to him and he's very kind and he'll share things with me as as he will with any of our students of course. So get yourself the newsletter, watch this space. This could be the most exciting investment story of 2026. It could make us a lot of money, but you always want to be risk aware. Managing your risk is where you make the real money, not actually just gambling on one thing happen. I wish you a beautiful successful year ahead. All the best. >> Hi guys, I'm Elliot. I'm a former market maker on the London Metal Exchange and I want to want to spend the next one or two minutes talking about basis. Now, if you're trading silver, you're going to be hearing that term a lot at the moment. So, what is basis? The basis is essentially the difference between the price for taking delivery now versus the price for taking delivery sometime in the future. The difference between those two prices is the basis. Now in a regular functioning market with lots of supply, we would expect the price for taking delivery in the future to be above the price for taking delivery today because that takes into account things like storage costs, insurance, and interest rates. We call that a contango curve, okay? where the future price is higher than the current price. Now, what we're seeing in silver at the moment is just the opposite. The price for taking delivery now is above the price for taking delivery in the future. We call that a backquidation. And that's not something you see very often in commodities. And it implies a couple of things. Well, first off, that there is not enough supply to satisfy demand for delivery right now. People literally are prepared to pay a premium to get their hands on the physical stuff, right? It can also imply some funding issues. Now, it's incredibly important because when we're in this backquidated curve, it can create lots of energy for the price to go up, right? as people are scrambling to get their hands on material. Okay, it also creates volatility which again we're seeing in the market presently. However, if that flips from a backquidation into [clears throat] a contango, it might suggest that there is ample supply arriving and that could send the price sharply lower. Okay, keep an eye on it because as long as this is above this, it's going to be incredibly volatile, guys. Thank you. >> If you own silver or any precious metal or even you've been thinking about buying silver or gold, what I'm about to show you is going to make you furious and then it's going to make you money. on December 28."
    }
]