[
    {
        "video_id": "ke91INqEk5s",
        "title": "2026 Market Forecast: Bull Trap Ahead?! #shorts",
        "published_at": "2026-01-02T14:42:10Z",
        "sort_date": "2026-01-02",
        "url": "https://www.youtube.com/watch?v=ke91INqEk5s",
        "transcript": "It's time for 2026. And guess what? We have a lot to discuss because this year will change your life. And I mean it in a positive way. Not like Eric Trump when Eric Trump tweeted, you know, Q4 is going to be unbelievable. It was mega wreck. I actually mean it in the real bullish sense that 2026 will be fantastic. But you have to pay attention because before we get to the fantastic glorious part, there will be challenges along the way. 2026 will be great later in the year. In the early 2026, we have to be alert for a bull trap and then a revisit of the 200E moving average. And by bull trap, I mean some kind of a relief rally that will get rejected because we're currently in the midterm year. And if you look back at 2022, you had another midterm year that started somewhere here at approximately 42. And then what happened? We did see a further dump and then the bull trap happened right here into March, April before it got rejected and we went into new lows towards the 200week moving average. I mean the similarity is quite crazy because we were below the 50 moving average then we went back to touch 50 moving average and then we got rejected to the 200 week and the same thing is currently happening as well. We're in the bare trend we're below 50 moving average and likely next step is that we retouch the 50 moving average. That would be my guess. But listen, we don't know what's going to happen. And if this doesn't happen, we also don't really care because we do have the money line. And in case it flips bullish, we're bullish. And also, in case we go above 50 moving average and start closing weeks really really above 50 moving average, we would be already turning bullish at this point. So for us, it doesn't really matter whether the last cycle will repeat or not. At the same time, it has been repeating quite exact. I know many people are crying all the time that oh no, it's not the same. It's exactly the same. It's exactly the same. You look at the number of weeks from the bottom to the top, number of months from the bottom to the top. Watch the last video. I spent the whole video talking about it. So, it is quite exact. So, to expect something similar does make perfect sense in my mind. But at the same time, we know that this market is not just that, you know, it's copy paste all the time. They do rhyme. Cycles do rhyme. But at the same time if we see something different we will adapt in real"
    },
    {
        "video_id": "eIxjmptjiJc",
        "title": "The 2026 Crypto Crash or Moon? My Brutally Honest Analysis",
        "published_at": "2026-01-02T11:37:42Z",
        "sort_date": "2026-01-02",
        "url": "https://www.youtube.com/watch?v=eIxjmptjiJc",
        "transcript": "Okay guys, jingle bells over, new year over. It's time for 2026. And guess what? We have a lot to discuss because this year will change your life. And I mean it in the positive way, not like Eric Trump when Eric Trump tweeted, you know, Q4 is going to be unbelievable. It was mega wreck. I actually mean it in the real bullish sense that 2026 will be fantastic. But you have to pay attention because before we get to the fantastic, glorious part, there will be challenges along the way. 2026 will be great later in the year. In the early 2026, we have to be alert for a bull trap and then a revisit of the 200E moving average. And by bull trap, I mean some kind of a relief rally that will get rejected because we're currently in the midterm year. And if you look back at 2022, you had another midterm year that started somewhere here at approximately 42. And then what happened? We did see a further dump and then the bull trap happened right here into March, April before it got rejected and we went into new lows towards the 200week moving average. I mean the similarity is quite crazy because we were below the 50 moving average then we went back to touch 50 moving average and then we got rejected to the 200 week and the same thing is currently happening as well. We're in the bare trend we're below 50 moving average and likely next step is that we retouch the 50 moving average. That would be my guess. But listen, we don't know what's going to happen. And if this doesn't happen, we also don't really care because we do have the money line and in case it flips bullish, we're bullish. And also, in case we go above 50 moving average and start closing weeks really really above 50 moving average, we would be already turning bullish at this point. So for us, it doesn't really matter whether the last cycle will repeat or not. At the same time, it has been repeating quite exact. I know many people are crying all the time that oh no, it's not the same. It's exactly the same. It's exactly the same. You look at the number of weeks from the bottom to the top, number of months from the bottom to the top. Watch the last video. I spent the whole video talking about it. So, it is quite exact. So, to expect something similar does make perfect sense in my mind. But at the same time, we know that this market is not just that, you know, it's copy paste all the time. They do rhyme. Cycles do rhyme. But at the same time, if we see something different, we will adapt in real time. And the big question is, how do you adapt in real time? Well, very simple. If you have the money line that you see on the screen right now, you see what trend we're in. If the trend changes, we change. And also here in the money scanner within the Bullmania software suite, we do also get all of the signals, what's bearish, was bullish in real time. And that's how you can adapt in real time where at the end of the day, it doesn't really matter for us whether we actually go to 200E moving average or not. I mean, if we do, it's just going to be a crazy no-brainer signal to be bullish because the way the markets work is that when you have a massive, massive, massive selloff and we go to a significant level such as the 200 moving average and you can buy here, it means that the next bull trend is likely going to be a nice long one that probably will take several years. That's what happened here in 2022. We had a big fat bare trend. Entire 2022 was bare trend. Then when the bull trend happened, we knew here we knew that there's going to be a multi-year bull trend and we were so confident to get in here in January 2023. So that's why if you want a nice entry, a fantastic entry, you actually do want to touch the 200E moving average because the entry is going to be crazy. It's going to be crazy. Meanwhile, let's imagine for a second that Bitcoin just pumps pumps out of nowhere to the upside like this. This will also be assigned to be bullish Bitcoin. But at the same time, it could just be another small trend. We can have another bull trend, but maybe you know six months, eight months. When you have a small bare trend like this, the following bull trend may also be small. And in fact, we may be entering some kind of chop period where you have small bare and bull trends. In reality, what I think everyone wants is that we have another big glorious bull market. And for that it would be nice with a proper flush of the system, proper detoxing, proper crushing of the souls of anyone who hasn't sold in time or derisks in time. Crushing everyone who is still hoping for a recovery that would be the ideal and currently we're not there really because you still see a lot of things like this on Twitter and these things get a lot of engagement. Basically people saying that we had a bare market. It's very very common. People are saying we just had a bare market and the reason is because 2025 was red. Now, if you dig deeper, you understand it's it's baloney. It's baloney. Why is baloney? We because we had the Bitcoin alltime high in October 2025. So, basically, the bare market was two and a half months, guys. [laughter] But people engage a lot. They engage a lot. Another thing that people are engaging with where they say that it's time for us to pump is that all have been going down for four years years in a row. And of course, many people are saying, \"Okay, now it means it's going to pump. It's going to pump.\" So, guys, we need more crushing. We need more crushing of the souls before we can go up. When I tell you that I'm bullish and you tell me, \"Hey, Ivan, you are retardio.\" That's when you should be bullish. When most people are calling you retardio for being bullish, now it's not like like that at all. Now people are still telling me that the for cycle is broken. Well, it's exact. People are people are saying, \"Oh, it's not the same. I want listen. They need to be crushed. When the market has crushed them, then I can tell you we're going to go up and it's going to be later this year.\" And there are a few other clues you can keep an eye on. For example, if Micro Strategy stops dumping and it's been dumping like hell. As you can see, we have the green line. We told you to be careful. Once the green line broke, it was elevator down. It's still elevator down. Potential new support is the 200 week moving average. So, Micro Strategy is almost there. So, when Micro Strategy stops dumping, it means that the bottom may be closed for Bitcoin as well. I mean, let's see when that will happen. Here it was sideways for 3 weeks. It doesn't mean that the dump is over. it really has to start creating a new trend to the upside with higher highs and higher lows. So, keep an eye on that. And then, of course, the ETFs, the ETFs are being uh cooked, guys. They've been cooked alive. The last year, the last day of the year had a big fat 350 million million outflow and yeah, not good. When we see consistent inflows here, that's obviously also another story and that's going to be a signal to be more bullish. Now, how can we make money in the coming days and weeks? Well, if you look at altcoins, you do see that quite a few of them actually now turned bullish in the last few days on the daily time frame. You look at worldy finance, it just fle bullish. And here the way to think about it is that you want to see where the next resistance is. And the next resistance for it is somewhere here along this highs. So if we measure here the current potential of the pump somewhere 15%. Obviously, it can go higher. It can just smash this this resistance also. But we want to be thinking about riskreward. So here you have a nice 15% reward. And how do you trade this? Well, you can trade spot. You can also trade with leverage. If you use the link below for exchanges I use, you see buy bit, you see bitun, you get big fat signup bonuses everywhere and everywhere. Here you can go long, you can go short. I recommend you to start with buy bit. If you don't have it yet, then bit ununix, pionex, get all of them because at the end of the day, you want to spread your capital across exchanges as they are centralized. So you want to have different options. And then if you want the decks then use hyperlquid decks as well. If you're trading stocks you can also do it on buy bit or on pionex. So all in all use the links below sign up get the bonuses as soon as soon as possible. In terms of other altcoins you have polka dot. Let's let's check what happened here. It just bullish on the daily. And again if you think about where the resistance is it's going to be somewhere here. Uh so 18% with leverage obviously more. Uh then uh thinking in terms of Pepe, let's see. Oh man, Pepe, brilliant, brilliant, brilliant, brilliant, brilliant. Pepe just uh you know, flip bullish and then massive acceleration. That's the beauty of the money line. And the next uh resistance is somewhere here. So basically 20 22% uh riskreward. Uh and then if it pumps higher then 54%. So between 20 and 50% is your uh upside here. Next uh uh let's check. it also justly bullish. Very interesting setup here and uh the uh riskreward probably is somewhere here for 10% or in case we manage to break out somewhere here for 25%. So guys, you need to have a tool something like the bulmania money scanner because as you can see once the bull trend trends happen for example with Peppa you see massive acceleration to get access use the link below bullmania.com watch the free video and their future instructions are going to be because we only allow people to get it and to join us who we think we can help. So watch the free video very important and then you're going to see further instructions. I mean basically what bull mania allows you to do is that you see all these opportunities within a bitcoin bare trend. So you can trade all coins on a short time frame not that you think for a long term here it's short time frame because bitcoin is in bare trend you can long in shorter time frames like the daily and you can obviously extract money from the market even when bitcoin is bearish. Now if you look at what recently flipped bearish in case you want to short you want to try shorting look here ontology justly bearish you can short the crap out of it. It actually looks very weak here because if it um keeps dropping here somewhere is your next next support. So 15% right here with leverage obviously way more. Uh then look at this random stuff. I don't even know what it is but this one this one could be interesting because it just flip bearish after a massive bull trend. Okay. And obviously the downside here uh from a shorting perspective is at least this one but likely this one. Okay. So yeah, keep an eye on this. I don't really know what it is. But that's the best thing with the tickers. You don't have to know what it is. Yolo game. Big shout out. No, no idea what it is, [laughter] but that's the best. But that's also the best with the system. You don't have to analyze what it is. You just look at the freaking chart. U next for shorting. Do also no clue what it is, but uh a nice short here. towards 32. Obviously, when you are trading, you have to do risk management and that's also what we help you with in bulmania.com. How to set the stop- loss, how to do take profit and so on so forth. So, basically, bullmania gives you the opportunities, but also it tells you exactly how to execute on them. So, go to bullmania.com and watch the free training about the mechanical rules. Now, let's check precious metals. You have gold still bullish, 11 months since the bull flip. Silver still bullish, paladium still bullish. I mean, all of these different charts, they look parabolic. You have to actually be a bit careful. Just like I wrote here a few days ago, listen, this will not end well because it is a parabola and silver. When you look at silver, this one may actually be an interesting shorting opportunity in the future when it goes into bare trend because this is not the first time that silver is on this rampage. Let me go to super high time frame. If you look here in the 80s, it had this parabola, then it got super wrecked. Then here in 2010, parabola super wrecked. And now we have something similar. Now, we don't know where it's going to stop. it can still have another year of massive pump but at some point it's going to be something similar and once guys once you have the bare flip whether on the yearly here it's 52 or I mean even when you look at the uh monthly see where the bare flip is is on the monthly 61 I think from a risk perspective this short is going to be quite juicy but for now for now for now uh still bullish but you don't want to really be betting against the parabola until it's broken and it's not broken yet let's check stocks you have Visa flipping bullish a week ago. Let's actually see what Visa is doing. Uh Visa had a lot of chop. Hopefully now it's exiting the chop and this bull trend is going to be price discovery. Keep an eye on that. Potentially going to try to go to alltime highs here. Let's see. Is this alltime high? Yeah, it's alltime high. So yeah, Visa looking good. Then you have this micron tech this and that. What's happening here? Oh, nice continuation of the bull. New alltime high price discovery after a small bare trend. And as you know, a lot of these companies have something to do with AI in one way or another. Not Visa in particular. Like I don't know if this one has something to do with I mean just looking at the chart probably has something to do with AI. But just another point here that you don't actually need to know too much about what they do. Uh if they're bullish they're bullish. Simple as that. Uh Salesforce Salesforce let me see here. Chopping chopping chopping now bull trend. And the um potential of this bull trend is that here you may have a resistance 10% up but if not if this is not the resistance then alltime high probably the next 40%. So, Salesforce is still 40% below alltime high. Did not recover this um dump here, the tariff uh dump. Uh and yeah, potential potentially nice upside and we just just just bullish. Disney Mickey Mouse. Man, I watched some Mickey Mouse during holidays. I don't know if you watched some Mickey Mouse. Where is it? Mickey Mouse on holiday. Was it Once Upon Christmas? Mickey once upon Christmas. Uh let's see. Let's see, guys. Here. Uh number one, you have this peak here. next resistance potentially 10%. 10% from here and then all the way here to 2022 it's 78%. 78%. There you go. So, can this be something? I mean, for now, it's still a bit choppy. It's still very, very choppy here on the weekly. Actually, let's look at two week. Two week we're still in the bearish trend, but yeah, as soon as we flip here, when you see a lot of chop, like we just saw, just move one time frame out. When you see a lot of chop and uh you want to see clear signal, just go a bit on a uh on a bit higher time uh time frame. What else you have? S&P Global, Boeing. You see what Airbnb is? I'm not using Airbnb. I don't like Airbnb, guys. I mean, it's uh it's guys, you pay so much, you have to clean. But anyway, let's see what's happening here. Sideways, just sideways chop lately. Let's go to higher time frame. Still bare. Yeah. I mean, let's see. Let's see. Let's see. I think they're going to they're going to have a tough time. Turns out hotel wasn't so bad. [laughter] Someone cleans someone kisses your ass in hotel. I'm joking, but they do. [laughter] I mean it is like that. It is like that. It's it's a bit like that guys. Anyway, you need Bulmania to understand the full strength here. I'm just giving you some uh some sneak peek and I have a final message for you. And my message to you is that this year will change your life in the positive way, not in the Eric Trump way. If you can buy Bitcoin when it flips bullish and let's say it dump to 200E moving average, it is crazy. That's where real wealth is made in crypto is to buy the bare market lows is to buy lows in the midterm year. We're now in the midterm year. I don't think we're at the lows yet, but once we get there, it is buying and buying and buying and buying and backing up the fiat track that will have to happen. Of course, I will be guiding you by hand, step by step, just like I've been guiding you since October 8th, drisking, as you know, we played it brilliantly. People still ask me which day did you risk, Ivan? October 8th. Also, just like we guided you since January 2023 by being super mega bull on Bitcoin January 2023 all the way until October 8th, 2025. Fantastic. We have fantastic track record. Thanks all guys for watching. Smash up the like. Subscribe. It was a pleasure yet again to speak to you and I'll see you in the next one."
    }
]