[
    {
        "video_id": "ewxfBUHgtMk",
        "title": "Palantir New Analyst Price Target is SHOCKING!",
        "published_at": "2026-01-07T03:54:42Z",
        "sort_date": "2026-01-07",
        "url": "https://www.youtube.com/watch?v=ewxfBUHgtMk",
        "transcript": "Welcome back to Data Dispatch. I hope everybody is having a wonderful day as we see the market that is relatively resilient here achieving a new all-time high and closing right around those levels. On top of that, we see Palanteer that is continuing to catch a bid as momentum is re-entering into the stock after we saw from Friday's selloff and is now near these kind of higher resistance areas. We'll be talking about this in just a few moments and also a new large price target that was just dropped from Palanteer by a very big analyst. And on top of that, we see a lot of the individual more speculative AI plays like Cipher, uh, like I these names are catching nice intraday reversals experiencing a lot of volatility with some of these high beta names. And we see Zeta or Zetta, however you want to pronounce it, is starting to become one of the most trendy stocks on X. What this could mean, what my own personal opinion is on it, and we'll be finalizing with crypto and how Bitcoin and Ethereum are doing. If you are a new or returning viewer, hit that like button, subscribe for daily videos, and follow me down at X below if you want to get more of my post and more frequent updates before these videos can drop. Now, if you pop it up on the screen here, Palanteer is currently in the overnight session at 17941. It's basically consolidating in the overnight session and it closed right around these levels, up overall about 3.2% on the day. One nice thing in terms of just the daily moves and on the indicators, Palanteer is back above its 200 and it's 50 simple moving average. And on top of that, what we've always talked about here for Palanteer, we know this consolidation zone that I like to talk about, this accumulation zone, this volume zone that Palanteer likes to hang out within with that 170 support, that resistance is right at about the low 180s, right at about 182, 183 right here. So, if Palanteer in the macroeconomic environment looks quite well, if we see continuation here and buying pressure into the market, this is where Palanteer could experience a possible push, another possible run back to the 190s. If this resistance is broken. Now if we talk about what is the big analyst today that is truest. They initiate here a buy and a price target at 223. And looking at the risk watch right here even acknowledging the high valuation but justifying it based on the growth in the AI leadership. They say here bullish views for Palanteer as a top tier AI play with accelerating fundamentals. So you can see here even some of the big players, some of the big firms, the big banks are still initiating these buy targets. Another one here that is past 200 also while all acknowledging the current criticism which is the valuation saying that the growth and the AI leadership is outpacing that concern to them. So we'll see what happens here, but Palanteer of course still staying bullish on it even at these prices. cool to see here, especially with the big firms that are continuing to set these higher price targets. If we talk about the general market today, we got the S&P 500 before we get into the more of the high beta individual trendy names. Uh you got the high, you know, S&P 500 right here at 6944, up about another 62%, continuing to show a lot of resiliency. Uh the S&P 500 is doing quite well. And what we see here, the Dow is also adding about 500 points, closing above for the first close ever, above 49,000. Now, some of the big things that brought a lot of resiliency and buying pressure into the index here were from the MAG 7. We're starting to see some more buying pressure that's kind of reinitiated into there with Amazon uh rising about 3% as Amazon's just kind of been consolidating, been beaten down. A lot of people talking about Amazon as a potential nice long-term hold. Uh but you're also seeing things here like Micron Technology, Palunteer, they even mentioned with Micron climbing around 10%. It's been a very good start to the year especially with these semiconductor stocks. Uh in terms of tech, you know, that took a pause and that was the whole expected Santa rally and stuff like that. That's when we saw a lot of the high beta names that were continuing to correct and find a bottom. Now, right now, what we're seeing is a lot of buying pressure. Um 2026 seems to be quite bullish right now. That's what the current sentiment feels like, especially with rate cuts, fiscal stimulus, and AI enthusiasm that's continuing to get closer and even is continuing to accelerate, especially after Jensen from Nvidia's CES speech yesterday talking about the roll out of Reuben, the next generation of the AI chip after the predecessor, Blackwell. Uh, we're also seeing energy stocks that are rising. a lot of different stocks here across the board, not just tech stocks, are continuing to experience a bid and positive momentum. Uh the geopolitical events, they do not seem to be making any huge huge impacts to the market considering like, you know, talking about Venezuela and stuff like that. One of the big things that we do need to keep on our radar though, the market is around all-time highs. A big big decision that could bring a lot of volatility into the general market here is the Supreme Court ruling to issue on the rulings for tariffs on Friday. They have set Friday as an opinion day, potentially marking its first ruling on Trump's global tariffs. Justice returns here from a 4-week break with these decisions released at 10:00 a.m. Eastern time. So, in the morning, we could see a lot of volatility depending on this tariff determination that's considered likely. Uh right now you're starting to see people talking about this. Oh, Friday is going to be the worst day of 2026. You know, the mega bears and stuff like that. But what poly market is currently pricing in about a 78% chance that the Supreme Court rules these tariffs illegal on Friday. Uh talk talking about possibly having to buy back and stuff like that. So we'll see what happens. Uh we also have some jobs data. So it's going to give us an indicator on the actual labor market. Until then, uh things are not a ton of news will be coming out. However, this is something here where we could experience a little bit of volatility. We could experience some downside pressure if the market does not like what the decision is here. So, keep that on your radar. uh on top of some of the more high beta names. Let's talk about Cipher Iron, what I've been talking about recently. You know, on the daily right here, Cipher drops down to about 1645 and gets a nice intraday reversal, pushing back up here to 1768, back above its 15, its 200. And basically the same chart pattern here with INE. INE comes down here to about 43. Gets some nice support there with an intraday reversal. And you see buying pressure and pushing right back up to 46. Uh currently up about 1% in the overnight session. So uh currently I'm still bullish and I in the short term right here and and especially with Nibbius right here that could be recapturing with the 100. If Nibbius is able to hold support and recapture the 100, that's where you could see a possible push back into that 130 120 zone with Nibbius especially since they are going to be the first cloud provider to offer the Reuben to their clients. So, they kind of have an edge up here in terms of competition with some of the AI data center stocks, especially as a NeoCloud. Um, one of the cool things that we're seeing in terms of IWM, I like this post right here by Chris saying that IWM is strong, especially when these leading themes like the AI data centers, the pullback, and it just keeps marching higher here. You know, in terms of IWM, we're starting to see a lot of resiliency there at 25662 and continuing to climb right here in the overnight session a little bit and possibly could be testing this resistance that we saw on December 12th at about 258. Uh how that looks at the spy right here, we're continuing to see futures that are basically relatively flat as the markets near its all-time highs. One of the big names that is really popping up on the radar for everybody is Zetta. Now looking at Zeda right here saying a rerating is coming just like it did with Palunteer. I shared this chart yesterday but it is quite interesting to look at. Looking at Zeda versus Palanteer's revenue growth. Now looking at this you can see that Zetta is experiencing a highly correlated type of compounded annual growth rate in terms of revenue compared to Palunteer. Um this is a nice trend line here. cool to see and especially as a lot of people on X everybody's talking about Zetta right now um is very comparable possibly to Palanteer when it was early on in its infancy. Uh where Zetta sits at right now is at 2426. I will admit I did not have this name really on my radar when it was at the 14s when it was at the 17s you know looking for that asymmetrical upside and stuff like that. I just didn't. But what really caught my attention recently was the partnership with OpenAI. And that's what caught my uh kind of strong uh attention to this name. What does it mean? You know, if OpenAI is getting involved, uh what type of with Athena marketing platform can they offer? And I'm starting to become more bullish on do have some personal exposure to it right now. So, we'll see what happens. Even though this is more of a riskier play cuz we're kind of chasing right here on this breakout, we could have any type of macroeconomic shift in the market at any time. Uh however, if Zeda is able to hold the support here, um that's where you could see a possible run that continues, but we'll see what happens. More of a very speculative plan in its nature just due to the current entry. Um talking about Bitcoin, let's talk about that 93,000 right here. Bitcoin kind of saw a little bit of selling pressure. Uh brought it down to about 91,000 right here before pushing back up to 92, back down to low 92s, and now sitting at 93. So, we're continuing to see some resiliency right here, some support above 90, which is great. in Ethereum. Oh my gosh, it's still above 3,000. It's crazy to see Ethereum that's been above 3,000 for like over, let's see now, is it been a week? Uh, it's been like 4 days, but 4 days above 3,000. It's quite good for Ethereum. Uh, I don't, you know, technically do a lot of charting on Bitcoin or Ethereum, anything like that. Just looking at major support, kind of looking at what the, you know, current sentiment is cuz I do have some exposure to, uh, some of the digital asset treasuries and, you know, looking at BMR right here. You know, BMR is at 33. I don't have ASST ASST right here for Bitcoin on the on this uh wish list right here, but that's above like that $1, you know, zone right now. So, Bitcoin's at an interesting spot. I think crypto needs to make some moves here to kind of see some significant liquidity possibly come into those areas. So, let me know what you think down in the comments. Peace out. Take care and I'll catch you guys later."
    }
]