[
    {
        "video_id": "kbDHzk4ckgk",
        "title": "I Analysed Every Market Top Since 1929. Here’s the Pattern That Will Save Your Retirement",
        "published_at": "2026-01-07T14:00:06Z",
        "sort_date": "2026-01-07",
        "url": "https://www.youtube.com/watch?v=kbDHzk4ckgk",
        "transcript": "92% of investors lose their retirement savings not during the crash but in the months before it happens. And right now the S&P 500 is closed out last year with a 16 or 17% gain. Third year in a row with doubledigit returns. There is something called the cape ratio which is really important to understand is at a level that we've only seen twice in history. I'll give you the years, 1929 and 2000. Both times the market crashed over 75%. But at every single market top in the last 100 years, investors felt the exact same way they feel right now. Invincible, safe. It must continue to go up in a straight line because this time is different. in every single time they're about to lose 30, 40, even 75% of everything they worked for in their entire lives to build. But if you know the pattern, the warning signs that repeat like clockwork, you can protect your wealth, you can make money from this rally and position yourself to profit when everyone else is panicking. My name is Felix Pin. I'm an ex investment banker. I've seen how this works and I've also got Winston back there who is got a very large nose for sniffing out patterns. The big banks, the institutions, they know these patterns. They're preparing right now. The retail investors are piling into a lot of the riskier stuff. That's also one of the reasons I founded the Goat Academy where we've taught over 20,000 regular people how to read the markets like professionals do. I'm also the co-founder of trademission.io where I give you the same quality data and news that Wall Street looks at. So, our mission here is simple. Level the playing field. give you the knowledge the big guys have and they don't really want you to have. So, we're going to show you today what we discovered of the stuff after spending a couple of months analyzing every major market top from 29 to 2025. We're talking about the peaks before the crashes. The moments when everyone thought they were geniuses, when your neighbor was bragging about his stock portfolio at dinner parties, your Uber driver was talking about stocks and CNBC are saying stocks only go up. Um, those are the moments. So, I found four patterns that show up at every single top without fail. And by the end of this video, you'll know more about spotting market tops than 99% of investors. You know, when you take profits, when you get defensive, most importantly, you'll stop buying the worst thing at the worst possible time. So, let's stump jump even straight into it. Stump straight into it. You know, that sort of thing. So, let me show you what Winston and I analyzed, and he should get all the credit for it, especially if it doesn't work. [laughter] Oh, Winston. He's just come back from fun with his pals. Um, we studied 11 major markets about 100 years uh worth of data. And these are the big ones, right? The ones that came after the just before the massive crashes. So, we looked at 1929, the mother of all tops. We had this thing, and I'll explain this in a bit more detail, the cape ratio is very important, was at 28 28x. Um, we declined 89% though. Took 25 years to recover. Bit depressing, isn't it? Um 1968, the sort of go- go years, um S&P peaked went up 51%. The Buffett indicator hit 87%. We'll talk about that in a in a moment. And then we crashed 37%. Sorry, my presentation is a bit messy there. Wiped out basically all the gains that people got. Um bit more modern era. I started investing in 1999. When did you start investing? Put the year in the chat down below. It' be interesting to see actually. Um the cape ratio was the highest level ever. NASDAQ PE was at 200 and we went down 77%. Took 15 years to recover if you'd stopped buying which of course is also always a mistake. And if you look at 2007 just before the global financial crisis and actually conversation I was having yesterday with a friend um he's also sort of in the finance space and he was saying do you know it was 18 years ago since 2008 and I was like wow he said you know what that means and I was like that means the bankers running the world don't remember it right and he's like precisely they were 10 years old at the time because most bankers are sort of in their late 20s early 30s literally going to invest in bank because it's a pretty grueling thing and you also make so much money people quit very early um so or get kicked out by the younger ones you know and they they eat them. So the problem is that the guys taking all the risk now they don't remember what happened last time everybody took all the risk. Um the market looked very healthy uh we got a 57% crash there and over over the next year and a half and all my friends got laid off which was very sad for them. 2021 that was like the everything money was the money printing bubble really the Buffett indicator went over 200% first time ever caper set highest in history went down 25%. Now for each of these market tops we tracked five critical data points there we looked at we looked at PE numbers I'm not a huge fan of PE numbers but there they are. If I could only write in a way that you could actually read it be helpful. We looked at the cape ratio. Uh we looked at um price to sales ratio because a lot of the time these companies have no profit. So we need to look at revenue. And then we looked at investor behavior. What were people doing with their money? The market breadth. How many stocks were actually going up? Something I track every single week. And then the warning signs like what indicators are flashing red and then what happens afterwards? How long did it take to recover? And what shocked me is that every single one of these market tops separated by decades, generations, different technologies, different presidents, different conditions, they all showed the exact same pattern. It's like the market has a personality disorder and it just keeps making the same mistakes over and over again. Right? So the question isn't whether we'll hit another market top. We will. The question is, are you going to recognize it this time or are you going to be like the millions of investors who bought at the absolute peak and then watched their portfolios get destroyed? Right? So, will you be the sheep or will you be the the, you know, the lone wolf, which is what we're hoping for here. So, let me walk you through the patterns. Now, before we do that, I'm going to do something even better for you. On Saturday, I'm going to run a live session, a live training webinar, whatever you want to call it, and I'll walk you through what I see the opportunities for 2026. Um, how we positioning ourselves, the structure, the rules, um, around picking great stocks for this year because it's a year we're going to make a lot of money in. That's my humble opinion, not a promise. Um, and I want to share that with you guys. So, if you want to join me for that, uh, on Saturday at felix.org/weinar, there's a link down below. Grab yourself a seat. Um, we have a couple of thousand people their life and it'll be a lot of fun. Now, pattern one, numero uno. It is the most important pattern I discovered. It's the pattern every other pattern is jealous of. Every market top goes through four stages. And right now as I'm recording this, we're showing signs of being in stage three. Right? So, let me break down each stage for you so you can see clearly where we are. You know, I can see clearly now the rain is gone. Right? Give me give me the song reference there and you get a you get a cookie. Now, stage one is the rational bull market. It can last on for years. This is where it all begins. And it's a sort of it's it's everything is fine. Stocks are going up for good reasons. Profits are growing. The economy is expanding. Interest rates are reasonable. valuations are moving from really cheap to fair. Investors are cautiously optimistic. They're not bragging about it everywhere. Sort of 2009 to 2015 or 1991 to 1996. Companies are making more money. The economy is looking good. Um isn't that isn't that when we had Bill in the White House? I repeat, I did not I did not have you know that that that sharp. Um this one's still sticking my butt line. Stocks are going up. Um you know, and it makes sense, right? So, this is the stage where you should be buying and holding. Um, I saw him once actually in an elevator in in a Grand Hyatt and he looked pretty good. He's got sort of he's got sort of an aura, a charisma around him. I can I can absolutely see why you guys voted for him. Um, I don't know very much about the policies, but he's just got that kind of like this man is in charge kind of thing. Just probably all the women thought too on certain islands. Did I say women? I think I meant to say girls. Anyway, the key characteristics of stage one is that the market gains are broad. Not just a few stocks, but most of them. most small caps, most midcaps, most large caps, different sectors. The tide is rising and it lifts all boats. At that moment, you're in stage one. You then enter stage two, which is the acceleration, uh, where returns go a little bit ga, right? So, historically, we sort of make 8 to 10% say now suddenly in this stage, you're making 20 to 30%. We've been doing this for the last three years, give or take a few percent. Bad news gets ignored. Media coverage becomes overwhelmingly positive and new investors, fresh money. Um, naive money floods in. Your taxi driver, if you these taxi drivers still exist? I should say your Uber driver is giving you stock tips, right? Your barber is giving you stock tips. And fundamentals are still okay, but it's starting to look a little bit stretched, right? So, we move to expensive. Nobody really cares because stocks just go up all the time. This is sort of 2017 to 2019, the late 1990s, 2023, 2024, 2025. I'd add to that. The market is rising faster than profit growth can justify. But it feels good, right? People are wearing cream jackets and little square pockets because money is just so easy. And they get a little overconfident. That's the warning sign, right? Are you writing this down? Because you're not going to remember this. Stage three, take screenshots, too. This is where fortunes get destroyed, but nobody realizes it. This is the actual top. But the cruel part is it feels the best right there. Right. It's just it's the high before the crash. Valuations are at extreme highs. Retail investor participate more than ever. the meme stocks, the cryptos, the spaxs, all that stuff goes to the moon. I think they've rebranded spaxs, by the way. I think they call them spars now. I saw Bill Aman pitching um Elon Musk the other day. He was one of his spars. So, that's going to come back next year too. Um next year, this year even um market breadth narrows, which means few companies lift everything else. Insiders are selling. IPOs of unprofitable companies succeed. I made a video the other day on exactly that topic. The media says it's a new paradigm. But here's the thing. While the index, so the S&P is going up, the majority of stocks are actually going down. And that is called a narrowing market. And in 2025, we've seen some stage three signs. We've seen this mystical cape ratio at 40. That is the top 1% of all its historic readings. Retail inflow that's lot 155 billion just in the first half of the year. I got the data for the second half of the year. Zero day uh options volume tripled. So the lunatics are running the asylum and unprofitable tech stocks at their highest level since 2021. So in stage three, the smart money institutions on the insiders are selling to the dumb money, you and me, right? Because we're showing up late. That's called distribution [laughter] by Wall Street. Uh basically a distribution of profits. That's the way they look at it. So the big players are getting out and the retail investors are pouring in and you're looking at, you know, March 2000, October 20, 2007, maybe you remember. Do you remember November, 2021? Yeah, maybe you remember that one. So the market looks invincible. Everyone's making money. Fear has disappeared. The fear index is at historically low levels. Which is why what we do in in in my my students, we don't just look at the fear index. We look at how it's shaped, right? You need to look at her curves, not just, you know, the headshot. You see what I'm saying? That's an incredibly sexist analogy, isn't it? Um the the 9% of women viewers have all just voted this down. Uh sorry about that. Um the the the the the shape of the golden retriever is uh you know nice. I can't say this. Anyway, let's move on. Um so that's when you should be terrified quite frankly. Um and then in stage four, this is the um excuse my French, oh moment when everybody realizes simultaneously that prices are too high and um everybody sells off at the same time. So the market collapses, fear spikes, panic selling begins, the media suddenly discovers all the problems that were obvious for months and that they had been warning them about them. Somehow they didn't. Um, and this can happen slowly or very fast. So in 1929 it took a few weeks. In 2000 it was gradual over two years. In 2008 it was about 6 months. In 2020 it was a few weeks again. But remember April 2025, freedom day or whatever it was called, liberation week or you know something like that. um it happens in two days, right? And then the Fed stopped and and and and Trump reversed some of the tariffs. So the key insight is here. By stage four, it's too late. The damage is done. So if you're trying to sell in stage four, you're selling at a terrible price alongside millions of other sheep panic. So how do you use this information? Well, let me show you where we are right now. Okay, first of all, this cape ratio business, it's essentially like a PE ratio, but it's sort of smoothed out a bit for inflation um and and the business cycles. And this is just some historic data here. And you can see that say 1999, we had 44, right? In um where is 1929? Here we were at 32. In 2020, we're at 30 38 or thereabouts. Where are we right now? 40. 40. We're like slightly below December 1999 levels, which just means valuations are politely put very stretched, right? Like sort of those kind of spandex clothes women seem to have started to wear. What's that all about? Why you want to wear something that basically makes you naked with a very thin piece of plastic polyester wrapped around you? I don't understand it. Very strange. Anyway, moving moving, moving on. So, that's kind of not good. We have three consecutive years of double digit returns which is traditionally a warning sign and market concentrations at extremes right the top the tech stocks are lifting everything up um although actually mag seven stocks didn't do all that well some of them last year and there's some opportunities in there by the way things like Google and so on not a buy recommendation but I think there is but that's kind of where we are right now so at the moment riskreward is not great now does that mean we're going to miss out on the party of 2026 no why not because there are a couple of And here's the link again for the for the the the training on Saturday. There are a couple of reasons. The tax cuts are kicking in. So that's basically free money for the market. Rates are going down because they're going to appoint a new Fed poodle, sorry, Fed chair. You know, he will do as he's told. Um heal, you know, that kind of that kind of a chap. Um we've got massive AI spending and yes, that might be more and more debt finance, but that matters less and less and less when rates go down. And we have we're in the second year of a presidential cycle, which is when the president basically wants to get reelected midterms. So, he's going to do lots of things to make the market go, right? Um Venezuela, one of those things. Bit of a cynic over here, but you know that that's going to help, right? They just announced, I don't know, 30 billion, 50 billion in oil they're getting for the benefit of um the US and Venezuela. Not sure which direction that's going to flow in. And that's exactly the kind of thing that the market loves because what's it going to do? Cheaper oil. What's what's a cheaper oil going to do? Cheaper lower inflation, right? What does lower inflation mean? You're going to have lower interest rates. What do lower interest rates means? Well, you're going to spend more because your car payments drop, right? Your mortgage payments drop if they're not fixed. Your student loan payments, you can refinance them lower, you know, good for SoFi. Uh and and and all that kind of stuff. And then companies, same story. They can finance AI spending cheaper. They can build new factories and and all that kind of good stuff. So, it's good for the market, right? So, therefore, stock prices tend to go up. So, let's go through briefly the individual indicators. I give you moment to write these down so you can look them up. So, cape ratio, as I said, it's a 10-year average of inflation adjusted earnings. It's essentially um PE for people who want to look a little bit smarter. It's not the greatest indicator in the world. You can massage it slightly with accounting. Um I was going to say fraud, but I think it's called uh adjustments. So, um, historically it's about 17. Um, at 40 it's usually a bubble. We're at 40 in December 2025. We're still in early 2026, still a still a bubble. So, only 2000 in 2021 exceeded that. So, not good. Right now, secondly, we have the buffet indicator. Warren the Buffett called this probably the best single measure of where valuations stand at any given moment which is why it's called the Warren Buffett indicator. It's fairly simple. It takes the total market cap so the total value of all US stocks market cap all your stocks and it divides it by the GDP. So basically it says stocks divided by economy, right? How much are those stocks worth divided by the economy? And the logic is fairly straightforward. Stock prices can't permanently grow faster than the economy that supports them. Historically, the Buffett indicator is um below 75%. So the 75 to 90 is kind of fair. That's kind of where we want to buy. Um the danger zone is above 200. Now right now we're at about 200%. Uh so the last time that happened was 2021. That's also the only time that ever happened. So if you think back to to to the.com, by the way, we were at 140%. Right? So Buffett said anything above 100% is playing with fire. So 200% is just playing with uh I don't know um nitroglycerin or something like that. Isn't that something they used to have in those um what was that what was that cartoon lucky somebody or other lucky Luke or someone like that and they used to always play with nitro what is it glycerin or something I don't understand why maybe some of you remember um you can ask yourself how can companies be worth twice what the entire country produces doesn't make a lot of sense now you can add some explanations and that is um you've got the United States and then you've got the rest of the world and once you understand that the rest of the world is actually now a colony of the United States and sends all their money to the United States, things make a little bit more sense. And I say that with some, you know, bit of a grin, but it's kind of true. Look at the UK, it's a vassal state. Look at Europe, it's a vassal state, right? Um, and I presume more of that happening in in the Americas sphere. Um, why? because all the major companies and say Europe or the US uh sorry or the UK are actually US-owned private equity or or publicly listed right so you go to Europe you don't see a um French word processing software no people use Microsoft right people use Google people watch Netflix people use Uber right like it's all Americanowned you walk down this high street and and what are they're buying they're buying American brands so Americanowned brands private equity gobbled pretty much everything. Um, you know, you're in the UK, you get a sandwich at Moni, well, you're sending your money to the US, right? You go to McDonald's, you're sending your money to the US. Um, hotel chains, mostly US-owned and so on. You get, you get the idea. Um, and it means that all the profits flow to the US and it's all listed there. So, I would argue that you can have a number that is relatively high for the Buffett indicator. it isn't necessarily the end of the world because the the world is sending all their money to the US which is a good thing for the US right um in long that continue I hope [laughter] why because I invest most of money in the US um now PE ratios in itself are not massively useful um if you look at forward pees uh they're 23 current PE is 28 so I look at the difference here um how big is that difference because that tells you how optimistic are we on the growth that has to happen this year in terms of profits, right? So, it's a pretty optimistic outlook and the more optimism there is, the easier it is to disappoint. And then the the fourth pattern that we looked at is is really sector rotation. And I know that sounds, oh my god, stop. Make them stop, Winston. Um, but it's actually incredibly important. Pattern 4 is insanely useful because it gives you an early warning system. Different sectors perform differently as we approach the market top. If you know what to watch for, you can see the top coming before it arrives. So, the stock market moves in a fairly predictable cycle and different sectors lead different stages. You've got um and and let's focus on the on on the on the late stuff here. You often see energy stocks surging. You see material stocks surging and you see the tech leadership still performing but narrowing a little bit. And that's when you're going to want kind of want to start paying attention. You'll start to see consumer discretionary stocks starting to fail first. You see the more defensive stocks going up more. What are defensive stocks? Anybody know? Healthcare, utilities, consumer staples. Repeat after me. Healthcare, utility, consumer staples. Uh the hook stocks. That's the thing I just made up. Clever, isn't it? Okay. So, what happens? consumer versus discretionary spending. Um, so it's a very reliable indicator. Now you have consumer discretionary spending. That's things you you want but you don't need. Restaurants, luxury goods, cars, entertainment, travel, they do very well when the economy is strong and people feel wealthy, right? Portfolio is up, you feel wealthier. And then you have the consumer staples are things you things you need to buy regardless what happens. food, beverages, household products, medicine, that kind of thing. And those are the defensive stocks. So the the the staples, the needs are defensive. They'll go up in a the bad times and the discretionary the wants will go up in the good times. And there's a ratio between those two that we want to look at that tells us quite a lot. So the ratio rises, people feel wealthy, they're taking risks, the economy is good. The ratio falls, people are getting defensive, they're getting worried, very, very worried. and things are look about to decline, right? And that's actually been an incredibly accurate indicator before every single crash. So watch that ratio. So where are we right now in relation to this? Well, the mega caps, the tech stocks are up, right, massively. Materials, copper is up massively. Silver is up massively. Gold's up massively. We had a beautiful year with that last year. Energy is underperformed. Defensive sectors are starting to show some strength. Tech and mega caps are still dominating but not as much. And that's that typical late cycle behavior. So watch for the Mag 7. Are they still are they still doing their thing or are they starting to underperform? Very simple thing. You can look that up. It's called the MAGS M AS. And it's an ETF that tracks the MAG 7. I'm pulling it up here in Trade Vision, which is our software. And what are you seeing? Well, look, for most of last year, where does it start? Somewhere here. Okay, we had the we had the Trump, you know, liberation thingy. So, if you if you take that little mini crash out and you start in January, you know, they they did pretty nicely, right? They did pretty nicely. They went up 26% and then they sort of did went down a little bit, but actually between September and December, they did absolutely bugger all nothing, nada, zero. And that's a little bit of a concerning sign here that we might be topping out, right? You're seeing a high top, slightly lower top, still lower than the big big top, right? Um we're at the moment below the 50-day moving average line. Those are all kind of early warning signs. Volumes declining a little bit end of year story there for sure, but there is not a lot of enthusiasm in this. So watch this chart. If this thing keeps going sideways, it starts to decline a little bit. You say you get a little bit of that sort of trend going on. You kind of know what's coming now, don't you? Because you watch this video, you're still here. Does that mean I've sold all my tech stocks? No. But I have been looking very aggressively towards the second half of last year, other things which are, you know, we made a lot of money out of out of out of retail stocks like Victoria Secret. She's done very beautifully. Look at those legs. uh or um you know gold miners, we picked individual ones, but but but look at look at that beautiful beautiful rally last year, right? They did 160%, right? Um and obviously silver has done incredibly well. Uh gold's done incredibly well. Do we have a copper ETF? Is there a copper ETF? Okay. Well, you you you get the idea. Uh so that's kind of what we've been doing is just diversifying. But I'm still very heavily in tech stocks. In fact, we even use some leveraged ETFs to be in tech stocks, but we're not just buying and holding it randomly. We are using a institutionalgrade risk management attached to that. And I think that is what makes this potentially a lot safer. Obviously, there's risks with investing and particularly using leverage. Don't use leverage if you don't know what the heck you're doing. You're going to lose your shirt. Uh but that's what we're doing right now. And that's one of the things I'll touch upon on if you join me on Saturday of how exactly how we do that. Um and I share that with my students. By the way, we got a live portfolio there that I that I share with them so they can really see it and learn from it. But what should you do right now? So, we've covered the four patterns. We've looked at the data. We've seen where we are historically. What do you do with the all the information? Because knowledge without action is useless. And most people I see that goes in one ear, out the other, and they think they've done something useful. No, you haven't. You've wasted 30 minutes of your life. So making the wrong moves in a market top can destroy years or even decades of wealth building. It can delay your retirement by many years. So let me give you some practical actionable frameworks, not theory. This is what the more sophisticated investors do. They like to think they're sophisticated. Once you meet them, that's just a well. And what do we do? Step one is what's your personal risk tolerance? You need to be honest with yourself. Ask yourself these questions. How would you react if your portfolio dropped 30% over the next 6 months? If your answer is, I'd panic and sell everything, you would have too much risk exposure right now. If your answer is, I'd buy more, you might be okay keeping what you've got right now. And if your answer is, I'd be stressed, but I stick to my plan. You're probably right sized. Maybe there's a little bit of risk in there that you might want to shake out. Um, and and ask yourself, how close are you to needing this money? Are you retiring in the next one to three years? You should be a lot more conservative, my friend. You're retiring in 20 years. Chill. You can weather the store. You need the money to buy a house to in 2026. Well, you shouldn't be heavily invested at these valuations. You're going to want to move this to something that pays you some interest but doesn't risk your capital as much. And you also want to look at what percentage of your net worth is in stocks. Is it more than 70%. And exclude your primary own by the way. It's not an asset. It's a liability. Sorry, it's true. You're paying for it. It's not paying you, right? So, that's not that's not really part of your net worth for this purpose. If you got more than 70% of your money in stocks, that's pretty aggressive. Um, you might want to think about that, right? I'm not giving you financial advice. I'm just giving you some pointers, some frameworks. I'm not a financial adviser, right? I'm I'm a golden retriever adviser. So, at market extremes, you might want to be a bit conservative. And that can be metals, that can be bonds, not the longdated ones, but some of the corporate bonds are quite quite nice things for for now, for example, if they have fixed rates. And then the second step is implement a profit taking strategy. Um, actually, what I put on here, the biggest winners sell. No, actually, I I disagree with that. I'm not a fan of that. What I would do is set stops. And that means if you have a beautiful winner that's up, you know, 50%, 100% whatever, you're not going to let it grind its way back down to zero because those other ones are most likely going to come back down to zero or negative. So we set a stop. We say if this thing drops and then 20%, random number, then um you got to pick your own number obviously, then it'll sell. And it means I've still locked in 80% of the gains. I've given it I haven't given it all back to um Chad the banker, right? Um they're always called Chad, aren't they? Uh people say, \"Oh, tax on it.\" Yes, that's what happens when you make money. Get used to it, okay? Or or move somewhere where you don't pay tax. But um paying tax on profits is a good thing because it means you've got profits. If you don't pay any tax on profits, then you've got a problem. So it's it's a reframe that in your mind. And then do we do we rebalance? Well, look, you might want to add some defensive positions. Um you might want to look at some health care. You know, we bought some UNH last year, for example. Some utilities have done well. Consumer staples. Um, I still think we've got a Trump rally ahead of us. I think they're going to pump and prime the market like nobody's business. So, I I also wouldn't want to miss out on that, which is why we're using our tech stocks leveraged with very complex institutional risk management. Not recommended for the ordinary mortals, but I'll show it to you guys if you join me on Saturday. Um, so I still wouldn't quit tech completely because I still think there's a lot of legs in that, but I just want to be very aware that there's a likelihood this is going to go down significantly at some point in the future. So for that, you know, you could do something again like the like the stops rather than complete rotation out and then create a shopping list. Which stocks would you want to buy if they were cheaper? Wouldn't that be nice? Like Microsoft or Google or, you know, some of the really truly great amazing businesses out there. And then I put that here stop losses. Um we already covered that. Avoid leverage. Um yes, absolutely. Unless you've got insanely good risk management, which is what we've got. Um why? Because well, first of all, it's not a promise that it's lower risk. But um I'm working at one with one of my mentors who's a retired market maker. And what's a market maker? Well, if you think of the stock market as the casino, the house always wins, right? Well, he's the house. And that was his career. So he understands on a deeper level. Um and and and and and therefore we we do that. But generally speaking, definitely don't use margin in your account. Get rid of all margin in your account. Literally, I would do that today. That would be honest advice for me, which I think I can I can honestly give. Just don't ever use margin in your account. It's a really bad idea. And I know you think you're going to get to riches quicker, but you're probably going to get to the bread line quicker because it's going to destroy you in the worst moment. And you need to work on your emotions. If you feel FOMO, don't do anything. Right? I always say if you've got an idea, sleep on it for a night or maybe even two and then execute it and maybe you missed a few percent blah blah blah. It doesn't really matter. Um just don't act in the moment. I don't buy stocks when the market's open. For example, I do it on Sundays and it's just one of those little tricks that keeps us calm and peaceful and and stops us from doing doing other things. So what have the last 100 years taught us? The market works in four stages. It's very predictable if you ask me. Uh I I my opinion is that we're in late stage three. Stage three can still be beautiful because it's the euphoria stage. We can make a lot of money. I think we probably will. Uh but we need to be prepared for the reckoning that will inevitably come. Evaluations are extremes. Um Cape is at 40. That's like bubble. Buffett's at 200. We never seen that before. And everybody is optimistic. Everybody's buying it. People are messaging me saying, \"Felix, do you think gold's a good investment? Felix, do you think it's good to buy chess?\" like you know that kind of thing and and wherever I go people want to ask about stock tips uh and I'm talking about it and I see literally taxi drivers with their portfolios up that tells you quite a lot right that's not this is not the new permanent new normal this is like we're near the top um so watch out for sector rotation that's really I think one of the best indicators we can look at just look at how the max seven are performing as the ETF on that one so the patterns I think are pretty clear but you can't time it exactly it' be ridiculous to claim that you can you can however prepare. You can manage your risk. You can take set up automation so you don't have to act when you know the going gets tough and the tough get going. A lot of musical reference there. Put that in the chat down below if you know where that's from. Um so this is not doom and gloom, right? This is opportunity. I think we got some tremendous opportunity. We're on a live session on Saturday on how to pick amazing stocks in this crazy market with uh the the the dollar reset and the inflation and the crypto madness and all the debt and everything else. Um and and how do we still pick good stocks in that that scenario? Um but just ask yourself what kind of investor do you want to be? Do you want to be the one that keeps the gains and you want to be the one that you know lifts the rally and then gives it all up? That's really a question for you. So come and join us for the live training on Saturday, Phoenix/training. And I wish you a glorious, wonderful start to 2026. And I'm sure Winston does the same when he wakes up from that slumber. All the best. The Federal Reserve just announced they're printing money again. Not like in the future, not next quarter. No, they've already done it. They've already started. 40 billion every single month. Plus, they shoved about"
    }
]