[
    {
        "video_id": "y52NOQ-zfoM",
        "title": "Why the &quot;Experts&quot; are Wrong About the 4-Year Cycle (I Ran The Numbers)",
        "published_at": "2026-01-07T16:33:50Z",
        "sort_date": "2026-01-07",
        "url": "https://www.youtube.com/watch?v=y52NOQ-zfoM",
        "transcript": "Oh yes guys, on Monday I told you that I'm not buying the pump. I told you that the pump is a bull trap. When Bitcoin pumped all the way to 94K, I told you that likely this is a bull trap. And even if even if Bitcoin goes to the 50 moving average, we need to be extremely extremely careful. And look here, we do have a rejection currently at this horizontal. And although the week is not over, anything can happen within the four days that are left in the week. The chances of us pumping above it are getting slimmer, slimmer, slimmer, and slimmer. But today I want to do something different because I want to take this year 2026 and I want to compare it to previous midterm years in order to see where we are in the four-year cycle. Are we deviating from the four-ear cycle or are we exactly exactly exactly on schedule? And many people of course say that the four cycle is dead. But we have the data, we have the charts so we can answer, is it dead or not? Let's talk about it. And if you want all of these charts, they're fully free. If you go to bullmain.com/charts, you're going to see every chart, all the data that we speak about in this video, the first chart I want to speak about is this yearly performance chart because here we can see at the current year 2026 and we're currently up 4.06%. And the question is, is it good? Is it bad? Is it super bullish, super bearish? What's happening here? We need to compare this year to previous midterm years such as 2022. And here it does indeed seem that 2026 is quite bullish because 2022 collapsed quite quickly. We did see a mini mini pump into the 2nd of January and then we collapsed. And by the way, 2022 was a horrible year. It ended minus 60% or something 60 70%. Let me just quickly quickly see here how far we fell because it was brutal. It was minus 64%. And um currently we're still tracking above it. Currently Bitcoin is higher than 2022. So the bulls may be saying that listen actually this cycle is broken. But of course, we need to look at more data points such as 2018, which was another midterm year. And guess what? Now, we have a totally different picture because in 2018, we pumped all the way to 30% during the first week of the year before starting the descent. And the descent here, guys, was also quite brutal because we ended the year minus 72% in 2018. But let's continue. Let's get another data point and let's see 2014, which was another midterm year. As you can see now, we're kind of where we were in 2014. We did see an initial pump here of 20% early on in 2014, but then uh it collapsed quite quickly since then and continued down and down and down and down and ended the year at minus 58%. And so to answer whether we're bullish or bearish, uh we need to see the average. You click here, boom, the average. Y chart is the average. As you can see, we're basically exactly exactly exactly at the average of all of the previous midterm years. The next chart I want to share with you is this Bitcoin hovering cycles chart, which basically shows when Bitcoin topped in relationship to the hovering. How many days after the hovering? And so here uh last year we topped on day 535 after the hovering as you can see right here. Uh and if you compare it to the previous cycle, we topped 10 days after at 545 or 50 some somewhere here. And if you compare it to the previous cycle uh we topped on day 528. So it is in the vicinity of you know 10 days here, 10 days there, a few weeks here, a few weeks there. The only exception is the first hovering cycle when Bitcoin was just created. it had a bit uh different timeline and it was actually even earlier than the current current cycle and the cycle before that and the cycle before that. So this one is different. If we remove that one though you see that basically the top is somewhere here in this area 10 days plus 10 days minus and then we have approximately a year before the bottom. And the next chart I want to share with you is a low to low chart. basically how many days it takes from one low to the next low and most importantly on which day do we see the peak and here you have big big big massive similarities. Basically all of the different low to low charts show you that the peak is somewhere in this area where the yellow first cycle topped out the second cycle and the third cycle and as you can see we it's around you know day,000,50,60 I mean somewhere here,50,60 days after the low that's where the top is. So of course here you see massive massive massive similarities with the 4ear cycle yet again and yet people tell me every day that the fouryear cycle is dead. They're telling me that it doesn't apply, that it doesn't exist, and that's why they're trading in a different way. That's why they're holding down their altcoins minus 99% just like all of the Murad followers, you know, the Murad with his list, all the coins are down 95 to 99%. Why are people holding them? Because they're believing, believe, believe, believe in something. And what they should have believed instead is the process, a simple process where if we are in a bare trend, we're bearish. If we are below 50 moving average, we're bearish. And if we are in a bull trend, we're bullish. If we are above the 50 moving average, we're bullish. Super super simple. This simple strategy has been making us so much money ever since here early 2023 when we went basically all in crypto and has basically saved us from the wreckage because we got the signals here on October 8th on the daily time frame to be careful and we start to do risk on October 8th. And this of course priceless. The Bullmania platform is absolutely priceless. And if you want to join Bullmania and learn trading for real, go to bullmania.com and watch this free video. I use the mechanical rules to buy early 2023 and sell on October 8th, start to derisk on October 8th. And you can learn this process literally by just going to bull.com and watching this free video right here. And the smart listener would be asking, \"So, Ivan, can I just set an alarm every four years to buy Bitcoin right here on day 1,50 from the previous low and I just go all in. I go 100x leverage and take a loan. I become a billionaire. I become richer than Warren Buffett. Can it be that simple? That four cycle is just repeat, repeat, repeat, and we just buy exactly on the same day from the low or on exactly the same day from the hovering. Can it really be that easy?\" And guys, I wish it would be that easy and that's not how it works. And we don't actually trade based on the four year cycle alone. And the smart listener here would be saying, Ivan, what the hell? You just said four year cycle. What are you speaking about? What is this for guys? You just said four year cycle works and now you say you don't trade. What is going on? [laughter] But guys, it's actually pretty simple. You know that we trade based on trends. If you've been watching this channel, if you've been following me, you know that I trade based on trends. I'm a trendbased trader. So, if we have a bare trend, I'm bearish. If we're below 50 moving average, I'm bearish. If we're above 50 moving average, I'm bullish. And if we're in a bull trend, I'm bullish. It's simple. The four cycle is second grade confirmation. It is second grade confirmation. For example, when Bitcoin went into a bare trend right here, right after this fake all-time high uh in October and and at the same time, we had exact number of days in the hovering cycle where the previous stops were this exact number of days in the low to low cycles. This is this was confirmation. This was confirmation. If if Bitcoin would still be in daily bullish trend, it would not have all-time high and would just continue to up and up and up and up, I would not be bearish. Even though according to 4 cycle, it is time to be bearish. It's just that as soon as things start breaking, as soon as things become a bit shaky, it's just another confirmation. But the trend is your friend and nothing is above the trend. Trend is the number one great signal. Then you have the for cycle which currently can be used as second grade. And then you have third grade which is for example the liver pattern we discussed yesterday which you should check check out if you haven't yet. And then the fourth grade signal is you know news uh some headline Bloomberg Coindesk like everything else that you guys love to watch sometimes all of the headlines and macro is also four fourth grade. Why is micro fourth grade signal not really useful? because uh even though macro is correct, even though macro will pump us. ISM, global M2, it may just take half a year and in that half a year your altings will go down 99%. So it doesn't matter from a practical standpoint. Macro of course they pump the markets, they will they will stimulate. It's going to happen. But the thing is it can still take uh three quarters to kick in. And what will happen to your hard-earned money in crypto during that time? We can literally we can literally go down this entire this entire midterm year. I mean, look at all of the midterm years. This is how they look like. And we can literally go through an entire year like this and then micro kicks in and all the macro narratives are fully correct. Nothing has been wrong, but you've been super super wrecked. And your macrobased influencer is going to tell you EXACTLY AS PREDICTED. I TOLD YOU that macro is going to pump us. ISM is going to pump us. all of the index producer index what the hell they're looking at is going to pump us. He's going to tell you I was fully right and you're there with minus 99% waiting for them to come back. You have to do a th00and 10,000% pump to recover. If that's what you want to do, good luck. We don't do that here. So the question is, can we even make money in this market? Is it even possible? And the answer is of course yes. Yes. Yes. Yes. Yes. Look at this screen. We have all of these different altcoins that flew bullish just a few days ago and now are up 80% 90% 64% 46% and this is on the daily. Let's check the weekly what kind of performance we have there. And we look only at the bullish in the last month. Let's say here you have 451%. Uh 178 123. So absolutely it's possible to make money in this market. You have to know what flips bullish, what flips bearish. And it's not always necessary to even hunt these big percentages. What you can do is that you can click the link below exchanges I use. There's a link called exchanges I use. And then if you sign up to buy bit or bit unix you get a very nice signup bonus. For example here on buy bit a big fat massive massive massive signup bonus right here. Uh bit unix. I mean all of them are the same. Pioneex you can check. Uh and um you get the bonus and then you can trade with leverage. So even if you have a lower percent gain with leverage, it can be quite nice nonetheless. So yes, a lot of coins have nice percent gains if you catch them early on bull flip. But at the same time, even if you get I mean say you get 12%. It's still good if you exit in time, if you know what you're doing, if you can use leverage. And so if you want to learn more about how all of this works, how to how this trading, this kind of trading works, go to bullmania.com and watch this free training about the mechanical rules where I explain how to think about trading, how to think about riskreward. And if you want to get started with the exchanges, just click the link exchange I use and go nuts, go absolutely crazy. But you should watch the video so you know how to manage risk. Very, very, very key. And guys, Mr. Baron, I want to just reiterate that all of these all coins are shortterm trades. They're not for hodling long-term and ignoring in case they dump. If they flip bearish, you're out. If they start going down to a price point that you did not expect that you define before you even buy them, you define the price point at which you're out no matter what. If they drop there, you're out. That's it. You're ruthless. You're brutal. You protect your capital because currently Bitcoin is bearish. We're in a micro bear trend for crypto. But in that micro bear trend, there are opportunities as you just saw. That's what we're trading right now. Also, we have a bit of news to everyone who is in bull menu because now we added crypto and blockchain category here within the stocks tab because now you can see all of the different crypto stocks and how they're doing. Unfortunately, guys, they're not doing too well because Bitcoin is going down. So, when Bitcoin is going down, all the different stocks got absolutely demolished, absolutely slaughtered. The noob will think that it's a good time to buy, but as you know, you have to wait for them to flip bullish first because when something is bearish, it can still go down from - 55 to - 85% and that's a massive massive fall. So be calm, be patient, wait for them to flip bullish. At some point they will flip bullish. It's going to be a generational entry. For now, they're bearish, bearish, bearish, bearish. Don't touch them. And just to prove a point here, if you go to MAG 7 and if you see how much they pump, for example, Alphabet pumped 81% since it fle bullish. Nvidia 45% since it bullish. So you you just need to be patient. When it bullish, you have all of the upside still. So don't rush it. Don't get uh too crazy. Just wait for things to flip bullish before you go nuts. Also, we added gold and silver miners. This one is quite interesting also. Gold and silver miners because when gold pumps or silver pumps, gold and silver miners, they also pump a lot a lot more by the way because they're more volatile. Silver and gold miners are more volatile than gold and silver. So, when you have a new bull trend in gold, it's more thing to do is to speculate also on the on the miners if you want more volatility. And here you also see since the bull trend flipped here with this this this thing Ross gold is up 431% massive massive massive since one year and yeah 9 months ago and obviously way more than gold way more than gold I mean gold gold since it's bull flip let's see here is up uh 100 let's see gold here since 11 months it's up 61%. So that gold miner actually flipped bullish even before. So keep an eye on this. Keep an eye on these different categories. Especially when you see, let's say, commodities pump or Bitcoin pump. Then you can check the crypto stocks here. Um and then of course we have MAG 7, MAG7, they're carrying the whole stock market. If we see more and more of MAG7 turn bearish, then it's not good for the stock market because you see uh MAG 7 is 25 trillion uh in market cap and the whole market is 92 trillion. So for all you guys who don't know Mac 7 is this magnificent 7 as they're called and it is uh Nvidia, Apple, Google, Alphabet uh then Microsoft uh Amazon uh Meta and Tesla. So guys that's it for today. Hope you enjoyed. For your cycle is dead. Long live the fire cycle. Smash up the like. Subscribe to the channel. But most importantly long live the trend. The trend is the king. For cycle is below the trend. Then you have all of the other patterns and news and ISM macro and all of that. Guys, hope you enjoyed. Let me know what you think. The free charts are at bullmania.com/charts. Go check them out. See you all tomorrow. Have a good day. And on Friday, we have the live stream because I know the OGs want the live stream. It's coming Friday. Goodbye, guys. Goodbye. Goodbye. Bye."
    }
]