[
    {
        "video_id": "ibXubhJBhD0",
        "title": "Bitcoin Breakdown, Gold Goes Parabolic, Clarity Act Collapse &amp; Market Chaos",
        "published_at": "2026-01-26T14:02:21Z",
        "sort_date": "2026-01-26",
        "url": "https://www.youtube.com/watch?v=ibXubhJBhD0",
        "transcript": "Hard times. Bitcoin struggles as geopolitical turmoil, ETF outflows, and fears over the Fed's next move grip the market. Absolutely metal. It's a different story for gold and silver, though, both of which just hit fresh highs. What's driving this surge? And can it last? Clarity in peril. Crypto's flagship piece of legislation is on life support following attempts by the big banks to kneecap stable coins. We assess its chances as another government shutdown looms. And we'll have the top tweets, Lewis with the TA, dates for the diary, and much more besides. This is the Coin Bureau News Live. GM, happy Monday and welcome back to the Coin Bureau News weekly live stream. And if you were shocked by that in those intro images of me, Guy, and Lewis, so were we because we didn't know those were coming. >> What a surprise, guys. Yeah, you can't drop that on us in the beginning of the stream. Really, it threw me off my game, man. Oh god. Anyways, yeah, welcome back, guys. Of course, it's the Coin Bureau News. We got a lot to talk about today. My name is uh Nick Guy. How you doing? I'm all right, thanks, Nick. I'm all right. Well, I mean, as all right as I can be after seeing those images. >> That last one was particularly jarring. >> Yes. Yes. It has to be have to spend the rest of the stream trying to unsee it. Um, nevertheless, I am cheered up by your uh by your choice of attire today. It gone pink. >> Yeah, it's like it's light red. It's like right red. Yeah, >> it's coral. >> It's coral. Yes. I tried to mix it up a little bit, you know. Um, I like your attire attire as well. um gone away from the white to >> yeah I thought I'd mix things up a bit okay you know keep keep myself fresh for the for the people um yeah >> so anyways we got a lot to talk about guys today first of all hard times for Bitcoin you know we close to the yearly open it's fallen below key levels quantum risks so we're going to talk about that go back about through the week last week was a busy week indeed and then of course metals are just going mad silver and gold just keep breaking new all-time highs after week after week. So, we're going to dive into exactly why that is happening and whether we could play a catch-up trade at at any point. Let's see. And then crypto's most important market structure bill uh that everyone was looking forward to seems to be in peril. Seems as if the Clarity Act is now, you know, NGMI unfortunately. So, we'll be talking about that as well and of course bringing you the tweets for the week, TA with Lewis and much more. Um, but before we start guys, please don't forget to support your favorite crypto live stream with a like. That's all we can. If you can just hit a like, that'd be great. We're not going to try and give you something at the end because we haven't been able to hit it in the past few weeks. >> There's still the status bar, you know. >> Hit those hit those likes, fill the status bar, maybe full status bars, you know. Exactly. Yeah, maybe. >> Um, yeah. And don't forget to subscribe as well. So, circling back to last week uh on Monday, >> if you'll recall, it kicked off with a little bit of a fuss uh and a disagreement over an island, pretty big island in the middle of the Atlantic. >> This was the tariff threat for the Greenland annex next year by Trump. >> Yep. Once again, tariffs coming back to uh to bite us and, you know, obviously sprinkle in sort of added geopolitical uncertainty, end of the old world order, breakdown of the postwar consensus. >> There we go. Yeah. >> And uh yeah, you kind of got a recipe for for Bitcoin going lower apparently. >> It seems to be seems to be um and it was actually came at a bad time because the US markets were also closed. So Bitcoin was one of the few things that guys could sell. It's like oh can't sell our stock. So let's go and sell our Bitcoin, right? So that happened. Then on Tuesday, and this is crazy, Sailor announced that he had bought 22,000 Bitcoin. 22,35, which is mind-blowing. And it's great that he's bullish, but it brings us to the scary realization that that 97k run to the week prior was purely off of sailor's buys. He's the only bidder out there, you know. So, what the hell? So, ETFs weren't buying. So, yeah, sailor strategy is the bid that must last because if it doesn't, what happens? >> Um Yeah. And then um you know, the the announcement itself also did nothing. Bitcoin actually fell, right? >> Yeah. In fact, it slid below 90K. >> Yeah. >> Um which uh which we did not want to see. Um however, it wasn't alone though. Stocks also had a tough time. They were getting hit by uh geopolitical uncertainty as well. Um yeah, some some big names suffering some big falls there. Um now there was a lot of talk as as Nick said um Greenland was kind of cited, but it was also problems in the Japanese bond market um which we talked about last week. Yeah, Japan Japanese fiscal concerns are cropping up right now. Uh the 40 years at the highest level ever since inception uh yields are rallying and this is all because they're going to have a snap election and the and these massive dislocations in the Japanese bond market and the sell-off was a large factor in the riskoff sentiment last week. >> Um and then on Wednesday we actually came back and closed a CME gap as per usual. Uh, and this was one that was opened up at the beginning of the year between uh, like down at 87K. So, we closed that one, which is which is good that it's closed, but it still fell below 88K on the day. >> Yeah. Yeah, that was tough. Um, meanwhile, uh, Thursday took us the uh, it turns out the taco trade was back. Trump always chickens out. He, uh, rode back the Greenland uh, threat saying he won't take it by force, which is which is good news. >> Yep. Okay. >> Not force. Okay. >> Okay. Well, that's something I suppose. >> Um, so yeah, US troops in Greenland not happening for now. Um, we also had a lot of economic data coming out on Thursday as well. Jobless claims. >> Yeah, jobless claim. Uh, so GDP numbers were very strong. Uh, jobless claims were still a little bit tight although the core PC itself was within within the expectations. So inflation is cooling. So that was good. and gold and silver hit all-time highs on the same day. Um, >> congratulations to all the gold and silver uh holders out there. All the gold and silver buds. I was looking back over silver's chart today. >> A year ago today, silver was $30. >> It's wild. >> I think I think silver's going to hit $200 before soul. >> You reckon? Wow. Okay, you heard it here first. >> I just I think so. Anyways, not to trigger any soul maxis there, but yeah. Um, >> don't worry. the silver maxis, they're they're they're tough people. Don't come out for not looking too good um on uh Bitcoin as well because the ETF outflows, there were a lot of ETF outflows last week, three consecutive days. Um and uh on Friday evening, we also got an update about the potential Fed chair. And this is interesting because out of the blue, it seems as if the chances of Rick Ryder, who is the uh chief, one of the chief investment officers of global fixed income at Black Rockck, okay, >> Black Rockck, yes. uh was rallied in his chances of being the new Fed chair out of the blue. So he's now the favorite according to Poly Market. >> Okay. So it looks like we might not get one of the Kevins. We might get Rick Ryder. Cool name, isn't it? Rick Ryder. >> Rick Ryder. Exactly. Yeah. Yeah. >> Rick Ryder, a chief of the fail. >> Yes, you must do your interest rates right now. >> Yes, boss. Yes, sir. >> Yes. Yes. Yes, Mr. President. Um okay. Uh that takes us into the weekend. Uh, gold and silver were not slowing down. Broke gold broke 5K, silver $17. >> It's crazy, man. And Bitcoin just trended lower, man. And it actually even at a time was below the yearly open. >> We gave up our yearly gains. >> Oh my word. January just not going to plan. >> Oh, just not. >> Um, but uh and I I I want to get in ahead of Nick on this one. A CME gap opened up. guy, you stomp. No, we didn't. No, this is you got the renewed fears about this heading into the shutdown. >> You were so keen to get onto the CME gap. >> Oh, no. We got to talk about my thunder. >> Shut down. There's a shutdown. No one cares about the shutdown. CME gap opened up, everyone. >> No one gives a about the shutdown. The CME gap. Bring up the CME gap, guys. Uh, the CME gap. Yes. So, we did open up a CME gap over the weekend. >> Replace Nick's photo with mine for next week, which is I want to be the CME gap person. He's a CV gap guy. Um, >> but this is this is above. So, we've now got to go up in order to close. >> Well, we hopefully we can. Yes. I mean, it seems to have it tried to close a little bit earlier today. It's now still below, but that's one to look out for. Anyway, so what's coming this week? Um, it's a big week. We've got the FOMC meeting uh coming up, an interest rate decision, uh, which we'll talk bit more about a bit later in the stream. Uh, looking at the charts on the weekly charts, not looking too good, RV. uh we broke below that long-term trend line since you know over the past few years and um we now seem to be in a range uh but if you zoom in on the range it's not looking good because well it's we're at a critical level in the sense that we not only are at the open for the yearly open but we also just trending above the 100week moving average. So we need to hold those levels. we need to hold above that and if we close this week below uh the 100week moving average as well as the um the yearly open then 80k below below is is on the cards so it's not looking too good momentum is lost um so yeah and if we also close this month this January down it will be the fourth straight negative month in Bitcoin's history it will be the first fourth straight negative month and this NOS has not happened since 2018 18. So, not looking good there. Not even in 2022. So, anyways, >> one pro is we still have that CME gap. Um, there we go. And once that's closed, >> bring you the CME. >> There we go. Once that's closed, guys, then Yeah. Okay. >> We continue our trends downwards. >> Exactly. Yeah. But if you feeling bullish, bearish, or whatever, and you want to trade these crazy market moves, we couldn't think of a better place to do it than on our first uh brand partner. This is Tubbit, a top tier international exchange. Uh they've got a solid interface, deep liquidity, competitor fees and the onboarding is super simple. All you really need is just an email address. Uh you go and scan that QR code or you can go down and link link down below, create an account, use an email address and you can start trading. You can try with a demo first, see how it works for you, and then if you deposit, you'll get up to potentially 90k in trading rewards. 90K US in trading rewards, as well as a immediate VIP level one upgrade, which gets you 50% off trading fees for life. So, um, go down there, hit that link down below, scan the QR code, avail yourself of the amazing benefits on offer. >> Oh, yeah. >> You are feast at the two bit buffet. Okay. Um, I am going to give you guys a uh a rundown on what's happening in the comments. Um, we've got a bit of an emergency with one of our viewers. Uh, Cransinator um has been battling a uh a gana. A gana that's been trashing a shed for the last few days. It's apparently >> gana >> 4 foot long. >> What the With the guana that's like a lizard, >> I think. So, yeah. Transcanated, can you can you elaborate? Do you have photographic evidence of this? Can you uh can you tell us what exactly we're dealing with here? >> And where on earth have you seen an iguana that size? Do you live out the Gapagos Islands or something? >> I mean, I presume I presume these things are native to Australia. That sounds like the sort of thing. That sounds like an Australian problem in me shed, mate. >> Tanzania or something where, right? >> Yeah. Some some sort of godforsaken place down under at any rate. Um, okay. Uh, someone called no one. Hey Schmucks, please can you not privatize the video halfway through the stream? We didn't do it on purpose. Yes, it just happened. >> Please take your please take your complaints to the manager of YouTube. >> Yes, exactly. Phone them up. They love to hear from you. Um, okay. Uh, we've also got Oxford Row Coach has got problems of his own as well. It's almost flooding in in Oxford, but I'm drowning in bad news. Help. Well, if it's flooding, at least you at least you have some transportation on hand. You're probably the best uh best place person to deal with any flooding in Oxford. I don't know why you're complaining. It's everyone else in Oxford that that's got problems. Um uh meanwhile a lot of people are also I mean yeah there's a lot of talk about gold and um uh and what have you. Um uh guys rocking man boobs. >> Oh bro, you thought you thought the black the darker shirt would would hide. >> I thought I thought it would cover a multitude of sins. Apparently not. Although my triceps are also looking juicy as well though. So you know it's uh it it swings and roundabouts. I'll I'll take what I can get. >> They're always objectifying new guy. They're always object. I kind of think, you know, when when sentiment is this bad, when markets are this bad, you know, that's when that's when the objectification of this guy kicks in. So, you know, we'll know when things are getting better when uh when that >> as long as it entertains our viewers, you know, it's okay, guys. Feel free to do it. Not me, of course, but guy. Feel free. >> Yeah. Don't objectify Nick or whatever, please. I mean, you know, he's a very sensitive young man. He'll be he'll be devastating. Okay. Um let's talk then about metals. Um because this is uh this is the story of the moment in investing right now, isn't it? >> Yeah, the metals mayhem. Uh it's been tough to watch for crypto holders. Let's not lie. Bitcoin and ETH are crashing and gold and silver are making all-time highs. >> Uh indeed, the Bitcoin gold ratio is at its lowest level in 3 years. The ETH silver ratio is at its lowest level in five years. It's not looking good. >> They just these charters just keep coming up with new ways to to illustrate pain, don't they? It's like here's Bitcoin plotted against gold. Oh, ETH against silver. It's terrible. So, let's have a think about what's driving gold then. Um there are a few, you know, the these aren't there's no sort of one isolated factor here. This is a kind of confluence of factors driving gold at the moment. Um the first one is the uh the debasement trade sort of married with lower interest rates as well. >> Exactly. Right. So for one um debasement worries about inflation and that so that's what's um leading to rally and then also lower interest rates means that the lower real yield if you you know have lower real yield then the incentive for holding bonds the opportunity cost for holding bonds you know decre decreases I mean and um you want to go back into potentially higher yielding assets like gold. >> Yeah. >> Um and you can see this in the charts as well because you can see bonds selling off. So you see the yield in the 10 year going up and you can also see the sell off in the dollar as the Dixie comes down. So that perfectly lines up with why gold is also rallying right now. >> Yeah. And speaking of the dollar, there is also a ddollarization trade going on as well. Um a lot of central banks, a lot of foreign central banks, non- US central banks are are getting much more nervous about holding US treasuries. Now US treasuries have long been the the number one form of of collateral to hold. you know, hugely popular with other central banks because they've been perceived as so safe. However, um, obviously the US is behaving somewhat erratically these days. Um, and a lot of countries, you know, spearheaded by the bricks and others are starting to kind of move away from the dollar. And although you know talk of maybe like goldbacked bricks currencies is is a bit premature and a bit overblown nevertheless central banks are looking to stock up on an asset that can you know that that is is more neutral than the US dollar. >> Exactly. Exactly. Um and then also another reason is because of of gold is rallying is because uh equities are looking a lot more expensive these days from via many metrics right so for example uh there's one thing called the Schiller PE ratio which measures the PE ratio based on where we are in the cycle uh and then also tech stocks are a source of concern on the stock market right now because they are huge companies that can pull down the S&P 500 so then again the investors are looking at the current opportunity set and think, okay, equity is looking a bit too expensive right now. Uh, I will never ever touch anything called Bitcoin, so I'm going to go into gold. So, that's a >> Yeah. And look, you can't rule out just momentum as well. Price begets price. Um, so gold is, you know, gold has got that momentum at the moment. More people are piling in. You know, this this happens during parabolic runs like this, you know, be because it is top of mind for so many people. >> Exactly. It is. and gold historically as well in in five of the six years before 2025 that gold futures rose by at least 20%. They climbed again in the next year. So gold has that momentum factor behind it. >> Yeah. Yeah. And it's I mean it's just everyone's including us. Even the crypto grows are talking about gold uh gold as well now. and and you do kind of feel that this is this must have had a big effect on you know this must be one of the big reasons for Bitcoin's price decline because obviously Bitcoin and gold are in kind of competition. Um there's you can also point as we did last week you know there's the kind of quantum threat that people are worried about as well and I guess you know there's there's a lot of tokenized gold now there's there's pax paxos gold pax g there's tether's gold token x aut as well so it is pretty easy for for the bitcoiners for the crypto bros to rotate out of crypto and into gold and I'm sure that's you know I'm sure that's that's a trade that we're seeing play out. >> Yeah we are. Um and then also now that's gold but silver's also obviously had a it's a way bigger rally right and silver's especially over the past 2 months I think this this past month or so it was the fastest appreciation in silver since the 1970s um but there are many drivers of the same with silver it's the basement it's riskoff hedge right now but also there are some unique factors with silver uh and and that is because it's not just a precious metal like gold it also has industrial uses right >> yeah yeah silver is found in a whole range of products. You're finding it in things like fighter jets, in phones, it's solar panels, I think, exactly is a big part of it as well. And obviously, you know, as the world kind of moves away from fossil fuels, uh solar panels are becoming a big thing. That's something I'm really that that's something I sort of watch quite closely. And it's like, you know, places like Pakistan for instance, just covering themselves in solar panels like solar power is growing way more than a lot of people think. And of course that is you know that is demand for silver >> and China as well. Yeah. Um and industrial demand now accounts for over 50% of silver's total consumption. >> Um and there's also a structural deficit in terms of silver supply. Uh because it's important to note that so first of all mining output has remained stagnant due to high energy costs and regulatory hurdles. But more importantly silver is not mined itself. it's usually as a byproduct of other you know metals being mined gold, copper etc. So essentially if there is a lack of supply of silver on the markets um it's it can't react as like other metals can because it's mined as a byproduct. So it's like if you have a only if you have a similar rally in the price of like gold or copper and then the miners decide to increase output but it's it's mind as a byproduct. >> Yeah. So actually increasing output is not easily done. It's not like you can just sort of open up and an abandoned or you know a mothballled mine >> which I think sometimes happens with you know other metals and stuff, >> you know, you can you can get you can put put sort of old mines back on back on stream. It's not not really the case with silver. So you've got like increasing demand >> um and supply that can't keep up with it. So I I mean I guess you know when you see rallies like this in in anything in any asset you always think well you know after a parabolic pump like this there's going to have to be a a correction at some point but I think with gold and silver you know for for those kind of different reasons that we've outlined it's it's hard to see them slowing down anytime soon. It's not. And I recall last week in the stream I said I think it's going to continue outperforming Bitcoin and alts. And I pushed a tweet last week saying, \"Look, the the fact is driving altcoins lower and gold and silver higher are not going to reverse anytime soon.\" Lots of people took issue with that. Oh, you buying the top you literally buying into an asset that's at the top right now and it still kept on going, right? That was when silver was at 90 and gold was below 4,800. So >> honestly, this with momentum this strong in an asset of that size, gold and silver, it's not your average crypto bro rotating between one thing or the other. It's structural changes going on the markets right now. It is the massive debasement trader that many Bitcoiners had been talking about for years. It just unfortunately turns out that it wasn't the asset they were betting on that was getting going to be debased or going to benefit from debasement. >> Look, Bitcoin will have its time again. You know, these things are cyclical and at some point, you know, the momentum will run out of gold and silver and uh and Bitcoin will have its moment in the sun again. But it ain't that moment right now. >> Not right now, unfortunately. >> Might not be for a while. So, uh for the foreseeable future, we will now just be coin >> or the the bullion bureau >> or the bullion bureau, >> the metals bureau, one of the few. Um but uh if you guys are feeling bullish about gold and silver and you only have crypto but you want to trade gold and silver well uh you can do so on our second brand partner which is Bitket. Now they've got Bitket Tradfi which is basically allows you to trade metals and other stocks as well tokenized stocks directly with USDT um up to 500 times leverage if you are so brave. Uh you also can enjoy deep liquidity and low slippage. Uh, so if you guys want to sign up right now and and trade on BitKat, scan the QR code over there, hit the link down in the description. And they're offering up to $50,000 in sign up incentives as well and deposit bonuses. So, make sure you guys go and trade some tokenized gold and bit. Lovely stuff. Lovely stuff. Okay, let's let's talk something more cryptospecific now. Obviously, gold and silver, you know, are very much top of mind at the moment, but uh we are still a crypto channel. So, we need to talk about the Clarity Act. So, this was the big market structure bill um that there were great hopes for >> clear as mud. Clear as mud. Uh we we covered it last week, but it seems as if the chances have continued to decline. The chances that is passing. We've got the poly the KHI odds up there. Um so yeah it's not looking good there in terms of chances for this year it's continued falling and it's fallen a lot over the past two three days especially because now the increased shutdown risk um so just let's go through a bit of an update of ex exactly what happened last week with it so um the postmortem begins right >> yeah yeah so um yeah there's been a lot of speculation been a lot of talk as to exactly what uh kicked this off but I mean the the reports are mostly focusing that the main friction The primary friction came from an amendment that was very much uh backed by the banks or the bank lobby um which was targeting stable coin yields. Basically banks do not like the idea of people being able to hold stable coins and um you know get and get some of the yield that those stable coins generate because obviously they have assets mostly US treasuries backing them. Those treasuries yield you know sort of somewhere between three and 4% at the moment. Um, and banks don't want to uh don't want that yield passed on to consumers. >> They don't they don't. But, you know, other crypto giants, although Coinbase took a big issue with it, other giants like A16Z and Ripple said that, you know, we shouldn't allow quote perfect to be the enemy of good >> and they said we should consider trying to work with the banking lobby to get it passed. And David Sax, the White House cryptozar, was still quite optimistic about it at Davos. uh and he said that the bill is essential for the eventual merger of traditional banking and crypto. >> Yeah. Meanwhile, Brian Armstrong uh who was also present at Davos um he said that uh they'll be working on a on a win-win situation. He seems to think or at least it seems to be saying in public um that uh you know it is possible to get a bill that works for everyone. He reiterated that in order for Coinbase to support, you know, to to return support to the bill, um it must protect tokenized equities and remove this uh proposed ban um on stable coin rewards. >> Yeah. And something else interesting came out last week. Now, if you guys will know with regards the to this act, there are two committees in the Senate that are working on this. You've got the banking committee which is the one that I think uh Coinbase took the their draft was the one Coinbase took umbrage to and then you've got the uh Senate agriculture committee which oversees the CFGC etc. And the agriculture committee which is led by uh Boozeman John Boozeman I think um he released an updated version of the market structure bill and it's notably cleaner than the banking version uh that Coinbase rejected >> and by releasing this draft Boozeman is attempting to bypass these particular poison pulls that have been added by the banking committee. Yeah. Yeah. So, this is kind of setting the stage for a markup next week. Well, I mean this week. >> Tomorrow. Exactly. >> The 27th. >> Um, now we have uh we have been tweeting out about this a bit as well. Um, and you know, it's talking about what's been going on and why the bill could fail. It is unfortunately becoming more and more of a partisan issue. >> It is indeed indeed. the um one that went through the Senate AG committee um or the AG chair, it is very partisan. There was no Democrat support there. So, it's going to mark up tomorrow with no Democrat support. And the problem is you can't advance. It could stall in the Senate if it goes through without Democrat support. Democrats still want uh the ethics provisions to bar Trump, etc. from getting involved in crypto. Um and and that's just on the the Dem the Democrat side. There's also the banks are also not going to give up. And the American Banking Association says, \"Nope, we will do everything we can to allow. This is going to be a priority for us.\" >> Yeah. And you and I were talking about this earlier, weren't we? And I mean, there is a there is an interesting distinction to make here because on the one hand, you know, what the banks are doing is I think pretty egregious because, you know, they don't want people to be able to earn yield on stable coins because they want people to hold dollars in accounts with banks uh which will pay you less than 1%. Meanwhile, those banks are taking the money that you deposit with them. They are buying US treasuries uh and getting that, you know, 3.5 to 4% yield or whatever it is and paying you less than a percent amount. So, pocketing the spread. >> Yeah. And they're also lending out the money, earning a massive earning massive interest from the people who've lent from. But I think that to be fair to them, look, if you want to take this look at look, put it yourself in the shoes of the banks, right? Okay. These it's not all banks. People are like they're just the banks, right? There's the difference between JP Morgan and your small regional lender in in a small town in the middle of America and that small town bank has gone through the steps to be able to get a license to be able to operate the expensive an expensive regulatory pro process to get that license to be able to serve the customers there and they the ones who are also worried from this. So you can kind of they say oh well Coinbase is just basically out there offering stealing our business with this without going through the regulatory steps we have and they that's why they're fighting it right. So you can kind of see what they saying to a degree, right? So this is why there needs to be some sort of, you know, compromise to come. >> Yeah. And of course it's, you know, with with banks, it's not just a case of them holding on to deposits. It's it's also a case of them, you know, lending to businesses. And as as as you say, like those small and regional banks are the are the banks that are lending to small, you know, small and medium-sized enterprises right across the United States and indeed elsewhere. So you know they are performing a service. They are an important part of the economy. It's just I guess if you mix them in with the big banks and just you know talk about the banking lobby in general then it's much harder to have any sympathy. >> Um because you know who cares whether JP Morgan Chase you know or bank of America is losing out you know these guys are these guys are wealthy enough as it is but um yeah it's not black and white. >> So where exactly are we are we right now with >> right now as it stands. So they've got the markup tomorrow in this in the agriculture committee. We'll see if that goes ahead. Uh and people think we now this next week it's crucial crucial to pass it before we go to the potential talk of a shutdown. Look guys, it's not going to pass this week. I'm telling you. Um the Senate Banking Committee itself, that one has stalled because there's they're focusing on other things now shifting to housing legislation and President Trump's affordability measures. So where we stand right now, unfortunately it seems as if um the consensus view it's not going to pass this year. >> No. >> And that's that's according to many people who are talking about it. Indeed, I'm sorry to say, but I think I remember when we started this year, I came out and I said that this is not going to pass because I just there's just too many competing forces. And we it looked as if indeed prior to this weekend, it looked as if the shutdown risk was not coming. But now because SE Senate Democrats are threatening a shutdown because of funding for ICE or whatever which is a whole other uh you know thing. It's basically not we could see a shutdown which is got its own issues with it. So unfortunately that means I don't know we'll have to see. I mean going into an election year it's unlikely that this thing's going to pass. So it's going to have to thankfully you still got a pro crypto SEC pro crypto CFTC. >> Go back to rulem. >> I mean it could be worse couldn't it? Because like you know clarity is is fundamentally about who gets to regulate crypto and you know I if if if if it was the CFTC in the long term then arguably that's the best long-term solution for the industry but we are fortunate enough that we are not in the Gendler era SEC. You know we have have actually got a very friendly SEC at the moment. So, it does feel like we sort of, you know, maybe we do have that time on our side. And I mean, I'm kind of in Brian Armstrong's camp as far as like I think no bill is better than a bad bill. >> Yeah. >> Because I think if we get it through at the end, we and again, we talked about this last week. If it goes through, that's it, >> you know. So, if it goes through with these stable coin yield provisions as well as the ban on tokenized equities as well as the restrictions on DeFi, which we didn't even really get to, you know, that will long term, I think, inshitify the crypto industry or certainly like hobble it. >> And I don't think that is that is what we want. So, I I think really, you know, it's it's not ideal, but it's for the best until some sort of consensus can be reached, which might be a very long time. >> Yeah. But if you guys want to store your crypto until that time comes, we couldn't think of a better place to do it than on a Tangent device. Which brings us to our next brand partner. This is Tang. And uh if you haven't got a Tandem device yet, it's your all-in-one crypto solution with no seed phrases, middlemen, and no compromises. It's just a tap and go. So, you can now scan that QR code on the screen and get a 10% discount on your Tangent device. Uh we also have it linked to down below in the description. So, go and load up on your Tang, pick it up. Self custody is the way, guys. Nothing better than a quick easy tap with your card. >> Absolutely. Absolutely. Okay, you've been listening to us rabbit on about various things. It is now time to pass over to uh another titan of the coin bureau. It is time for some TA with Lewis. Gather around. Don't miss a beat. TA with Louis can't be beat. Charts and trends. He'll show the way. Louis brings the TA today. All right, guys. So, I'm going to keep this short and sweet. Well, maybe not so sweet because I have some very bad news, especially for the crypto bulls and everyone who has been hopeful in the crypto markets. And I'm going to let you know that I sold pretty much all of my crypto and moved it into metals. And I'm going to explain why right now. So on my screen, I have the 2021 bull market cycle. And you could see that we had this trend line support that the market kept on bouncing off of until finally it broke beneath it in January of 2022 after the bare market started. And then it ended up coming back up to it before falling all the way back down to the previous market cycle highs that you could see right over here on the left side of the screen. And if I keep on scrolling, you could see that we ended up bouncing from there and having the new, you know, 2022 to 2024 or 2025 market cycle, right? And what just happened right now is that we have this trend line support for this cycle that was just broken. Okay, so in my opinion, that's pretty much the worst possible thing that could happen. And in my opinion, that also confirms that we're in a bare market. And not only that, but on the left side, this is the previous cycle's all-time high. And we are now underneath of that as well. And so this is the total market cap for all of crypto. And in my opinion, because I think this is the absolute worst thing that could happen, I am going to be selling all of the rest of the crypto that I currently hold. And I'm going to be waiting until it falls a lot lower before I decide to go back in. With saying that though, what's the name of this channel? It's called the Coin Bureau. And what are coins made out of? Metals. Okay, so if you look at some metals, metals are doing absolutely crazy. They're going bonkers. We're talking about uranium. We're talking about copper. Okay, check that out. We're talking about lithium. Okay, who knows? But a lot of them are doing really good. So, I think that these are the plays right now. Why be in something like a market like crypto when everything is super super hard? Why not just wait until things look a little bit better? Or maybe things go down and there's a really true capitulation event, you know, like how we had FTX and how we had, you know, uh the stuff in 2022, we had like a crazy crazy drop. We had a crazy crazy drop in 2018. You know, we haven't really had anything like that, any any real damaging capitulation event yet. I don't know if we necessarily will uh have something damaging, but we probably will have the price do a huge huge huge dip sometime soon. And okay, that'll be a great time to buy in. But like right now things don't look very good in the crypto markets, but things are looking real good in all of these metals, you know, in all these metal markets. Am I top blasting? Probably not because, you know, I don't think that metals really uh act the same way how crypto acts. It obviously depends on if you get into, you know, riskier miners or whatever. But to me, it looks like metals are the play, just like how Nvidia was the play, you know, and even over here, you know, back in March of 2024, after everyone knew about AI and knew about the chips and everyone understood it already, it still ended up pumping over 130% even after everybody knew everything, right? And so, right now, Trump is really pushing uranium and nuclear energy. So, that just seems like a no-brainer to me. And it seems like a no-brainer to a lot of other people too considering that's up over 100% in, you know, just a few months. So, yeah, I did a little bit of research and these ones that I have on my screen over here on the right hand side are the ones that I'm looking at and the ones that I'm getting into. You know, fingers crossed that they don't just tank. Obviously, not financial advice, but it seems pretty pretty good to me considering the fundamentals uh that are happening. But yeah, as of right now, because of what I just shared, that's my plan. And so, if I see something else, I'll point it out. But uh yeah, I'm going to stick with what I got right now and I'll hand it back to you guys. >> Well, thanks for the heads up there, Lewis. I mean, that would have been great to know. >> It seems like that pivot to the bullion bureau has gone off swimmingly. >> We got to start watching those videos before we put them up on the stream. Okay, >> would you like some silver guy? Would you like some silver? >> Time to get into this. Um, so there you are. Onethird of Coinb's main channel presenting team is now out of crypto entirely. Scott >> Well, you know, there's I mean I think I think he had a lot of interesting stuff to say there. I mean, yeah, gold, silver, uranium is something I'm very bullish on as well. >> That backpack is loaded with all kinds of metals, bro. >> Yeah, we better make sure he hasn't run off. We uh maybe he's maybe he's preparing to to fly off with all those a backpack full of metal. Um but yeah, someone in the comments is saying, \"Well, you can't get uranium through an airport.\" >> That is true. Very true. And it's And isn't it also radioactive to a degree or no? That's when you're after >> um I I don't know. I don't think it's something you want to be having lying around the house in Exactly. You don't want it hidden under your pillow. You don't want You don't want uranium under your pillow. So, yeah, you can hide your ledger under your pillow. Uranium, unless you want to grow three three, you know, an extra three toes. Yeah. >> Um Okay. Well, so there you are. There. There's some offer for you. Lewis is into metals. Um, so we'll uh, yeah, we'll be just talking about uranium, copper, and zinc next week by the look of it. >> Okay. Well, whilst we digest that news, let's have a look at some tweets of the week. >> I mean, I just can't focus on now that I know Lewis is all out of crypto. Um, what's going on here, Nick? >> Uh, so someone said a crypto has been held back by Bitcoin. If retail knew that crypto is more than this pet rock, we would be in a full-blown bull market. Ethereum is fixing this. And then the responses were ETH got outperformed by USD savings accounts. Sit down. And then no, actually someone else said actually by checking accounts too. So yeah, there we go. Not even earning interest and you would have outperformed Ethereum. >> Eat bash continues. Eat bashing continues. >> Yeah, it's the sport. Okay. Uh, next up we have this one from um, uh, LTR. The funniest is crypto bros were right about most things. Yeah, fiat debasement, financial rebuilding, metaverse ownership, etc. And yet it's the same web two just the same web two companies or old metals receiving the reward because we killed each other off in little tribal wars. >> That is true, man. >> I I think there's a lot to um a lot to a lot to agree with. >> PvP battles against everyone, max extraction, mean coins, all them. Anyways, uh this one's pretty from Duma. This is basically uh a release. The SEC basically has released a filing, guys, because I know Ledger is going to be making an IPO application, but they found there was one big red flag in the SEC's filing for their IPO, and there are big concerns that the SEC has, and that is the fact that Ledger has French devs. >> Oh, yeah. >> Um yeah, >> for sure. For sure. >> Okay. You should point out that that is very much a parody account. Um, thank God because you do have to look twice sometimes. Um, so yes, I'm sure those French devs are are shipping like nobody's business >> for sure. >> Um, okay. Uh, next up we have this one from Oh, Michael Sailor. The greatest risk to Bitcoin is ambitious opportunists advocating protocol changes. This >> stirred up a lot of controversy. Yes. I I mean, I think this is because obviously there's lots of talk now around quantum risk. People are worried about it. It seems to be a big a big concern. There are devs who are trying to look for solutions in terms of upgrading to quantum secure wallets etc. And yeah, he got a lot of heat for this these comments because he is I think one of the after Satoshi one of the single biggest Bitcoin holders, right? And he's he's not too concerned about this existential potential existential risk to Bitcoin. And I I actually did a podcast with Charles Edwards um on the which is a you know macro analyst on the coin bureau podcast channel and he said that I think quote there's a 20% chance of Bitcoin going to zero in the next four years if quantum is crack if quantum is cracked and or quantum comes to Qday and it's faster f further ahead than you think. So go and check that out but yeah I think that it is a bit of a concern right now especially how fast it's progressing. >> Yeah. Yeah. And I mean I think this is this is one of the problems that Bitcoin faces. Not only the fact that you know this even even if the quantum threat is still a very long way in the future just that the talk of it is enough is you know is enough to spread FUD. And I also think like one of Bitcoin's big issues is it kind of its decentralization in a way in this regard because like you know in order to get a solution agreed upon and initiated you know that is going to take a very long time. >> Exactly. It's not easy to coordinate uh with all the different devs and and also some devs are and some development companies are being incredibly resistant to change. Um >> but moving on dates for the diary and coins to watch. There's no coins to watch really because we're not watching coins anymore. We're watching metal. >> Gold, silver, >> those are coins. >> Any coins made out of metal. >> Exactly. >> Actual actual coins, physical coins. Your diary tomorrow, as we said, is the SEC. Well, firstly, there's the SEC and CFTC are holding a joint event on harmonization. Um, and this is interesting to see what comes out of that. And then is also that potential markup of the AG version of the bill clarity act. And then on the 28th Wednesday of course it is the FOMC meeting and the interest rate decision. Current expectations are no change to interest rates. Uh although it will be interesting to see the tone uh that Pal brings forward. The is it going to be a doubbish pause or you know a hawkish one. So it's all about his tone. >> Yeah. >> Okay. Okay. Well, um, safe to say, uh, Lewis's Lewis's revelation there has triggered a fair bit of activity in the comments. Um, look, I think, you know, a lot of people are kind of, uh, kind of in agreement here. And, um, no, we're not going to fire Lewis because he's gone into metals. Um, this is we're a broad church here in the chat as well. >> Lewis is in the chat. Yes, he's defending himself. I I think Lewis, you better you better come in tomorrow and just prove you're not in Thailand. >> Lithium, bro. >> Lithium. Yeah, lithium. I was bullish on lithium a while ago and then I bought some lithium stocks and they went nothing but down and now I realize I was too early. I was ahead of my time. Um this is an interesting comment from someone. Um been holding gold and silver for 5 years and it's been painful when it doesn't move for years. So I've now taken some profits. However, I will rotate into crypto soon but not selling any data center or AI stocks. Well, good on you, sir. I'm I'm glad that people, you know, have been holding this stuff for five years are getting their reward. It just shows patience is one of the investing superpowers that you need. >> Is that Peter Schiff's alter alt accountant there? >> I think if that was Peter Schiff's would not he would be a lot more. >> Yeah, it would be more like you dumb crypto bros. You're a bunch of idiots. Um yes, a few people say that Lewis is triggering a dump. Um Cranator who I presume has uh has resolved your Goana problem. Uranium was a buy four years ago. A bit late to the party. I disagree. I think I think we're just getting started on that. >> Yeah. I mean, isn't they just starting up all these nuclear uh all these nuclear plants, nuclear fusion now, right? So, >> well, a fusion I don't think uses uranium, but like fusion is always years away. So, I mean, one of one of the advantages of of of fusion, as I understand it, is that the the fuel for it is relatively easy to come by. You don't need uranium, but the problem is it's so, you know, they just they still haven't perfected the technology. So I think we're going to be unless there's a massive breakthrough on fusion sort of soon, which you know might happen. I think we're we're going to be stuck with uranium, but you know that because that's where the technology exists for it in a while. Um uh meanwhile 312 Mary says, \"Good to see you. Haven't been here live in a while.\" Are you talking about yourself, Mary, or us? Because we've been we've been here every week. Well, every >> you guys never do live streams. Why don't you do live streams anymore? is like literally we're doing we're doing two a week now. Okay. Um well uh yes that's an interesting one. Gosh, what a what a what a mic drop. Um uh to finish on with Lewis Lewis moving out of moving out of crypto honest guys. Yeah, we did not know about that at all. I was literally expecting to come and say okay well Bitcoin is maybe recovering. You know we can thinking about this not going to buy into alts right now. But yeah the complete and utter pivot into metals was not taking us by surprise but >> wow. Okay. So, it seems like we like left out here holding the fourth. Are we are we that last Romanian Japanese soldier on the island who thinks World War II ended? >> Everyone else is in medals and we're still like Bitcoin looking good here. >> Oh my gosh. >> Um, yes. Uh, Matt Sme channeling Sean Ryder and the Happy Mondays and Twisting Malum. Oh, Lewis Lewis is one of our one of the coin bureau has has got out of crypto, but I think crucial crucial to clarify he is planning to rotate back in uh at some point. >> All in on Dubai chocolate, man. >> All in on Dubai Ch that there's a bull market somewhere and it's in Dubai chocolate. I can tell that stuff. I had to get some for my nieces and nephew. Nearly bankrupted me. >> Really? Did you get the original ones from the original store? >> Yeah, because you know they want the they want the pure stuff. Um and uh they obviously want a bar each. They're not going to share them. >> Okay. >> Little. So So um yeah, >> thanks for that nieces and nephews. Um okay, thank you for watching folks. Uh that's been a great stream. Uh we will be back next week um uh with our metals only dedicated live stream. Um but let's see what happens this week. Thank you for watching. There's lots more content coming your way. Please continue hitting the like button and we'll see you all soon. >> See you next week. Smash that like button like Nick did the porcelain throne last week. >> WELCOME BACK, NICK. How many kgs did you shed? Nick >> live, but Nick's looking like an escapees from a goth party. In that moment, he realized he was dying along with the sushi and his party for guy's birthday this week. Happy birthday, Your president is an alien. >> Happy birthday, guy. >> Smash that like button like Nick did the porcelain throne last week. >> So, yeah, I I think uh now that we're pivoting to a gardening channel, we want some really authentic presenters. Um, you know, we want people who are deep into this. And so, you know, that's why we came to you. You've got a a very impressive resume here. Um, so can you just tell me a little bit about your experience?"
    }
]