[
    {
        "video_id": "Y4fjWwtGmC4",
        "title": "Apple and Tesla Are Being Tokenized...Here’s How It Works",
        "published_at": "2026-01-26T10:45:52Z",
        "sort_date": "2026-01-26",
        "url": "https://www.youtube.com/watch?v=Y4fjWwtGmC4",
        "transcript": "Tokenized stocks have been around for a few years, but something changed in 2025. [music] Major crypto platforms have jumped in and for the first time, regulators are starting [music] to seriously engage. So, let's have a look at what's actually happening in this space and also why it [music] matters. So, what are tokenized stocks? They're crypto tokens that track the price of real stocks like Apple or Tesla, and you can trade them 24/7 just like any other token. And they give you exposure to traditional equities without going through a stock exchange. But most of the time, you're not actually buying the stock. You're just holding a token that follows its price. There are a few ways that it gets done. The most common setup is that a company buys actual stocks through a regular brokerage, holds them with a custodian, and issues tokens that match them one to one. The token price tracks the real stock through arbitrage and oracle feeds. So, the token moves in sync with what's happening on NASDAQ [music] or wherever the stock trades. But holding the token doesn't mean that you own the stock. So, you're not on the shareholder register, you can't vote, and you won't get a direct dividend payment. Now, some platforms try to simulate dividends by reinvesting what the real shares earn. So, the token reflects that value, [music] but at the end of the day, you're just getting price exposure without the legal rights. A few projects like Soloex and Superstate are trying to change that by tokenizing shares in a way that holding the token actually makes you a shareholder with voting rights, dividends, and everything else that comes with it. Now, the efforts are still early, but it kind of hints to where this space could be headed. But even as this industry is trying to get a footing, it has still attracted both major crypto exchanges and fintech [music] firms. Back in June, the total market cap for tokenized stocks was only around [music] $4 million. But by the end of September, that number had exploded to nearly $400 million as new platforms launched and [music] exchanges started rolling out tokenized stock trading. And one of the notable launches was by backed [music] finance out of Switzerland. They launched X stocks in June and within just four weeks. Trading volume topped $300 million across platforms like [music] Kraken and Bybit. Each token is backed onetoone by a real share held by a licensed custodian. With them you get exposure to blue chip US names like Tesla, Apple, Nvidia right [music] onchain. But as mentioned earlier, you're not getting shareholder rights. Then Ono was another notable launch. They started out with tokenized bond funds a few years [music] ago, but this year expanded into equities with the launch of Onondo Global Markets. It works like back finance in that the tokens are backed onetoone by real US [music] stocks to give you economic exposure without ownership. And when a stock pays a dividend, Onondo automatically reinvests it to reflect in the token's price. On the exchange side, major platforms like Kraken, Bybit, and Gemini have all listed tokenized stocks for retail investors. But due to regulatory constraints, [music] these tokens are only available to non US users. Even with these platforms staying extra cautious around US regulators, 2025 marked a real turning point for tokenized stocks in the US on the regulatory front. In June, Daener became the first to receive a full regulatory green light to run a tokenized stock platform and then soloex followed [music] suit in October. Ekanow also legally offer tokenized stocks to US retail investors. Other major platforms like Coinbase and Kraken are still seeking the SEC's approval. Meanwhile, NASDAQ itself has proposed a rule change to allow tokenized stocks to trade alongside traditional shares on its exchange. Now, the key requirement is that these tokens must carry the same rights as the normal shares, meaning that they're legally identical, [music] just digitally represented. Over in Europe, the door is already a bit more open. Tokenized stocks can legally be offered under existing securities rules as long as platforms follow proper licensing and disclosure. Back Finance, for example, uses EU regulations to let retail investors buy tokenized stocks across the region. Other platforms like Robin Hood, Gemini, and Kraken also began offering tokenized US stocks to customers in the European Union this year. finally giving our European customers exposure to US stocks. >> That said, Robin Hood ran into some regulatory push back shortly after launch. So, the rules in Europe may still shift as regulators catch up. And this brings us into the risks, benefits, and impact of tokenized stocks on the market. Critics are mostly worried about investor confusion. A lot of retail users might not realize that they're just holding a token that tracks a stock, not the stock itself. And then there's also the liquidity side of things. Right now, tokenized stocks can trade 24/7, but volume drops sharply on the weekends, and that's mainly because arbitrage gets harder when the real stock market is closed. Without price updates from NASDAQ or NYC, it's tougher for traders to keep token prices aligned with the real thing. And this lack of arbitrage pressure means that tokens can drift more on the weekends, leading to wider spreads and more volatility. Critics also worry that if token markets keep growing, they could start pulling liquidity away from regulated exchanges, and that might split up the market and make fair pricing harder to maintain across both sides. Still, proponents argue that their approach actually enhances liquidity. With tokenized stocks, you don't need a US brokerage account anymore, just a crypto wallet. You could be sitting anywhere in the world and buy $ five dollar worth of a US stock if local rules allow it. And that kind of access could make it way easier for everyday investors, especially in emerging markets, to build diversified portfolios with just a little cash and so create liquidity that didn't exist before. Plus, these tokens trade around the clock. If a company drops earnings after hours, the token doesn't wait for Wall Street to wake up, it just moves. That could mean faster price reactions and over time tighter spreads as more liquidity shows up. One of the more interesting angles is how stock tokens can plug into DeFi. Once a stock is tokenized, it's just another asset on chain. You could use it as collateral for a loan, trade it on Dexes, or drop it into liquidity pools. And platforms like Radium on Solana are already experimenting with this. It basically makes regular stocks programmable and compatible with the rest of crypto. So where does that leave us? Well, tokenized stocks might not be a gamecher yet, but they're not noise either, especially with regulators now starting to take [music] them seriously. Most of what's live today still feels like a stop gap, though. But slowly public markets [music] are moving onto crypto resils. Only time will tell if this turns into something mainstream. So, what is your [music] take? Drop your thoughts in the comments below. Bye."
    }
]