[
    {
        "video_id": "YRgBvHJTins",
        "title": "DCA Live: Gold Won or Rotation Ahead?",
        "published_at": "2026-01-26T17:04:16Z",
        "sort_date": "2026-01-26",
        "url": "https://www.youtube.com/watch?v=YRgBvHJTins",
        "transcript": "Hello everybody. Tensions are high. It's like for the last nearly 90 days, we're literally in the same range. Nothing is happening. And people are very frustrated because they they look around. I think CTO said they're looking at their parents' silver supply being worth more than their Bitcoin. people are there's there's nothing nothing worse I think in investing than people being in something and then watching all the other assets run it cause extreme pain but we're going to get to that today and saying you know it's never good to be envious of other assets and there's always a faster horse somewhere but the question is what's going to happen big picture that's what going to try to dig into today and the structure of our talk is a bit different but first of all mand Ando, good morning. All good in the hood. >> Yeah. Did you miss me? Sorry. Sorry. Here last week. >> We did. >> Yeah. >> What I would say is a very interesting obviously >> there's a ton of stuff happening across that. >> So, um there's there's opportunities to make money. Let me put it that way. >> CTO, what's going on in your world? Yeah, I think you everyone has to kind of learn to tackle the FOMO feeling because uh one way that I find it helpful is that there's literally 1,000 assets that are going up every single day. You simply cannot wake up and feel bad for missing all those 1,000 every single day. But of course, it is difficult when silver gold is going up like this. If you're not owning it, you start feeling bad. it feels like everyone else is winning and so on so forth. But you have to get over that feeling because what will happen otherwise is that you will capitulate eventually and buy the pico top of whatever parabola it is in whatever asset. So that's one theme for today maybe. >> Exactly. I'm a big believer in mean reversion and if you look at the historic silver chart for example or the Monero chart etc. they always kind of mean revert. So this is more of a could just be a massive short squeeze to some extent. Marty, what's going on in your world? What do you see happening out there? >> All good. I mean, as usual, this is exactly what I expected. Nothing is out of the normal. Normally, this these macro bottoms happen and then gold and silver rally. All we have to see is what's the next levels. Gold 5,000, silver 100. Um, and you know, Bitcoin is is obviously going into its bare market. Um, and looks like it's playing the WO off perfectly. So, as expected, I mean, just watch the road map. Just watch the Woff is telling you exactly what's happening. They will do one final flush out for sure. But, I mean, I think the important thing is time horizon, guys. Depending on your investment time horizon, everything's different. So, anybody asking quick questions about what to do, why do I miss out? I mean, what is their time horizon? If you're buying Bitcoin, for example, for 2030, these ranges are insane. We came from 16,000. What do people expect? Right. >> Yeah. Well, the big the big question I want to kind of tuck into here is uh when I see things like gold and silver run so fast, I actually get a little bit excited because it's a harbinger of things to come. So if you look at the gold, so every every time gold market cap goes up, you know, there was there was talk for a decade that one day Bitcoin would hit gold market cap. You guys remember all that for the last 10 years. Now gold has just reached a $35 trillion market cap. When you break that down, that means if if Bitcoin hits market cap parody with gold, that's a $ 1.8 million Bitcoin. So I'm going to kick this to you, Mando, first. Are we delusional here? Um, are we going to spring or sink? There's lots there so many there's a million opinions out there as to what's going to happen next. A lot of people are hoping for 70k. A lot of people think we'll struggle in this range, sub 100 for a while. We've been here for nearly 90 days. What's going on? >> My gut tells me we are going lower, I have to say. um and may not may not be what people want to hear, but my gut tells me that just the setup here just continues to feel like something needs to like properly break for crypto then to like be seen as the asset. And in this sort of range where everything else is hitting alltime highs, Bitcoin seems to be struggling. And I think CTI will probably show that in the charts as well. Like we had a bit of a breakdown again. So my gut is that we could be in for a little bit more pain. It doesn't necessarily change the long-term out uh appetite here, I think, for for crypto. But yeah, uh I don't think if you're get if if you're facing a lot of personal anxiety right now because metals are going higher and crypto isn't, I don't know when that's going to that's going to change. I do think that this whole situation in Japan may be it. Like if that starts to spiral, um I do think that that you could see a bit of a Bitcoin trade on the back of that. That would be like the most obvious one. Potentially the market structure bill, although it looks like that's maybe going to be delayed. Those are the two like short-term ones I'd see. Or we see some it's a narrative right now, but it's a narrative which seems to be growing. And I was at the real vision conference this week and I met a bunch of people and first thing everyone mentioned to me was about quantum. Everyone's talking about it, even if it's not threat. Uh, and I think that narrative needs to be addressed somewhat head-on by the Bitcoin core devs at the moment. Um, >> in fact, Vitalic and the Ethereum Foundation have already funded a million dollar, >> right? >> Multi-million dollar quantum proofing project. >> That's the sort of thing even just something like that, some sort of organization by the Bitcoin Cordes, I think would change the narrative around it, which may also lead to like a candle because I think everyone's sitting there right now and going like this should be going a lot higher like all this. >> Um, >> Marty, I think you're tapping your fingers. >> Yeah. >> Sorry. playing the piano again. >> There is uh there is obviously some elasticity to supply in some of these metals, you know, like they we will find more gold if it if it doubles. We will find more silver if it doubles. In the short term they are inelastic, but in the medium to long term we'll find it. >> Yeah, >> there isn't for Bitcoin and it does have that digital gold narrative and and somehow it's broken down. I think now either something really has to break or we need to address quantum I think to to kind of see that bounce. >> Yeah. Well, let's look at the chart. You mentioned that Mando. Uh walk us through silver, Swiss Frank, copper. >> Yeah, exactly. >> So, let me just first show what I tried to say before here. So of course everyone who doesn't have silver feeling of course enormous FOMO right here but like the controlled entries were here in April 2024 and maybe here in May 2025 there was one more setup in November 2025 but buying something here is is gambling. I have no idea perhaps it will go much higher. uh but what has happened in the previous times it has run like this is that there have been corrections so and they can be brutal so at some point this will correct that I have no doubt about and it will be brutal and unfortunately most retail they tend to buy like the pico tops of this FOMO when it's as most euphoric as possible And unless you have some insight into the world economy that no one else has, it's very difficult to know when it will turn. So I feel that the riskreward to try to, you know, do something now just isn't there. This is how the altcoins often look. >> Yeah. >> If you've been here for some time, the charts look exactly like this. and meme commodities. It's meme like we had meme stocks. We they had meme coins and now it's meme commodities. Like all these people like random people are loading up their Robin Hood account and buying palladium. Like it's it's a weird >> Exactly. So it's kind of difficult. Let's switch to Bitcoin which looks quite different from the uh chart we just looked at. So clearly it's not behaving like digital gold at this point that much we can say. And from a technical perspective, exactly like Mando said, this has not turned yet. Of course, it could be that, you know, this range here and ends up holding and it reverses from here, but that's pure speculation at this point. This is a wedge that broke on the downside. The trend is still down. It hasn't turned yet. And then, of course, we don't know about the future, but there's no clear signs of this turning yet. Exactly. like Mando said. So that's what we can see in the Bitcoin chart. >> One thing real real crude to point out here is we did have that big breach down to low 80s a while back but ever since then the 85k has held up very well for the last 3 months. >> It has absolutely. So that's if I remove these is perhaps that's clear. So it could be that this range here will end up holding and that it becomes a rectangle reversal pattern. It actually looked like that already in what was it two weeks ago right on 14th of January. This was a legit breakout but it didn't hold. It fell down again but that could happen again and you know maybe a second time is a charm and it actually turns here. A rectangle uh pattern can be a strong reversal pattern. So it can absolutely happen but we it hasn't happened yet. If it does we're not going to miss it, guys. We're not going to sit here and and miss it. So no need to be stressed. We will hopefully see when it is turning and um then I will take it from there. >> Yeah. And I go back to uh money, we have had no flows into the ETFs. We've had drainage as well. And there's a direct correlation between the action there. If we look at the US spot ETFs going back the last basically since 1010, it's just been slow drainage. And until those things activate again, until maybe, and it goes back to rotation, Marty, perhaps um you know, bees always go to the flowers with the most pollen. Right now, those are things like a gold and silver and palladium and Robin Hood and whatever else Mando said. H do you believe the action in other assets is taking the oxygen from the Bitcoin room? >> Um perhaps. I mean, there's been a lot of outflows from Bitcoin and Ethereum ETFs for the last couple months, but only positive inflows for Salano ETFs. So, I just think it's just repositioning. At the end of the day, I think uh we're going through a like I said a macroeconomic transition. Gold and silver are repricing. Bitcoin is doing its woff and it'll catch up to money supply which is at all-time high nearly hitting 100 trillion. Um, everyone is printing. If I look at my charts here that I do detailed global liquidity, China's at 48.9 trillion. They've only been printing more money. Russia's at 1.6 trillion. Japan's at 8.3 trillion. Massive big candle over the weekend. EU is at alltime high 19 trillion. They're all printing money. So, are they printing money and buying gold and silver? Probably, right? Um when when gold and silver break down, that's what we're looking for. When they have their blowoff tops and then where will the money go? that that's when I'll look at where where's the money going to go. This is a you know macro monetary reset. So the the money will flow. Where will it flow? I think it will flow as usual, but the allocation to crypto will be much larger than the last time. >> Um in my opinion, we're at the bottom of a bare market right now. >> That's what the W telling us. Put up that chart I sent you today. Um I sent you another one looking at silver and then look at bu Bitcoin. Look at that chart in the WhatsApp. Put that Let me let me dig that up and pop it in. >> That's all I look at. >> I don't really get caught up in the weeds, guys. It's all meant to trap you. >> Mando, you mentioned Japan. Um, from the Real Vision conference. Was there a lot of talk about this being the black swan or was it just, you know, we we've seen the carry trade unwind for the last 12 months? >> Maybe it's nothing. >> It has been nothing, but it does seem like they're now going to do some intervention, right, where they're literally trillion dollars to buy to buy yen. I think that that is the first time we've seen that for a little bit. Um, and maybe that's the beginning of worry about this. The ris the issue about this is Japan's debt to GDP. Um, there's like an echoing. I don't know if Marty it's coming from you potentially. Um, >> weird. >> I think I think it I think it's coming from you. Um and I think the the reason for that is um is the debt GDP ratio is so high in Japan. So if this does continue to go higher, this will have a a very worrying effect on the yen and and that could cause a rush from Japan, which is like 3% of global GDP, maybe even higher, um to to other other alternatives. Gold has been the main thing that people have been talking about. obviously it's a bit more integrated into Japan um as a you know that they were slow to pick up on Bitcoin and and they've only really recently gone into crypto but I do think Bitcoin could really benefit in that sort of world like just seeing a a you know a top country in terms of GDP go through a spiral like this I think would really prove that we this current system is is is fundamentally broken. >> Exactly Mando I always say Bitcoin loves a crisis. one of my old expressions. Let's talk about while we're on the topic of money, there's some changes happening that could be beneficial. We've got this guy Rick Reer. Um he is the chief investment officer of Black Rockck. Larry Frink is now the interim head of the WF. And the Fed has always been on the horn with the with Black Rockck whenever there's a bond crisis, financial crisis, C19, etc. The the biggest money runner in the world is very closely aligned with the Fed. Now, Rick Reer is now top in the seat. I know Marty, you probably follow this stuff, too. He likes low interest rates. Uh, he could slash take us down to 3% or 1% or 2% in very short order and run the economy hot. Uh, is this good or bad for Bitcoin? >> I mean, let me start again. I don't believe any of this influences Bitcoin. I believe Bitcoin is is manipulated by large players, large institutional players. So I'll started with that again. Um the will this influence Bitcoin stuff I don't really buy into. I think uh he's very good for the for the global economy especially for Trump's plan. Um he's always been a proponent of Bitcoin since early days. He's been a big Bitcoin evangelist from the beginning. Um he's I believe the person that influenced Larry Frink and turned Larry Frink around into understanding Bitcoin and and its value and so yes absolutely he would be very bullish for the sentiment of Bitcoin 100%. Um he's a great guy. If you watch the Ral Pow interview with him it's mind-blowing. Um he predicted a lot of what's happening now. So I believe Rick Reer is a strong candidate. In my opinion it's between Rick Reeret or obviously Moran. I'm a big Moran fan. Um but that that's the big news is this week we might get more information on the Trump pick. Um it's coming down to the wire right now. We should know very soon. >> And then the dollar is also tanking. Uh CTO the Dixie. This is normally also very good for Bitcoin when the dollars get weak. But think about it. If you have an asset denominated in the dollar, dollar goes down, the asset goes up. And this is what's really bizarre. If you take the true dollar value in a basket of currencies and and the current price, you know, Bitcoin should be a lot higher. Um, CT, any thoughts on the Dixie Mando as well? >> Yeah, absolutely. I can show some uh charts just to touch on what we just talked about. So, here is the Japan 30-year uh bond yield. And I mean, this did it feels like like it happened just now, but this journey actually started already front and it's been going in this direction since. So that's an interesting perspective on that Dixie. So definitely the dollar is under pressure. And >> what you what you should show is a chart of the Japanese 10-year yield versus silver. That's the chart that tells you everything. It's literally following each other. >> Interesting. I'll bring I'll bring that up as well. Uh so the dollar kind of was very strong here until 2022 compared to the other fiat currencies. Then it broke down. It broke down again here last spring in 2025 in April and then it stayed below here. But I think what is maybe what is not visible here is that you we're a lot comparing garbage versus garbage a little bit. But what was very striking to me was if we start comparing the U Swiss Frank for example versus US dollar like one of the currencies that is behaving a little bit differently then it's a very different picture here it's showing enormous strength uh over quite long time clean setups new breakouts so this is in direction of Swiss Frank versus US dollar so this going up means The Swiss Frank is is becoming stronger and dollar is getting weaker. And this is happening not only on US dollar, it the chart basically looks almost the same on Swiss Frank versus Euro. This is basically breaking out now as we're recording this. So, and I feel that this is a shift. I listened lot I felt for the first time this year the World Economic Forum was actually interesting with I think there and everyone. And I think it was a lot of interesting conclusions and people are kind of worried that the it's an irresponsible spending from the governments and one one of the >> uh key people there said that in like 1920s and so on it was the private sector that was responsible but this time it's the government sector they are printing out of control and um that seems to be the case both in the US and maybe Europe as well to some extent. So I am a little bit worried here actually for the for a rapid drop of purchase power of of the US dollar fiat for example that you know they will print more money and do all these things bail out Japan >> u and everything else. >> Yeah and this this these are all again everywhere I look I see nothing but really good tailwinds for the Bitcoin space. But the other thing I would like to mention and it goes back to one of the things I sometimes say is risk happens fast. So if you look at the action on silver just since the beginning of the year nobody saw that coming. It just went vertical. It completely outstripped the performance of gold by a large margin even going back in time. U Mando in terms of risk happening fast. Could we wake up one morning and then we see the massive crisis happens and then everybody says we need some schmuck insurance for this. Let's go buy some Bitcoin and that goes to the moon and the OTC desks are empty, etc. Because we see Michael Sailor keeps on buying handover fist with another 3,000 um today was announced and he nearly has if you imagine 5 million Bitcoin or lost he nearly has 5% of the supply. One guy, one company. I'm not as I mean sailor buying is going to be a constant but but a a top five GDP country going through a debt spiral and having to print their way out of it or basically sell all of their US dollar holdings to crop up their own currency. That is an obvious Bitcoin trade. That's an obvious Bitcoin trade. Uh how on the back of that you couldn't say oh this is going to be a uh a new monetary system that we need to move to. Some people might say we need to go back to the gold standard, but again like the supply is inelast there is some elasticity of supply. Like I actually met a guy based in um there's some echo again mi uh in Miami where who who works on old gold mines and like extracts is extracting more value from them now because suddenly the economics of that has gotten way more attractive. So like uh mines which were previously like shafts which were difficult to get or older mines which weren't as productive, they're now looking at them again and being like right we suddenly with new technology we can go into some of these these shafts and and and find more gold. Like there's nothing with that with Bitcoin. So it's if you can get over the quantum risk of it, let's say, then I think it's just a very very nice asset though. >> Yeah. It's like shale oil. when gold or oil goes above 90 bucks, you can pull the oil out of the sand in Canada and it's lucrative. But this one here, a lot of people believe uh Sailor's on track to no matter what, he doesn't care. He wants to get to a million Bitcoin. He's nearly at 3/4 of a million Bitcoin. That would again, he's also buying up on any excess supply while the ETFs are absent. If the ETFs come by and he continues, this could shake things up. Anyway, enough on that. It is interesting. Somehow going back to your inelasticity, people see that, but the market isn't ready to step in yet. Eventually, the time will come. We just don't know when. All right, let's get back to some other >> Can I just add one point on that? I think so. Why isn't it happen? Why Why isn't it going up? I feel that one thing I learned in crypto is that the price action creates the narrative. It's not the other way around. So, the narrative is there, but but price isn't moving. So then it feels like oh the narrative wasn't true. Now the gold is moving because clearly some central banks are buying large quantities of of it. That's why it's going up. It's not going up because of the narrative. It's going up because of the action of buying. So I feel that if that changes if suddenly buying is back okay then the narrative is true again that it is the new monetary system and so on. So it just takes that it just takes enough buying power and then it the narrative can be back and it can start you know be the digital gold again and at some point I'm almost sure it will happen from my perspective the lower the prices when it turn the better because then the more money we can make. >> Yeah good point. Okay a lot of people now are again debating what they should do. A lot of people all of a sudden had windfolds. You know, maybe it's part of the big uh a lot of people are earning uh or taking in retirement money. They're being left money by loved ones, etc. And I've seen a lot of people all of a sudden have 200k cash in their bank, $50,000, $100,000. And people are questioning now, what should they do? What should they buy? So, we sometimes ask these questions. Uh what would we'll do a quick round the horn here. you have 200k. Do you go leverage Bitcoin long on Coinbase or do you, I don't know, invest in other assets or AI or chase the precious metals? Mando, quick one round the horn. Somebody dropped 200k into your pocket. What would you do? Deploy whole cash, buy JP. >> I'm a little bit wary on on on the L1 trade just because of what's happening with Bitcoin. But but one thing I am very very bullish on at the moment is AI and the whole agent space starting to to come to life. Um I don't know if you've seen but there's again over the last two weeks this whole move towards AI agents doing things for you has taken another step. There was this Claude bot thing which has gone viral and everyone downloading it and using it to trade on Hyperlquid and um I do think that decentralized trading these bots is like we are getting there. I saw people being like giving these bots oh hey just trade on Hyperlquid for me. You need to you need to survive. The only way that I'm going to pay for your server fees is if you make money from this. Um I think we're about to enter that world pretty quick. Maybe I've been saying it for a while, but every single week I I go like this, this is really really close. >> Yeah, >> I am bullish on um Hyperlquid in particular as a venue for that. Um I really like apps in crypto um which use crypto as the as the rails and then have a very direct um path back to the the token making money. So I I really like that one. I think Hivelick would be would be an interesting one to look at here as AI picks up um and has like a direct link back to the to the revenue. >> Interesting because you know we do know that there are five DAPs on one chain that make more than Ethereum. Um and there's also Hyperlid that is making a ton of money. There's also a new one too. I forget the name of it that's making even more money than Hyperlid. A light and and lighter and hyperlquid are the three main ones, but I think hyperlquid has generally won that war. It does feel like won that war. >> Yeah, disappear. Marty, what would you do now? I know what Manda's looking at. >> Um, it depends on the timeline. What's your Is this for 2030 or is it for >> Yes, 2030 like 3 to five year time frame. >> I think you've got to you've got to allocate significant amount of that to Bitcoin and uh and L1's in my opinion. L1's that are regulated, L1's that passes commodities through clarity, >> stable coin movers, tokeniz, anything involved in tokenization. I do a a combination of Bitcoin and L1's heavily adopted for tokenization. >> Yeah, we're going to come back to that one actually. L1's and tokenization and if there is a play there, but that's a really good input. So now we have Mando saying he's afraid of L1's right now, but he likes I feel good. and you're the opposite because there's no one that has like a direct buyback part of it. Other than that, it does feel like that if all my trading groups are trading metals, maybe that's the top, but maybe I just I feel as though that that trade a lot like copper feels like a metal that could could still break out. I know we spoke about that a little bit before in the show. Um and I still like some of the the stuff breaking out to all time highs like Google, but the um they're stopping crypto which I like. It's just that right now it feels like with Bitcoin in that range, it's really difficult to go like, \"Right, I'm going to call a bottom. I'd rather wait for a bottom to be confirmed.\" >> Yeah. And you're right, oftentimes the bottom is made by a massive capitulation event along the lines of 1010. Uh, we'll see. I think the leverage is a little bit scarcer these days because people got burnt in 1010. So, it might be more difficult to have a capitulation event like that. CTO, what would you do? 200k fell falls into your pocket today. >> Yeah, I don't really buy and close my eyes like that. I right now right today I don't see anything that is obvious buying opportunity. Last week platinum had a clean new setup but now that has already reached the target as well. Solana perhaps is bouncing a little bit of supports and so on. But I don't really buy and then hold it for two years and and or five years and wake up. I try to react. I I my perspective is more like this. I right now it's hard to find new setups in metals very difficult. The right entries were long time ago and stocks many alltime high kind of difficult. Bitcoin looks weak right now also difficult. But what I know for sure is that next week, next month or soon there will be new great setups. I you know it's like waves in the ocean. It's not like the last wave has come and you missed it. That's not how it works in the market. So, I will look out for the next clean opportunities and try to take it. Try to see what the narratives might come next and uh watch the charts and uh enter with >> if you want another detailed if you want to I know the people out there like details. What I would do based on WOF should expect to run towards 90,000 again. We might have had it this morning and then we'll see the spring. It's going to coincide with the $210 million gamma release January 30th around that time frame. Um it'll test support. Obviously first support is the lower liquidation levels at 83300. 82500 I would say was the beginning. If it breaks through that support expect a spring lower probably under 8,900 testing that previous low. I would say the spring the low the potential low will be the Fibonacci at 78,000 somewhere around there. That would be sort of the 5 to 10% probability. That's how I would enter the 200,000 right there. >> Yeah. A lot of people a lot of people believe with this 200 million your 200 billion gamma release will take the lid off the price action and release it. But we thought that back in December too. Is it true this time or is it the same thing all over again? >> We weren't in the Woff accumulation in my opinion then. I mean we start started in November 21st but it's manifested now. It's very clear what's happen to me what's happening. Been here before. This is my fifth WOFF. just looks exactly the same. It always gets the sentiment like you guys basically even the sentiment on this this DCA today. They they're manufacturing the sentiment and uh I see it on the timeline and it always plays out the same way. There'll be a spring and then a markup towards the SOS back to resistance and then onward and upward and then as CTO just said I agree 100%. Price makes narrative tomorrow morning if the price pumps the narratives will all change. Um, so that's that in my opinion what will happen. Then there's another 86 million gamma release in February 17th where I believe we'll be testing that resistance at 96,000 um and and onward up from there um there. So in my opinion that's what's going to happen. We'll watch it play out. It's been very accurate since November 21. >> All right, let's talk about tokenization. Uh there was a very interesting piece released late last week from Kathy Wood and Arc Invest and they looked at the biggest opportunities through you know the best ideas 2026 one of them was the second largest TAM of all was tokenization of everything 11 trillion >> that took me by surprise so the questions we have here this is Salana is it scaling or failing I think they're still building they're still getting faster it's still getting better but you know the sentiment is sucks and nobody's jumping in. But the ETFs are under constant accumulation as you pointed out Marty earlier on. The question I have for everybody here >> a lot of people think okay well if you need to tokenize stock markets like NASDAQ you need million transactions per second you need finality of 30 40 milliseconds etc. There's only one game in town can do that. But a lot of people also say this is where it gets tricky. They say well you know what the New York Stock Exchange NASDAQ they can build their own blockchain. I would like a technological point of view from CTO and Marty why that is not likely. CTO first >> the global protocols tend to win. This idea has been up many times in technology history notably in the beginning of internet everyone was going to build their own network which was optimized for their own application. In the end that didn't win. And why is it like that? It's a very long discussion but the global you know ecosystem it feels like an washed out word but tends to win. The global innovation tends to outperform what a few engineers in the local office can do over time. So that's why it wins and that's why I think it will be the same here. I think the global public protocols in blockchain that's uh protocols like Solana, Ethereum was the main contender before but they lagged uh where I think will beat the pro private protocols just like TCPIP and many other protocols beat the local attempts. >> We also heard something else. I'm going to dovetail it because it's a European story. The EU at the WEF believe they're going to build a new X social network and they're calling it W, which is for freedom of speech and truth. So, what legs do you think the EU has to build their own social network? And then they just said they want to build their own Google and their owned AWS and everything else. Is it a pipe dream or do they have a chance? >> Imagine the cookie popups how compliant they will be. Okay, technology perspective number two. Marty, tell us can a stock exchange build a protocol to be fast, quick, safe, decentralized, reliable, etc. >> I mean, look, I mean, I think there's so much ignorance. I watched the entire Davos thing and I agree with CTO. It was the best one of all time in my opinion. The the Ken Griffith, Larry Frink, um, and the EU woman was the greatest debate I've seen in a long time. Anyway, the takeaway is that I think there's still a lot of ignorance in understanding of what blockchain is. Um, EU, you know, going, \"Oh, we'll do it ourselves.\" Even of X, I mean, what you just said, I think there's a lot of ignorance. They don't really understand what it takes. They don't really know what it is. Larry Frink knows the most. Um, he understands tokenization. He understands decentralization. That's why it's so gung-ho. But we've been building blockchain since early 2000s. You know, I was part of Corba, um, the the first decentralized system. And we've been doing this for a long time. It is incredibly complicated. The complexity in the cryptography is mindboggling. Um it's extremely hard. Consensus is almost impossible to design um and get right. Um especially you know things like to protect against 51% attacks, long-range attacks, things like that. Nothing at stake problems etc etc. Security civil attacks, Eclipse attacks, I mean you name it. These things are extremely hard to engineer. uh scalability, performance, trade-offs, the whole dilemma to get that right. They've all tried, they've all failed. Look how many blockchains have come and gone. Um networkked effect to get to get people to use it unbelievably hard. And decentralization is the most important part of blockchain and open source. And if anybody does it themselves, they're going to, you know, they think they think they they want they want a piece of the pie. They don't really understand the technology. So, the only chance they have, and this is always a non-zero risk, is that they fork a very successful chain, right? because it's open source. So they could fork Salana for instance and use it and that's not a it's a not a nonzero probability they try and do that but nobody will use it and that's that's the bottom line. They already have centralized databases with extreme performance. Um I worked for Oracle. I was the CT of Oracle or CTO of Fiser. Databases are unbelievably fast data centers. Uh the cloud they've already got that but it's centralized. Therefore it doesn't have trust. The whole point of blockchain is no single point of failure and lack of government trust. So a government can do it and if there's any single point of fail, it doesn't work. So no, I don't think and the costs, it'll cost billions, trillion to make it your own blockchain to compete with these things. So I don't think it's happening. I think it's a pipe dream. I think all of these things are FUD narratives because price makes narrative. Um when when the price goes down, these all these topics come up. These narratives come up. when price goes up then you know the changes instantly. No, I don't think they can. I think they've all tried. JP Morgan tried. You name it, they've tried building a blockchain and getting the network effects and getting a community of developers around the world to actually maintain it and and and uh bring it up and and and people to use it is almost impossible. There's a thing called the Lindy effect. Go and learn about it. These blockchains have passed the Lindy effect. There's no turning back and I think it's extremely hard for anybody else to compete. That's my opinion. >> And then what what I believe is also possible, Amanda, check me here. If there is a core exchange, there'll always be competing exchanges and could it be possible that there could be say a NASDAQ exchange and then parallel to that there's a tokenized version of it running on multiple blockchains. Would the NASDAQ open themselves up to that? tried five perspective. >> Yeah, I think what what's already been said here is is traditionally how these banks might try and do it. Like I've traded at banks and and you have like five different risk systems even within the bank. Um like you have one for fixed income, you have one for equities, you have one for commodities, like it's a disaster. So the idea that they may decide to all choose to share one is the hope. But some of these people might be like, \"Hey, I'm going to try and build it my myself and have some proprietary tech here.\" You might see a JP Morgan blockchain for a little bit. You may see a a uh New York Stock Exchange blockchain. I agree that over time those things will will be pointless. Like there will have to be some level of um conformity, let's say, but it is um it's kind of annoying to see this from from some of them at the moment, I would say. Um every point they fork them, but like you could end up with a lot more centralization risk there and I think that like something disastrous will happen and they have all realized that there is a need for decentralized platforms. I mean another point always to make is that you know you don't want one thing. One thing defies the single point of failure. You become a single point of failure. You want that's why I like the fact that tokenization right now seems to be going if you look at the latest Clarity Act writing I just read it this morning. It seems to be going to Ethereum and Salana. Um everyone's going to tokenize onto Ethereum and Salano. So you have two options. Remember that's tokenizing the dollar, tokenizing debt, tokenizing money markets, tokenizing equity, tokenizing real world assets, tokenizing everything. Silver will be tokenized. Gold is tokenized. So you you don't want to have it all on one thing that creates one single point of failure. So having the dual networks is a great idea. I think it's a terrific idea. >> I don't think you want one. >> And in fact, it is interesting you say that, Marty, about all roads are leading to ETH and Salana, which is good, >> you know. Um and also in terms of tokenization of everything $3.5 trillion of value is already traded in tokenized format today correct >> on blockchain $3.5 trillion. So it's not like it's a vision for the future. It's already landed and that's what's big and stable coins will be big. The dollar is in a world of hurt and I know Bent and others are going to do everything they possibly can to find a way to create yield on stable coins because the Clarity Act right now forbids that because the banksters are in play. Um any update there Marty on when we could >> Yeah, the Clarity Act I mean I talk to people all the time. The Clarity Act there's a lot of obviously a lot of narrative around it. Um first of all they bundled up too many things into one act. That's clear. There's too many stakeholders at the table. There's too many conflicts of interest. Um at the end of the day, the Clarity Act was initially written to bring clarity and classification to blockchain tokens um in order to classify them and put them under the correct regulator. And over time it was just added with you know more genius act amendments which is the yield problem. Um you know what is a layer two the classification of uh defy all bundled in there and obviously you know that just creates roadblocks in the regulatory and voting situation with with one senate um which are very ignorant to explain everything you require to understand the clarity act right now to someone who doesn't understand crypto is almost impossible. So expect it to take a long time. these people don't really understand any of the stuff. So, and then the stakeholders in the room are banks um and exchanges, centralized exchanges, which uh you know, I had a long discussion with somebody you all know, but who who stands to gain the most with no regulation? Centralized exchanges, right? They're making unbelievable amount of fees. They can manipulate. Um so, they don't really want these these acts to pass. So, they're going to fight like dogs to not pass them. Who wants regulation? We do. the investors, the traders, the builders. >> I'm going to challenge you there, Marty, in that because you know Brian Armstrong, a lot of respect goes out to him. He's the one that called BS on the Clarity Act and he's been a champion for it, the only one from the crypto side. So, while CZs and others are quiet, Brian Armstrong was actually very vocal. So, do you still stick to that that the centralized exchanges do not >> I have my own theories. Uh I have my own theories. I think layer 2 are at its extreme risk of being classified as securities and security venues and so it jeopardizes everything he's built. There you go. You want to hear it? That's that's what I believe. >> Okay. >> I don't think I don't think it's uh what you think. >> All right. Let's switch gears. And this is let's go back to questions. The poopcoin tax harvest. It's like a lot of people are feeling a sense of urgency right now. 2025 was a lost year. If you were in Bitcoin, you lost three or six% or whatever it was. And people are now looking at the clock and they're looking at the retirement timeline and it's like, how do they catch up? But there's some decision points need to happen. First of all, the poopcoin harvest, should they a dump and consolidate everything into Bitcoin or b hold and wait? Because in reality, when you look at certain things like Jupiter or Hype, etc., They're close to the bottoms and it's probably not a good idea to sell these things at the bottoms. Mando, to you first because you did say at the beginning you're worried about layer ones, but then you said hype is good, which is an app or quasi a layer one. Um, what would you say here? How would you gauge your poop coins? >> If it's an app making revenue, I think I think it's it could be in a better spot basically. So, >> you mean hold? >> Yeah. If it's just an altcoin, I I think I think it's I mean, I'm never a fan of just owning altcoins. I think you can only buy them at certain points, normally during breakouts, and the rest of the time they just get smashed and smashed and smashed. So, I I see very few old coins right now, which I like that story on. So, yeah, I think it's always a good time to consolidate into Bitcoin. I do like certain apps. Hyperl is the most obvious one right now. I know Jupiter does a buyback, but they've been talking about not turning that off. So uh for for now the my favorite app is is definitely >> and in fact what's interesting too and I'm sure you've been tracking this Mando is prediction markets excuse me are going on chain and Jupiter has a big play working I think with Kouchi right now as a counterbalance to poly market so and they're making a lot of money from that so prediction markets could be a little bit of game changer and what Manda said is so important always as follow the money look at the revenue these things are making and look at the adoption If they make revenue and they have adoption, they'll eventually float to the top. And that's simple. If there's no adoption, no revenue, boom. One thing is also very unusual in the crypto space is you can see loyalty. Maybe I'm going to ask you this again, Mando. Loyalty through apps can be very fickle. You know, for for nine months or a year, one app could be redot and then within six weeks, everybody migrates to another application. Talk to me about that. Yeah, I mean that normally is linked to some form of airdrop campaign or or something along those sort of lines. >> Correct. >> Yeah, we saw that with the perexes. I do still think normally the best product wins over the medium term. So sometimes the best trades are buying the bottom of that sort of a rotation in the best product which is why hyperlquid might be an interesting one. We saw that with like the the token launch pads as well where like I think pump has kind of found a bottom here as well and it's generally seen as still the strongest. There's a there's still a trade there I think on that rotation back to the main one. Um Jupiter Jupiter has a bit of a moat I would guess on on Salana but there's still quite a lot of other players there. So I don't know if it has as strong versus some of the others. I think you're muted, James. >> Sorry. Thank you, Marty. Marty, your your choice. Bullet to the head for the poop coins or hold them and hope. >> Yeah, I mean, if you if you were heavily invested in poop coins and you're down heavily, then I mean, I don't know what to say. Um, it was a bad trade. Uh, I don't know why people put so much money into poop coins in the first place. Anyway, it was all aliveness test. What you got to think is all of those meme coins will be replaced by, you know, proper companies with business models and boards and the tokenization of those things will use the venues that have been built for memecoins which have performed unbelievably well at the infrastructure level. The prices are completely separate. So memecoins to me were never a real thing. I I know a lot of people love memecoins, but I think it was a livveness test. This comes directly from people who built these infrastructures. So, um you got to replace in your mind meme coins with actual tokens, the tokenization of anything. So, the infrastructure moves the tokens at high speed, has launchpads for tokens, and it's a token economy. the if you're in memecoins right now and they're at the b the low. If you're in old coins now at the low, it is like Mando just like Mando said, it's a good time to switch right now. If everything's at its low, that's a good time to slide around. That's a great time to reallocate. Okay. Um, put it in something that's probably going to appreciate. Um, the there's a high probability meme coins never recover. Um, some might, maybe new ones will come along, >> but uh, they're, you know, they're seasonal. They come and they go >> and the rule of thumb is >> at the right time and get out at the right time. >> Mean point season is when you're in and you exit, you know, it's a bell curve. You get out at the top. >> And a simple head check as well for everybody listening is 99% of crypto is going to zero. So, you need to weed out that 1% of winners. And that is sometimes not easy to do. So again, look at the money they make, look at the adoption, look at the moat, make sure the technology is solid. Another interesting left field question that came in was, I'm 41 years old. I feel like I'm very late to the game. I only have 0.47 Bitcoin. Call it half a coin, which I think is a substantial amount. What should people do? What's their path forward? They're getting nervous now, especially in this age of AGI and AI. Um, the pressure's on and I'm feeling that wi with people out there. CTO to you first. Uh, your pearls of wisdom from that Swedish mind of yours. Half a Bitcoin, 41. Should they do more side hustles to build a bigger bag? Are they comfortable here? >> Yeah, I don't think they should stop uh trying to get more money. I don't think it's enough to if if that's the question. But it's, you know, it's enough that is worthwhile to learn trading, learning investing and uh try to grow that um capital. It's like, you know, it's not a small amount, $50,000 almost and um have a Bitcoin. So, I think that should be the strategy. It's definitely not the right strategy. I don't think is to call it a day and then move to the beach and start drinking beer and wait for the wealth to flow in. I don't think it's enough, but it's definitely enough to start uh trying to get better at the game. Try to learn trading, investing, and try to grow it. And I definitely think that's possible. >> You're giving me ideas. Beach and beer. That sounds very attractive. Sounds fun. >> Okay, Marty. Uh give give this fellow or lady some advice. Yeah, I think uh first of all, the sentiment right now is awful. So, anybody coming into this this question at 41 years old and hitting the sentiment wall is probably going to be fearful fearful of everything. Um I feel like they're late to the game, but you're not. Um, in my opinion, we're at the macro bottom. Uh we're now going into the probably the biggest expansion in history. So pretty much anything that's a viable part of the infrastructure of the new economy is a great investment from AI to Bitcoin to Salana to to to anything that moves tokens um to to metals. Anything that's priced in dollars is is probably at its bottom right now in my opinion. There might be a pullback. The Wov says they will do one more pullback. And if you look at silver did the same thing right before it ran like this. Um, the WOVF caused the spring and gold and silver had their spring. Bitcoin's just about to have its spring. Um, and then I think we go we run to Ral P's inevitable banana zone. Um, I believe they're going to have to print$10 trillion minimum just to get going. So, if you're 41 years old right now, first of all, we had in a previous DCA we discussed that your most valuable thing you can do is have skills. CTO Lawson brought that up. Skills. So, don't just give up. Don't just say, \"Oh, I'm going to become a full-time trader and and that's how I'm going to make my money at 41 years old.\" You can't give up. You got to work. You got to create liquidity. You got to have income. You got to And it's a great time to do that. You can start your own business with an AI agent right now. Um I have friends, they're 23, 24 years old. They quit their jobs and they have they vibe coded AI agents that replace employees for, you know, small businesses and they're killing it. There's unbelievable opportunity right now if you're 41 years old. Exactly. Start your own business. >> There's there's a guy in the Bay Area who spun up 30 startups in a month using AI and AI agents. 30. And he know he's clever enough to know that hey 29 might go to zero, but if one hits you literally go on AI right now and say AI, I'm 41 years old. I want to start a business. What's the best thing to do? And it'll literally give you a thesis and a game plan for starting a small business. It's unbelievable. So AI will give you the idea to create your own AI business. Um it's unbelievable. My brother just left Deo to start his own company in AI. Um you can imagine he left go a huge salary and he's 41. So this is the time 41 year olds this is your time. >> Yeah. Yeah. And you can build >> for the first time ever in history. You can actually build an enterprise, you know, an accounting department to finance department, uh, marketing department, sales department, whatever, with no employees, which is which is a massive paradigm shift, Mando? Um, anything to add on this one? Skills. >> No, I mean, he's not he's not late. That's all I would say. 41. Uh, you got you got a lot you can do. I I do think this is a great time to yeah be a bit more entrepreneurial. I think that I want 0.47 Bitcoin as well isn't going to be enough. So I I would just echo what was already said. Like I think there's a lot still to make here. Um you got to have a lot more of a hustle mindset even at that age. >> Yeah, good stuff. We have one other little piece of news which is I think it's slide 13. A lot of people are kind of pinning hopes and dreams again to things on the way out out there in the future. There's the the US is having a 250 year American anniversary and they believe there's going to be a lot of buildup to that event. There'll be a new Fed chair which will cut interest rates which will boost the market. There'll be more money printing, more strategic advance advances, uh maybe an SB which they kind of have 330,000 Bitcoin if I'm not mistaken right now. Um is it worth pinning any hopes and dreams to this event? Uh, Marty, you first. You follow the politics very closely. >> Yeah. I mean, I don't know whether this is to me. I haven't heard of this narrative to be honest, James. So, you're bringing this up to me. It's news. I didn't even know that it was a 250 year centure. But I believe that, you know, Trump started in his first term MAGA and he's picked it up now. And, you know, tariffs were always part of the plan with under Moran. And he's trying to make he's trying to do it. is trying to make uh the US into into have to have it its big jubilee and uh and that starts with regaining trust in the US debt. And I think all of these these things from Venezuela to Greenland to the Golden Dome to crypto to the Bitcoin strategic reserve to you know the the big beautiful bill. It's all about a green new deal. Bringing back growth to the US bringing back US supremacy. Remember the US, >> don't mention the Green New Deal. >> Saved the world before at the end of World War II. Um, they also pledged all the gold, but they saved the world. And I think it's their time to do it again. And yeah, we're looking for any any major milestone to create the Jubilee. And I believe we always said an entrepreneurial president would come along that would say that, you know, f you to the world debt. And uh, and it looks like Trump is the guy. So, he's trying. I think he's trying his lot. And you could see at Davos there's a lot of push back. They're very afraid of it because um you know he's he's pulling out security from the rest of the world and making it a western hemisphere only thing and the rest of the world are having to to pivot and think about their own security things like that. So yes, maybe the 250 year jubilee is the one. >> Davos was a big turning point by the way all over present. It's it's like a whole bunch of gangsters went in there and just shook them down. Man, did you track any of the WF stuff at Davos last week? I know you were at another conference. >> Uh, I think it just confirms what everyone's been saying, right? Which is that we are in this new he really just came through and just proved what it was all it's all about, which whether you like it or not, the US is going to be a bit more for its own interests and bully potentially to get them. Um, I think there was some brinkmanship obviously around some of the deal stuff, which I guess I don't really know why that's a surprise here from Trump. He he does that all the time. But yeah, you're definitely seeing that the US is deciding that it's going to take a far more aggressive role in what it wants and and getting it. Um I think Europe this was the big a big wake up for Europe realizing that >> there was a lot of commentary from and maybe Canada as well. There was a very good speech by Carney actually just like describing that you know the world is changing and you got you got to pick back up. I know some people don't like Carney but I I thought it was a very good speech and uh and there were some speeches by various different European officials saying the same thing. now they have to go back and do it and and I'm glad that Europe is maybe waking up to it getting some more energy independence realizing that you know the way to make money from tech is not finding big tech firms from the US and actually building your own like these are sort of basic things that you need to be doing um whether the US will do whether Europe will do it remains to be seen it feels like maybe the bureaucracy has to die maybe the EU has to die for the Europe to really be >> Oh yeah there's a lot of chatter about countries trying to exit to survive. I think Poland had the chance of adopting the euro and they said >> no thank you we're fine without it. Uh CTO technical question nobody's talking about the Bitcoin soft fork. We know uh the whole debate between core and knots. I think that was bad press as well for Bitcoin. Bitcoin should know what to do. I believe the protocol should be kept as simple as possible as a store of value, not be adding a whole bunch of JPEGs to it. What's your take on this and could this be also making potential investors nervous in the asset? >> I I think exactly like Mando said earlier, I think it's a wrong focus right now. There is one one problem that the community should really attack and that is the quantum threat because exactly like Mando said it's what everyone's talking about now and it's not good to have that like what's the solution and it should be a clear road map like here's what we're going to do step by step here's how we fix the old Satoshi addresses and or wallets and uh here's when we will upgrade step by step and here's how we monitor that we're well ahead safely ahead of any quantum development in computer capacity. >> I can comment on talking about all these other things. It's like a completely wrong focus. It's not going to move the price. It's not going to do anything good. That's my take. >> I mean the Bitcoin softboard is called BIP 110 to be specific. And around 2.38% of nodes run it. So it's a it's a very low threshold. Far from a super majority. It's a joke. It's fud. Forget about it. Don't get caught up in FURD, people. Stop fing getting fudded. That is to me the biggest problem. >> Yeah, >> people can and >> I know we're running out of time. I have one super big question that >> before before you go CG, I do want to say something regarding quantum >> and that is if there is a quantum computer strong enough, maybe Google or IBM or somebody makes it strong enough to hack Bitcoin, that means every other system on the planet is already hacked. This is forget >> there's $33 trillion in paper gold right now. Okay, that'll get hacked way before Bitcoin. >> Yes, correct. >> Way before >> the all organizing to try and upgrade and that like Bitcoin can easily do that, but right now >> is they are not and that's what's causing the narrative. I think something very basic just has to happen. Just even what we just saw from the ETH foundation over the weekend, which is, hey, we're taking this seriously. We're going to do something. Whether it's whether it's of course it would only ever be a nation state probably that has quantum computing at this stage and like which nation states really going to take with that sort of power is going to take down Bitcoin like you can only really imagine it would be like North Korea and I don't think they're getting quantum computer anytime soon >> there is actually a lot since the beginning of middle of 2025 Bitcoin core has actually been talking about quantum there's actually a thing called BIP 360 go research it go gro it full pay to quantum resistant hash scheme They they're working on it. It's all happening. There's QRAMP quantum resistant address migration protocol. Very simple. Um they'll >> there is by this very clear. >> It's just not it's just not in the narrative. It'll come in the narrative when they need it. The second when the Woff is ready to spring, they'll you'll see the narrative. Oh, Bitcoin is addressing quantum. >> Don't get stuck in the narratives there. It's all pre-programmed in my opinion. There is so much work on Bitcoin postquantum. It's unbelievable. There's at least five different proposals out there. People just don't research it. Um, you'll just simply move your Bitcoin from where it is now to a new address and it'll be quantum resistant. We had Costas from the Suie Foundation come on. He he built the crypto the cryptography for Suie and has been part of Bitcoin forever. He explained very clearly the quantum threat. It is far far away. haven't even got one. >> But again, again, it's about the narrative. Anything that makes So investors hate things that are that are in any way in doubt. And that's the problem. >> Uh Mark Carney's in the audience for you, Mando, as well. >> He says, \"Hi.\" >> And fan, just to let you know. >> I know you your your comment did trigger a lot of emotions out there. I want to repeat that in case you missed it. Manda said he's not a Mark Carney fan. >> What's up, Mark? There was good points made he made apparently in the speech. >> Did you guys see though after how fast Mark Carney changed his tune when Trump threatened tariffs? >> Yeah, exactly. Anyway, don't forget by the way, one take one more quick question. We're at the top of the hour right now. Links below for this team. We're streaming on all our channels. Make sure you follow these legends. And I want to wish everybody happy Monday. And it's very cold in Canada. Uh there's not a lot of questions which >> I have a question. >> Yeah. Do you guys think that we could see a dramatic drop in purchase value of dollar like in the near term like within a year or something? >> I think the government want to orchestrate that. >> Yes, they want that. >> Yeah. So it's it's it's very very clear what they want. A weaker dollar is better for the US. They will always want to demonetize their debt. That's the end game. >> They need to refinance their debt, export more products. They need the dollar to be weaker. It's all planned. It's all manipulated. >> Yeah. because that's kind of a big thing. Mando, Mando, what's your take on that? Should we be scared holding the field? >> I saw on the weekend that the gold has overtaken US treasuries now as the number one asset by central banks globally. That as a trend is going to continue particularly if Japan spirals here. Japan is one of the biggest like holders of US debt and today they're talking about doing a swap line basically to sell dollars to buy yen. um feels like maybe both sides as we've just spoken about get what they want from that and you have a new Fed chair coming in. So I I do think that I'm not sure if it will necessarily the dollar weakness. I think I think probably we will continue to see a weakness in the dollar but I do think that the other thing is that we could see a spike in bone yields even in that time. >> Yeah. I mean just also once again I don't want to rattle on it that's a little fatty because 80% of the debt is held by the public in social security Medicare internally in the US even Japan it's like a trillion dollars of the 37 it's >> it's it's not a huge deal but yes I believe that you the US dollar bonds are extremely under risk right now under pressure of being even degraded even further they need a plan I think tariffs is the plan um to to support more you know a a buyer of last resort will probably be stable coin um and the tariffs the big ruling guys we didn't talk about it the big narratives right now are the Trump tariff rulings which is pushed back the Supreme Court has not ruled yet that's going to be massive and obviously market structure crypto market structure which is pivotal let's watch out for those things see next week on the show whether there's been any movement >> exactly and I do want to make people reflect as well on dollar and devaluing the dollar and stuff. All you have to look at is inflation since 2020. It's a cool little chart that I did have my back pocket on how much prices have gone up. >> Hospital services 200 281%. College tuition 200%. College books 180%. Child care 160%. Open up some of those ling centers guys. It's lucrative. Average hourly wages went up a bit. Housing 111%. Remember, as money is printed, real estate goes up. It floats all boats, but it's not floating the Bitcoin boat, which is quite perplexing. And yes, shout out to the gold bugs. They did well. >> That's an insane chart, James. Thanks for that chart. That is an insane chart. >> Yeah, but you know what? If you can eat TVs and if you can survive on TVs, you're saving a fortune. They're down a huge percentage. What is that? 98%. >> But I mean, that's before silver and gold went. So now TVs will be a lot more expensive. >> Yeah, exactly. >> That's what's going to happen. Although they only use crumbs. I think I I broke it down in the amount of silver inside of an electric vehicle. It's only like $100 worth. So it's now it's probably like $300 $400 worth. So it does it does add up for sure. >> I'd like to see this chart though with the 2026 added. >> Yeah, we got to wait a year for that one. >> Yep. We'll see that. Let's let's make a note. >> Anyway, thank you everybody for coming. That was a show. That's a wrap. Big links below for the team here. Thank you Mando. Thank you CTO. Thank you, Marty. Um, and Marty, prediction markets for the tariff rejection, uh, it's 70%. >> Yeah, I mean, I've never seen the Scotas delay four times in a row. >> Just remember, if they do declare that he that Trump can't create make new tariffs based on emergency measures, he has several other ways of of imposing tariffs. So, there's an entire backup plan. So, once again, don't be super futed out. the market makers will take advantage of it, but it doesn't mean tariffs are over. It just means that he can't create tariffs under emergency rules. >> Exactly. Without a congressional vote. >> And a big thank you as well to the moderator, Sha D, TND, K8, Blazo, and everybody else. Thank you all. The Laring Center, we'll never live that one down. That was the big that was the big trade we missed last year was setting up 15 ling centers in Minnesota. >> Yeah. If I take if you give me that 200,000, I'll start a lingaring center. >> Okay. Cheers all. Be safe. Have a good week. >> Have a good week, guys. Thanks as always. Thank you everyone."
    }
]