[
    {
        "video_id": "75QcbOozsow",
        "title": "Palantir Stock Falls Overnight as Shutdown Risk Soars!",
        "published_at": "2026-01-26T03:42:15Z",
        "sort_date": "2026-01-26",
        "url": "https://www.youtube.com/watch?v=75QcbOozsow",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. I hope you guys all had a good weekend. Had some time to mentally relax from the markets. However, we have a huge week ahead of us with overnight hours and futures that are opening up quite volatile right now. We're seeing a decent amount of actual selling pressure with a little bit of some dip buying. We'll be talking about that, but nonetheless, we're going to be talking about some of the big headlines that have appeared over the weekend that are causing a lot of uncertainty going into Monday's open. On top of that, we have the FOMC interest rate decision. We also have mega release of earnings. Tons of earnings being released. This is going to give us some guidance and some hopefully reassurance into how the economy is doing and how the current bull market is continuing to operate. We're going to be talking about everything that you need to know. Also covering Palanteer, some of the big names that I like for 2026. And we'll finish with crypto because there's a lot of selling going on. If you're a new or returning viewer, hit that like button, subscribe for daily videos. Let's try to hit 30,000 subscribers and pop it up on the screen. You see Palunteer that's down here about 1% in the overnight session. This is just due to some of the uncertainty and headlines that we've seen over the weekend. And the market is finally trading that in now that it has had the opportunity to do so. Palanteer here is at 167. It's down about 183. Now, Palanteer has just been kind of hanging out right here in the 165s and has actually kind of found some support and consolidation. you know, Palanteer hasn't had a ton of trading action in this area. Um, in the short term, I think it's going to be important for Palanteer to recapture this kind of 170 area between the 170 and the 184 that's been a strong base area and a large, you know, consolidation since like last September, October, uh, that we've been covering for a long time in the channel. If Palanteer is going to face a lot of selling pressure due to, you know, just selling or if we see a big change in macroeconomic structure, that's where you could see a breakdown here to 155 or Palance here if it recaptures that 170 support. It's probably just going to be stuck in there until we see earnings that are coming out here pretty shortly. I think it's like February 2nd, I believe, and we're going to be seeing earnings. It's going to be happening either February 2nd or the 6th. I can't remember now. But nonetheless, it's coming up soon. Um, and they are priced for perfection. There's like 21 earnings per share revisions in the bullish direction. Balance is expected to come up with some slam dunk earnings even though historically they have. So I'm still expecting them to do so. They've been doing quite well. Let's talk about some of the other commodities. Interesting things that are happening within the market. First things first is that gold and silver are still continuing to squeeze. You see gold up here 1.2% and silver now at 107 107 an ounce. Uh this is up crazy. A lot of people have been trying to short silver along the way, but unfortunately have been getting stopped out or have been getting beaten down as silver still continues to fly. It's up by 200% or whatever uh in the recent time. Now, this probably will have a cooling off period. It's just a matter of when. So, crazy to see here at 107. We'll see what happens. Keep you guys updated with that because, you know, how does that correlate here with SPY? SPY is down only about actually 21 basis points right now. down about 143. Now, when this opened up, this was down more like closer to a full percent, maybe down about 75%. It's under its 50. It's under its 200 moving day. So, we'll see what happens here with SPY. Um, definitely we could have an open below 6,900. That's not necessarily a bad thing. Uh, we've seen some recent dips that pushed us, you know, all the way down to 6,800 here. That was bought up quickly. What I do like here is fundamentally a lot of things have not changed. What you're seeing is a lot of uncertainty within the market. And what is that uncertainty? Uh there's a possibility here. I'm going have posted this on Twitter that um the US government shutdown odds are now starting to approach around 80%. Now this is after we have the left here that threatened not to vote on the proposed spending bill unless we saw the new funding towards ICE unless that gets eliminated. So we're seeing this political tension that is continuing to rise across the board. And even though we're nonpolitical the channel, you know, we're trying to analyze how is the market going to react to this. Right now, the market doesn't like the odds of another shutdown, and that's because we just went through a very long shutdown. Yes, the market continued to operate pretty well and was resilient during the shutdown. However, during that shutdown, however, that 40-day shutdown that we got, which is quite long, that shadowed about 1 to 2% off the quarter 4 GDP. Now, quarter 1 GDP is expected to be very strong here, but the shutdown here is going to hurt growth again basically as it'll take away from GDP. So, that's where the fear is. Um, you also have big tech earnings and then you had that threat of like that 100% tariff on Canada. So, you're seeing these threats that are continuing to rise across the board with tariffs or playing the tariffs game. Fundamentally, I really don't care about the whole tariff threats because a lot of those get tackled traded where they kind of get backed out. We just saw that recently with the February 1 tariffs. So, nonetheless, if we see any dips, as long as earnings, that's what I'm going to be keeping as a priority, holds strong, that's where I think fundamentally we're still in a positive bull market direction, especially with the AI industry industry that's behind us. Now, why this is a really huge week is more than 90 S&P 500 companies are set to post quarterly reports this week. Things like Apple, Meta, Microsoft, so big names for the Mag 7 here. And also we're seeing the overall picture here anticipating a growth hopefully and that is because 76% of the companies have already reported beating expectations which is a good leading indicator leading into this huge earnings week. I do like that. Uh on top of that, what's also to expect in the markets this week? You're going to be getting the FOMC interest rate decision on Wednesday. So keep your eyes peeled for that. The expectation is that we're probably going to get no rate cuts. Um that's because recently we've seen the job market that has continued to be resilient and the signs of weakening have actually kind of deteriorated a little bit and uh we've seen the economy that's been doing quite well in terms of the numbers. Um with that being said, the market's kind of already priced in. You know, this whole FOMC interest rate decision of probably not cutting rates. Uh we're also going to see, you know, more forward-looking. What's the expectation looking forward? That's where you're going to see possibly some volatility on top of Wednesday. That's when you get Microsoft, Meta, Tesla, and ASML. Oh my gosh, huge earnings on Wednesday. So, that's going to be a crazy day. Um, talking about some of the other ones, you see some big names on Tuesday, big names on Monday. You're going to get Apple here on Thursday, Mastercard, Visa, which will give a strong indicator on how the consumer is doing. You got Exxon Mobile and the Chevron. So, wow, big big names that will be coming out here uh towards the end of the week. Um, so that's where we kind of sit right now. some of the big names that I'm looking at. Personally, if there's any type of dipping, I'll be looking at Zeda. Now, Zetta has been doing quite well and had a nice bounce off the 20. A very nice bounce off the 20. Has had a good reversal kind of back at the 22. Once Zetta, I think, can get a bullish kind of push here to the 24s. Uh, passes resistance. That's where you can see possibly, you know, any breakout territory. It's just a matter of what's the macroeconomic situation going to look like in the short term to try to basically gear that or set up that trade. Um, also looking here, some of the other big names, of course, looking at Cipher and Iran that we've been talking about a lot. These have been holding up decently well in the overnight session. It's down about 2%. IN here could be going down to, you see 55 right here. IN's been having an incredible amount of resistance at the 50 or a support, excuse me, at the 50 recently. You can see right here at the 50, the multiple touch points that I has experienced a lots of volatility here. The swings in IN have been quite astonishing. Ever since we've hit 50, this thing literally bounces to near 60 or in the high 50s, then gets sold off and does it again. So, if people have been swing trading this whole thing, they've been incredibly successful. I have not. Uh, but that's where we see right now. If we see any type of dip, that's where I'll possibly be looking to add more exposure to. I read as I do like the whole AI data center play and especially the demand for compute is continuing to be kind of the bottleneck for the uh advancement of AI in itself. U also looking at that Nebius under 100 again anytime this is under 100 I really really keep it on the top of my watch list. Cororee don't have a ton really going on with it right now. Um and then also looking at like some nuclear stuff close back to 85. Um, and then looking at Path for Agentic AI. I like this right here. Just kind of hanging out around the 14s, 15s. Not so bad. So, uh, those are some of the big names that I'm keeping on the watch list. Now, let's quickly look over here at crypto cuz we are seeing, uh, some selling off. You see Bitcoin right here drop down to about 86 at least. Was recently able to find a little bit of support and a reversal there that pushes it to 87. Now, 87 is a strong support level for Bitcoin. There's a strong floor there. So, if it just kind of hangs out at 87 for a long time, I don't think that necessarily means that the world's ending. Just means that Bitcoin is, you know, back down here again. And like I said, it's really not been making any moves uh recently. Don't have any exposure to Bitcoin or Ethereum. And with Ethereum right here at 2,800 also just hanging out at this level. This dipped down to about 28 basically before a little bit of reversal below 3,000 again. So, now we're just kind of sitting here. The big question is, you know, what does that mean for the BMR sharehold? There's uh probably going to be experiencing more of a selloff. We see BMR right here at 2769 again. Now 27 at this area was a nice strong kind of reversal and balance. We kind of have this double bottom here. We'll see what happens with BMR and where this continues to hold. If this dips below 27, uh possibly it could be interesting. Um, however, however, there's a lot of volatility here and with the current setup and depending on the macroeconomic environment, especially with earnings, a little too risky for me at this moment. Don't really care if I miss out on any moves as there could be some further draw down on a big breakdown uh with just the recent selling pressure that we've seen. So, we'll see what happens. Hopefully, this week goes well. Good luck to everybody out there. Let me know what you think down in the comments. Peace out. Take care and I'll catch you guys later. Have a wonderful day and a great"
    }
]