[
    {
        "video_id": "FhbYL-GGMao",
        "title": "Clouds Don’t Mean the Sun Is Gone #shorts",
        "published_at": "2026-01-26T18:00:17Z",
        "sort_date": "2026-01-26",
        "url": "https://www.youtube.com/watch?v=FhbYL-GGMao",
        "transcript": "It doesn't mean that I'm a non sun denier, non-believer in the sun. [laughter] You know, cloud is going to come. Cloud is going to rain. We're in the rain. We're dancing. Some people say we're dancing in the rain. Let me know what you think. H But it's going to pass, man. It's going to pass. And when when does it pass? According to mythological, how do you say meteor meteorological whatever with the weather, guys? It's either passing here or here. Yeah. Very simple. Very simple plan. And the Bitcoin is going to is going to smash towards a million bucks as we reset, as we flash, and we can continue to the upside."
    },
    {
        "video_id": "57vyxf5ZRBA",
        "title": "Yen Intervention and What It Could Mean for Bitcoin #shorts",
        "published_at": "2026-01-26T15:42:11Z",
        "sort_date": "2026-01-26",
        "url": "https://www.youtube.com/watch?v=57vyxf5ZRBA",
        "transcript": "The Fed is actually now intervening with the Japanese yen markets in order to support Japanese yen because Japan is under heavy pressure. And if you see the the yen weakness is going to lead to higher interest rates in in Japan and that may unwind the Japanese carriage trade, the yen carriage trade. You can read more. I mean it's it's it's a bit of a a rabbit hole. You can read more. But the the important thing for us in Bitcoin is that last time they intervened. What happened? We did see a 29% crash quite fast crash. I mean literally within a few weeks boom boom boom very very fast crash and then it found a bottom within the coming months and continued to pump from there within the coming uh quarter or so. Uh so can this be something like that? Obviously history never repeats exactly but this would be quite good overall for the Bitcoin markets to have the flash go to 200 week and then build from there and and continue from there. It could be one alternative and again you look at the timeline there it is within the you know four or five months that we can see something like this playing uh playing"
    },
    {
        "video_id": "uadiU0bIu-w",
        "title": "BITCOIN AND ETH: QUICK FLUSH THEN VALHALLA!!! (important)",
        "published_at": "2026-01-26T09:57:37Z",
        "sort_date": "2026-01-26",
        "url": "https://www.youtube.com/watch?v=uadiU0bIu-w",
        "transcript": "Oh yes. So yes, yes, yes, guys. Welcome to another episode. And as you can see right now, Bitcoin is at $88,000 and we did see rejection last week from these very, very important highs and then bam, all the way down to 86 and now we're around this area 86, 87, 88. But all in all, guys, you see that we are right on the brink of the breakdown. And again, from my perspective, I don't really care if it breaks up or down because we have our uh targets. We're going to be buying here at the 200 week or at 50 week. Like, we don't really care which one hits, but currently the the path of least resistance is down. And then you have another 30% drop to our buy zone here at the 200E moving average. So, let's see if Bitcoin gets a nice flush because that's what Bitcoin kind of is looking at right now. It's kind of like, you know, you have your your situation and it's waiting for you to hit the flash button. Okay? Whether it's going to be the big flash button or the small flash button yet has to be seen. But all in all, Bitcoin is in this position. But guys, I want this to be a bit of an encouraging video because personally, I'm very excited about Bitcoin. I'm super super excited, especially now that gold is moving to alltime high every day, a new gold alltime high. I mean literally you just have gold smashing and smashing and smashing and now gold and silver are back to being number one assets in the world because in the past you had Nvidia and other stocks being number one but now gold and silver are number one and of course everyone is so disappointed with crypto everyone is so disappointed with Bitcoin and I think that that's a very very wrong approach in fact as soon as soon as Bitcoin shows strength which it will do sooner or later I think within the coming quarts we're going to see strength from Bitcoin like never before Bitcoin will catch up to gold. We will see a catch up trade, but we don't want to front it because at the end of the day, trend is your friend. Now, it's bearish. We can still have a weakness in in in Bitcoin before it starts catching up. And if you look at gold, gold has also had a lot of sideways, a lot of boring time before it had this explosion. And when you just look here at this chart, basically gold missed most of the action here in uh 22 23. It's only now like towards the 24 25 that it really started to pump. So it's not like gold has been up only always. It's it goes in cycles. I mean sometimes you have stocks, sometimes you have crypto. Here gold did super super poorly while Bitcoin was going nuts. So all in all it's not like Bitcoin is dead like it seems on Twitter and now gold and silver are the only answer. And many people are thinking like that now. there there's something to think oh okay crypto is really you know real kaka in the toilet waiting for the flush and gold and silver are the only solution and listen you have to be 360 I keep I keep saying 360 investor because look at commodities look at precious metals here in the money scanner we've been tracking this very very tightly and on the weekly you see that gold has been in a bull trend since a year ago and fantastic returns silver since 7 months ago 215% so we really have to 360 but 360 also means that as soon as Bitcoin flips bullish we have to be mega bullish when it will flip bullish that's the big question and you know my scenarios it's either going to be once we hit the uh the 50 the 50 week like we we keep going up from here let's say that we really see a pump now we don't want to front run again never front run just wait for the thing to play out so if it's to a bullish direction then we wait for it to start going above 50 week and here you can start getting excited or if it is down uh down scenario then it is the two 200 weeks. So that's why the title of this video is what is it you know the the big flash and then val something like that. Okay, it's true. It's true, guys. The thesis of crypto has not changed. The thesis of Bitcoin has not changed. Bitcoin is still better than gold. It's still better than gold. When you look at the fundamentals at the properties, you can have it in your wallet. You can have it in your brain. You can remember your seed phrase. So, obviously, it's way better practically than gold. But that practicality does not negate the bearish price action Bitcoin has right now. And we've been playing it super well. We I intend to keep playing it super well since October 8th. We've been zero risking. Here is all the proof. if you go to booming.com/ivan and let's see what the next move is for us. But the good thing is you don't have to make too many moves when it comes to big picture. You don't have to make too many moves when it comes to Bitcoin. It's a literally a few times per year you even see some kind of signal and the last big signal for us um to be bullish was in January 2023. And also Bitcoin is still mirroring the past uh the past problematic midterm years. If you go to booming.com/charts, you're going to come to this chart. This page is fully free. And then you can actually search for all of the charts in the search bar. Did you guys know that? You don't have to like click around here on the left. Let's say you want to see ETF. You just write ETF. Bum bum. It's realtime search. I mean, it's pretty powerful stuff if I'm to say it myself. Here, I just search performance per four. You see, and this shows Bitcoin yearly performance here. What I wanted to show you, you you check midterm year again, guys. It's uh kind of uh here. Wait. Bam. Let me show you here. Here's the midterm year. uh it's it's kind of exact guys I mean you see here you see here the performance in the midterm year it's exact like other midterm years so it seems to be following and so the question is how fast we get the flash the flash is towards the 200 week if we do what other midterms shares have done is going to be flash of approximately 30% it could be quite fast I mean I really don't care about the time uh the time aspect of it I care about it less I care more about it going to the 200 week area it doesn't have to go to exact 200 week it it can be within 5%. Uh, and that's going to be my signal. So, the faster we flash, the better. I mean, for the bulls, it is better. And so, when you also look at what's happening now with the Fed, with the Japanese yen and so on so forth, the Fed is actually now intervening with the Japanese yen markets in order to support Japanese yen because Japan is under heavy pressure. And if you see the the uh yen weakness is going to lead to higher interest rates in um in Japan and that may unwind the Japanese carriage trade, the yen carriage trade. You can read more. I mean it's it's a bit of a a rabbit hole. You can read more. But the the important thing for us in Bitcoin is that last time they intervened, what happened? We did see a 29% crash. Quite fast crash. I mean literally within a few weeks boom boom boom very very fast crash and then it found a bottom within the coming months and continued to pump from there within the coming uh quarter or so. Uh so can this be something like that? Obviously history never repeats exactly but this would be quite good overall for the Bitcoin markets to have the flash go to 200 week and then build from there and and continue from there. could be one alternative and again you look at the timeline there it is within the you know four or five months that we can see something like this play uh playing playing out so guys what is the uh practical practical practical for us uh risk off since October 8th people always ask me since October 8th we risk off we're sitting on our hands when it comes to big picture when it comes to bitcoin mainly sits on your hands this is this is a no trade trade zone but you don't want to get caught up in this uh bare doom and gloom mindset because we never had have it on the channel I mean Even when we always cough, it just means that the price is pointing down. And guys, when I see a cloud on the sunny sky, I need to tell you, maybe it's going to rain. It doesn't mean that I never think we're going to see sun again. It doesn't mean that I'm forever anti- sun. It doesn't mean that I'm a non sun denier, non-believer in the sun. You know, cloud is going to come, cloud is going to rain. We're in the rain. We're dancing. Some people say we're dancing in the rain. Let me know what you think. H But it's going to pass, man. It's going to pass. And when when does it pass? According to mythological, how do you say meteor meteorological whatever with the weather guys? It's either passing here or here. Yeah, very simple, very simple plan. And Bitcoin is going to is going to smash towards a million bucks as we reset as we flash and we can continue to the upside. That's going to be very very very nice. Now guys, actually what's happening is very interesting now in the world. That's why Bitcoin I I I don't I don't see it not recovering when it hits the 200 week. It always does. But also look here, you you have the US dollar going into another type of toilet. It has another type of flush. And this flash is that it is now losing basically world reserve currency status uh to gold to gold. When you look at the global reserves, the dollar is going down quite fast. I mean especially during the last years and especially during the last year two or one to two years you see how fast boop boop boop this is the black chart the black chart is the is the US reserves at the same time you have gold going up like this parabolic parabolic and uh yeah some people are saying it's time for hyperinflation could be could be never say never in China people are following into silver like never before Shanghai silver price are now up to record $24 and uh this is 124 and this is way more than 108 which is in western markets. Uh and yeah, I mean it does look a bit hyperinflationary. Let's see what's going to happen here with with the silver with the gold. It does look a bit hyperinflationary. Uh obviously Bitcoin will be part of that rally as well once if hyperinflation really hits. Bitcoin is going to be part of that rally as well. In reality, what's more likely to happen here if we ignore the hyperinflation scenario, which is something that people bring up all the time, and it's not like it cannot, it could happen, but what's more likely is that we see some kind of consolidation in in silver and gold. Uh maybe back towards a 100. By the way, look here. It just smashed through a 100 without even caring about it being a big round number and just added more form. So, it didn't even consolidate around 100. This is the kind of strength there is. The kind of weakness dollar is in right now. U but you know at some point it's going to have consolidation. Doesn't mean that it's going to go down. Uh but it could just go sideways for a bit like here and then continue to the upside. So never bet against a bull trend. A bull trend can look crazy then consolidate and continue higher. So let's see what's going to happen. But all in all, congrats to everyone who is using the money scanner. Uh because that's basically the only way to truly see what's happening to only way to in real time get the alert. was happening. Uh silver since since 7 months, paladium since 8 months, uh platinum since 8 months, paladium since 4 months. Okay, very important. Uh let's look at other commodities if we have something else doing well. We have nickel 21% since a month ago. See, it didn't have to be this early like 7 months or 8 months. Just a month ago, you had nickel copper two months ago. Uh 16 copper 16 uran the other ones are not too too high recently. So yeah, keep an eye on that. Let's check on daily. What has been doing the best on daily? Orange juice since 1 month ago still bullish on the daily. Platinum, platinum, uranium, and even natural gas 5 days ago could have gotten 15% if you uh checked here. So, all in all, if you don't have this tool, you want this tool, go to bullmania.com, watch the free training. You're going to love the free training about the mechanical rules. That's how you join the Bulmania. All instructions are here. And of course, when you join, you get all the tools and so on so forth. Just getting the tools without the knowledge is like you know a monkey having a machine gun like you don't know what you're doing. You're a monkey running around like you see some uh green red you don't understand anything you know you have no risk management you don't understand trading you you trade like a you know with your gut okay so that's why we don't give it separately you have to watch the training join for real understand you need to software update to your brain before you get the software to your computer first your brain needs to be updated so that's why go to bul.com watch free training and welcome everyone who is watching live let me know how you're doing today we have a green shirt it's still bare but we have green because I I do want to give a bit of positivity crazy because the amount of depression in crypto is quite insane. It's quite insane. And uh don't don't misunderstand what's happening here. Uh not at all. Yes, it's cloud now. Doesn't mean that there's never just like gold and silver were the boring assets no one cared about. Then suddenly boop, now everyone cares about it. So it's all about the the fact that it's cyclical and we have to be 360. Big shout out to DAB who is timeing us today. Subscribe to the channel if you haven't yet. Smash up the like and let's get going. Oh, by the way guys, another thing. If you want to trade, if you want to trade silver, you want to trade gold, go to bullme.com/partners. You find the link below. Sign up for Pionex. You can copy my Pionex boss, which by the way, we we did a silver bot. You remember we did a silver bot. It's crazy. It's crazy. Where is it? Here. Here. Fantastic. Fantastic. And this is silver. And we did it when like 16. It wasn't even that long ago. It's not like we caught the entire move either. We just we just experimented a bit with the bot 16 days ago. So go to Pionex and and copy the bot. You find all the links in description bulm.com/partners and then you going to come to this page and uh you're going to see this sign up copy and then you can go to uh buy bit bitunix wigs and so on to get other exchanges to trade precious metals or stocks. I mean most crypto exchanges now are 360. They allow you to trade any asset. So guys, the two big things, two big things. Number one, um gold is mooning as reserve asset. Dollar is going down. Number two, Japanese yen is getting quite weak and the US is now actively intervening to pump it. That's very important. We're going to see what kind of result that will lead to. But that's that's major. That's major. The Fed is back to being active. They're back to being active. And this is what happens. You have the dollar strength index, the the Dixie going down very very fast because basically the US is devaluing the dollar. They are dumping dollars to strengthen the Japanese yen. Uh and why you can read more about Japanese car Japanese yen carriage trade. Why they cannot allow Japanese yen to collapse and you're going to enter a very nice rabbit hole there. We can even do a separate video about it if you want, but I don't want to spend too much time here. All in all, uh, US dollar index down, gold up, Bitcoin kind of waiting to get flashed, but super bullish once we hit the levels, either 200 week or 50 week. Uh, and we're back with another interview with Charles Hoskinson. Look here. Democrats are coming for crypto bigly, bigly, bigly, bigly. Listen to this. >> The Democrats have said crypto equals Trump equals corruption. and they're publishing report after report saying of how corrupt this whole thing is. They're running in 2026 against crypto. They're not magically going to be pro- crypto now. And any Democrat administration that comes in is going to be neutral to negative with crypto. And they're going to have the Clarity Act, if it passes as a weaponized tool that they can use for their Securities Exchange Commission to basically attack the entire industry as a referendum. And it's not something that should have happened. It's one of the reasons why we didn't have the bull market. We could have had it if we had a bipartisan process. We could have passed the law last year in a non-controversial way. So all in all, he's saying the following. If this crypto market structure bill, the clarity act gets passed and it is bad, it will be used against us. I mean it is clear as day, but not too many people are discussing it. I mean that's why Hoskinson is against the bill which was supposed to be good for us. You remember this market structure bill. It was supposed to be good for us. He's against Brian Armstrong from Coist is against the only person pro it pro that is Brad Brad from Ripple and so let's see what's going to happen. I mean one thing is for sure the Democrats they're going to come heavily after crypto heavily heavily heavily. It's uh quite insane with all the Trump involvement. They're going to come heavily man. So let's see what's going to happen in the midterms. But the good thing is that the re after midterms we're going to see way more clarity about the situation about the the power dynamics and you can argue also that the reason why you currently have a bit of instability in Bitcoin is because we don't know what's the result of the election going to be. So once we have the result of the election we know what's happening the uncertainty is away from the market. It gets removed from the market. Market don't like uncertainty. Okay market does like uncertainty. So that's why normally midterm years we just bleed bleed bleed bleed bleed bleed bleed bleed bleed and yeah then we have election everything is clear okay these guys are in charge even if it's you know anti-crypto guys still uncertainty is gone now we know what we're dealing with we can move ahead and that's one reason you can argue why Bitcoin is finding a bottom somewhere after the midterm election which is as you know in what is it Q3 autumn somewhere it's somewhere there yeah next next guys Japan speaking about Japan let me know if you love Japan you love sushi it's crazy some people when they go to Japan, they come as changed people. They're like, \"Man, I love Japan. I love I don't know if it's the anime, you know, the the females in anime clothes. I don't know what what they love there.\" I was in Japan one time. Maybe I was a bit unlucky. It was raining and it was freaking cold as well. So, I didn't get that, you know. WOW. I LOVE Oh my god, Japan. I didn't get that. Maybe I need to go again. But it was cold and it was raining and uh it was Yeah. I mean, Tokyo was nice, but it was so so huge and just goes like Yeah. Anyway, I need to give it another chance. But if you love Japan, this what's happening. Japan's financial regulator is weighing rule changes that could allow crypto assets to qualify for ETFs. So more ETF access in Asian markets by 2028. I mean, at this point, we have the US, the most important market, but still good with a bit more, a bit more here and there, you know, you know, sprinkling a bit of more ETF around the world. Now what is interesting guys is that when it comes to ETH treasury companies guys I don't know what the hell they're doing. Uh they are now buying plane plane engine ether treasury ETHZilla buys plane engines amid tokenization focus. What what the hell is going acquired two aircraft engines for 12 million just weeks after company said it was renewing focus. Okay. So, instead of just focusing on ETH, now they do plane engine. They're going to tokenize. Yeah. I mean, let's play the video. Let's play the ad. What's happening? Maybe it makes sense, guys. I mean, the article is funny. I mean, the It looks [ __ ] Sorry. I mean, it looks ridiculous, but let's see. Maybe it makes sense. Let's watch the ad. >> The market opportunity for token, >> man. BUY A MIC. BUY a Why is it like clip the clip mic? What is this? The market opportunity for tokenization is trillions of dollars. When you think about the financial market are really great opportunities, I I think the regulatory environment >> anyway it's so they're going to talk plane engine and maybe it is because ETH treasuries they're such you know income producing machines because they have yield. You see Sailor says he has he has Bitcoin yield. I don't like that when he says that he has Bitcoin yield because Bitcoin has no yield. I keep repeating that but remember Bitcoin has no yield. There is no Bitcoin yield. Dollar has yield because you can take dollar, you can buy treasury. It's kind of like dollar but producing yield. It has the same risk because if something happens to the government, your dollar going to go to zero and your treasury going to go to zero. The relationship between dollar and treasury from a risk perspective is like the same. It's the same. So whether you have dollar or treasury is the same risk. So that's why you have this you know risk-free rate which is the treasury because something happens to it is the same as you have the the dollar. So anyway the same thing is with ETH. You have ETH, you have stake ETH is the same the risk but one gives you yield. So that's why you know ETH has a risk-free rate in ETH terms because if something happens to this one the other one is going to go down also some catastrophic this some bug both going to go down. So Sana has also yield. Bitcoin has no yield. You cannot stake Bitcoin. You can only do things that are way more risky than holding Bitcoin. And that's the clear definition of you know what is you know true yield. true yield in ETH for example you have ETH you stake it like the risk stays basically the same for you but here you have a bit of yield you put the money to work with Bitcom to get yield you have to lend it you have to speculate you have to participate in financial markets you need to find inefficiencies in the market you have to lend out to hedge funds like uh Celsius was doing or at least they were forging that they were doing that in reality they were gambling with the user funds and so on so forth I'm not saying that seller is doing that but I'm just painting a picture here that Bitcoin has no yield All yield needs to be uh created by taking more risk and risk is way higher than just holding Bitcoin. ETH meanwhile has yield. So maybe that's why you know these guys they don't know what else to do what what to do with the money. They buy plane engine they buy Tom Lee bought Mr. Beast company he bought bought stock in it. I will let you guys I I think the the focus is in all companies you know the the main problem is focus like you need to focus on like one thing small thing ideally. So, uh, personally, I'm not too bullish with like, you know, Tom Lee becoming a a hedge fund, like investing private VC fund or something, and this guy is tokenizing. Uh, maybe it makes sense, maybe not, but it's not ETH Treasury Company anymore. It's something else. And, uh, maybe it makes sense, maybe not. Who knows? Uh, but yeah, that's some news about ETH treasury companies. Uh, next, CZ CZ rules out return to Binance, predicts 206 Bitcoin super cycle. So, yeah, he he's been saying that we're going to come back bigly. uh and uh I mean listen uh for us for us uh the super cycle would make sense as well from the strategy perspective because I just want to remind everyone about our track record and what we're going to do in case reality changes. Uh if we go above 50 moving average we're in again. Uh and this seems to be like good like solid solid solid show of strength for Bitcoin above 50 week otherwise we we're buying at 200 week that's it. So whether CZ is correct, whether he is not correct, uh I it's secondary for us. For us, we rely on mechanical rules, we rely on positioning, risk management. So for us, you know, it's potato, potato, tomato, tomato. It is uh you know this and that is the same is the same. Uh but but but he's saying we're going to have super cycle. I know many guys hope for super cycle. I'm with you guys. Let's see what's happening here with CZ and uh where is his super cycle and if it is in this room with us. >> Ah man is one of these 13 minutes. It's too long now. Let's see where is he. >> Um well I >> let me just play for a bit uh here and see what's happening. >> Spend time working on this uh free education platform called Google Academy. >> Mhm. >> I work with an investment team called uh easy labs. I still uh I mentor uh a number of funders in the B&B chain ecosystem space. So uh we're minority investors. I just mentor them. >> Yeah. He I mean he shields all of the BNB coins like Aster you know he that's true that's true that's true that's true that's true. Now the problem is many people think that because CZ is involved in something is going to pump. Look at Aster it pumped a bit now he cannot make it pump more. So don't I bet against the trend the trend is the daddy. The trend is the papa. That's why we're saying Bitcoin is coming to papa at the 200E moving average. CZ is not the papa. Your old confounder that you idolize, he's not papa at all. The trend is the papa. Okay, very don't don't confuse who the papa is. But anyway, that's what he's doing. >> 40 away from him. Never talked to him, never never shook hands, never crypto. I don't want to deal with banks really. So they said, well, can we pay in stable coins? I was fine. And then they said, USD1, fine. Um, so that was the whole process. Many people misconstrue that that's just one transaction which I take. I don't have to hold that $2 billion. I can convert it any at any at any time and I have >> you have >> I have so >> so it was converted almost immediately. >> No, we convert portions one of the shareholders but because there's competitive >> yeah listen you can watch the whole thing. He discussed many things. I thought it would be a small one but it's like we we cannot watch some minutes. Anyway, he is discussing what's going to happen somewhere there. He says super cycle. Uh I can tell you if it's happen if it's going to happen we're going to see it. If it's not in this room with us, fantastic. We're going to buy at 200. We uh guys, look here. Look here. Majority of institutional investors say Bitcoin is undervalued. It's undervalued. I also think it's undervalued. Uh uh for sure. I mean, especially now that people are saying are so are so bearish. I think it's undervalued. It doesn't mean that it's time to buy yet because if something is undervalued, it can get even more undervalued and your gut feeling is going to wreck you. Sana in 2022 felt undervalued. Then it went minus another minus 90%. Okay, let me just show you here in 2022. You know things can feel undervalued and still dump 90%. Like here for example, you see Salana maybe felt undervalued and then it dumped another 90%. Okay, so things undervalued get more undervalued. So you you cannot base your trading based if you feel that something is undervalued. uh instead you need the trend, you need the signal, you need to be disciplined, you need the mechanical rules, you need to follow something that works over and over again. So important, but if you're a gut feeling kind of investor, it's problematic. So we can currently price at uh 87 downward 30% since all time could go could go down another 30% easily and still feel undervalued. Uh it's like you know look here again I just want to promote this search feature which we always had but I I see people haven't maybe used it but you see here you you go to search this is fully free by the way booming and concept chars and search just fear. Okay, fia. You I I just write F. It's already fe man. The search feature. It's crazy, man. It's crazy, man. Let's see ETF. Ah, it's crazy. It's crazy. Let's see. Hyperlquid. Huh? You you you don't have to like search here in the in the corner in the in the sidebar. Just search just search here in the What was Oh, yeah. I was going to see fear and grid. It's like know fear and greed. Something that is fearful. I mean, it can still stay fearful for a long time and go way lower. Like here it was already fearful in uh October October 18th was 23 it now it went down even uh and price here was 106 now it went to 86 and it's still uh it's even less fear now okay here it was 23 now it's 25 so all in all something that's undervalued can be way more undervalued and it's not it's not a way to trade but uh is it undervalued I mean yes look uh silver has 3xed uh against the Bitcoin like easily in the last year or something like that. Silver has 3x against against Bitcoin. So can you argue it's undervalued? You could you could do you trade before the uh confirmation of trend? You don't. You don't. Okay. Very important. Keep disciplined. Keep uh relaxed. And that's fantastic. So crypto market sentiment hasn't improved with prices trying to regain momentum and renew tariff threats. Freaking tariffs. Another day, another tariff. But now there's no tariff threat. So he kind of rolled back on that. So that's good at least. Co said this trend could continue. Geopolitical tension have flared up in several parts of the world. So yeah, all in all guys, tariffs are going to be bigger and bigger issue. All of that uh it should theoretically benefit crypto once crypto finally gets in bull trend. This is what the narrative is going to be that tariffs are happening, but it's good for crypto. Okay, now we're in a better so tariffs are bad for us, but the same news is going to be good for us. I I can promise you that. It's like that's why the player watches the news, the player gets chop chop chop chop chop in the news. But if you know the price trend, then you can say that the same news can either be bad or good depending on the price trend. If the price is up and you know there's tariff news, you know what we're going to say? All the influencers you follow that are calling for 30x alcoin season since uh like October, they're going to say tariff is good for us, okay? Because Bitcoin is outside of nation state. It's outside of Tradfi and and tariffs are happening in Tradfi. There's no tariff on Bitcoin and all of that. So, it's like now you know tariff is good for silver. Exactly. Some of the same. So, all in all, the the narrative is going to change. Uh the uh only problem guys like I can really feel your pain if you're heavy old coins. Like you have no d I can hear the I can feel the heavy pain there because Bitcoin I can tell you it's going to go to 200 week or like it's quite clear there. All because many of them will not come back like it is what it is. They will not come back. They will not come back. Uh I'm I'm not saying it to spread FUD. It is just the the truth is the mathematical truth because listen to this. Each and every new cycle there there is infinite amount of altcoins created. So by definition each new cycle cannot pump all the old coins from the previous cycle. Like man it's impossible. It's impossible. Look at all from 2021. Most of them did not pump in uh 2024 three like four and uh and beginning of five. Okay. So it's just reality. So I can understand that you know in that situation it it may be tough but uh uh that's why you go to booming.com you join you you understand the mechanical rules so you're not in that situation anymore. Very very important. Listen guys I think that's it from a big picture perspective. Let's go to Q&A. We're at a good length here. Let's go to Q&A. Uh questions, answers, debates, discussions. Big big shout out to um Dub for timestamping us today. And by the way, we got a new testimonial for Bullmania. Let me just play to here because I love when people are sharing their experiences. And this guy also mentioned something that is very dear to my heart, which is the 360 investor. So listen to this and go to bullmare.com and watch the free training. Big shout out to Tanel who recorded this feedback for us. Listen to this. >> Tanel. >> Hi guys. >> There he is. >> I'm Tanel from snowy Estonia. So yeah, Pulmania. I started about month ago and to be honest I had literally zero experience in trading with stocks, crypto or whatever, right? So basically, you know, it's been wait let me download it. So while while you're thinking about questions, let me download. We're we're streaming it from Slack. So what is the Slack? Bad connection. Bad connection, guys. Yes, let's do some Q&A. Bum, bum, bum, bum, bum. Tunnel will be back with us from snowy Estonia. By the way, if you are from Estonia watching us, big big shout out. Ivan, Minister of Finance in Japan is pro crypto. That's very, very good. They should be doing Bitcoin reserve. I mean, at some point, guys, the Bitcoin reserve narrative is going to come back. Like, it's going to come back bigly because uh you see the problem with fiat. Fiat is literally hyperinflating in real time. Yes, you some countries do gold. Maybe it's great for them. Fantastic. Most countries do gold. At the same time, you have crypto as the digital gold. That narrative is not going to go anywhere. It feels like it's gone now because of the price trend, but it's going to come back. Your old coin may not come back. Okay? And guys, that that's the only thing like people think that their altcoin is like Bitcoin. What we what I say about Bitcoin applies to their altcoin. Guys, your altcoin may not come back. Very few altcoins come for a multi- cycle run. And if you want help handling that, go to bullying.com, watch the free train. I mean, that's it. That's it. I I because I feel that's the that's the biggest thing I have to hammer home now because I don't want this to be like false hope. Like, you know, you have your [ __ ] and you think they're going to come back and the most important thing is that you understand the problem, you fix the problem because it's super fixable and you stay until next cycle and we go to Valhalla together, which is super super fixable. Bitcoin is going to come back bigly to Valhalla. Your altcoin may or may not. I mean, it's not something to like bet your farm on. It may come back. Likely not. Uh, okay. And now Tanel is back with us. Let's go. Tanel from Estonia live. Not really live, but yeah. >> And to be honest, I had literally zero experience in trading with stocks, crypto or whatever assets, right? So basically you know it's been a fun ride and uh you know after learning the mechanical rules uh which took me you know couple of days three times uh 3 days maximum and then you know I jumped uh into the trading uh right away and you know started out with uh small amounts just to you know learn and study uh uh study myself and as well you know how how the mechanical rules work and then you know apparently it was I believe Monero coin which gave me 3 hours profit so you know for me it was a big uh big surprise >> guys see the average player listening may not understand what what he means when he says three R because in Bulmania the first thing you learn is risk so let's say you do a monero trade let's say you risk 20% % of your portfolio. That's your R. So when he says three R, it means that he risk let's say 20% of the portfolio or 10% or whatever you decide and then you got three times as much than you risked. The most players they don't know like they they all in all in I'm bullish all listen if you do risk management you do position sizing you know your R and then you measure your performance as a multiple of R anyway it may be if you that's part of the mechanical rules okay you get a bit for free here in terms of parts of mechanical rules but go to boom.com and watch watch watch >> that uh you know this system really does work and uh you know I'll be honest when I entered the monero So, uh, position and know it was quite a quite a, uh, hard night for me because, you know, you never know what's going to happen over the night. And when I woke up, I saw Yeah. and it was flash close of the position for me back then. And, you know, guys, for me, this is a life changer. Now, I can shovel the snow whenever I want basically. And uh you know it's a it's a fun life. So I would strongly recommend Bulmania and Bulmania you know system and the community and you know the community part is I believe one of the one of the biggest uh strengths. Yeah. So you know a lot of hints, a lot of discussion around stocks, commodities, how to trade with you know different asset types and you know guys this uh 360 um investor mentality that's something I'm starting to like a lot and uh you know just last week >> I opened as well my stocks portfolio. So, um, let's see. I believe it's going to be a beautiful year. >> Let's go. Big shout out to Tadel. Big shout out to everyone in, you know, it's one thing when I promote. It's another thing when we have real results from real members. Guys, Q&A. Let's go as soon as possible. Ivan, are you holding stable coins or cash? So, listen. I don't like only stable coins. Sadly, we have to combine. We have to combine Tradfi and stables. It's uh I mean it is the sad reality because at the end of the day I would love it to be only stables. The problem is that yes it's self-custodial it's easy. The issue is that you have uh risk with the imitant with the issuer you have then they have a bank and uh and so on. So listen it's not a clearcut which one is better. Uh it depends on if you have a good bank if they know you like if you have good account manager although that's not always 100% either but there's no no good solution. So I have both. I have both. It's It's not how I would love it to be, but it is what it is. It is what it what it is. And is part of 360 strategy. I mean, do you have uh have you started to diversify outside of um so I have a portfolio for trading the uh bull trends that are in the in the money in the money line on the on the scanner because things happen there all the time. Uh they happen there all the time on um the daily time frame, the weekly time frame, all the time. all the all all the time. So you go here, you go to daily, you see what's happening on the daily. Boop. I mean, some of it is is ridiculously small and then it pumps a lot like this thing. Five 4,000% since the flip 4 days ago. So the these are nice to trade with the with the smaller portfolio like home defy app. You remember three three weeks ago. Bam. Nice gain. Again, we're not drinking the Kool-Aid. This is not for long-term huddles. That's why it's a smaller percent. Venice for example is uh this is up although it's it just entered bare trend so yeah be careful here with the pump because it is in bare trend. Uh so keep an eye on that. Uh all in all it's uh uh for me it's more of a sit on your hand kind of situation uh where we're waiting for Bitcoin to either come back to the 200 week or 50. That's it. That's it. That's it. Um no such thing as a I mean that's the problem. There's no such thing as a good bank. That's the problem. Uh correct. And this is the problem with uh stable coin. All of them have a bank where they have the assets that may also get frozen. I mean uh now we are kind of in crypto laand guys in one way because we have Trump in charge. He is uh pro crypto. Obviously he has all of the you know pro crypto interests. After midterms maybe it's different. Um so at the end of the day it's uh we you never know what's going to happen after. Let's say there is a Democrat in charge in the future. what what will happen to the stable coins? So, of course, that's still far away. It's a few years away, but I don't think we're out of the woods, so to speak. When it comes to anti-crypto sentiments, I'm not sure we're we're out of the woods fully uh currently. In fact, it may swing back big time and then having stable coin, you just never know. I mean, what what if they go brutally against uh Tether or Coinbase? Like, it can happen. We don't know. It can happen. It can happen. uh they say everything is corruption you know it was all Trump uh Trump did business with all of them so all of them are now liable for this and this and this and you know in the US things are just getting more and more crazy u I mean it's uh that's why we don't really comment too much on the political I'm kind of burned out of politics also because it's like it's it's a mental institution in in both ways in both ways uh what would be with Kamala would be mental now but now it's also a bit mental so so we we keep to markets that's it and um the backlash may come just like by the way just like Charles Hoskson was saying so that's that um practically practically um I think for you it it depends you know how much money you have if it is I would say if it is below 100k just have it in different uh stable coins you can have USDC you can have USDT you can have a bit of this a bit of that maybe you can buy some uh gold on chain uh you know spread out across different issuers USDT USDC die know a few others. So I think you're good. If you have like multi multi-millions then yeah you need to be more careful you need to be more riskov you need to consider more but if it is you know you have like 100k 200k even 300 I mean it's just spread out spread out die and so on flash and then Valhalla for real did Ivan turn bullish again watch the watch the video watch the video watch the video we explain exactly when we're going to flash and when Valhalla is did Ivan turn bullish I I I I think you're misunderstanding like you know I get this all the time Ian are you bullish or are you bearish um how how else can I explain I guess I mean there's always someone who's like Ian are you bullish or you be bearish I mean we I literally said we have been risk off since October 8th and then we have two scenarios either we go to 200 week or we go above 50 week like what is it am I bullish I don't know am I bullish or am I bearish I'm also saying that crypto is undervalued because everyone says it's dead but at the same time I'm not buying before we go to either 50 week or 200 week like you tell me am I bullish or am I bearish because I don't know is this plebbea mindset you know are you all in or are you all out are you bullish or are you bearish like you know how how can I explain it more how can I explain it how can I explain it it's you know someone who who is unexperienced they they take their mindset which is not great for Marquez and we've all been there and and they like put it in my mouth so we say no they put the word in my like are you bullsh I don't know I'm risk off since October 8th and we have two scenario where we go where we buy more either a 200 week or 50 week 200 week would mean that we go lower uh I mean you can argue that's a better from a riskreward perspective you can be more ballsy you can be ballsy as hell around 200 week you can uh I mean I'm not telling anyone to do it but I mean you could even uh take a bit of that to go heavy bitcoin because around 200 week I mean it's I'm not telling anyone to do it but you know it's is the kind of setup from a risk perspective that wouldn't be too crazy to go super heavy If we go above 50 week is still important signal to be bullish. Riskreward is slightly worse because we didn't really flash properly. We flashed I mean but still it is time to be bullish. Anyway guys you tell me you tell me what it is and uh instead of uh being this Ivan are you bullish is Ivan turning bullish ask instead what is Ivan doing like what's Ivan's plan because you always have a bull case and bare case and you position your portfolio after that. That's it. That's it. Let's say Bitcoin drops to 200 week moving average in summer timing wise says October is low if October was alltime high longterm. So uh if we go to 200E moving average you you buy there anyway. Doesn't mean that you buy with everything but you start buying there. Okay you start buying there. If we go to regardless of when it happens uh you start buying there. Okay regardless of when it happens. Uh it can still go lower but that doesn't matter because you see here in this simulation we have all the times Bitcoin went to 200E moving average and if you buy 5% uh from it you're very well off. Even if sometimes here for example in 2022 it went down another 24%. It's just from a riskreward perspective, it's good. It's still good. It's great. Okay, it went 24% so who cares in, you know, in a year you have massive uh profit. U okay, that's it. Keep it simple. Don't don't complicate too much. Uh does but again doesn't mean that you have to go all in. You can just start building your position. For the plebbe brain, this concept is very foreign also. They don't understand like what do you mean? I just went all in. You said you you said bullish. I I just went all I I I went all in. No, don't get all in. you can start uh building the position okay around two maybe you DCA in in within the you know span of 3 months um you have to get too crazy and then so we can be at 200 week moving average before the bull trend flips on weekly into bull uh so you can you know spread spread out maybe a third before we flip bull uh but we are at 200 week and then more once we flip bull for example so don't don't go all in in one button in one you know buy by by click why because you may be unlucky. You know, maybe you buy and just when you went all in, it goes down 25% like it did here. Still from a risk perspective, it's still good. Like, you know, you you were still okay. You were still okay a year after you're okay. Like, you're still okay. But, you know, it's not a nice feeling and it can it can throw you throw you off mentally if you go all in and you just unlucky. You buy the day before, you know, did the big dump. So, hope that makes sense. And it's a it's another feeling once you see golden opportunities. Let's say we're at around 200 week. You see gold, it's golden opportunity. It's literally golden opportunity. You start this in and it goes lower. It's actually a great feeling because yes, you you bought a bit higher, but listen, it was just a small amount and now you can have even better entry. Your your average price will be lower. So, personally, I'm even more excited when I know that we have a golden opportunity. I'm start I start dcing in and the thing goes lower, man. I'm I get I'm salivating even more because I know risk worth is good. Nothing has changed about the analysis, but now I can lower my entry. Fantastic. Fantastic. Obviously, it it does not work if you go all in. Okay, it does not work if you go all in. So, anyway, thanks for questions. Thanks for questions. I hope you you guys are okay when I call you Plebber sometimes, but I mean, it's fun. Listen, if you want some um PC podcast, maybe this is not it. And we've all been pleb. I've been pleba. I just published a video where I I'm telling you where I lost like high high seven figures. And it was very high seven figures. It was below 10 million but it was high seven. So I mean it's okay. We're all pleba. We're all pleba in in one way or another. But throughout my journey since 2013 I had times when I was down high seven uh seven figures which is yeah below 10 million and like very high towards exactly. Uh and uh yeah we've all we've all been pleba play is a great thing to to be uber plea. Exactly. So uh yeah that's that. Uh now let's let me just check a few things which we didn't check which we always check. For example, let's check ETF inflow outflow. What happened here? Uh minus 100. Uh uh minus 100. Yeah, there you go. Uh that was on the 23rd. So let's see if it will pick up or not. Then what else we look? Oh yeah, hyperlquid. Let's see. Hyperlquid. What's happening here? Gigachad bearish. G big brain slightly bearish. Digimon pro slightly bearish. Let's look at historic. No big change really. the those that have highest P&L or bearish or slightly bearish and then the plebe the plebe like Lil ai sacrificial plebbea other holder and wreck plebbe are super bullish that's it let's check pan stat what's happening with pan are they still man pan they're printing they're printing the a lot of memes are coming back now guys no memes are coming back so sorry this is not correct there are new memes that are pumping this is what I mean like memes as a whole like as a concept come back because new memes memes are pumping like it was this penguin thing which was uh during the weekend Trump posted the penguin that he goes hand in hand and there was a bunch of this penguin meme so memes they don't come back if there they can be today and in a 12 hour period they're go to zero and they never come back okay so uh yeah I mean there is still speculation that's why you could make the argument that we need more flash that we we probably maybe we need to see that very very nice 200 week to really flash because I mean people still uh they still speculate on on me on memes uh and memes really didn't I mean look here in in October yes they went to kind of low and here in but then I mean they're they're back basically towards alltime high isn't that crazy can you say in the comment section it's crazy because I think it's crazy guys I I think it's crazy the speculation on memes is around alltime high because now we look at pump fun daily revenue in soul it's like alltime high what's happening It's crazy. That's crazy. Importing penguins into the Yeah. Will that work? Can you take penguin, you put it in the northern hemisphere? Will they survive? They have the fish, they have the Have people tried doing that? I don't know if it's uh like legal under international law or whatever, but uh uh it would would be a fun science experiment. You take a bunch of penguins, you airdrop them. Boop boop boop boop bangos parachuting into Greenland. Well, why not? They have the snow. They have the ice fish. I'm not sure, guys. If you are a biologist, you're botanic. How you say do you say botanic? Botanism. You're into bot bot botanism. Let let us know if uh it would be possible. I mean, fish is technically there in the water. There is fish there. So, what's the problem? Let's get more penguins. Let's get more penguins. So let's see. Let's see guys. Solana privacy. Uh haven't seen that. We'll check. Uh Uber plebs. Yes. Um can we expect you on forecaster? Absolutely not. Absolutely not. Absolutely not. Uh this Zora I don't know mint me mint tweet there. It's it's on Farcast, right? And Farcast is just sold. Didn't they sell somewhere? So it's not even the same forecaster as before. Penguins are only in the south pole. Yeah, that's what that's what I'm saying. Let's air drop them into the north pole. Let's do experiment. If Trump gets Greenland, he should try that experiment. So his picture is correct. What what's your opinion about Saul? So technically I love Saul as a solution. I'm a soul use case enjoyer. They have tokenized stocks. They have all kinds of stuff very fast. I mean you see memes is I mean basically all retail use cases it's all guys from a price perspective I have to be upfront with you. It it looks quite bad. I mean it is support now into support now but I I would still not touch it because it's bare trend. It's below the moving average the the 50we moving average. Where is the 200? Yeah 200 is still here. is below the moving average and the moving average is trending down which means that it is a bare trend. Here is by the way an interesting lesson for you guys. If the 50 moving average is kind of like the sideways then whether we go up or down above or below it it matters less because it's just chop. It's just chop like there's nothing to say if the price just you know goes sideways for many years and it goes up and down uh up and down of this 50week moving average all the time. There's not there's no like there's no message in that. There's no if the moving average is pointing down like it's doing here, then there is a bit more message because it means that the downward trend is real. We have a downtrend. And if we go above it, it's a change of trend. So yeah, this one is pointing down, but we're far below it. Like we didn't even get to pet it. Not not even, you know, touch it or break it. We didn't even get to pet it here. Okay. We didn't even get to pet it here. So, it looks quite weak. Uh let's see if this support holds. I mean, maybe it holds, but if Bitcoin goes down, guys, this support is not going to hold. Then you have another support here. Uh and then you don't have any support until 30. Okay. So, Sana as a use case, as a as a thing is very good, the best. I mean, I think it's going to dominate retail onchain markets. It currently is doing that already. Like already is doing that already is doing that. If you are a crypto enjoyer since 2021, maybe you use all of the freaking L2s, a million L2s, you do the bridge and everything. But you know, most people who join crypto in 2024, 2025, they they they trade memes. They just are they download Phantom Wallet. In Phantom Wallet, you can also go long or short with leverage. You have the tokenized stocks. Why the hell would you like bridge to freaking arbitrum or what the hell? It's uh the the experience is is not great. And u again if you have experience of bridging and being this like super technical uh nerd from because you were here 2020 2021 when all of this L2 kind of started then for you it's like easy you know bridge this and that you're like bridging is in your in your DNA. If you um if you are new newcomer I mean mainly you are in uh you are in Phantom and you stay in Phantom. Okay. So uh use case great price can be very brutal. Solana can be very brutal. I I don't hold it since the uh October 8th derisking. Um long term I'm still I think it's going to go to fantastic highs long term. But shortterm guys it is what it is. We trade the market we have not the market we want. Like Ben says I love that saying is the best and uh it looks weak. And don't get surprised if it goes to 30. I'm not saying it's going to do that. Like again the plebe will will think oh Ivan said 30. Ivan is bearish. Listen, it it looks weak. I don't have it. I'm not saying it's going to go to 30, but I wouldn't get surprised. I wouldn't get surprised, guys. I wouldn't get surprised if it is at 30. If Bitcoin breaks down, I wouldn't be at all surprised because Sana can be very brutal. Again, we said earlier in the stream, here it was down how much it was down here, here it was down 70%. So, you may say it's undervalued, then it went down another 90%. From this 70%. So maybe if you're new in the maybe I don't know when you enter market maybe if you're new to the market you may think that Sana is kind of like Bitcoin you know you have Bitcoin you have Solana but no man Sana can go down a lot and very fast and and super brutal. Okay. Okay. So all in all keep the use case and um price separate. Uh I'm happy to change my mind. If Slana goes above the 50 goes into bull trend uh then yeah then it's a reasonable bet to to be bullish here for now. Bara, barra, barra, trend is your friend and the trend is barra. There was a brief historical introduction of penguins to northern Norway in the 30s, but these populations did not establish and eventually disappeared. Polar bears ate them. There you go. It's the bears, guys. It's always the bears. That's why bear right here. So is the bears. Just like they eat your portfolio, your alco portfolio that goes to zero because you don't derisk. You don't go to bullming.com. You don't watch the free training. It's free, but you still don't watch it. Why? I don't know why. What do you do? You're going to scroll reals or like what you what are you doing? Why you don't watch bull? Anyway, Barra eats your portfolio big time. Barra has been eating all coins bigly. And Bar also ate the penguin. No penguin in the in the northern hemisphere. Ivan, do you trade options? No, I don't trade options. Um why maybe the logical followup? I keep it simple. I mean for me it's it's enough with just the spot and with the leverage and uh that's it. Um I need to be more more of a sophisticated investor to do options. Okay. More of a I'm see here I can call myself pleb like I'm I like to keep it simple. actually keep it simple. Um let me know if you if you do it but for me it's uh listen also you you don't have to complicate too like whatever works for you I haven't I I just don't have the experience so I can tell you I'm pleba when it comes to it I and maybe I see a need for it in the future I mean something you just discover like an instrument for now I just love the simplicity of uh what we have here with bull trends flipping this and that I can tell you To use this, you don't need to know any option. You need to know any option. Like all of this when when things flip, look at commodity, look at precious metal, you you didn't need to know any anything about options. Okay? You you didn't need to know that. People over complicate a lot. They do options, call option, put it's what are you doing? What are you doing? Just keep it simple. I mean, most people they they don't have they don't even know risk management. They don't know what R is. they uh for them so you know option for them is like uh too much it's too much I mean even for me like I haven't seen too much need to do it yet but maybe it makes sense uh exactly what about 360 I'm not saying I'm not saying never I just say I I haven't needed it too much yet but uh yeah as we as we grow as sophisticated 360 investors maybe it makes sense so I'm not ruling it out I'm not ruling it out I'm just saying like for now I haven't really been needing it. Uh, let me know how you use it. I mean, I'm happy to learn. Let me know how you use it. Um, as a sophisticated options trader, man, coffee is over, guys. Coffee over. Show is over. Thank you all for being here. Smash the like as soon as possible. Big shout out to uh Dub for timesamping us. We will be back tomorrow. Hope you enjoyed. Smash up the like. Go to bullme.com/partners for exchanges whether it's bionex by bit uh bitunix other ones you can trade stocks you can trade I mean you can trade anything you can trade stocks you can trade crypto you can go long you can go short uh with bionex you have the copy bot feature here uh and the other ones you have uh here below buy bit between next weeks uh capital if you want to trade people ask they want like a trady platform to trade commodities you can go to capital.com all the links are in bullion.com/partners or in the description exchanges I use, you get always nice big fat signup bonus. Nice big fat um if you use the links and you support the channel. That's the best of both worlds. Guys, have a good day and goodbye. Goodbye. I [ __ ]"
    }
]