[
    {
        "video_id": "hP9rC7Gy4Z4",
        "title": "Bitcoin Whales ARE SELLING BTC!! What You NEED To Know!!",
        "published_at": "2025-12-13T14:01:17.000Z",
        "sort_date": "2025-12-13",
        "url": "https://www.youtube.com/watch?v=hP9rC7Gy4Z4",
        "views": 25679,
        "duration": "00:15:58",
        "transcript": "Everyone talks about strategy potentially selling BTC, but almost everyone forgets about the Bitcoin mining companies. Many miners face rising operational costs. And with BTC's price falling in recent months, miners could be the first Bitcoin whales to dump huge amounts of BTC. Case in point, some have already started pivoting towards AI, signaling that they may not see Bitcoin mining as a sustainable long-term business model. That's why today we're diving deep into the Bitcoin mining industry to help you separate the FUD from the facts. My name is Lewis and you're watching the Coin Bureau. Before we get into it though, you need to know that I am not a financial adviser and nothing in this video is financial or investment advice. This is educational content intended to inform you about Bitcoin mining. That sounds good. Well, prove it by punching that like button and let's get going. Now, if you ask someone which companies are hoarding BTC, chances are their first answer would be Strategy or one of the other well-known Bitcoin treasury companies like Metanet, for example. Bitcoin mining companies would probably be further down the list, which is odd when you think about it. That's because Bitcoin miners are actually directly involved with Bitcoin, and many of them hold more BTC than some of the largest Bitcoin treasury companies. And what's scary is that recently these Bitcoin miners have started selling. Let's start with the largest Bitcoin mining company, MEA Holdings. MEA began its Bitcoin mining operations in 2020 and has since accumulated 53,250 BTC at the time of shooting. This makes it the second largest publicly traded company holding BTC, second only to Strategy. For most of 2025, MEA held onto its BTC even as its price hit new all-time highs. That changed in September, though, when the Bitcoin miner sold 362 BTC. Then in October, Mea moved another 644 BTC to exchanges, presumably to sell. That sale hasn't been officially confirmed, though, and it appears that there haven't been BTC sales since. Next up, we have Riot Platforms, which has been in operation since 2017. At the time of shooting, it holds 19,324 BTC. Since Q2 of this year, Riot Platforms has been selling hundreds of BTC each month and has sold almost 3,000 BTC so far. Then we have Hut8 Mining Corp., which was also founded in 2017. Since then, the company has accumulated 13,696 BTC and hasn't sold any this year, at least not yet. That's largely because in early 2025, HUD 8 partnered with Eric Trump to launch American Bitcoin, which gave it a boost. Anyways, fourth on the list is CleanSpark, which began mining Bitcoin in late 2020. As I record this, it holds 13,01 BTC. In Q1 this year, CleanSpark sold minuscule amounts of BTC to cover operational costs, but ramped up sales from April onward, similarly to Riot. The result is that over 4,000 BTC in counting has been sold. And last on the list is Kango Inc., which is one of the newer players in the space. It only started mining Bitcoin in November of 2024, but already holds over 7,000 BTC. KGO hasn't sold any BTC yet, and its monthly reports proudly state that quote, \"Kango holds Bitcoin for the long term and does not currently intend to sell any of its Bitcoin holdings.\" To some, then the largest Bitcoin miners have sold around 8,000 BTC this year so far. The good news is that this is less than a billion dollars of sell pressure, which probably happened over the counter or OTC, so it likely had minimal impact on price. The bad news is that there's been a clear change in the trend since the start of the year. Bitcoin miners seem to be selling more and more BTC. And that reminds me, if you're looking to trade Bitcoin or any other crypto, then you have to check out the Coin Bureau deals page. That's where you'll find exchange signup bonuses of up to $100,000, trading fee discounts of up to 50%, and deposit cash backs of up to 75% on the best crypto exchanges. Just hit the links in the description or scan this QR code which will take you right to the deals page. There you'll see all of our offers across a range of exchange partners. Simply click one of the sign up now buttons and that should take you right to the deal. These deals won't be around forever though, so take advantage of them while you can using the link in the description below or by scanning on the QR code. Okay, so why have Bitcoin miners started selling BTC? Well, there are many answers and one of them is Bitcoin's having event in April of last year. As you probably know, the having cuts the BTC block reward in half. In this case, from 6.25 BTC to 3.125 BTC. Logically, this practically haved the revenue of Bitcoin mining companies. In theory, this should have resulted in less mining as unprofitable miners go out of business. But in practice, both Bitcoin's hash rate and mining difficulty have doubled since the having. This means costs have increased while revenues have decreased. To put things into perspective, the average cost to mine a single BTC is around $100 to $110,000 depending on your source. As I record this, BTC's price sits around $92,000. And that's after recovering from a dip to $80,000. Logically, this suggests that Bitcoin mining isn't profitable anymore. So, game over for Bitcoin miners then, right? Well, not so fast. Although Bitcoin miners can't change the price of BTC, they can reduce their operating costs by doing things like vertical integration and sourcing cheap renewable energy like surplus hydro or solar power since it's far less expensive than relying on standard grid electricity. But the uptick in BTC sold by Bitcoin miners since the start of 2025 suggests the struggle is real. But just when it seems miners might be pushed to breaking point, many have actually doubled down on Bitcoin by adding more BTC to their treasuries. For example, after the October liquidation, MEA bought the dip, adding another 400 BTC to its balance sheet. Meanwhile, other mining companies are expanding their fleets by purchasing additional AS6. So, no, it's not game over, but it's been tough out there. So much so that some Bitcoin miners have decided to start playing different games. Nearly every major Bitcoin miner in the US has pivoted towards AI and HPC, high performance computing. So, why is this? Well, the answer is unfortunately very clear-cut. Mining isn't very profitable right now, but AI and HPC certainly are. But how big is the incentive to switch from mining Bitcoin to AI and HPC? Well, a magazine dedicated to crypto mining recently said that quote, \"Bitcoin mining has entered what is effectively the harshest margin environment of all time.\" Before adding that, quote, \"At this level, profitability stress is no longer theoretical. It's systemic.\" Yikes. Simply put, the Bitcoin mining sector is facing its most severe profit crisis ever. Energy costs have skyrocketed and critical infrastructure like next generation AS6 and advanced cooling systems has made competitive mining far more expensive. These increased overheads combined with Bitcoin's rising hash rate have made generating profits significantly more challenging. Even the largest mining companies with the deepest cash reserves and most advanced tech have been hovering around break even since last year's having. Take a second to consider that the having means that companies that were profitable when BTC was $50,000 would now struggle at $100,000. And of course, this raises serious questions about the 2028 having logically the break even level for miners would be somewhere around $200,000. But hey, let's not get ahead of ourselves here. In any case, this is why mining companies are increasingly shifting from their core business to AI. For every kilowatt hour of energy, AI data processing can generate two to 5x more revenue than Bitcoin mining. On top of that, demand for AI far outpaces that for Bitcoin since tech giants are racing to build the most advanced and most lucrative AI systems for their users. But here's the twist. In their race to stay competitive, Bitcoin mining firms have inadvertently positioned themselves perfectly for the AI revolution. Many are already located in regions with abundant electricity, operate industrial-grade cooling systems ideal for power- hungry AIG GPUs, and run fully automated, remotely manageable sites. Most importantly though, these companies are hyperfocused on maximizing uptime and efficiency. This is why many tech giants are tapping mining companies, scrambling to secure the GPU capacity that they need. For example, in August, Google boosted its stake in Bitcoin mining firm Terowolf to 14%. Then in September, Terowolf announced a $3 billion raise to finance the buildout of new AI data centers. Some Bitcoin mining firms have gone as far as to abandon mining BTC entirely. One of the most striking examples is Bit Farms, which recently announced its plan to completely exit the Bitcoin mining sector by 2027. There's also Core Scientific, which was once a major Bitcoin mining company before declaring bankruptcy in December of 2022. The firm reemerged in January 2024, reinventing itself as a provider of AI and HPC infrastructure. Even Riot, the second largest Bitcoin miner, is starting to shift its focus. As Riot vice president Josh Kaine explained, quote, \"As our strategy has evolved, so has our approach to Bitcoin mining. We no longer view it as an end goal, but rather as a means to an end to maximize the value of our megawatts. Obviously, this spells trouble for the Bitcoin mining industry. But there's an important caveat to keep in mind. Mining companies can't just repurpose their ASIC miners for AI or HPC workloads. The hardware simply isn't compatible. AS6 are built for one task, computing hashes for Bitcoin's proofof work blockchain. By contrast, AI depends on GPUs or TPUs, which can handle diverse calculations and massive volumes of data. Mining machines are designed to do one thing and one thing only, making them fundamentally unsuited for the flexible data inensive demands of AI. As such, most Bitcoin mining companies are approaching AI as a side hustle, at least for now. Their AS6 continue to operate as before, but their operators are now juggling two business models. But whether mining will remain the main objective or eventually become the side hustle to AI is another question entirely. By now you may be wondering how BTC's price could be affected as Bitcoin miners continue to sell. The good news is that there's no clear direct correlation between minor sales and BTC's price. From our perspective, this comes down to three key reasons. First, it's widely assumed that miners will occasionally sell BTC to cover operational costs. So long as they're accumulating more BTC than they're selling, there's little cause for concern. The selling is effectively already priced in. The second reason is that mining companies typically announce their sales only after the fact, usually in a monthly earnings report. Since the exact timing of these sales isn't always clear, BTC's price rarely reacts. The third reason is something I mentioned earlier, and that's that Bitcoin miners typically sell their BTC OTC, which has a minimal impact on price and often isn't even traceable to anxious Bitcoin watchers. That said, some BTC sales by Bitcoin miners have been spotted onchain. For instance, in November, onchain analytics revealed that MEA moved 644 BTC to exchanges on the 20th, coinciding with a 12% drop in BTC's price. There's also the thorny issue of selling BTC to pay down debt. For context, Bitcoin miners had taken on 12.7 billion in debt by October this year, largely to fund their AI and HPC pivots, and partly to expand mining operations. For reference, this is a 500% increase from the 2.1 billion recorded in October last year. Logically, this means miners could be forced to liquidate some BTC to repay their debts when they come due. The good news is that most of these deadlines are still years away. The bad news though is that this debt carries its own set of risks. For example, in December of last year, MEA raised 850 million through convertible notes. Basically, debt that can later be converted into company stock. Fortunately, this debt doesn't mature until 2031. But unfortunately, this means Maristock will experience extra sell pressure. There are plenty of other cases like this, but you get the point. Most of these debts won't mature for years, and it's likely that they'll be repaid well before then. Thankfully, the use of convertible note debt means that the only asset that really is at risk of being sold is the company's stock, not BTC. So, after everything that we've covered, you're probably wondering whether the future of Bitcoin mining, and by extension, Bitcoin itself, is at risk. Well, let me put your mind at ease. The AI pivot poses no real threat. But with all the scary stuff that we've discussed, how can we be so sure? Well, it's pretty simple. Even if major mining firms scale back, all that will happen is that Bitcoin's mining difficult will decline, making it easier to mine BTC. Eventually, the cost of mining BTC will fall back below its market price, which is likely to stay elevated from steady institutional buying. Believe it or not, but something like this has actually happened before. When China banned Bitcoin mining in 2021, Bitcoin mining saw its largest difficulty reduction ever at nearly 28%. And yet, the blockchain kept chugging along completely unfazed. But it's important to remember that most Bitcoin miners aren't quitting BTC. They're simply branching out into AI. Paradoxically, this is actually good for Bitcoin. The AI strategy is likely to generate significant additional revenue, much of which could be reinvested into expanding mining fleets, making these companies even more competitive and more profitable. That said, any forced sales by major players could create some short-term volatility, especially during a bare market. In that scenario, BTC's price might drop more sharply than many expect, potentially triggering a cascade of additional panic selling. The good news is that even this wouldn't undermine Bitcoin's core value proposition or the security of its blockchain. Many companies, whether miners or treasury companies, would likely buy the dip, as would most investors. Before long, BTC's price would inevitably climb to new all-time highs, as it has done historically. Bitcoin will continue growing from strength to strength, and those who get the faith will be the most rewarded. question is, will you be one of them? Okay, that's going to be all for me for today, folks. And if you're wondering how much BTC that you need to retire, well, you could check that video out right over here. And if you want to learn which asset manager could push BTC to new all-time highs, well, we have a video about that right over here. Thank you so much for watching, and I'll see you again very soon. This is Lewis signing off."
    }
]