[
    {
        "video_id": "3cDs7cPld-0",
        "title": "⚠️WATCH IF YOU OWN #PLTR #SOFI #NVDA #AMD #HOOD #TSLA",
        "published_at": "2025-12-13T14:00:06.000Z",
        "sort_date": "2025-12-13",
        "url": "https://www.youtube.com/watch?v=3cDs7cPld-0",
        "views": 87019,
        "duration": "00:33:01",
        "transcript": "If you're worried what's happening with your favorite tech stocks this coming week, I'm talking Nvidia and Broadcom and Apple and AMD and Tesla and Sofi and Palanteer and all the big ones out there, then you found the right video for you. I'm going to bundle my ex investment banker knowledge and present it to you in a way that will hopefully give you some actionable insight. If you're wondering where the heck I am, I'm I'm on the move once again. Some of you might be able to guess where this is. put it down below in the comments. And if you look at the heat map just from Friday here, this is in Trade Vision. The tool I'm going to use the entire video is tradevision.io. It's something that we built, not something I'm randomly plugging. Um, I'm building it with my my co-founder because we want to make actual data and the news that matters to you, available to you, uh, for really just very very little. Um, I think it's like 16 bucks a month or something like that. 19 bucks a month, something like that. Um and what you see here is clearly that tech and software so tech of all had a tough tough Friday but much of the rest of the market was actually doing quite decently. If you just look at all sectors of the same size you can see there was some real like green stuff and farmer and restaurants and candy and sort of the real economy doing quite nicely just software and tech getting hit pretty hard. Now before we dive into the individual stocks and we're going to do that we're going to look at the charts we look where the support and resistance sit. going to look at where do institutions buy and sell because we can look that up in here and we might even look at some dark pools. We need to look at the the bigger picture. What's the big stuff that has happened the last week? Build a fat cap, right? Rate cap. That was widely expected. It doesn't actually do very much. But they also started printing money again. Some $40 billion. I told you that was going to happen. They did exactly what I said they were going to do because otherwise the banking sector will crumble. It also offsets what's happening in Japan. Japan's carry trade is unwinding quite slowly, but nevertheless, and that's withdrawing money from the US bond market. You take that money away, you got to replace it. Otherwise, interest rates go up. What happens if interest rates goes up? Well, the US spends more than a trillion dollars on interest, which is insane. And well, mortgages get more expensive, car loans get more expensive, business investments get more expensive. How is Sam Alman the um wonder child going to finance his $500 billion investment which he doesn't have? Right? That's kind of what's at stake here and that's one of the reasons the market tanked there a little bit. Um Trump also coming out saying whoever is the next Fed president is leaning towards Walsh or Hassid here. uh and that they're going to lower interest rates and that rate should be 1% or lower a year from now which would be I mean an enormous boon to the market and that's I think also what we need to zoom out for a second before we look at the individual stocks here and I promise you we're going to definitely do that um if you think this through the Fed is printing money again Trump's new Fed chair will cut interest rates as deep as the knife will allow and at the same time You've got midterms coming up in the autumn, which means the fall, as you think you call it. Um, which means the government's going to do everything to keep spending, to keep, you know, the wheels going to make sure they're going to win it. So, just think that through like how is it possible we're going to get a crash? It's always possible to get a crash, but it would be some bank falling apart or some hedge fund guy, you know, taking too much risk and crashing something. Not before that ever happens because my ex-banker friends are all very responsive. Yes, they really care about the economy and the little guy, right? Um but and this is one thing I should also mention today. It's literally the last day where we are allowing enrollments into our mentorship program where you can learn from those very people literally my mentors exod street guys who managed billions of dollars for hedge funds and Goldman Sachs and and best stance they fell apart right and and all those big banks and they actually know how the market works. They actually know how to protect their own money and and can teach you how to do the same thing. If you're interested in that, you can book a free call at freedologum and literally this is the last call. Why are we closing enrollments? Because it will be full. It's like the intake the year the class will be full. So um there's that. You want to take action on that? Do that right now. Fenix transfer stream link is down below. Now let's go and kick off. I was going to kick us off with Nvidia, but we're actually going to kick us off with ABGO because that's one of the things that really tanked the market here on Friday. and big candle down there, right? Look at that. You see that gap down there? Like that's that's a sort of hideous thing that Let me get a pen. This is a sort of hideous thing that we don't like in stocks, right? That's a really really bad sign when you get a gap down like that. Now, you can um you can look at what is actually happening here. Um why did they fall? Well, revenue was pretty good. Data was actually pretty good. But but they warned that margins are going to get squeezed with huge backlogs. Uh they have a 10 gawatt open AI agreement which is again open AI spending money it doesn't have. So the market is a little worried about that. The market doesn't like the ideas that profit margins are going to fall. Now if you zoom out a little bit here, what does that actually tell you? Well, just look at the chart for a second. And let me get a yellow pen here. You see that yellow line there? Right? I haven't got a pen. And I've only got a mouse, so you know, can't be writing very much here. But that's the 50-day moving average line. So, can we write down on it? 50 58 MA. Uh, and that's that's the line of all lines. And what do you see? Well, look, we hit it here in September. We dropped a little bit below it in November. We're hitting it again here in December. So, in itself, we did it a few more times here and there, too. In itself, that isn't such a terrible thing. Typically, we found support at that level. So really watch out on Monday. Big big big AI tech sentiment indicator. Is Broadcom going to bounce back and close above this yellow line there right now? That's what I would look for. Second thing I'd always look for is what are institutions doing? Well, look, institutional support was at 387, but we crashed through that. There's no institutional support yet. Institutions are have left the building. The next thing you can look at, this is all in trade vision. There's a link down below to get a free trial to it. You can look at the dark ports right now. Broadcom doesn't make the the worst of the day in terms of sell-offs. But if we can look at the actual trades, go in here, type in Broadcom or AVGO, it doesn't really matter there. And then you'll see for the day even institutions were bearish in their setups. Not massively, but somewhat. Now, the biggest trades at the top here, there are a couple of bulls, a couple of people buying um call options. Pretty pretty big trades actually. a couple of million, 8 million at the top. But a lot that is also just people just closing their positions, just just giving up on life. So there is definitely a story here that isn't, you know, 100% wonderful. And how does that then feed into the rest of the AI world? Well, everything is interconnected. And that's why I see so often in students portfolios and like, oh, I've got 98 stocks. I'm over diversified. I'm like, it's all tech. It's all AI, you know? So that that's a thing. This is just something to to learn and and to like adapt so that we can make money no matter what happens out there in the market. At least that's the goal. Now, Nvidia here is also tanking quite a bit on that news just because bad for the AI market, bad for Nvidia. But where are we? Well, look at that blue box I drew in here in in in November or something like that. And are we below that zone? No, we're not. We're still in it. So actually we've just done exactly that, you know, we've just done gone exactly sideways. But there is one more thing here. There is something here. I'm not a huge fan of sort of, you know, banana patterns or random stuff that the market comes up with, but you do have a pretty clear head and shoulders thing here. Left shoulder, head, right shoulder. And and and how do you read those? Well, you look at the armpits. So basically this is armpit number one. I guess it's a bit messy, but this is probably armpit number two here. This is armpit number two. Connect them with a line and when you drop below that, then you tend to get a really nasty downward movement. So, it's a possibility. So, what do we want? We want to hold on to these sort of 175 levels here as a close. So, write that level down. That's what I would do. We look at institutions. Guess what? They're sitting at 175. It's almost as if these lines and patterns and trends matter because the whole market moves on that basically. Now, Nvidia does have some good news. They are potentially going to make more H200 chips for um see the red flag there behind me, that one there, China. Um, and that's because first Trump has permitted exports of these chips to China and apparently the big Chinese companies, Alibaba and so on, they're very very keen on them and therefore they're going to buy a load of them and and Nvidia, this is kind of funny, right? Nvidia's like, \"We're at maximum capacity. We can't build anymore, but then um we might we might increase production um if there is the the China demand there.\" And you're kind of like so you can increase production but you are at the limit but try and make this make sense for me and that in itself also sews doubt about the story right is there really more demand than they can possibly satisfy or can they satisfy more demand that's the question but either way it's good for Nvidia because there is there now let me go on my watch list here and this is actually one of the coolest things about trade vision honestly our watch list as a setting here. You can make as many watch lists as as you want, I believe. Um, and you can take any of them. So, say I have a I have a robotics watch list or, you know, one of my portfolio watch lists or whatever, like here, this one here, right? And if I want to get news on all of these stocks in that portfolio, some not there anymore like VR that got knocked out. Um, we turn on this little slider here and I'm now going to get news about these stocks on my phone as pop-ups and only the news that actually is like to move the stock. You want to get those two free trial, go to tradevision. Um, there's a link down below felix.com/tradevision. Right. So, that's a that's a very very cool feature that we got there with those watch lists. I've got some of our key stocks in here that we're going to look at today. Let's look at AMD next and then we're going to leave the whole chip sector behind us. And AMD also tanked a bit on Friday, 4.8%, not as much as the other ones. Um, it basically stopped at exactly the sub level, the support level, the institutional support level. It's almost as if institutions were actually buying that. Yeah, of course they were. We did below it, they bought us back up. So we are sitting exactly at the at the support level there which is again having this data knowing where the institutions are sitting and where they're selling and buying very very important. So take advantage of that. So AMD here um I I I don't see it as a doom and gloom. Um it is sort of you know we're slightly above the the recent closes lows here. We're a little bit above that. Not the end of the world, but we have had trouble breaking out of this zone and crossing the 50-day moving average line, which makes me a little cautious on this. So, this is more of a sideways mover than anything else. Uh, Oracle has also had an interesting week. So, where is Oracle? Here it is. Um, catast catastrophe, right? Uh, would be would be the word I describe that as. Now, were there warning signs? Yes. Am I telling you this in hindsight? Well, yes and no. I'm telling you the rules first. When you break through a 50-day moving average line, when your 50-day moving average line goes flat, that's a sign. Pay attention. Tighten your stops. That's what I would suggest. When you have a little gap down the day you break through the 50-day moving average line, get your hard hat out and your parachute and just get the freck out of the stock. Would be my general advice, but obviously I'm not giving you financial advice. You got another gap down here. Little bit of recovery is usually a false recovery. usually on pretty low volume as you're seeing here and then you get a massive gap down and it's it's it's it's it's all over. It isn't all over but I'm just saying there was a place to exit and that was up here, right? And we're now 32% below that. And yes, I'm telling you that with hindsight, but it is a rule that you could potentially apply to any stock. I do it every single stock I have. I have a stop on it. So, for example, I'm in this beautiful thing here. She's got long legs. She's very attractive. Um she's apparently also related to um Epstein. Um but yes, Victoria's Secret forgotten about that part. Having a beautiful rally up and and we called the entry here down at $22. So we're making we're making really nice money on this one. We're up 133%. Right. Um I did a video on this one, by the way. So this is a public public call. So I think I'm allowed to claim that. How did that work? Well, it was the entry was the entry was um on the basis of this zigzag pattern down here, which is again another pattern that you'll see again and again and we talk about uh but if you want to learn how to really apply those and potentially spot those things, no promises of uh long legs like Victoria Secret, then you know, book yourself a free call and and learn how we do that. So, what have I got on this? You see that red line there? That's my stop. That's there. That's where it is now. It's significantly below where we are right now. Why? Because I only move my stops every Sunday. And I moved it I moved it uh where was it last? So this is where we closed on Friday. So we were here. So I set it literally about 10% below the market. Why? Just slightly below the gap. That was my my rationale for it. And and we've moved we've had a very good good good week. So we're now as I say, you know, if that was now my stop, that would be a 20 odd percent lower. So it might be worth moving that up. And the only rule I have about moving stops is well if the stock moves more than 10% that week to 12% pay attention. Um maybe think about moving it up. That's really all there is. So this this has been been a beautiful one. Um and again it's a sign. Look, we can make a lot of money out of retail stocks. I mean they sell like polyester underwear, right? That's what they're selling. Um and and I don't know what else they sell. Terrible smelling perfume. Last time I walked past one of these and and and it's you know it's a story that's a it's a comeback kid, right? It's a comeback kid. It was once a great beautiful business with, as I say, very long legs and it's it's sort of really really rebounding. Now, how much high is it going to go? Absolutely no freaking idea. But am I going to make money? Abso freaking lutely. Because even if you close me out of my stop, I'm up 88%. Except if it crashes like 20% overnight, which is highly unlikely, right? Unless, you know, they found uh Ebstein's body in the in the underwear drawer or something. You know, stranger things have happened. So, there we are. Now let's get back to um some of the big boys. Google, Amazon, Meta, let me look at Palante, AMD, Hood, Sofi in in in that sort of order. And what do you see with Google? I like the stock. I like the stock a lot. Um I think I think there is a this whole theory that Google is dead because of CHPT seems kind of bollocks. Um because if you start using Google again, uh it's actually pops up now. And Google Gemini 3 is fantastic. I've been using it quite a lot lately. I use it for all my compliance stuff because I'm not just an ex-banker. I used to be a lawyer as well, which some people find confusing. I'm both terrible corporate jobs that I really really didn't enjoy. Um and and I everything I put out I want to be compliant and and one of the key things is FTC compliance and SEC compliance. So, um, if you tell if you tell, um, CHTPT, act as a, uh, you know, FTC or SEC litigator and review the following, it'll literally send you a horribly worded memo um, accusing you of all sorts of things and and it does it very well and and then obviously we adjust the content accordingly. So, no, I think they have a really really good chance here of making continuing to make an LLM. So there's an AI like a JubT that is free, no adverts, and they can just keep that running for so long. But all these guys, the Jubtes and the Anthropics and the X's and everybody else, they're spending these hundreds of billions of dollars on this and there's just Google who's given it away and they're not even running ads on it because they're like, we're Google, we don't need the money, right? And I think I think that's the plan and I think it's going to be a little bit of a tough one for Chad GBT. I think it's still going to be a great business, but it's a it's a tough tough player to compete against. Now, if you look at the chart here, what do you see? It is a sort of soft zigzag pattern here. My my pen is just failed. Can we have another pen? Oh, yeah. We got we got this big pen here. The big pen might might have to step in. This is the backup pen. I don't know why these pens fail so often. All right. So, you have this you have this pattern here. You see that? Actually, you can't see that, can you? So, make that make that like visible for humans. But you're sort of zigzagging down. But what you also see that there's actually a trend that's going down. So, it's pulling back a little bit. Nothing tremendous, just pulling back a bit. Volume is pretty flat. We're still massively above the 50-day moving average line down there. So, it isn't like the end of the world, but we are approaching the recent gap up there. So, watch out for that. The other thing I would watch out for is is the institutional support that sits at 310, pretty much exactly where we closed. So, here we go. 310 and you drop significantly below that. Watch whether that moves lower on Monday. That'll tell you quite a lot about what the market's seeing here in Google. But to me, it's a consolidation. Not the end of the world. It happens. Can break out to the top, but right now it's a it's a positive consolidation. We look at Amazon. You basically see a stock that's just you basically see a stock that is essentially moving in this box. Fairly wide zone about $30 up or down. I think every time we hit sort of 240 probably the man himself sells a bit more. You know, it's got a boat to buy or finally afford top for his wife. Um, you remember the I was kind of mad. Um, good PR stunt, I suppose. So, what are we seeing here? Well, again, it's a it's it's a zigzag thing, right? I always say it's a zigzag thing. It's essentially a heartbeat pattern. And we're above the lows. So, that's pretty good. That's a check. We're exactly at the support level. Well, you'll notice with a lot of these big stocks, we're exactly at the support level. So, we are retesting here. We're not like super excited about the week. We're just a little bit cautious, but honestly, for me, just go back to the very beginning. Money printing, lower rates, right? Got job openings implying a stronger economy. Yeah, I know the little man is suffering, but the but the Wall Street man definitely isn't. And that's ultimately what makes the market. You look at Meta, the bastards. Sorry, I say I say that out loud. Meta had a uh fairly horrible Friday. Just move this over here. Meta is going to turn into Alibaba's Quinn model to train his next AI model. The the the Meta LLM is called Llama. It's terrible in my humble opinion. So, but doesn't matter because Meta is not a search engine, right? Meta is an advertising platform and that's working very well for them and that's really all this is all about. But once again, was there a warning sign about this dip? Yes. You see up here where we broke through the 50-day moving average line. That was your warning sign. The 50-day after that went flat, right? So this recovery up here, I wouldn't have bought it because your 50-day was moving down, down, and down. And then after after the fake out, basically every single time, almost every single time, you break down. You get this little bit of consolidation. You get a little bit of a rally up on pretty weak news, really pretty weak, weak volume, and then the real pain kicks in and people just don't see it again and again and again, no matter how often I mention it. So, write that down. That's that's what happens. Um, right now, yeah, bit of a recovery here, but Friday was ugly and weird. We went as high as 710 and closed at 640. That's a crazy ass candle. Bounced off, hit our head at the 50-day moving average lines. This is not a good story right now. Now, I think Meta is a tremendous business as a long-term value play. It's a tremendous business. Um, in the long run, it is grinding up very very hard. So, you know, if you want to lose value lots, then with a lot of patience, you have more patience than I do. Um, then it's something to look at. But for me, the child says no. Tesla. Tesla. Tesla. Tesla is doing what? Tesla broke out through the resistance line here. I'm going to get told off for uh speaking funny, aren't I? Uh I get told off a lot in the comments. Although most of you lot seem to have a sense of humor. If you don't, well, can't help you. See, actually, there is hope. I'm German. I developed a sense of humor. So, there is hope for all of us. That's the way I'd like to see that. So, there we go. That's kind of where we're at. So, we've got these two eyes up here at about 475 or so. That is your resistance. It is going to be hard to beat those Frenches and therefore it will be tough tough not to crack for Tesla. So it needs to crack that beautiful candle on Friday. Um beautiful story, beautiful volume. Everything looks hunky dory for Tesla. Um but and you can always consult the news as well if you don't know what the heck's going on with the domestic demand shrinking. you know, none of that really matters if they if they um get the self-driving sorted with regulation and if they get their robots out. And I think that's really ultimately the story here. The car company is always going to be a shitty business, but uh if they get the subscription revenue coming in, this is a beautiful, beautiful, shiny beacon of a business. But for me, at the moment, this 50-day moving average line is still pretty much going sideways. So, I would wait till we close above what was the highest close here? It's actually a little bit lower than I painted in previously. It's actually about 470. Do you want to see where the institutions are sitting? 450. So, we're above that. That's positive, right? Do you want to see what the dark pools doing? Let me show you. It is the day of transparency. What are dark pools, by the way? It's where the big institutions trade privately, so you don't see it. That's basically what it is. Um, neutral. Neutral. Um, biggest trade was $11 million on a call option. That's pretty significant at 550. That's actually pretty bullish. and then some more here. So the biggest five trades were very significant call options, bullish options on uh you know Tesla going up. Now Palant here the um Palantiles out there been upset with me because I said stock wasn't going to do very much and um then someone goes, \"You're wrong, Felix. You're wrong. It's also maybe you have a different risk profile to me.\" Um look at the 50-day moving average line there. That one, right? Is it going up? Is it going sideways? Is it going down? It's going sideways, right? Do I buy stocks when it's going sideways? I do not. You may may do. I do not. Um, what does this profile look like? Well, look, you see all these highs, right? See the highs here? They're all about the same level, right? We did break out a little bit here. That was just sort of the market going a little bit bonkers. You see that on most charts right now. And you also see the support that also sits around here, right? So, we're basically trading in a in a in a sideways box. This is a stock that's just got no direction, no momentum. As we recover here, and you know, we're talking $30, pretty significant. What's the volume doing? Right? There was more volume on the selloff than there is on the buy up. What does that say to me? It says to be caution, right? And again, some, you know, people who have got religious, you know, affin's fantastic hairdo. Um, brilliant. Right. The man is, as I understand it, um half Jewish, half African-American, hence the incredible hair, which is just glorious and and a lot of, you know, smartness obviously underneath all that hair. Uh reason enough to buy any stock, I'm told. So to me, brilliant business, brilliant stock, incredible stuff, but this chart says the money isn't flowing into it. And to me, that's ultimately all all that matters. And that's what my mentors told me. It's like follow the money, the institutional money. interested in learning that framework, then book a free strategy call with us, felixfriends.org/freedom. I call them freedom calls because if you don't learn how to manage your money properly, well, freedom is a fairly hard thing to obtain. Um, and then we look at some of our fintexs. Now, fintexs should do tremendously well when rates come down, right? They're very, very sensitive to that. They regarded as high-risisk businesses. Did they? Well, sort of. Midweek was quite nice for them. And then Thursday, Friday, they sold off pretty heavily. Was it because something terrible happened to Robin Hood? Well, if you had an alert set up on Robin Hood, which you can literally do in in in trade vision here, then be great, right? So, what's going on with Robin Hood? Tells you slower trading um deposit growth and higher margin balances, fund the accounts, blah blah blah. A lot of detail there. So, that's one of the concerns is that you lot apparently using margins to trade and invest. Stop doing that. It's insanely risky. Don't do it. They also entered Indonesia, which isn't all that far away from where I am right now. So, what does this say to me? Always look at the highs. Look at the highs. Look at the highs. Look at the highs. So, they are trending down, right? Is that good? Is that bad? Well, it's not great, right? What about the lows? Well, low here, low there. I generally look at the closing lows. Low there, right? And then here, we're not here. So, what what was I telling you? Well, we sort of went a little lower. Now, we've gone a little higher. So, we're not like at sort of danger point down there anymore, but also it doesn't look brilliant. But ultimately, we're basically trading in this box, right? We want to break out of the box before you see clear direction. And then if you look at the 50-day moving average line here, well, what is it doing? It was going sideways, right? Do we like sideways? Sideways is a warning sign. And now it's poking its head down. It's looking a little sad. It's like like Winston, my golden retriever. when you refuse, you know, the second egg of the morning or something like that. She's like, \"But it's very sad. I've only had one.\" Um, so that's it's a sideways pattern. Slightly bearish. That's really all that is. Now, next we had a Sofi on our list. And what is SoFi doing? Well, again, look look at do exactly what we just did. You look at the 50-day moving average line. What is it doing? Well, it's going sideways. Now, it's slightly, ever so slightly poking its head up above the, you know, it's curious, but it's ultimately going sideways. You look at the the highs. Well, there's a high here. There was a high there. There's a high here. There's some highs there. So, we're kind of like, yeah, we've gone on a little bit here, and now we're a little bit lower again. Lows, they're mostly there, and here, and there, and here, and right now, we're here. So, what is it telling you? We're neither at the threshold of danger at the bottom end, but we're also nowhere near breaking out. We're below the 50 moving average line, which isn't great. So again, it is a stock consolidating sideways, waiting for some action. Now, part of that is that people are not expecting an interest rate now coming in the early in the year. So far, I would love that because think about the core businesses, which is currently bringing in very little money. Student loans, right? That's originally where they were. So, think about all these people who've got their student loans on fixed rates. When interest rates come down, say a percentage point. Well, it makes sense to refinance because you can now pay less, right? And people are going to do that and so far is going to make a lot of money out of that if rates really do tumble significantly in 2026. But that's likely going to be towards the second half because Jerome, the money printer, Powell is still in in in in power, sorry, in power uh till till May. but he's going to lose influence. So once the new Fed chair is is officially named um and sometime early in the year from sort of February onwards I would guess that would be my humble guess he's going to talk a lot more about what he's going to be doing and and and how he's going to be talking doing things differently from uh Jerome and therefore people will stop listening to Jerome. He'll be standing in empty meeting rooms just with a few mainstream media journalists and you'll be going where is everybody? Well everybody is listening to the other guy. the other guy is going to say, um, Trump the Almighty is marvelous and and and and I'm cutting rates because he told me so. That's that seems to be the way it's going, which is a in in in an odd thing to happen with an allegedly um independent central bank, but you know, you got to take the world the way it is rather than think about whether it's right or wrong. That's generally speaking what I do. So, got to be looking out. But, let me give you one more one tip for the start of the week. Watch the VIX. Vick is fear. Um, we're actually building something insanely cool on the back of this, a bit more on that in in in a probably a couple of weeks. But this ultimately tells you what the market thinks is going to happen to the market. NIX is at 15 right now, right? Is that high or low? Is that high or low? Well, it's neither super high, it's neither super low, but it's definitely not in the panic zone sort of 20, 25, 30. And therefore, the market is looking very optimistic into the end of the year. And as am I. Does that mean I have a crystal ball of what's going to know what's going to happen in the next week? No, I don't. But I just think if you zoom out, you see what's happening. Money printing, lower interest rates, government spending like there's no tomorrow. And if AI just delivers a fraction of what we think it might deliver, and I use it every day, all of our businesses, we use it for all sorts of stuff. We automated loads of things. And it's um it's tremendous. And it's a huge huge timesaver. uh we can do in two hours what would have taken three weeks a and that's just to me a sign of growth to come economic growth to come. So I think there'll be a lot of money in it. I don't know which AI company's going to make all the money but my guess would be the big tech companies are going to do very very well out of it. I wish you a beautiful week ahead. I wish you a successful end of the year. And if you feel like you want to make 2026 potentially the best year ever, focus on your skills. Focus on your ability to manage your money better, especially the risk management side. That's why people, you know, that's why people like leave so much money on the table. Like someone said this to me the other day, UU for example, and they said they're down like 40% on UU. And I was like, oh man, that's really harsh. because our entry was down here and then where would you have exited? Well, a very very very very risk loving exit would have given you 150% up but somehow someone's down 40% on this and that sucks and it's just like not knowing what to do with something, right? Or here is a stock that did terribly after I thought it was a potentially a good business. Now, what did it do? Well, look, the entry point, you know, I show you my my winners and my losers. The entry point was here at 280. It actually went up 20%. Right? 20% in two days and then it went down. And now it's down 33%. But if you just set up trailing stop, even at 20% trailing stop, you would have exited actually at pretty much zero. Maybe a small loss. Small losses are fine. You can accept them. They happen all the time. But it's just if you haven't got risk management potential like could have made you some money but the slightly tighter stop turned into you know a freaking freaking disaster right shipwreck um recovering somewhat thankfully but people are just going to sit on this now for years and hope it's going to do better. Not the right approach in my humble opinion. So get yourself some education if you want to you can book a call with us if you want to learn about how our mentoring program works at felix.org/freedom. /f freedom where you can learn from my bro mo bro bro bro bro bro bro bro bro bro bro bro bro bro bro bro bro bro bro bro brokers my my my my my my um my mentors or Wall Street guys worked 10 20 30 40 even 50 years for the big institutions and and I think that's who I would learn from doesn't have to mean my lot but I'd learn from someone who's done this institutionally so expensive freedom there's the link there get yourself at least informed in the meantime which is what trade vision is for and all the best in September 86 million Bank accounts were frozen in Vietnam. I showed you the story when it first happened, and many of you thought, well, it was a one-off event, a Vietnam specific thing. Who cares? Not everybody had the foresight of this little monster here. And I told you then this was a test run. I told you other countries were watching. And guess what?"
    }
]