[
    {
        "video_id": "B5hotugHagY",
        "title": "Is Your Crypto DEAD (Here&#39;s How To Tell)",
        "published_at": "2026-01-28T14:00:22Z",
        "sort_date": "2026-01-28",
        "url": "https://www.youtube.com/watch?v=B5hotugHagY",
        "transcript": "Last year, 11.6 million cryptos went to zero. That's 32,000 tokens dying every day. Yes, most of them were memes with a lifespan shorter than a carton of milk left out in the sun. But plenty were sitting in portfolios, bleeding slowly, held by bag holders, waiting for a recovery that will never come. So, how do you know if your bags are deceased or just taking a power nap? And if it's the former, when do you finally pull the plug? My name is Guy and this is the Coin Bureau. Before we begin though, nothing in this video is financial advice. I can't tell you what to buy or sell, and you can't outsource your decisions to YouTubers and expect to do well. What I can tell you is how to check for vital signs, spot the difference between accumulation and distribution, and come to terms with bad death. So, if that sounds good, smash that like. Let's dig in. >> So, a new industry report has tallied the number of dead cryptos, and good grief, there are a lot. According to Coin Gecko, since 2021, more than half of all cryptos tracked on Gecko Terminal have failed. That means that if you picked a random altcoin, the odds of it going to zero were worse than a coin flip. Now, I'm sure most of you knew this instinctively because clearly most cryptos aren't long for this world. But last year was something else. 11.6 million cryptos wiped out. And to put that into perspective, that means 86% of all crypto deaths in the last 5 years. All concentrated in just one year. And the closer you look, the more gruesome it gets. 7.7 million of those crypto deaths happened in Q4 last year alone. So 35% of all the cryptos that died since 2021 died in the last 3 months of 2025. Now unless you've been in hibernation since Q3, you'll know what happened here. The 10th of October last year saw the biggest liquidation event in crypto market history, wiping $19 billion in leveraged positions off the map in a matter of hours. Thinly traded tokens with shallow liquidity pools were vaporized instantly and the market as a whole has been struggling to find its footing ever since. However, the October massacre wasn't the beginning of crypto's rolling mass extinction event. In 2024, Pump. Funds token Launchpad industrialized the process of launching a scam, and crypto hasn't been quite the same ever since. It used to take a team to pull off a decent rug. You needed a website, a plagiarized white paper, maybe a fake LinkedIn profile for your CTO. Now, it takes 2 minutes, and the ability to prompt a meme generator. The barrier to entry collapsed to near zero and the floodgates duly opened. The total number of crypto projects exploded from around 428,000 in 2021 to more than 20 million by the end of 2025. The tiny minority of these that saw any significant trading volume mostly pumped on the back of influencer shills and wash traded volume dumped at the first sign of non-inssider wallets bidding and nuked irretrievably all within a few hours. Now the vast majority of tokens launched in this way are by definition memecoins as there is no project to speak of. The ticker and the chart are the tokens rais on de. You could argue that this is the altcoin in its most efficient form, liberated from the window dressing and stripped down to its essence. And obviously, if you flood the market with memecoins, you're going to see memecoins bear the brunt when liquidity dries up. With no product, development, revenue model, or likable meme to fall back on, these deaths are usually foregone conclusions. Not all deaths look the same, though, especially when you leave pump.fun fun and go further down the effort curve. Some cryptos went to zero because the developer drained the liquidity pool and pieced out. Others bled out slowly over months, their holders clinging to the hope of a reversal that never came. And then there are the zombies, cryptos with billiondoll market caps that still technically exist, still show up on trackers, but generate almost no activity, and have no path forward. Statistically speaking, most cryptos do eventually die and sooner rather than later. Many are dead on arrival or have an extremely short lifespan, but not all. The question for altcoin holders is then, what type of body bag are you clinging on to? As we all know, a crypto can technically exist forever on a blockchain. You might have had the same token sitting in your wallet for years. The smart contract is still deployed on chain, immutable and permanent, but existing is not quite the same thing as being alive. And in crypto, the distance between the two is measured in liquidity. There's no universally agreed standard or threshold for determining when a crypto is dead, but that shouldn't mean it's hard for you to judge for yourself. So, we suggest starting with three simple criteria. Firstly, no trading activity for an extended period of time. Coin Gecko marks as inactive cryptos that haven't been traded a single time in 30 days. This doesn't necessarily mean they can't be traded again and be reinstated as active, but in reality, it's safe to say that this is extremely rare. Zero trades in a day is a bad sign. Zero trades in a week is 99% dead and zero trades in a month is lost to history. The trading volume flatline is usually the first sign. A coin or token that records zero volume for days or even a few hours at a time is very likely receiving zero interest and has been abandoned. If even the wash trading bots have moved on, it suggests there are not even any insiders left to pull the strings and ins snare exit liquidity. Without volume, there's no price discovery, which means there's no realistic way to exit the position without nuking what's left of the value yourself. Now, the second criteria is delisting, which is functionally somewhere between a death sentence and a death certificate. When a major exchange removes a crypto, usually citing low volume, weak development, or regulatory concerns, it usually kills whatever liquidity remained. And of course, if the crypto never even made it to a tier one exchange before being delisted from a lower tier exchange, it doesn't bode well. It may still exist on some decks with $47 in the liquidity pool, but at that point, the prospects of it staging a recovery for you to sell into aren't great. And third, there's the rugpool, which isn't so much a death as it is a murder. In the first half of 2025 alone, losses from scams and rugpulls exceeded $2 billion. These are cryptos where the developer drained the entire liquidity pool overnight, often within minutes of the initial pump and just walked away. The token still shows up in your wallet. The contract is still on chain. It just has no extractable value left whatsoever. Now there is a tricky gray area in some cases where a crypto may appear dead when it is actually in an accumulation phase. The chart could be down 90% volume anemic social media gone quiet holders capitulated. That setup is either the last trickle of volume before the crypto goes to absolute zero or it's the exact moment before institutional players and sharp traders quietly load up at the bottom while everyone else has given up. The difference between those two scenarios is what every bag holder's dreams are made of. But you might not be able to tell which one it is just by looking at the price because it's not price but volume that should tell you whether anyone still cares about a particular crypto. However, not all volume is created equal. Crypto markets are absolutely rife with wash trading where a single entity trades with itself to create the illusion of activity. This is especially rampant on lower tier exchanges where there may be relatively little oversight and on dexes where there's absolutely none. So a token showing high reported volume isn't a sign of life if that volume comes from the same handful of wallets trading back and forth. In that case, you're looking at a low rate manipulator trying to keep the lights on just long enough to find exit liquidity. The giveaway is looking at unique wallet interactions versus total volume. If the numbers don't appear to make sense, well, then they don't. Meanwhile, another useful and underused indicator is onbalance volume. Now, OBV tracks cumulative buying and selling pressure by adding volume on up days and subtracting it on down days. If price is bleeding but OBV is rising or holding steady, it suggests that there are bidders absorbing the capitulation. If OBV is flatlining alongside price or worse, declining faster than price, the token is being abandoned. You should also keep an eye on liquidity depth. If market cap is a vanity metric, liquidity is a sanity metric. A crypto can show a $100 million valuation on a tracker, but if there's only $50,000 sitting in the liquidity pool, that number is meaningless. The 2% market depth metric measures how much capital it takes to move the price by 2%. If a $5,000 sell order crashes the price, the market cap might as well be written in crayon. It's ghost liquidity, a number that evaporates the moment someone tries to realize it. A healthy project typically maintains liquidity at around 1 to 5% of its market cap. Anything meaningfully below that and you're holding an asset you can't sell without obliterating your own position. Of course, there is the question of whether that liquidity is even safe. Any good token screening tool will let you check if the liquidity pool tokens are locked. If the developer holds 100% of the LP tokens and they're unlocked, well, the project is one transaction away from vanishing. Locked liquidity at least means the developer can't drain the pool on a whim, though it says nothing about whether the project has any actual future. Meanwhile, developer activity is another vital sign worth checking if the crypto purports to have some project associated with it. Cryptocurrencies are software protocols and software requires maintenance. A GitHub repository with zero commits in the last 6 months is therefore a ghost ship abandoned by the crew and drifting towards the rocks. But this metric is lowhanging fruit for scammers who have adapted and will often fork active repositories to make their project appear busy. Others make trivial updates, editing a readme file, changing a comment in the code just to generate commit activity on the chart. That's why you can't just look at whether there are commits. You have to check what the devs are actually doing on those commits. Are they fixing bugs, adding features, responding to issues, or are they just rearranging the furniture to create the illusion of work? And being code illiterate is no excuse in 2026. Run it by an LLM and it will tell you exactly what the devs are cooking or not. On that note though, in the age of AI agent coding, GitHub activity is likely going to become a less reliable indicator of project livveness because even the most loweffort scams can now have fully functioning software products that are not vaporware despite next to no human effort, time, or talent being invested. Now, at any rate, a confluence of these signals matters more than any single one. If volume is dead, liquidity is drained, and GitHub shows no meaningful activity, the crypto is dead. But if price is down while volume is quietly rising, liquidity is stable or growing, and developers, perhaps even human ones, are still shipping code, well, that's another story. And by the way, if you're liking this video, you'll love our weekly newsletter where we break down the biggest stories in crypto each week. You can sign up for free using the link in the description. And while you're at it, why not check out the exclusive deals we've secured for viewers of this channel, including eyewatering signup bonuses and trading fee discounts on the best crypto exchanges, great deals on hardware wallets, and much more besides. All that right behind this QR code worth checking out. Now, not all dead cryptos look dead. Some have billion-dollar market caps, active exchange listings, and social media accounts still trundling along. Some have cults of bag holders who will fight tooth and nail to defend them. So, we'd better not name any names. But many are nonetheless zombie projects, technically alive, functionally irrelevant. They're not dead in the sense that they've been delisted or rugged. The networks still operate, but their valuations are held up by the possibility of future adoption, which always seems to be just around the corner, but never quite arrives. Indeed, Forbes named and shamed an entire category of so-called zombie blockchains a few years back, much to crypto Twitter's dismay. Chains that maintain massive valuations despite generating almost no fees or revenue relative to their market caps. Many are still top 100, top 50, even top 10 cryptos. The question for holders of these living dead cryptos is, does any of this even matter? Well, we think it depends. The more obscure a project is, the greater chance there is that it gets forgotten and does not recover during broader crypto market rallies. Conversely, larger cap cryptos, projects that already have a critical mass of name recognition, trading volume, and liquidity, are much more likely to join in such rallies, regardless of their project fundamentals, or functional zombie status. Here, we're getting close to spilling over into a debate about fundamental versus technical analysis. That's maybe a topic for another video, but we'll just emphasize here that market structure is ultimately king. There is no reason to ignore a zombie project if its market structure flips bullish, meaning that the chart prints a convincing series of higher lows and higher highs on high time frames. Likewise, there are no fundamentals or catalysts that are bullish enough to save an asset with broken market structure, meaning one in a clear highframe downtrend until that is the market structure shifts again. So in short, ignore what the chart is saying at your peril. If a crypto you thought dead shows signs of a high time frame bullish market structure, higher highs, higher lows, increasing volume, increasing velocity, then disbelief will only cost you an opportunity. Take Salano for example. Soul fell by more than 95% between November 2021 and November 2022 when FTX collapsed. FTX looked like the final nail in the coffin for Salana, which spent almost all of 2023 in a grueling range between around $13 and $32. Sentiment was very poor. Volumes were low, and many market participants appeared to have written Salana off, but as it turned out, this was only a neardeath experience. Soul started closing candles above this range in Q4, and it was off to the races again. It went on to rally to above $263 over the next year. Now, this may be an exception rather than the rule because most dead cryptos are not coming back. However, we think the more important takeaway here is just to keep an eye on market structure and high timeframe candle closures. So, while your peers are trying to use fundamental analysis to explain why a dead coin pumped or a living coin dumped yesterday, the chart will show you trends as they emerge and crucially when they reverse in real time. Richard Wyoff's market structure framework gave us the language we used to describe what we saw with Salana in 2023, namely accumulation. He also coined the term distribution to describe what we see with other assets that collapse and meander in the same way but fail to recover as sold did. Both accumulation and distribution can look like what some call sideways or choppy price action. But there are important patterns that distinguish the two. A crypto in distribution will be printing lower lows and lower highs with volume that spikes only on the way down. Price slices through support levels without any defense. There's no convincing demand, just bleeding. This can continue for a long time, often until the asset is completely abandoned. Accumulation looks different. You get a selling climax, huge volume, violent drop, but the price finds a bottom and enters a range, chopping sideways for weeks or months as capitulation plays out and whales quietly absorb the supply. A key feature of accumulation that follows is known as the spring. Price briefly breaks below the established range. It looks dead, triggers stop losses, shakes out the last weak hands, and then sharply reclaims that level. This is the liquidity grab. Smart money needs sellers, and the best way to create panic sellers is to make the chart look like it's going to zero. Salana's range in 2023 was textbook accumulation. It held that range through multiple tests, then reclaimed it on rising volume in Q4. That reclaim was the signal. Now, buying during the range is brave. Buying after the reclaim is strategic. As long as a crypto is still making new lows, it's distributing. if it formed a range, held it, and reclaimed it on volume, that's a different setup entirely. So, is your crypto dead, and will it ever recover? Well, to be frank, the odds are that yes and no are the answers. But if you're holding a crypto with significant trading volume, liquidity, and exchange listings, it could be in with a chance. If it is still trending downwards, you're playing with fire. If it's bottomed and showing signs of accumulation, you might be on to something. Just remember though, hope and fear are your worst enemies, and candle closures and risk management are your friends. And if you're disappointed that we didn't name any names in this video, I've got good news for you. We just made a whole video about the possibility that Ethereum could die and send ETH to zero. How's that for some controversy? You can get the full story right over here. That's all from me for now, though. So, as always, thank you all for watching and I'll see you next time. This is Guy over and out."
    }
]