[
    {
        "video_id": "GD0HOMnMeKs",
        "title": "Palantir Stock Set To Move Ahead of MASSIVE Earnings!",
        "published_at": "2026-01-28T03:44:43Z",
        "sort_date": "2026-01-28",
        "url": "https://www.youtube.com/watch?v=GD0HOMnMeKs",
        "transcript": "Ladies and gentlemen, welcome back to Data Dispatch. Hope you guys are all having a good day. We have some very interesting things and rotations that are occurring in the market that we definitely need to be talking about in this video. On top of that, Palanteer making some interesting moves, though it doesn't really seem like it. However, they have a big event with earnings coming up and we have the broader market that basically closes here at all-time highs uh right before tomorrow. We're going to get the decision on interest rates uh and also what's the guidance look like for that. And on top of that, we have huge earnings from the MAG 7. We're going to be breaking that all down for you guys and also talking about precious metals and kind of covering here the dollar index, why we're seeing this huge pump and how long is this going to possibly last for things like gold and silver and we'll be ending it with crypto and also talking about some of the big high beta names that we've been talking about on the channel. If you're a new or returning viewer, hit that like button, subscribe for daily videos. We're trying to hit 30,000 subscribers. Let's pop it up in the screen here. Let's talk about first Palanteer. Palanteer has just kind of been hanging out here at this 165. I mean, over the last week, it's been really kind of just holding support here at this 165, which to be honest is kind of an interesting area. Uh, typically Palunteer likes this the zone between the 170 and the 180. We've talked about that before multiple times on the channel. I feel like doesn't have a ton of trading action in history within the 160s. Uh what we do have here is a little bit of some support recently kind of back in November uh back here in the beginning of December before it kind of reclaimed the 170 area. But nonetheless, it's kind of right below that really strong base that's been trying to be built out and um support level. The fact that it's kind of just hanging out here basically I think Palanteer is just waiting for earnings to be released before making any type of major moves. Uh right now the announcement date is for next week Monday post market. Earnings per share here are estimated to be at 23 cents normalized with 1.34 billion in revenue. Earnings per share revisions in the last 90 days are up 21 times in the bullish direction. Zero on the bearish. So what you can see here is Palanteer is definitely priced for perfection. Uh historically they've done very very well. Uh one thing that people are talking about Palanteer though talking about oh is Palanteer had its run blah blah blah. You're starting to see some of the bears that are talking about that with Palenteer. You know, nonetheless, I think it'll be interesting to see what happens here. But we know this is a very resilient stock and they're continuing to execute at a very very rapid pace and a Palanteer has a slam dunk earnings, which I mean just given their track record that they have, um you could have Palanteer that easily reclaims that one kind of 7180 area. Um, however, if it doesn't for some reason, possibly that's where we could see a further breakdown into the 150s into the 140s. I'm not going to be turning bearish here right now, just because Palanteer is just taking a little bit of a breather, especially after an incredible run that it has. I think earnings will be more of an indicator on the direction on where Palanteer is going. It's kind of my two cents on it. Uh, let's talk about silver and gold because holy Toledo, silver is doing quite well in the overnight session right here. futures for SLV right here are at 10364. Now, this kind of had a double bounce right here at 96 during the intraday and has reclaimed this $100 level. Let's talk about why what could be happening here. Uh kind of what the move is for silver and how long is this going to go cuz if you look here over the last 5 years, you know, this move is just quite parabolic. And even the last year, silver here has over like a 230 or 240% chance change. It is absolutely crazy. 257 to be exact here over the last year. Um, one of the big things that I like here from Amit is talking about currently Trump and the administration is okay with a weak dollar and right now that the dollar index is at its lowest level this year at 9580 compared to 109 before he took office down over 11%. And Amma kind of talks about why does this matter and it makes complete sense and I thought that it would be valuable to you guys here that when the dollar weakens here it says that US goods become cheaper for foreign buyers means more exports more demand more jobs and it helps with the economy in terms of productivity manufacturers and this is exactly what Trump wants to do to decrease the trade deficit. We know he's trying to work on trade. However, when that dollar fails, um the increasing value of hard assets increases quick because now it's going to take more dollars to basically purchase that same amount of a commodity, that same amount, that same ounce of gold or that same ounce of silver. And we're seeing a large rotation here, especially from kind of investors around the world and institutional investors. They're running to gold and silver as what's the next store of value? What's the safe haven if the value of the dollar is declining? And that's kind of one of the big moves here that we're seeing right here. So, we're saying that Trump really never was indicative or kind of basically wishing on a strong dollar and he was clear that he was okay with it weakening, but saying that we don't think he's going to let it bleed too much. The dollar does of course need to maintain some strength, I think. Um, but if it continues to see this rotation, there's a chance that we could continue to see silver. We could continue to see gold that continues to have a move. However, right now, this move is parabolic. Quite crazy, especially for these hard metals. As soon as dollar the dollar starts to gain some value back, if we see some profit taking or anything like this, this is where I could be possibly looking at any type of a short exposure for silver. Uh, just because, um, I don't know how much longer this run has to go. personally don't want to enter any long exposure right now. It's quite interesting to see what happens. And congratulations to all the silver bulls out there that have been hanging out over the last so many years at like 30 20 30 bucks. Uh finally seeing uh these hard precious metals that are paying off. So quite crazy to see. Talking about the general market, we see the spy right now. It's continuing to increase in the overnight hours up about 27 basis points. Do we have 700 on the table as a possible test? I think most definitely if we like the guidance of the interest rates for the future here because right now the market's basically pricing in you know no interest rate cuts. So I don't think that's going to be making a big move. Um and in terms of the all-time highs right now S&P 500 index closed at 6978. So I think 7,000 is definitely on the table if the MAG7 earnings come out pretty strong. We got some major tech earnings on top of that. The benchmark rate is estimated and is highly priced in with a lot of confidence to stay within the target range here of 3.5 to 3.75%. Uh we're going to be seeing though what's the longer term changes to monetary policy. Uh right now fund futures trading suggests two quarter point percentage points by the end of the 2026. So only a total right here that's it suggests two quarter percentage point cuts. So only 50 more basis points. So we'll see what happens. um cuz the economy is continuing to show signs that it is remaining quite strong. We also have here earnings from Microsoft, Meta, and Tesla. And then we have Apple earnings tomorrow. So that could also cause some volatility. If these are slam dunk earnings, you know, personally in the short term, I think that, you know, you're going to see the S&P 500 index, you're going to see the SPY, they're probably going to push over 7,000. We'll see how they trade above that. It'll be really interesting to see what happens. And looking at some of the individual names that caught actually a decent bid today, we see Cipher that has a nice bounce right here. Cipher comes down to 1662 and gets this huge shoot up to 1875. And you can see it's been really trading with a lot of volatility, a lot of swing trading here between the 16s and the highs of 18s. Cipher, I think, will get more exciting if we zoom out a little bit here. Cipher is going to get more exciting once this can break through this $20 area. That's where you're probably going to personally see a little more of a breakout type of a scenario. That's because we have a little bit of a bull flag building here. If the volume shows and stays strong, if the macroeconomic environment continues to do well, especially with these mag seven earnings, if we're continuing to see a lot of demand for um you know, these data center names, that's where I think you can get the next leg up. Of course, these follow, you know, these setups are only as good as her follow-throughs. So, we'll see what happens. But you see that even with IN here that is now at 6053. So, IN also gets that same kind of love today with huge announcements that we saw on Corweath back here at 111. And we see NAS here that's trying to reclaim that 100. Hopefully, it can hold the 100 this time. It's been struggling recently. In terms of the agentic AI names that we've been talking about, Zeta and Path, uh, not getting a crazy amount of love, just kind of hanging out down here. Uh, I'm not scared of this price moving about at all or being shaken out or anything like that. You know, path down here at the 14s is just chilling. You see Zeta right here at the 20s. That's where we've recently had a decent amount of bounces and a lot of support right here at the 20s uh before we saw that launch of 24. So, if we get another nice bounce here, this could kind of confirm this recent triple bottom, which I think would be pretty mega bullish in terms of a technical standpoint for Zetta. Uh, looking right here at cryptocurrency, you see Bitcoin at 89,000 getting a little bit of love. We'll see what happens. This thing's been criticized so hard and with Ethereum that's back above 3,000 just kind of hanging out here. I mean, Bitcoin, Ethereum really have not been making any moves considering the rotation that we've seen into gold and into silver. Uh what does that mean for BMR? BMR just kind of was consolidating here, hanging out at the 27 28 29 area. Uh unfortunately a lot of people got wrecked by the stock uh in the kind of the la basically the end of last year um as we kind of saw some insane price targets and I think some misleading unfortunately you know could of course this get a bid and could crypto experience a nice rotation possibly if we see a rotation out of these hard you know precious metal assets definitely it's just a matter of if that's going to happen and when that's going to happen. Let me know what you think down in the comments. Peace out. Take care. I'm going to catch you guys"
    }
]