[
    {
        "video_id": "iLh-X-OjUms",
        "title": "Trump Reveals Best Investments Now",
        "published_at": "2026-01-28T20:21:48Z",
        "sort_date": "2026-01-28",
        "url": "https://www.youtube.com/watch?v=iLh-X-OjUms",
        "transcript": "Just a couple hours ago, Trump comes out and says, uh, copper is the second most used material by the Department of Defense. America will once again build a dominant copper industry. So, you know, the government is pretty much directing the economy. This is one of the big themes that I highlighted in my 2026 predictions is that the government is going to tell you where to put your money. And instead of being too smart, you should just know where the government money hose is going and set up shop there. So, nuclear, yes. AI, yes. Uranium, yes. And they're saying they want to pump crypto. They're saying they want to push crypto forward, and we hope they do. And as soon as they do, we're going to start screaming from the hilltops to get long our best and most favorite crypto assets. But for now, the charts with crypto are not screaming that they are feeling the love. Not Not as much. So, we're focusing on other stuff right",
        "summary_hu": "Trump hangsúlyozta, hogy a réz a második leggyakrabban használt anyag a védelmi minisztérium által, és ígérte, hogy Amerika domináló rézipart fog felépíteni. A kormányzat gazdasági irányítását is kiemelte, amely arra figyelmeztet, hogy érdemes követni, hová áramlik a kormányzati finanszírozás. Az előrejelzések szerint a nukleáris energia, a mesterséges intelligencia és az urán jó befektetési lehetőségek lehetnek a jövőben, míg a kriptovaluták iránti jelenlegi kereslet nem bátorít. Eközben a kripto piacon a szakértők jelenleg nem jelzik a pozitív trendet, de remélik, hogy a kormány hamarosan támogatni fogja a kriptovaluták növekedését.",
        "summary_en": "Trump emphasized that copper is the second most used material by the Department of Defense and promised that America will build a dominant copper industry. He highlighted government control over the economy, suggesting that investors need to follow where government funding is directed. Predictions indicate that nuclear energy, artificial intelligence, and uranium could be viable investments in the future, whereas the current demand in the crypto market does not inspire confidence. Meanwhile, analysts are not seeing a positive trend for crypto at present but are hopeful for future government support that could drive growth.",
        "crypto_sentiment": "Bearish",
        "sentiment_score": 30,
        "key_points_hu": [
            "A réz kulcsszerepet játszik a védelmi iparban.",
            "A kormány gazdasági irányítása befolyásolja a befektetési lehetőségeket.",
            "A kriptovaluták jelenlegi piaci helyzete nem kedvező."
        ],
        "key_points_en": [
            "Copper plays a key role in the defense industry.",
            "Government control over the economy influences investment opportunities.",
            "The current market condition for cryptocurrencies is unfavorable."
        ],
        "main_topics": [
            "Copper Industry",
            "Cryptocurrency Market"
        ]
    }
]