[
    {
        "video_id": "NAqOqouec4E",
        "title": "When it makes sense to enter silver #shorts",
        "published_at": "2026-01-28T19:00:32Z",
        "sort_date": "2026-01-28",
        "url": "https://www.youtube.com/watch?v=NAqOqouec4E",
        "transcript": "If you are in silver, in gold, in all these assets since the early bull trend, good for you. Fantastic. You've been playing it correctly and you can stay in the trend until it until it ends. If you're following in now, you are doing it incorrectly. I would wait for a return to moving average. Going back to moving average doesn't necessarily mean that it turns forever bearish. The the silver is dead. It's not what it means. And that's why also like these guys who are writing this kind of stuff, you the silver is true money. This I agree with them. just that the amount of FOMO at this levels it doesn't make sense to me. If you did not use our tools for example and you got in in time this was the time to get into silver. This was in time to get into platinum. The return to to the mean is going to happen."
    },
    {
        "video_id": "i72FRhZ3chA",
        "title": "Is the Dollar Really Weak? Zoom Out. #shorts",
        "published_at": "2026-01-28T15:49:57Z",
        "sort_date": "2026-01-28",
        "url": "https://www.youtube.com/watch?v=i72FRhZ3chA",
        "transcript": "What will make the dollar come back uh Dixie come back is the midterms. I think the midterms are going to uh really calm a lot of this uh craziness because the problem is Trump guys. It it is Trump. Everyone has Trump fatigue is crazy. It should be it should have been pro peace, pro business. Instead we have insanity every day with new threats, new attack, new this, new that. It's it is quite fatiguing. Obviously, it adds to the dollar weakness. And the dollar weakness, as we just saw, it's not even that crazy. Like, it's it is weak, but you look through time, it's not um it's not really different from the last 10 years really. If you zoom out again, if you zoom out and you see on the big picture, but as soon as midterms happen and there is a bit more check and balance, maybe Democrats get the Senate or the House or something, um that's going to be a big big confidence boost to the US as a whole. Likely markets are going to do very very well."
    },
    {
        "video_id": "a9BqYWEBL7E",
        "title": "BITCOIN AND ETH: DOLLAR MAY NOT SURVIVE THIS!!!!! (emergency)",
        "published_at": "2026-01-28T10:13:10Z",
        "sort_date": "2026-01-28",
        "url": "https://www.youtube.com/watch?v=a9BqYWEBL7E",
        "transcript": "Yes. Oh, yes. Oh, yes. Oh, yes. Guys, welcome to another episode. And as you can see right now, Bitcoin is currently at 88, but the big story is happening currently in silver, which is, as you know, absolutely parabolic. This week, also parabolic. It is in gold. Gold is pushing literally new highs. It is in other precious metals as well, such as palium, which has a fantastic run as well, a bit of consolidation. And this is platinum and paladium that has a similar picture. But all in all, the talk of the town is that the dollar is collapsing. If you look at the dollar strength index, you see it is just going down and down and down and down. Massive, massive collapse against other major currencies. You do have the IMF coming out saying that they are preparing for a global run on the US dollar. You have Peter Schiff coming out saying that it's fenito. It's phenito. It's fito. Listen to this. I'm going to play you this from the beginning. Listen to this. And the world is now pulling the rug out from under the US. The dollar is going to collapse. The dollar is going to be replaced by gold. Central banks are buying gold to back up their currencies. They're getting rid of dollars. They're getting rid of treasuries. We are headed for a economic crisis again that will make the 2008 financial crisis look like a Sunday school picnic. The biggest difference between the crisis that we're about to have and the one we had back then is this one is all in America. It's not going to be exported to the rest of the world. It's not a global financial crisis. It's an American financial crisis. >> So guys, let's talk about it because obviously this affects our portfolios a lot. This is really important to think about as we are constructing our portfolio and as we prepare for the next leg that Bitcoin is going to do either to the upside or the downside. But let's stay on this topic a bit because it's not only pure shift. It's not only the IMF. I mean everyone is coming out in one way or another saying that the debt is crazy. this will not end well. You have Ray Dalu every day saying it. You also have Citadel. This is this is from Citadel. Listen to this. >> The the area of recklessness is the is the spending of governments around the world who are all with with little exception all spending well beyond their means. That's the recklessness of this moment in history. This is not a parallel to the 1920s in terms of the recklessness of the of the private capital markets. It's a story of the recklessness of government spending within the private sector. There's a huge question as to where AI will take us >> and I I was carefully taking notes and listening to what Larry has to say or to what Madame Lagard has to say because this is one of the big issues of our moment. Will AI create the productivity acceleration that is honestly that's hoped for in Washington and in the halls of government around the world as a ways to overcome the profit spending that we're currently engaged in. Like the world the world needs a savior. >> Yeah, guys. I mean basically what he's saying is that AI needs to come. It needs to boost productivity. We need to pray for AI to fix all of this because the debts are so big. is fito. If if AI doesn't come and fixes it, the deaths are too big. Everything is gonna go to zero pretty quickly. And so everyone's definitely freaking out now. You clearly see it emotionally when you look at people's emotions now on Twitter, everywhere. They're freaking out. They're freaking out. Meanwhile, Meanwhile, you have Trump coming out saying that he can go he can make dollar go up and down like a yo-yo. [laughter] I love it. Listen [clears throat] to more. Would that be? >> No, no. I I'd want it to be just seek its own level, which is the fair thing to do. You could have it I could have it go up or go down like a yo-yo. [laughter] >> I I'm not sure it helping. I'm not sure it help. I think he tried to make it look like he has control. He also said that the dollar looks very good, very strong. Listen to this. >> Mr. President, with the current value of the dollar, do you think it's declined too much? >> No, I think it's great. I mean, the value of the dollar, look at the business we're doing. No, dollar's dollar is doing great. >> Yeah, listen. So, this definitely did not help. And the question is how much should we be concerned? We'll soon get to that. I just want to play one more thing and that's from Warren Buffett because Warren Buffett, this was last year at the end of last year when they had their annual missing. He also said that he's a bit concerned with the dollar inflation because as you know he has 380 billion in cash. He's waiting to deploy into the markets. He thinks that the markets are too overvalued. So he has 380 billion in cash and short-term treasuries. So he obviously is very concerned that his cash is going to go to zero. This was from end of last year. Listen to this. And obviously we wouldn't want to be owning anything that we thought was in a currency that was really going to hell. And that's the big thing we worry about with the United States currency. I mean it the the tendency of a government to want to debase its currency over time is there's no system that beats that. You you can pick dictators, you can pick representatives, you can do anything but but the people there will be a >> I mean he's a very slow talker but basically saying he's he's a bit concerned and uh people listen people listen. So guys, now let's take the other side of the uh of the of the picture because I do fully agree with the fact that the dollar is going to zero. Sooner or later, it's going to go to zero. Many people make the mistake of forming so hard into metals into silver at these high prices without understanding the journey that many investors have been have been on when it comes to these commodities. So the journey I'm speaking about is for example when you look at the money scanner, the bullishness happened for silver for example 7 months ago. So many investors are up tremendously. You look at platinum since eight months ago it was bullish. Uh lithium since five months, gold since one year and I mean you see the returns here and obviously if you use leverage it's it's even another stratosphere. So when you look at gold, when you look at silver, uh it is true that they're going to continue going up long term as well. But the amount of fear and also the amount of not the amount of FOMO and the amount of fear for the dollar that is currently in the market and that people are saying, you know, everything is redefined, everything is different. I did a tweet yesterday where I where I kind of called it out. Um it's it is concerning. It's concerning because people are writing stuff like this. By the way, big shout out to the guy that wrote it. But you know, you should check the fundamentals. This is not crypto. Don't compare to silver run to 2008 run or the previous silver runs. Uh another guy saying I I don't think you're paying attention to the macro of silver. And listen, I fully agree like long-term silver is going to go up, but it will return to its moving average sooner or later. And because we're so far we're so far above the moving average now, that return may be brutal. Listen, I'm not denying that silver is going to go up through time. It's just that normally any market that has a parabola, it will return to moving average. Moving average goes like this. This is the 50 week moving average here goes like this. This is the 200 week. At some point they will meet. Now it can definitely be higher like the current moving average now is at 46. In a few months it's going to be maybe at 70. But at some point this parabola is going to come down and touch it and it may continue even. Okay. But many people forming in here don't understand the simple mechanic that if you want a good entry ideally you want to be early in an early bull trend. For example, if you are using the money scanner, you you get you got the signal seven months ago or let's say that you are not in silver now, but you want to build a position for the long term. I would wait for a return to moving average. Going back to moving average doesn't necessarily mean that it turns forever bearish. Uh that you know that the the silver is dead. Okay, it's not it's not what it means. And that's why also like these guys who are writing this kind of stuff, you know, the silver is true money. I mean, I agree with them. just that the amount of FOMO at this levels it doesn't make sense to me. If you did not use our tools for example and you got in in time like this was the time to get into silver this was in time to get into platinum the return to to the mean is going to happen and the mean now is higher than it was yeah for for years if not decades. So definitely bullish silver longterm but plebbe is going to get wrecked anyway. This this is the curse of the pleba. Even if he's correct, he's correct at the wrong time and he's pulling his cars out of, you know, out of his donut without looking like without even playing them correctly. Even if he has good cards, they become bad cards because it's a misunderstanding the market dynamic. So all in all, if you are in silver, in gold, in all these assets since the early bull trend, good for you. Fantastic. you've been playing it correctly and you can stay in the trend until it until it ends if you're following in now you are doing it incorrectly even if you're bullish silver gold and all of that uh understand at some point they're going to come back to moving averages and that would be a way better riskreward so that's number one number two if we look at Dixie if we look at the dollar strength index we also need to realize that it does go down a lot I mean this fall is quite significant and people are freaking out at the same time when you zoom out let's look at the uh monthly here If you do zoom out a bit, you see that it's not I mean it's not too crazy. The the bottom of the range here would be at um uh 89. Okay. If we start going below 89, then yeah, I mean then I would say it's it's quite crazy because then we're going to we potentially going to go to this lows from 2008. But the uh Dixie we're at now, the dot index we're at now is the same as it was in 2022 is the same as was in 2020 like the whole 2020, 2019, 2018, uh 2016, 2015, 20 and so on so forth. So I mean in reality there there are always this panics when strength index is dumping in most cases it finds a bottom and goes up. Why? because there is simply no good alternatives because we're speak we're speaking about an index here dollar strength index where dollar is compared to other currencies. So what other currency is better than the dollar? Tell me is it the euro with all of the chaos? Maybe they're going to now fix themselves and make themselves entrepreneurial maybe. H is it China which is capital controlled and non-transparent and you don't really know what the hell is happening there really? Absolutely not. Is it Russia? Absolutely not. Small economy at war. uh no obviously no transparency or anything no business you know it's so what is better okay so when it comes to Dixie alone which is just comparing dollar to other currencies uh it's too early like way too early to say that the dollar is that way way too early to say that the dollar is that okay if you compare to gold when you when you compare to bitcoin it is a process which is going for decades is going to continue to go for decades where dollar goes to zero and the other assets continue to uh to move higher see someone writing Swiss Frank potentially but Swiss Frank is not the it's not a global reserve. It's not a global reserve and Swiss Frank kind of has the same issue with precious metals as well. When people are saying that that dollar is going to zero okay look at the gold versus Swiss Frank it also moves. So I mean gold moves against everything against everything. So if if anything gold is a move against all fiat this is gold versus Swiss Frank. So precious metals moon against Swiss Swiss Frank also. So it wouldn't really protect you in this uh situation. And um Switzerland is a fantastic niche country for wealthy people. It's very good. But um is it a global reserve currency? No. I mean you look at other global reserve currencies whether it is the pound, the gilder, Netherlands, Gilder, the the other ones they were global uh empires or global global scale economies. Swiss is not a global scale economy. So all in all guys uh it is a big move shortterm for the dollar. Longterm it is really not too special and the fear I I think it's too overexaggerated. If you want my take on it I think it's too overexaggerated. I don't think that the dollar is going to collapse uh tomorrow. It's going to collapse long term. It always goes to all fear goes to zero. Uh but when it comes to you know suddenly bricks is is the alternative. Man, it's a tough one because let me actually address this because many people say that bricks is going to replace the dollar. You know, bricks, they are kind of an alliance, but they're not super good friends either. I mean, look at the the different countries there and uh look at what's happening and how much they actually help each other, how much they actually collaborate with each other and uh if you look beyond the statements, it's not too much. It's not too much. They've been speaking about the common currency for for decades. Uh what happens? Not too much. Not too much. Can they chip away? They can chip away slowly, slowly, slowly. And it it is a trend that is happening. But um by the way, and by the way, I've also been part of this, you know, bricks now is going to replace everything. They're going to be the go-to global reserve. But I I kind of moved from that position maybe in the last two years or so where I mean, when you actually see what's happening and the you compare to the US with all of the problems US has, man, it's not really comparable. It's it's not the same league. Not the same league. Uh, can they do a new currency with gold? I mean, ask yourself, if China gives you a new currency backed by gold, even if it's backed by gold, like how much do you actually trust it? I don't know how much I would trust to be fair. Okay, you give me a coin, it should be backed by gold, but there's no transparency. There's no accountability. There's not what else happening there. Where is the gold? Is the gold in the room with that? Like where is it? So uh at the end of the day I don't think that too much has changed in terms of like the uh the speed the speed you know that no suddenly now everything cool I don't think anything has changed in terms of the speed we're on the same trajectory where crypto should should benefit a lot from this gold pump obviously gold is pumping putting all fiats not just the dollar putting all fiats more closer to zero measured in gold again look at Swiss Frank look at anything gold looks like this in in any currency See, so that's that's a trend that's that's happening. And Bitcoin is a trend that should be happening, but not yet. We're ready to react at any point. We're ready to buy it cheaply at the 200 week if it continues down there or we're ready to buy it um at above 50 week if it goes there. So let's see what Bitcoin does. But Bitcoin currently is in this uh bare trend curse in the no man's land kind of you know derping around in the huddle uh no hold formation. how you say the whole pattern like an airplane just a hodddle formation going around and around. So that's that. Uh let me see more uh news when it comes to this. Exactly. So this is the the counterpoint that I also want to make that you know the the the claims that coll is collapsing is a bit of a nonsense because there's no real alternative. There is no other deeply liquid rule of law market like the US treasuries. I mean name any country. It's Singapore and and Switzerland don't count although they are amazing. It's not it's not an alternative. US uh market depth this and that all of the stocks are in the US basically no valid replacement euro I mean euro they're trying man now they try to take the lead they made the deal with India yesterday that you know India is now going to be working with EU with low tariff bricks gold and all of that and I think what will what will make the dollar come back uh Dixie come back is the midterms I think the midterms are going to uh really calm a lot of this uh craziness Because the problem is Trump, guys. It It is Trump. Everyone has Trump fatigue. It's crazy. It should be It should have been pro peace, pro business. Instead, we have insanity every day with new threats, new attack, new this, new that. It It's It is quite fatiguing. So, obviously, it adds to the dollar weakness. And dollar weakness, as we just saw, it's not even that crazy. like it's uh it is weak but you look through time it's not um it's not really different from the last 10 years really if you zoom out again if you zoom out and you see on the big picture but as soon as midterms happen and there is a bit more check and balance maybe democrats get the senate or the house or something um that's going to be a big big confidence boost to the US as a whole likely markets are going to do very very well just again just to show you where the dollar strength index is on Twitter it sounds very dramatic Because you know what they do? I mean, they show you it like this. They show you like they they show like this. They show like this. They show like this. They're like, \"AH MY [screaming] GOD, what's happening?\" Oh my. But yeah, then you zoom out a bit. Yeah. I mean, so what's happening? Not not too much. Not too much. So, uh, sleeping Joe Biden, he's out. But if Democrats have some kind of check check and balance in after midterms, I think it's going to is going to basically make us uh move forward from the Trump bonanza, which is quite insane. So guys, to summarize, to summarize, Bitcoin huddle formation, we're waiting for it to play out. Uh, dollar collapse uh likely not going to happen in some accelerated way, but long-term trend is the same. What gold is doing is just exposing all the fiats including the dollar, including including the euro, including Swiss Frank. Look at any fiat, they all go to zero versus gold. Now, with the recent move, there's nothing too unique with the dollar. Um then you have um what else we said? Gold and silver. The time to buy gold and silver was when the the uh money line bullish, which was months and months and months ago. The next time to buy gold and silver if you're fully new to the to the asset and you you're just following now. The next time is when they get to the moving average again. Here you have this one. It's moving up like this. At some point they're going to they're going to meet. Who the hell knows when? But at some point they're going to meet. Uh is going to be very good riskreward. And uh or if it goes super low then it it could even be this at at the 200. Sorry this is month. This is month. Let me go to week. uh you can you can uh act on weekly this is what I what we want to see so now it's here to 50 week is going up at some point they're going to meet this is so yeah all assets at some point they come to papa 50 week or 200 week [snorts] so yes that that's the big picture uh let me see what other news we have um they will have to print I mean that that's for sure that's for sure uh later this year they will have to print they will have to decrease interest rates because$10 trillion dollar of US government debt matures in next year. That's one/ird of all outstanding debt and the interest now is still quite high. So they probably will decrease the interest rate before they have to uh roll over the the debt. Lyn Alden is also saying basically what we said here, a breakdown in the dollar seems pretty intentional. Uh potentially Trump making a dollar weaker because he wants the industry to do better, exports to do better. Many people will send Sa s s s s s s s s s s s s s s s s s s s s s sens sens sensationalize how you say sensation s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s s sens sens sensationalize it, but it's still in its uh longer range for now. Sub 90 guess I basically it is what we said guys because sub 90 that's where it starts breaking from this uh mega long-term um huddle basically does it huddle this uh line in 2018 2021 if it goes below that absolutely then potentially we are getting a flash to the weakest point in recent history which was 2008 where the where everyone said the dollar is going to collapse uh it opens the door for that and let's Did we ever go lower here on this chart? It's kind of the all-time low. Exactly. So, uh, should we get below 90, this is the time to be worried. This is the time to really be concerned because then we're going to be flashed here sooner or later. The door is open for that. And uh, yeah, and then it's if it's below that, it's price discovery. How low it can go. Then it is really some kind of um, yeah, some kind of alternative. Let's check actually USD versus Euro or vice versa. Actually, let me check euro versus USD. So, we can see in 2008 how much it pumped. If we get all the data here, uh we should see we should see that deep in Dixie in Euro pump because I guess that was the kind of the alternative back then that everyone flocked to. Yeah, exactly. Exactly. So, Euro was the alternative that everyone flocked to back in 2008. You see here, everyone was all in Europe. Bye, bye bye bye bye go to zero, dog go to zero. and then yeah it kind of stay stabilized afterwards. So will Europe be the same uh safe haven this time around in case dollar strength index breaks down? I mean potentially this is what the IMF is saying that the EU should issue more common debt. The problem now this is why euro is not really an alternative now because when people hold dollars they don't don't just hold dollar for example you look at Warren Buffett he doesn't just hold a bunch of dollars in the bank account and it says a big amount of dollar instead he has uh his dollars in treasuries so they have a bit of yield uh and the risk is the same the treasury is zero risk like risk-free yield in quotation mark because The only risk is that they both go to zero, dollar and treasury. But in terms of dollars, it's risk-free yield. Why? Because again, you hold dollars, you risk that dollar goes to zero. And you hold treasuries is the same risk you risk that the government bankrupts doesn't pay its its debt. And so the risk is the same dollar or or treasury. But at least with treasury, you get a bit of yield. So that's why it's called the risk-free. But the problem is, let's say you have euro. What kind of treasury do you buy denominated in euro? There are no common euro bonds. I mean they actually started to give them out but it's not like a big thing. They did they did a few of them. They did one for COVID and one for Ukraine now but it's not like an established thing with deep liquid markets like the US Treasury market. So this is what basically the IMF is saying that the EU should actually issue more common debt where you can invest in EU debt not Germany debt not like French debt because that's one country it's not comparable to having US treasury like it's the risk is too too big in compared to US treasury. This is where the discussions are now that hey EU should if they really want to be alternative to world reserve currency ina in case dollar goes to zero with Trump going nuts they should issue more common debt. So there is if you have euro you can put it somewhere you get some yield. So at the fund one muscle that we're building is our ability to hypothetically present scenarios of unthinkable events such as dollar collapse. Uh and asked whether the scenario include a potential run of dollar assets. Guar who is the paji penguin head of the uh of the IMF said that the fund runs all kind of scenarios and that it was examining the issue as part of its ongoing analysis because of the tariffs because of the attack on fed independence because of attack of rule of law and so on so forth. Uh so yeah, let's see what's going to happen here. But uh potentially Euro is the alternative. But guys, just knowing just knowing how Europe works, I can tell you I don't know man if it's alternative. Yeah, it's it's quite dysfunctional. It's also quite dysfunctional. It is not super connected. It has how many EU members? Like 27. H not super connected to to really be an alternative. You look at GDP growth, it's not comparable to the US. So yeah, it's a potential uh safe haven asset in terms of fiats that uh maybe can be global scale reserve, but I mean who the hell knows? Probably not. Probably not. And then you have gold, you have silver, and all of the precious metals. They will likely to keep pumping, but again, they will also likely go go to their moving average averages at some point. Now, here is why silver cannot compete with Bitcoin. This is from safe moose from his book. So he basically examined last events, last occurrences when silver pumped a lot and uh he explained why it's not sustainable. So he says in the book, this explains why the silver bubble has popped before and will pop again if it ever inflates. As soon as significant monetary investments flow into silver, it's not as difficult for uh producers to increase the supply significantly and bring the price crashing down. taking the savers wealth in the process. And the best known example of the easy money trap comes from silver itself of all commodities. Back in the late '7s, the very affluent Han brothers decided to bring about the remmonetization of silver and started buying enormous enormous quantities of silver driving the price up. So this was in the 70s when you look at the silver pump and you go back all the way here [snorts] all the way. Yeah, there you go. There we go. There you go. There there's the Han brothers. They they they also said, \"Listen, dollar is going to go to zero. We're going to make silver the new money.\" And silver pumped, guys, from $4 all the way to $50. So, it was a 10x. Okay? And you see what happened later. Why? Because as soon as it pumps that much, the producers, the miners start mining like mfers. Like mfers, they start mining. I mean, imagine you go to forest la. You have a basket. In that basket, you put blueberry. You see nice blueberry looks so great. Boop. You put in the basket. Then man, you could continue going into forest, but the blueberry is so cheap. Like, you're not going to get too much money. If you go like for days and days with the tent, you know, you have to go on big expedition to get more blueberry. So, you you go maybe for a few hours, you come back, you sell blueberry, that's it. Imagine the same blueberry now cost 10 times more. Man, you're gonna get the tent. You're gonna get the, you know, port portable fire thing so you can do cooking like those nature YouTubers do. They like cook a steak in the middle of god nowhere. You're going to get all the blueberry because now the freaking price is 10 times higher. You're now motivated to go deep in the freaking forest expedition. One month expedition to get all the freaking blueberry. [laughter] You see, YOU SEE BEAR eating blueberry. You kick away the bear, you take the blueberry. So the same thing now is with precious metals. This is where by the way Bitcoin comes in because obviously you cannot do the same thing with with Bitcoin. Bitcoin is fixed supply no matter the price. Fixed production no matter the price. So um as soon as the hand brother started to pump the silver price in the 70s what happened? Everyone started to mine like a like an mfer like a big fat mfer. They start to [laughter] what happened the they start to buy. The rationale was that as price rose, more people would want to buy, which would keep the price rising, which in turn would lead to people wanting to be paid in silver. Yet, no matter how much the Hunt brothers bought, their wealth was no match for the ability of miners and holders of silver to keep selling silver onto the market. The price of silver eventually crashed and the Han brothers lost over 1 billion. probably the highest price ever paid for learning the importance of stock toflow ratio and why not all that glitters is gold. So guys, with silver, as long as it's bull trend, you know, we're bullish in bull trend, we're bullish. At the same time, I just see many people getting mega wrecked. Mega wreck. And even though you're bullish on silver, it all depends on your entry. You can be bullish on the thing, but if you buy at the wrong time all the time, you're still going to get wrecked. So if you have silver since the money line told you, great. If not uh uh I mean at least at least consider the the situation of your of your affairs in case it goes and revisits the 50 week or the 200 week and uh it may do it a bit later on when when it's higher maybe it's going to be at 70 maybe it's going to be at 80 but uh too many people I know for sure they have too much for mode too much for mode and things go this fast today everyone wants it tomorrow not so much a good example is a let me know if you AX, but they did a spot ETF and they have zero net inflows. [laughter] Big shout out to AX. The first Avalanche spot ETF began trading on NASDAQ, but recorded no net inflow on day one, posting a 300K 30K volume and 2.4 million enough. So, as you guess, as you can see, Wall Street institutions, they're not here for a crypto now. For now, they're not here, guys. They're not here. You see it in the Bitcoin price. That's why we're we wait for the signal of Bitcoin to either go above 50 week or down. So you see there's no now there's no interest. Now a good news a bit of a good news here is that the US now has a new stable coin and it's from Tether and it is fully regulated in the US. So when people have been asking Ivan what stable coin is best should I trust Tether? You cannot trust any stable coin but at least now you have a bit more diversification because now this USAT a US regulated dollar by stable coin built for American market is launched which will give some people more more peace of mind because yeah now it's regulated and it's not this you know offshore shady thing that many people perceive USDT as and um yeah there you go. Uh what else? What else guys? ETH ETH ETH building some stuff for AI. They have a new ERC ERC8004, a proposal containing standards for A agents that will be live on mainet soon. The proposal aims to enable a agents to interact with very sensing on ETH allowing them to participate in the services economy. Marco de Rosi, head of AI at Metam Mask and one of the co-authors of the process said that the main launch will likely There you go. There you go. Very interesting. So was by enabling discovery and portable reputation allows AI agents to interact across organizations. Okay. Okay. Yeah, I mean fantastic, fantastic. I mean, let's see if it's used, but good that it is there. You can talk to AI. But one thing that's interesting, guys, you see, I don't think you need any AI to AI protocols. I mean, AIs, they speak to each other in English and in JSON themselves. You need a bit of integration between like web two systems and AI because there you have a traditional back end. You need some way to, you know, to gel that. So you have the MCP protocols but you know when people say oh we have an AI to AI protocol guys AIS you know how they speak with each other in freaking English you don't need any protocol [laughter] and if they need exactness well they can do JSON they can do any format but there's no need to have like exact exact okay now our AIS they're going to speak like this man they speak to each other already isn't it crazy that English is the is the AI to AI communication It happens all the time. I mean you and I mean the way you speak to AI is also English. So it's it's the best one. It can uh communicate with each other. They can uh I I love this apps lately where they are AI powered but you can customize the prompt a bit. You also write in English and uh and and that's how you like define the behavior you want of the web app. I mean it's quite fascinating. But anyway, let's let's not get too too sidetracked. But um good for ETH. Good for ETH that something's happening there. Uh, and on this note, let's go to Q&A. Bam, bum, bum, bum, bum, Q&A, guys. Big shout out to Dub, who is time stamping us today. That's number one. Number two, go to bullminger.com/partners. You also find the link below because you're going to find exchanges I use, whether it is Pionex, whether it is by bit, Bitunix weeks. You get big fat nice juicy signup bonus on all of them. You can go long, you can go short. You can make money when crypto pumps or dumps with leverage. You can use leverage and many people do that especially when they trade the shortterm pumps when it comes for example on daily trends. You see things that are bullish on daily trend. I mean with leverage you can you can make a lot here. You can obviously risk you need risk management. You need to use your brain and all of that. But uh you need to have the tools. So the tools uh are here. Oh by the way I have a picture here from our just an example where if you have leverage and you have good risk management you don't need too much of a like price increase. Big shout out to Supreme Governor from our Bullmania discord. And in Bulman, we teach how to do leverage in a in a risk uh adjusted way where even if you if the market moves against you, you're fine. You're fine. So, for example, here he has 100% gain from um entry price 109 on silver and mark price 100 114 uh with 20x. Now, should everyone do 20x? Absolutely not. You need to use your brain. You need to use good risk management. But it's just uh one thing I hear a lot when people say but Ivan you know what if the move is small I mean it's just a few percent well it depends how you play it even the small moves if they look good it's a new bull trend and you you have the platforms uh such as yeah buy bit weeks all of them you can still make it work you can still make it work fantastically well so anyway use the links below and go to bullmay.com if you want to get access to our tools such as the money scanner the money line the community and so on so forth and on this note let's go to Q&A and Big shout out to who? To dab for timestamping us yet again. Let's go guys. Peter ship says that no one has been exploring or for or developing silver mines for many years now partly because of Bitcoin bull market. Yeah. So exactly I mean kind of what we said where in the past when silver wasn't pumping there was no investment and no initiative to explore new mining. Now that silver has like 3x guys is the amount of minings that that's going to happen is crazy. It's crazy. I don't think it's going to be biblical amount of mining. Now uh another thing that has pumped silver is that China uh put a put a ban on export like a limit on export. Uh I mean let's see at the end of the day if there is market demand the the the goods find a way. [laughter] The goods find a way. No matter the sanction, no matter the export ban, if there is demand, they they kind of find a way. Go to Moscow, go to a uh go to mall, you're going to see all the western STUFF THERE. SOMEHOW THEY found a way there. [laughter] Okay? I mean, we as a species, we're very creative. I mean, as as we're very creative as a species. If there is the man, man, we're going to find a way. It all started with the mammoth back in the ice age. how we went from the cave to get the freaking mammoth even though it was cold af outside. Now there is some banan there is some I mean listen somehow I can tell you goods find a way market will find a way and also again too many people they bet so much on this high prices what happens one uh one penstroke from the from changing ping no more ban on silver export what happens I mean you see yourself so I'm not saying that silver is bad I mean just just to clear say I think silver long-term is going to continue going up as fiat is going down I'm just commenting on the fment people have around this high levels okay and not understanding that uh this the supply will increase. They it will increase. We've seen it in the 70s as an example. And uh uh yeah uh and the export ban. Let's see how that's going to actually be uh enforce and all of that. But most importantly, it's here today. Maybe it's here tomorrow. Maybe not. It's like the Bitcoin mining ban. Okay. Oh no. China ban Bitcoin mining. What happens? It dumps a bit then okay then let's go no one cares anymore then then they unban then they ban then unban then they ban then so everything changes there that's why you know for short-term trading it makes sense for long-term I mean bitcoin is just better both when it comes to no extra supply or both when it comes to you know ban not ban like it doesn't really matter so you get the point yo yo done with another Regarding A and front developers, I don't think A will replace front end devs. Instead, they act as a force multiplier. Exactly. I mean like with anything, but you can have one front end guy now do the work of five. So that that's true. I mean obviously it's not like the CEO of a company is going to build all front end and not hire a single dev. I mean probably he's going to hire someone who's very good at front end uh AI use probably a very experienced front end engineer themselves and they do the the they do front end with AI and uh that's it. Uh and uh I I saw on Twitter someone commented, \"Oh, but you know, if you do comment with prompted with AI, the back end is going to suffer because it's going to be calling so many times.\" Listen, it's like you're a few prompts away from fixing it. You're a few prompts away for adding uh cache local storage cache. Uh and so I was like is is I I don't think those those people that I just had one guy before the stream he was like oh no you know AI cannot do front end because it's going to be calling API in an inefficient way so API is going to be over bro what what do you mean [laughter] what do you mean like as an example this exact problem I kind of I kind of have a a fix here look here you go to cryptobubbles it says you see here it just said yes sir but when I come to the page you now updated here here you see So actually you don't see on the screen let me see here here here. So here for example it updates not every time you come to the page it doesn't go to back end every time you come to the page here. So did I build it myself? I just told the AI listen don't hammer my freaking back end. You update you know you don't have to update every millisecond. Update you know here here and there you can update. Don't update every millisecond. So you're a few prompts away from making it nice uh and and not hammering the the back end. Here is another example. We see here it was like a minute ago it fetched. Now it patch something else. So listen this thing. Oh no, AI cannot build front end because you're you're like one prompt away probably like literally adding caching it was one prompt. Then uh we have caching here on the local storage. Then we have caching in the in the back end itself. We have in memory cache there in the API so it doesn't hammer the database and uh the database is itself is a cache before we fetch third party API. So listen guy it's not like rocket science rocket science it's not it's not but I agree you need one great engineer who can use it now he can do the job of five okay so and nothing nothing crazy with that you had in the 1900s in 1800s you needed 100 people to dig a hole now you have excavator one guy can dig the same hole okay so it's the same okay you want the hole dig like a build a house in front of my the foundation. You know, before my like 200 people with freaking spade. Bum bum bum bum bum. Now one guy press a button. Whoop. That's it. That's it. That's how front end is going to be done. One guy tells AI make this go add cash. Don't hammer back end. Make a great plan. But I think most people who who don't understand what I'm saying here, they just haven't tried building anything with it. Like don't understand that. like the their their counterargument against it like it doesn't make sense because maybe they tried the guy like two years ago. Two years ago is not the same as now. Uh so anyway, there's that. Yo, Ivan, long long time chat lurker since 2017. I'm thinking of going full-time crypto and joining Bulmania. Very nice. What is involved? Go to bulma.com, watch the video, sign up for the call. But because you have to sign up for the call, you understand it's not like buying a chewing gum. It's not like $5 to buy chewing gum. Uh but that's why you have to watch the video. You sign up for the call. Do that. Uh and uh everything will be explained and everything. But you understand when some when the price is not public. You understand what it means? You understand what it means? But at the same time, you get transformation which is life-changing. So anyway, go to bullman.com, watch the video, do the call. Bum bum bum. I mean, if you want to go full-time, you want the transformation, you do it. You do it. Um otherwise you're going to be buying this you know cheap indicator $50 $90 they don't do anything for you they don't give you any transformation there are endless tools endless information endless indicator yet most people are re play anyway so that's why booming is very different like it's trans it's a transformation watch the video do the call you're going to love it you're going to love it love it but yes it's not like buying a chewing gum it's um and we don't even say It's buying. It's investing. It's a white glove premium service, premium transformation. So, it's not buying. You don't buy. You invest because the returns are massive. The returns are for life. Like you do this one transformation once for life. You're not wrecked pleba. Imagine every year you wrecked pleba man. You you don't understand anything like you you get abused literally abused by market maker but in like year in year out and now you can have a short transformation that fixes that and for decades ahead you are fixed. So that's why it's not priced as a chewing gum because it it cannot and uh it's white glove so it's with a coaching go to go there and figure it out like it's everything is super clear and booked the call it's super easy super nice guided by the hand then that's that thanks for asking thanks for asking great question but everything is explained right there I did not use my secret match but I got 10k secret token yeah there you go I just got five because I didn't use it at >> [laughter] >> I just got so disappointed when I couldn't get the Ivan on take seeker. So I just like put it in the garbage. But yeah, I put it in Yeah. below the table so it doesn't wobble. So yeah, if you don't use it at all, you get 5k which is like what is it 10 bucks or 500 bucks or something. [clears throat] I heard most increase in supply of silver in the short term comes from uh scrap but it's uh once of uh yeah I cannot tell you exactly how the supply of silver is going to go up but it will go up for sure I heard it takes like a decade to explore develop and permit a new silver mine yeah at the same time market is forwardlooking so as as soon as they start it's going to be already starting to get priced in but I cannot tell you uh you know exactly how they're going not do it. But maybe Claude can tell us. Let me actually have to be too smart here. I mean in the age of AI. So uh by the way guys uh I don't know if you type to AI if you type to AI you are a Neanderthal like you know like know if you use AI number one but also if you type like a Neanderthal pleb instead look here I click here I click a button now I can speak to it. Okay. So Claude, we have a discussion here. If price of silver increases 5x or like now 3x uh how long time will it take for miners to increase the supply with new mines and so on so forth. You see then I click bam that's it. So I I will just remove bam bam. See this this how you use AI. This is how you use AI. I see people click click click click click typing typing like what do you type guys don't type anything [laughter] don't don't don't type anything don't type anything see here typical timeline for new silver supply uh to come online from price signal to meaningful new production looking at 7 to 15 years so you you were fully correct there uh so exploration the construction ramp up this and that around 70 to 75 production is uh byproing this and that reactivating so you have also reactivation possibilities, expanding existing operation. So likely this is where most of the stuff is going to happen. I mean it's not like you have to open up new from scratch and the market is going to be pricing it in faster than like the actual delivery. So even with you would realistically see only mod supply increases in years one to three with meaningful new production hitting in seven to 10 years. This is probably why silver can have such violent market market supply simply can't respond quickly to de demand shocks. So it's interesting here. So yes, it's one to three years to start getting new stuff online, but also you see how fast silver falls in all of these situations because here people are pricing in that I know it's going to take 10 15 years this and that. But then you know once the once the sentiment changes now people are pricing in okay in the coming years it's uh it's it's going to be here like the it's all about pricing in and now here very quickly people move on somewhere else. So while the supply like you say it is slow to get if you look at all of these silver runups they do deflate quite quickly as well. Why? I mean probably because like what I said it's all about new capital like the price is defined at the margin. It is the last buyer that buys that is that is deciding the price and so if the last buyer now says ah okay but now they have this started that started let me go to Bitcoin. Silver also pumped so much let [snorts] them go to Bitcoin. So you don't need the actual supply to be you just need like all the signs and all the signals that soon is going to be there and now the marginal buyer goes somewhere else. Uh now the other u the other argument is of course the industry will the industry buy anyway? I mean likely likely the industry will buy anyway but there's also a limit there like will they buy silver at 10x the price? How much it affects their their pricing for a consumer and so on so forth. It could just be that the industry also takes a bit of a cautious approach and u and uh yeah and and adjust to new silver prices. I mean when you have an important input into your production and now that has five to 10xed or whatever is whenever the rally is going to stop probably you'll have to reconsider a bit like do do are are you as aggressive as you were? Uh can there be be a trade deal? Maybe business goes to politicians and and going to tell hey listen we really need this freaking silver. go talk to China, let make them remove the ban. Let's make a deal here. Maybe China needs something from us. So, uh I mean that's what you normally see here with massive pump and then uh everyone thinks yeah, we're going to go to infinity and we return to moving average here and then to here and then yeah, it's uh sideways. Let's see what's going to happen. Could be like here massive pump then back to the 200 week and then another massive pump. So we don't know you know exactly where the rally is going to stop but I can tell you it will return to moving averages. That's all assets return to moving averages and moving averages again they go up as well. It's not like returning to current moving averages. Moving average go up but at some point it's going to touch the moving average and that's a good entry. I mean if you want to build the portfolio and you have zero silver now I wouldn't go in now. Instead I would wait for a revisit of moving average which will happen at some point if you're patient enough. Guys that's it. Thanks all for being here. Thanks for contribution to the chat. Big shout out to uh Dub for time stamping us. See you tomorrow. Smash up the like, subscribe. Have a good day and goodbye, guys. Goodbye. Goodbye. Goodbye. Check bulman.com. Boommy.com/partners for for all of the exchanges and all of that good jazz. See you guys. Have a good day and good."
    }
]